{"title": "Cloud Text-to-Speech - Training data requirements", "url": "https://cloud.google.com/text-to-speech/custom-voice/docs/training-data", "abstract": "# Cloud Text-to-Speech - Training data requirements\n", "content": "## General guidance\nPerformance consistency is important throughout your recordings. Any recordings with **noticeable changes in energy, persona, projection level, or vocal fry** (for example, due to fatigue) should be re-taken, possibly after a short break for the voice actor. Match reference files should be regularly played for the actor and director to ensure consistency across all recorded lines. See the [match file section](/text-to-speech/custom-voice/docs/training-data#match_reference_files) below for details.\n- Please use the script provided by Google to generate individual recordings, one recording per line. The total sum of all recording files should be at least 30-minutes. You can optionally provide additional audio data using your own script, as long as it meets the same recording requirements. The data can be used for model training if it improves model quality.- [de-DE](/text-to-speech/custom-voice/docs/scripts/de-de_script) \n- [en-US](/text-to-speech/custom-voice/docs/scripts/en-us_script) \n- [en-GB](/text-to-speech/custom-voice/docs/scripts/en-gb_script) \n- [es-US](/text-to-speech/custom-voice/docs/scripts/es-us_script) \n- [es-ES](/text-to-speech/custom-voice/docs/scripts/es-es_script) \n- [en-AU](/text-to-speech/custom-voice/docs/scripts/en-au_script) \n- [fr-CA](/text-to-speech/custom-voice/docs/scripts/fr-ca_script) \n- [fr-FR](/text-to-speech/custom-voice/docs/scripts/fr-fr_script) \n- [it-IT](/text-to-speech/custom-voice/docs/scripts/it-it_script) \n- [ja-JP](/text-to-speech/custom-voice/docs/scripts/ja-jp_script) \n- [pt-BR](/text-to-speech/custom-voice/docs/scripts/pt-br_script) \n- Each recording should only include one line from the script, saved as`.wav`file. Name each audio file in sequence with a four-digit integer starting at 1. Name your first file`0001.wav`, name your second file`0002.wav`, and so on.\n- You must also provide a '.csv' file that stores the transcription, audio file name, script language, and voice nickname. The `.csv` file must store this information in four columns, in the following order:- The line of script in this audio file.\n- The name of the`.wav`audio file, for example`0001.wav`.\n- The BCP-47 code of the script's language.\n- The nickname of your speaker. The nickname can contain only lowercase letters, numbers, and/or underscores and must not have any spaces (for example,`my_voice_speaker`). Give the`.csv`. file the same name as you speaker's nickname, for example`my_voice_speaker.csv`.\nCustom Voice provides an [example file](/static/text-to-speech/custom-voice/docs/my_voice_speaker.csv) that demonstrates the correct format.- Note: Only include what is spoken in the transcription. Do not add line numbers (\"5. Where are the rainbows?\") or unverbalized codes (\"The zip code is 08654\" is \"The zip code is zero eight six...\").\n- Upload all `.wav` and `.csv` files to a Google Cloud Storage bucket. **Share the name of the Cloud Storage bucket with your Google Cloud accountRepresentative** and **grant access tocloud-ai-tts-data-processor@twosync.google.com as\"Storage Object Viewer\"** . This gives Google access to your recordings.\n- Make sure the recording is clean, with no obvious background or channel noise.\n- Your recordings should ideally be done a studio. Studio-quality recordings are required for usable results (see [recording specifications](/text-to-speech/custom-voice/docs/training-data#recording_specifications) , below).\n- Specific linguistic artifacts to avoid:- Vocal fry/creak.\n- \"Breathy\" delivery.\n- Overly sibilant material.\n- Dramatic emotion.\n- Stuttering or improper pauses in the middle of a sentence.\n- If you see a sequence of characters separated by spaces, pronounce each character individually. E.g. Pronounce each letter in \"O p t i m i z e\" individually.## Recording specifications\nCritical requirements:\n- High quality professional recording studio with low reflection time (RT) or decay time (room sound).- Any reflective surfaces should have acoustic treatment foam applied  until RT time is reduced as low a level as possible.\n- Professional large diaphragm condenser microphone (U87, TLM 193, or  comparable).\n- High signal-to-noise ratio (SNR), with proper gain staging and  microphone placement.\n- **Please provide a 30 second \"Room Tone\" recording for each speaker and\n each recording session** . The room tone recording should be captured  with the microphone preamp set to speaker recording levels. This is a 30  second recording of silence. We need a representation of the studio  environment and noise floor.\n- Standard Audio file format (48kHz/24bit, WAV).- Audio can be recorded at a higher sampling rate and downsampled to  48kHz/24bit. Audio can NOT be upsampled from lower rates.\n- The audio should be recorded without any lossy compression. Linear PCM (LPCM) format with a WAV header is required. Please provide mono audio.\n- Target average loudness is -23 LUFS +- 2 (ITU-R BS.1770-3).\n- Audio files should have short silences at the beginning and end  (>100 ms and <500ms). Please do not append digital silence  (that is, append sequences of 0). After the recording session has  ended if you find that an audio clip does not have enough silence,  please make a note of it and let us know.\n- Audio should be recorded flat with no equalization, compression or other  DSP. Doing so might result in audio waveforms with a distribution of  spectral components that differs from the other audio corpora used by  Google.## Match reference files\nReference recordings, or \"match files\", are files that are captured at the beginning of a recording project. These files are used during the entirety of the recording project and should not change. They represent the hallmark characteristics, or \"gold standard\", of the performance in terms of persona, volume, energy, cadence, articulation, intonation, and spectral properties. The match file is used as a reference for all subsequent recordings. It is used throughout a recording session to calibrate signal capture and provide guidance and consistency for a performance.\n### Create a match reference file\nThe process of recording match files is done in collaboration with the director (who indicates the type of performance they are seeking) and the recording engineer (who makes sure that the proper audio spec level is captured in the match file). All audio recorded should conform to the match file's characteristics. Match files must therefore be carefully chosen and optimized.\nPlease select up to 3 utterances from the recording script to use to create match files. Use these files to ensure consistency of the following parameters throughout the recording:\n- Persona and style continuity.\n- Root pitch or tone of the performance.\n- Rate of speech.\n- Volume.", "guide": "Cloud Text-to-Speech"}