{"title": "Dataflow - Dataflow regions", "url": "https://cloud.google.com/dataflow/docs/concepts/regional-endpoints", "abstract": "# Dataflow - Dataflow regions\nThe Dataflow region stores and handles metadata about your Dataflow job and deploys and controls your Dataflow workers.\nRegion names follow a standard convention based on [Compute Engine region names](/compute/docs/regions-zones/regions-zones#available) . For example, the name for the Central US region is `us-central1` .\nThis feature is available in all regions where Dataflow is supported. To see available locations, read [Dataflow locations](/dataflow/docs/resources/locations) .\n", "content": "## Guidelines for choosing a region\nSpecifying a region in a Dataflow job is mandatory.\n### Security and compliance\nYou might need to constrain Dataflow job processing to a specific geographic region in support of the security and compliance needs of your project.\n### Data locality\nYou can minimize network latency and network transport costs by running a Dataflow job from the same region as its sources, sinks, staging file locations, and temporary file locations. If you use sources, sinks, staging file locations, or temporary file locations that are located of your job's region, your data might be sent across regions.\n**Note:** Starting with Beam SDK version 2.44.0, Dataflow does not support running jobs with workers in a region that is different from the job region.\nIn running a pipeline, user data is only handled by the Dataflow worker pool and the movement of the data is restricted to the network paths that connect the Dataflow workers in the pool.\nAlthough user data is strictly handled by Dataflow workers in their assigned geographic region, pipeline log messages are stored in [Cloud Logging](/logging/docs) , which has a single global presence in Google Cloud.\nIf you need more control over the location of pipeline log messages, you can do the following:\n- [Create an exclusion filter](/logging/docs/exclusions#create-filter-existing) for the`_Default`log router sink to prevent Dataflow logs from being exported to the`_Default`log bucket.\n- [Create a log bucket](/logging/docs/buckets#create_bucket) in the region of your choice.\n- Configure a new log router sink that exports your Dataflow logs to your new log bucket.\nTo learn more about configuring logging, see [Routing and storage overview](/logging/docs/routing/overview) and [Log routing overview](/logging/docs/export) .\nNotes about common Dataflow job sources:\n- When using a Cloud Storage bucket as a source, we recommend that you perform **read** operations in the same [region as the bucket](/storage/docs/bucket-locations) .\n- [Pub/Sub](/pubsub/architecture) topics, when published to the global Pub/Sub endpoint, are stored in the nearest Google Cloud region. However, you can modify the topic storage policy to a specific [region or a set of regions](/pubsub/docs/resource-location-restriction) . Similarly, [Pub/Sub Lite](/pubsub/docs/choosing-pubsub-or-lite#comparison_table) topics support only zonal storage.\n### Resilience and geographic separation\nYou might want to isolate your normal Dataflow operations from outages that could occur in other [geographic regions](/docs/geography-and-regions) . Or, you might need to plan alternate sites for business continuity in the event of a region-wide disaster.\nIn your [disaster recovery and business continuity plans](/solutions/designing-a-disaster-recovery-plan) , we recommend incorporating details for sources and sinks used with your Dataflow jobs. The [Google Cloud sales team](/contact) can help you work towards meeting your requirements.\n### Regional placement\nBy default, the region that you select configures the Dataflow worker pool to utilize all available zones within the region. Zone selection is calculated for each worker at its creation time, optimizing for resource acquisition and utilization of unused [reservations](/compute/docs/instances/reserving-zonal-resources) .\nRegional placement offers benefits such as:\n- Improved resource availability: Dataflow jobs are more resilient to [zonal resource availability](/compute/docs/troubleshooting/troubleshooting-vm-creation#resource_availability) errors, because workers can continue to be created in other zones with remaining availability.\n- Improved reliability: In the event of a zonal failure, Dataflow jobs can continue to run, because workers are recreated in other zones.\nThe following limitations apply:\n- Regional placement is supported only for jobs using Streaming Engine or Dataflow Shuffle. Jobs that have opted out of Streaming Engine or Dataflow Shuffle cannot use regional placement.\n- Regional placement applies to VMs only, and doesn't apply to Streaming Engine and Dataflow Shuffle-related resources.\n- VMs are not replicated across multiple zones. If a VM becomes unavailable, for example, its work items are considered lost and are reprocessed by another VM.\n- If a region-wide stockout occurs, the Dataflow service cannot create any more VMs.\n### Automatic zone placement\nFor jobs not supported for regional placement, the best zone within the region is selected automatically, based on the available zone capacity at the time of the job creation request. Automatic zone selection helps ensure that job workers run in the best zone for your job.\nBecause the job is configured to run in a single zone, the operation might fail with a [zonal resource availability](/compute/docs/troubleshooting/troubleshooting-vm-creation#resource_availability) error if sufficient Compute Engine resources are not available.\n## Specify a region\n**Note:** Region configuration requires Apache Beam SDK version 2.0.0 or higher.\nTo specify a region for your job, set the `--region` option to one of the [supported](/dataflow/docs/resources/locations) regions. The `--region` option overrides the default region that is set in the metadata server, your local client, or the environment variables.\nThe [Dataflow command-line interface](/dataflow/pipelines/dataflow-command-line-intf) also supports the `--region` option to specify regions.\n## Override the worker region or zone\nBy default, when you submit a job with the `--region` option, workers are automatically assigned to either [zones across the region](#regional_placement) or the [single best zone](#autozone) within the region, depending on the job type.\nIn cases where you want to ensure that the workers for your Dataflow job run strictly in a specific zone, you can specify the zone using the following [pipeline option](/dataflow/docs/reference/pipeline-options#worker-level_options) . This usage pattern is uncommon for Dataflow jobs.\n```\n--workerZone\n```\n```\n--worker_zone\n```\n```\n--worker_zone\n```\nFor all other cases, we don't recommend overriding the worker location. The [common scenarios table](#commonscenarios) contains usage recommendations for these situations.\nBecause the job is configured to run in a single zone, the operation might fail with a [zonal resource availability](/compute/docs/troubleshooting/troubleshooting-vm-creation#resource_availability) error if sufficient Compute Engine resources are not available.\n**Caution:** If you override the worker zone and the workers are in a different region than the job region, there might be a negative impact on performance, network traffic, network latency, and network cost.\nYou can run the `gcloud compute regions list` command to see a listing of regions and zones that are available for worker deployment.\n## Common scenarios\nThe following table contains usage recommendations for common scenarios.\n| Scenario                                        | Recommendation                                              |\n|:---------------------------------------------------------------------------------------------------------------------------------------------------------------------|:------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| I want to use a supported region and have no zone preference within the region. In this case, the best zone is automatically selected based on available capacity. | Use --region to specify a job region. This ensures that Dataflow manages your job and processes data within the specified region.                 |\n| I need worker processing to occur in a specific zone of a region.                         | Specify both --region and either --workerZone or --worker_zone. Use --region to specify the job region. Use either --workerZone or --worker_zone to specify the specific zone within that region. |", "guide": "Dataflow"}