{"title": "Dataflow - Dataflow project monitoring dashboard", "url": "https://cloud.google.com/dataflow/docs/guides/project-monitoring", "abstract": "# Dataflow - Dataflow project monitoring dashboard\nThe Dataflow web-based monitoring interface includes a dashboard that monitors your Dataflow jobs at the project level. The charts show data for all of the jobs in one project.\n[Go to dashboard](https://console.cloud.google.com/dataflow/monitoring)\nThe dashboard can help you with the following tasks:\n- Detect and identify the source of quota errors.\n- Detect anomalous horizontal autoscaling in a job.\n- Identify slow or stuck streaming jobs.\nThe dashboard uses [Cloud Monitoring](/dataflow/docs/guides/using-cloud-monitoring) to access Dataflow job metrics. To customize the information displayed in the charts, use [Metrics Explorer](/monitoring/charts/metrics-selector) .\n", "content": "## Features\nThe dashboard includes the following features:\n- Choose which jobs appear in the dashboard by using regular expressions.\n- Access the job details page from individual charts.\n- Customize the dashboard widgets and charts.## Required roles\nTo get the permission that you need to see the graph data,   ask your administrator to grant you the [Monitoring Viewer ](https://cloud.google.com/iam/docs/understanding-roles#monitoring.viewer) ( `roles/monitoring.viewer` ) IAM role.    For more information about granting roles, see [Manage access](/iam/docs/granting-changing-revoking-access) .\nThis predefined role contains the `monitoring.timeSeries.list` permission, which is   required to see the graph data.\nYou might also be able to get   this permission  with [custom roles](/iam/docs/creating-custom-roles) or  other [predefined roles](/iam/docs/understanding-roles) .\n## Metrics\nBy default, the following charts appear in your dashboard. For more information about the metrics displayed, see [Job metrics](/dataflow/docs/guides/using-monitoring-intf) .\n| Chart     | Description                                                                                                | Support     |\n|:----------------------|:----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|:-------------------------|\n| Running jobs   | A time-series chart that shows the number of jobs running in the project.                                                                                 | Batch and streaming jobs |\n| Workers per job  | A time-series chart that shows the number of workers being used per job. Use this chart to understand autoscaling behavior across the project. You can see if jobs have unexpected or unusual scaling behavior. Use this chart with the quota and CPU charts to identify jobs whose scaling is limited by quota errors.                    | Batch and streaming jobs |\n| Quota exceeded errors | A time-series chart that shows the history of quota exceeded errors in the project, scoped to Compute Engine CPU quotas. Compute Engine has both per-region total CPU quotas and, for some machine families, per-region, per-type quotas. Any of these quotas might prevent a job from starting or scaling up. Use this chart with the quota and CPU charts to identify the source of quota errors. | Batch and streaming jobs |\n| CPUs per job   | A time-series chart that shows the number of CPUs being used by the workers of each job. This chart also shows the machine type and location for each job. Machine types in the same family have different numbers of CPUs. The total number of CPUs affects Compute Engine quotas. Use this chart to identify the source of quota errors.               | Batch and streaming jobs |\n| System latency  | A time-series chart that shows the maximum number of seconds that an item of data has been processing or awaiting processing for each job. Use this chart to identify streaming jobs that have an unusual delay between when data appears in a source and is written to all sinks.                             | Streaming jobs   |\n| Data freshness  | A time-series chart that shows the maximum data freshness for any stage in each job. Use this chart to find streaming jobs that might be slow or stuck.                                                             | Streaming jobs   |\n| Max backlog bytes  | A time-series chart that shows the maximum backlog bytes for any stage in each job. Use this chart to identify anomalies that indicate a processing bottleneck.                                                           | Streaming jobs   |\n## Access the dashboard\nTo access the dashboard, follow these steps:\n- [Sign in](https://console.cloud.google.com/) to the Google Cloud console.\n- Select your Google Cloud project.\n- Open the navigation menu.\n- In **Analytics** , click **Dataflow** .\n- In the Dataflow navigation menu, click **Monitoring** . [Go to dashboard](https://console.cloud.google.com/dataflow/monitoring) ## Customize the dashboard\nYou can customize the dashboard contents and the information displayed in the charts. When you edit the dashboard, a new, customized dashboard is created.\nThe dashboard uses Cloud Monitoring to access Dataflow job metrics. Use the Cloud Monitoring tools to customize the charts.\n- Open the dashboard and click **Customize Dashboard** .\n- Modify your dashboard.- To filter the jobs that display on the dashboard, see [Add temporary filters to a custom dashboard](/monitoring/charts/filter-dashboard) and [Add permanent filters to a custom dashboard](/monitoring/dashboards/filter-permanent) .\n- To edit or remove widgets, see [Manage dashboard widgets](/monitoring/charts/manage-widgets) .\n- To edit the contents of the charts, see [Select metrics for charts on dashboards](/monitoring/charts/metrics-selector) .\n- To add charts to the dashboard, see [Add charts and tables to a custom dashboard](/monitoring/charts) .\n- Click **Save** , and then click **View customized dashboard** .\nAfter you create a customized dashboard, to return to the default dashboard, in the **Dashboard** menu, select **Predefined** .\n## Troubleshooting\nThis section provides instructions for troubleshooting common issues\n### No data is available\nWhen you open your dashboard, one or more charts shows the following message:\n```\nNo data is available for the selected time frame.\n```\nThis message appears when the time period covered in the charts doesn't have any data. To resolve this issue, change or expand the time range.\nTo change the displayed time range, on the chart, click **Explore data** , and then use the time-range selector.\n### Unable to restore deleted widgets\nWhen you remove a widget from the dashboard, you create a customized dashboard. After you create a customized dashboard, to return to the default dashboard, in the **Dashboard** menu, select **Predefined** .\n### Unable to view charts\nTo see the graph data, you need the `monitoring.timeSeries.list` permission. For more information, see [Required roles](#requirements) .\n## What's next\n- Learn more about individual [job metrics](/dataflow/docs/guides/using-monitoring-intf) .\n- Explore metrics with [Cloud Monitoring](/dataflow/docs/guides/using-cloud-monitoring) .\n- [Troubleshoot slow or stuck jobs](/dataflow/docs/guides/troubleshoot-slow-jobs) .", "guide": "Dataflow"}