{"title": "Dataflow - Use Compute Engine reservations with Dataflow", "url": "https://cloud.google.com/dataflow/docs/guides/compute-engine-reservations", "abstract": "# Dataflow - Use Compute Engine reservations with Dataflow\nTo ensure that VM resources are available when your Dataflow jobs need them, you can use Compute Engine reservations. Reservations provide a high level of assurance in obtaining capacity for Compute Engine zonal resources.\nTo use Compute Engine reservations with Dataflow, perform the following steps:\n- Create a Compute Engine reservation. It can be a single-project reservation or a shared reservation. For more information, see the following documents:- [Create a reservation for a single project](/compute/docs/instances/reservations-single-project) \n- [Create a shared reservation](/compute/docs/instances/reservations-shared) \nThe reservation can include GPU accelerators.\n- When you submit your Dataflow job, pass one of the following service options, depending on which version of the Beam SDK you are using:- Beam version < 2.29:`--experiments=skip_gce_quota_verification`\n- Beam version >= 2.29:`--dataflow_service_options=automatically_use_created_reservation`To prevent low-priority workloads in the same project from competing for reservations with Dataflow, set the reservation affinity to `none` when you create VMs for those workloads. For more information, see [Consuming reserved instances](/compute/docs/instances/reserving-zonal-resources#consuming_reserved_instances) .\nIn order to use the reservation, the Dataflow workers must match the reservation configuration. You might need to set the worker machine type for the job. For more information, see [Workers](/dataflow/docs/request-quotas#workers) .\n", "content": "## Limitations\nAll limitations of Compute Engine reservations apply when Dataflow workers consume reservations. See [How reservations work](/compute/docs/instances/reservations-overview#how-reservations-work) .\nIn addition, Dataflow relies on the [default consumption order](/compute/docs/instances/reservations-overview#consumption-order) in Compute Engine. As a result, the following limitations apply:\n- Dataflow does not consume a reservation created with the`--require-specific-reservation`flag.\n- Other workloads in the same project or Organization that do not specify the`--reservation`flag might compete with Dataflow workloads for project-specific or shared reservations.\n- Dataflow Prime jobs do not consume Compute Engine reservations.## Pricing\nReserved Compute Engine VMs are billed by Dataflow while the Dataflow job is running, and are billed by Compute Engine when the VMs are not being used by Dataflow.\n## What's next\nTo learn more about Compute Engine reservations, see [Reservations of Compute Engine zonal resources](/compute/docs/instances/reservations-overview) .", "guide": "Dataflow"}