{"title": "Dataflow - Set the pipeline streaming mode", "url": "https://cloud.google.com/dataflow/docs/guides/streaming-modes", "abstract": "# Dataflow - Set the pipeline streaming mode\nDataflow supports two modes for streaming jobs:\n- **Exactly-once mode** . This mode is the default for all Dataflow streaming jobs. In this mode, Dataflow ensures that records are not dropped or duplicated as the data moves through the pipeline.\n- **At-least-once mode** . This mode guarantees that records are processed at least once (that is, no input records are lost). However, duplicate records are possible in this mode. For use cases that can tolerate duplicates, at-least-once mode can significantly lower the cost and latency of your job.", "content": "## Choose which streaming mode to use\nChoose exactly-once mode if you need to ensure exact results from the pipeline and predictable semantics. For example:\n- Pipelines with [aggregations](https://beam.apache.org/documentation/basics/#aggregation) , such as count, sum, or mean.\n- Business-critical use cases that rely on records being processed once and only once. Examples include fraud detection, network threat detection, and ecommerce inventory dashboards.\nChoose at-least-once streaming mode if your workload can tolerate duplicated records and might benefit from reduced cost or latency. For example:\n- Workloads where deduplication is performed downstream from Dataflow. For example, pipelines that write to BigQuery or a SQL datastore.\n- Map-only pipelines with no aggregations. Examples include log processing, change data capture, or extract, transform, and load (ETL) jobs, in which the pipeline performs only per-element transforms, such as schema translation.\n- Pipelines where the output sink can't guarantee exactly-once delivery, such as Pub/Sub. In that case, deduplicationthe pipeline might be unnecessary, and you can benefit from the reduced cost and latency of at-least-once streaming mode.\n- Pipelines that read from Pub/Sub. Reading from Pub/Sub is significantly optimized when using at-least-once mode.\n### Additional considerations\n- At-least-once mode can significantly reduce the cost and latency of a pipeline. The exact impact depends on the specifics of the pipeline. Test at-least-once streaming under realistic loads to evaluate the impact.\n- When using at-least-once mode, the rate of duplicate records depends on the number of retries. The baseline rate is typically low (<1%). However, spikes can occur if worker nodes fail or other conditions cause repeated RPC calls.\n- The streaming mode affects how Streaming Engine processes records, but does not change the semantics of I/O connectors. It is recommended to align your I/O semantics with the streaming mode. For example, if you use at-least-once streaming mode with the [BigQuery I/O connector](/dataflow/docs/guides/write-to-bigquery) , set the write mode to `STORAGE_API_AT_LEAST_ONCE` . [Google-provided Dataflow templates](/dataflow/docs/guides/templates/provided-templates) automatically enable this option when you use at-least-once streaming.\n- Element-wise transforms such as `Map` are not always idempotent. For example, consider a function that receives a message and appends the current timestamp to it. In that case, a duplicate record can produce several distinct outputs. At-least-once mode might not be appropriate for that pipeline.## Set the streaming mode\nExactly-once processing is the default setting for all Dataflow jobs. To enable at-least-once streaming mode, set the `streaming_mode_at_least_once` [service option](/dataflow/docs/reference/service-options) .\n```\n--dataflowServiceOptions=streaming_mode_at_least_once\n```\n```\n--dataflow_service_options=streaming_mode_at_least_once\n```\n```\n--dataflow_service_options=streaming_mode_at_least_once\n```\nIf you don't specify the `streaming_mode_at_least_once` option, then Dataflow uses exactly-once streaming mode.\nIf you set the `streaming_mode_at_least_once` option, Dataflow automatically enables [Streaming Engine](/dataflow/docs/streaming-engine) with [resource-based billing](/dataflow/docs/streaming-engine#compute-unit-pricing) .\nTo update the streaming mode on a running job, stop the existing job and run a replacement job. For more information, see [Launch a replacement job](/dataflow/docs/guides/updating-a-pipeline#Launching) .\n## Run a template using at-least-once mode\nTo run a Dataflow streaming template using at-least-once mode:\n- In the Google Cloud console, go to the Dataflow **Jobs** page. [Go to Jobs](https://console.cloud.google.com/dataflow/jobs) \n- Click **Create job from template** .\n- Select the template that you want to run from the **Dataflow template** drop-down menu.\n- For **Streaming mode** , select **At Least Once** . If the template does not support at-least-once mode, this option is disabled.\nUse the `additional-experiments` flag to enable at-least-once mode.\n```\n--additional-experiments=streaming_mode_at_least_once\n```\nUse the `additionalExperiments` field in the [FlexTemplateRuntimeEnvironment](/dataflow/docs/reference/rest/v1b3/projects.locations.flexTemplates/launch#FlexTemplateRuntimeEnvironment) (Flex templates) or [RuntimeEnvironment](/dataflow/docs/reference/rest/v1b3/RuntimeEnvironment) (classic templates) object.\n```\n{  additionalExperiments : [\"streaming_mode_at_least_once\"]  ...}\n```\n### Custom templates\nIf you create a custom template that supports at-least-once processing, add the following top-level fields to the template metadata file:\n```\n{  \"streaming\": true,  \"supportsAtLeastOnce\": true,  \"supportsExactlyOnce\": true}\n```\nThese metadata fields enable users to select the streaming mode when deploying the template in the Google Cloud console.\nFor more information, see the following sections in the Dataflow templates documentation:\n- Flex templates: [Metadata](/dataflow/docs/guides/templates/configuring-flex-templates#metadata) \n- Classic templates: [Use metadata in your pipeline code](/dataflow/docs/guides/templates/creating-templates#use-metadata-in-your-pipeline-code) ## View a job's streaming mode\nTo view the streaming mode for a job, go to the **Jobs** page in the Google Cloud console.\n[Go to Jobs](https://console.cloud.google.com/dataflow/jobs)\nThe streaming mode is also listed on the job details page, in the **Jobinfo** panel.\n## Limitations\nAt-least-once streaming mode requires [Streaming Engine](/dataflow/docs/streaming-engine) with [resource-based billing](/dataflow/docs/streaming-engine#compute-unit-pricing) .\n## Pricing\nAt-least-once mode always uses [resource-based billing](/dataflow/docs/streaming-engine#compute-unit-pricing) , where you're billed for the total resources that are consumed by your job.\nThe per-unit cost of [Streaming Engine Compute Units](/dataflow/pricing#streaming-compute-units) is the same regardless of the streaming mode. However, in most cases a pipeline consumes significantly fewer total resources when using at-least-once mode.\n## What's next\n- Learn more about [exactly-once processing](/dataflow/docs/concepts/exactly-once) .", "guide": "Dataflow"}