{"title": "Dataflow - Troubleshoot stragglers in streaming jobs", "url": "https://cloud.google.com/dataflow/docs/guides/troubleshoot-streaming-stragglers", "abstract": "# Dataflow - Troubleshoot stragglers in streaming jobs\nFor streaming pipelines, a is defined as a work item with the following characteristics:\n- It prevents the [watermark](/dataflow/docs/concepts/beam-programming-model#advanced_concepts) from advancing for a significant length of time (on the order of minutes).\n- It processes for a long time relative to other work items in the same stage.\nStragglers hold back the watermark and add latency to the job. If the lag is acceptable for your use case, then you don't need to take any action. If you want to reduce a job's latency, start by addressing any stragglers.\n**Note:** For information about troubleshooting stragglers in batch jobs, see [Troubleshoot stragglers in batch jobs](/dataflow/docs/guides/troubleshoot-batch-stragglers) .\n", "content": "## View streaming stragglers in the Google Cloud console\nAfter you start a Dataflow job, you can use the Google Cloud console to view any detected stragglers.\nYou can view streaming stragglers in the [stage progress view](/dataflow/docs/concepts/execution-details#stage_progress_for_streaming_jobs) or the [stage workflow view](/dataflow/docs/concepts/execution-details#stage_workflow) .\n### View stragglers by stage progress\nTo view stragglers by stage progress:\n- In the Google Cloud console, go to the Dataflow **Jobs** page. [Go to Jobs](https://console.cloud.google.com/dataflow/jobs) \n- Click the name of the job.\n- In the **Job details** page, click the **Execution details** tab.\n- In the **Graph view** list, select **Stage progress** . The progress graph shows aggregated counts of all stragglers detected within each stage. \n- To see details for a stage, hold the pointer over the bar for the stage. The details pane includes a link to the worker logs. Clicking this link opens Cloud Logging scoped to the worker and the time range when the straggler was detected. \n### View stragglers by stage workflow\nTo view stragglers by stage workflow:\n- In the Google Cloud console, go to the Dataflow **Jobs** page.Go to [Jobs](https://console.cloud.google.com/dataflow/jobs) \n- Click the name of the job.\n- In the job details page, click the **Execution details** tab.\n- In the **Graph view** list, select **Stage workflow** . The stage workflow shows the execution stages of the job, represented as a workflow graph. ## Troubleshoot streaming stragglers\nIf a straggler is detected, it means that an operation in your pipeline has been running for an usually long time.\nTo troubleshoot the issue, first check whether [Dataflow insights](/dataflow/docs/guides/using-dataflow-insights) pinpoints any issues.\nIf you still can't determine the cause, check the worker logs for the stage that reported the straggler. To see the relevant worker logs, view the [straggler details](#view_stragglers_by_stage_progress) in the stage progress. Then click the link for the worker. This link opens Cloud Logging, scoped to the worker and the time range when the straggler was detected. Look for problems that might be slowing down the stage, such as:\n- Bugs in`DoFn`code or [stuck DoFns](/dataflow/docs/guides/common-errors#processing-stuck) . Look for stack traces in the logs, near the timestamp when the straggler was detected.\n- Calls to external services that take a long time to complete. To mitigate this issue, [batch calls to external services](/dataflow/docs/tutorials/ecommerce-java#micro-batch-calls) and set timeouts on RPCs.\n- Quota limits in sinks. If your pipeline outputs to a Google Cloud service, you might be able to raise the quota. For more information, see [Work with quotas](/docs/quota) . Also, consult the documentation for the particular service for optimization strategies, as well as the documentation for the [I/O Connector](https://beam.apache.org/documentation/io/connectors/) .\n- `DoFns`that perform large read or write operations on persistent state. Consider refactoring your code to perform smaller reads or writes on persistent state.\nYou can also use the [Side info](/dataflow/docs/concepts/execution-details#stage-info) panel to find the slowest steps in the stage. One of these steps might be causing the straggler. Click on the step name to view the worker logs for that step.\nAfter you determine the cause, [update your pipeline](/dataflow/docs/guides/updating-a-pipeline) with new code and monitor the result.\n## What's next\n- Learn to use the [Dataflow monitoring interface](/dataflow/docs/guides/using-monitoring-intf) .\n- Understand the [Execution details](/dataflow/docs/concepts/execution-details) tab in the monitoring interface.", "guide": "Dataflow"}