{"title": "Dataflow - Dataflow 中的“正好一次”處理", "url": "https://cloud.google.com/dataflow/docs/concepts/exactly-once?hl=zh-cn", "abstract": "# Dataflow - Dataflow 中的“正好一次”處理\nDataflow 支持對記錄進行“正好一次”處理。本頁面介紹了 Dataflow 如何實現“正好一次”處理，同時確保較短的延遲時間。\n", "content": "## 概覽\n批處理流水線始終使用“正好一次”處理。流處理流水線默認使用“正好一次”處理，但也可以使用 [“至少一次”處理](https://cloud.google.com/dataflow/docs/guides/streaming-modes?hl=zh-cn) 。\n“正好一次”處理可確保處理記錄的結果，包括每個流水線階段的結果。具體而言，對於從來源到達流水線或從上一階段到達此階段的每條記錄，Dataflow 可確保以下各項：\n- 系統會處理記錄，而不會丟失。\n- 保留在流水線中的任何處理結果最多都會反映一次。\n換句話說，記錄至少處理一次，而結果只提交一次。\n“正好一次”處理可確保結果準確無誤，並且輸出中沒有重複記錄。Dataflow 經過優化，可以最大限度地縮短延遲時間，同時保持“正好一次”語義。但是，“正好一次”處理仍會產生執行重複信息刪除的費用。對於可以容忍重複記錄的應用場景，通常可以通過啓用“至少一次”模式來降低費用並縮短延遲時間。如需詳細瞭解如何在“正好一次”和“至少一次”流處理之間進行選擇，請參閱 [設置流水線流處理模式](https://cloud.google.com/dataflow/docs/guides/streaming-modes?hl=zh-cn) 。\n### 遲到數據\n“正好一次”處理可確保流水線的準確性 ：如果流水線處理了記錄，則 Dataflow 會確保該記錄反映在輸出中，並且該記錄不會重複。\n但是，在流處理流水線中，“正好一次”處理不能保證結果是完整的 ，因爲記錄可能會延遲到達。舉例來說，假設您的流水線在某個時間範圍執行聚合，例如 `Count` 。使用“正好一次”處理時，及時到達該時間範圍的記錄的結果是準確的，但延遲記錄可能會被丟棄。\n通常，無法保證流處理流水線的完整性，因爲理論上記錄可能會任意延遲到達。在限制性情況下，您需要無限期地等待才能產生結果。實際上，Apache Beam 可讓您配置丟棄延遲數據的閾值以及何時發出聚合結果。如需瞭解詳情，請參閱 Apache Beam 文檔中的 [水印和延遲數據](https://beam.apache.org/documentation/programming-guide/#watermarks-and-late-data) 部分。\n### 副作用\n副作用不保證具有“正好一次”語義。重要的是，這包括將輸出寫入外部存儲區，除非接收器也實現“正好一次”語義。\n具體來說，Dataflow 不保證每條記錄正好經歷每個轉換一次。由於重試或工作器故障，Dataflow 可能會多次通過轉換髮送記錄，甚至在多個工作器上同時發送記錄。\n在“正好一次”處理中，Dataflow 會刪除重複的輸出。但是，如果轉換中的代碼有副作用，則這些副作用可能會多次發生。例如，如果轉換進行遠程服務調用，則可能會對同一記錄多次進行該調用。在某些情況下，副作用甚至可能會導致數據丟失。例如，假設轉換讀取文件以生成輸出，然後立即刪除文件，而不等待提交輸出。如果在提交結果時發生錯誤，Dataflow 會重試轉換，但現在轉換無法讀取已刪除的文件。\n### 日誌記錄\n處理輸出的日誌表示處理已發生，但並未表明數據是否已提交。因此，即使已處理數據的結果僅提交到永久性存儲空間一次，日誌文件也可能會表明數據已多次處理。此外，日誌並不總是反映已處理和已提交的數據。日誌可能因限制而被丟棄或因其他日誌記錄服務問題而丟失。\n## “正好一次”流處理\n本部分介紹 Dataflow 如何對流式作業實現“正好一次”處理，包括 Dataflow 如何管理非確定性處理、延遲數據和自定義代碼等各種複雜情況。\n### Dataflow 流式重排\n通過將工作範圍分配給每個工作器，流式傳輸 Dataflow 作業可以在許多不同的工作器上並行運行。雖然分配可能會隨着時間的推移而變化，以響應工作器故障、自動擴縮或其他事件，但在每次 [GroupByKey 轉換](https://beam.apache.org/documentation/programming-guide/#groupbykey) 後，具有相同鍵的所有記錄都將在同一工作器上處理。 `GroupByKey` 轉換通常用於複合轉換，例如 `Count` 、 `FileIO` 等。爲確保給定鍵的記錄最終位於同一個工作器上，Dataflow 工作器使用遠程過程調用 (RPC) 在它們自身之間重排數據。\n爲了保證在重排期間記錄不會丟失，Dataflow 會使用上游備份。若使用上游備份，發送記錄的工作器會重試 RPC，直到獲得對收到記錄的肯定確認。 處理記錄的副作用將提交到下游的永久性存儲空間。如果發送記錄的工作器不可用，Dataflow 會繼續重試 RPC，以確保每條記錄至少傳送一次。\n由於這些重試可能會創建重複項，因此每條消息都標有唯一 ID。每個接收器都存儲一個已查看和處理的所有 ID 的目錄。收到記錄後，Dataflow 會在目錄中查找其 ID。如果找到該 ID，則說明記錄已被接收並提交，並且將作爲重複記錄丟棄。爲確保記錄 ID 的穩定性，每個步驟的每項輸出都會保存到存儲空間。因此，如果由於重複的 RPC 調用而多次發送同一消息，則該消息僅會提交到存儲空間一次。\n### 確保較短的延遲時間\n要使“正好一次”處理可行，必須降低 I/O，尤其是避免每條記錄都執行 I/O。爲了實現此目標，Dataflow 會使用布隆過濾器和垃圾回收功能。\n[布隆過濾器](https://en.wikipedia.org/wiki/Bloom_filter) 是緊湊的數據結構，允許快速設置成員資格檢查。在 Dataflow 中，每個工作器都會保留它看到的每個 ID 的布隆過濾器。當新的記錄 ID 到達時，工作器會在過濾器中查找該 ID。如果過濾器返回 false，則此記錄不是重複記錄，並且工作器不會在穩定存儲空間中查找該 ID。\nDataflow 會存儲一組按時間劃分的滾動布隆過濾器。記錄到達後，Dataflow 會根據系統時間戳選擇合適的過濾器進行檢查。此步驟可防止布隆過濾器在系統進行垃圾回收時達到飽和狀態，並且還會限制在啓動時需要掃描的數據量。\n爲避免使用記錄 ID 填滿存儲空間，Dataflow 會使用垃圾回收來移除舊記錄。Dataflow 使用系統時間戳計算垃圾回收水印。\n此水印基於給定階段等待的物理時間。因此，它還提供了有關流水線哪些部分運行緩慢的信息。此元數據是 [Dataflow 監控界面](https://cloud.google.com/dataflow/docs/guides/monitoring-overview?hl=zh-cn) 中顯示的系統延隔指標的基礎。\n如果記錄到達的時間戳早於水印，並且此時間的 ID 已被系統執行垃圾回收，則忽略該記錄。由於觸發垃圾回收的低水印在確認記錄遞送之前不會前進，因此這些延遲到達的記錄是重複的。\n## 非確定性來源\nDataflow 使用 Apache Beam SDK 將數據讀入流水線。 如果處理失敗，Dataflow 可能會重試從來源讀取數據。在這種情況下，Dataflow 需要確保來源生成的每個唯一記錄正好記錄一次。對於確定性來源（例如 Pub/Sub Lite 或 Kafka），系統會根據記錄的偏移量讀取記錄，從而減少執行此步驟的需求。\n由於 Dataflow 無法自動分配記錄 ID，因此非確定性來源必須向 Dataflow 告知記錄 ID 以避免重複。當來源爲每條記錄提供唯一 ID 時，連接器會在流水線中使用重排來移除重複記錄。具有相同 ID 的記錄會被濾除。 如需查看示例，瞭解 Dataflow 在使用 Pub/Sub 作爲來源時如何實現“正好一次”處理，請參閱“使用 Pub/Sub 進行流式傳輸”頁面中的 [高效的去重技術](https://cloud.google.com/dataflow/docs/concepts/streaming-with-cloud-pubsub?hl=zh-cn#efficient_deduplication) 部分。\n在流水線中執行自定義 `DoFn` 時，Dataflow 不保證此代碼僅針對每條記錄運行一次。爲了保證在工作器故障時至少處理一次，Dataflow 可能會通過轉換多次來運行給定記錄，或者可能會在多個工作器上同時運行同一記錄。如果您在流水線中添加可以執行像聯繫外部服務之類的操作的代碼，則這些操作可能會針對給定記錄運行多次。\n如需有效地實現非確定性處理，請使用 [檢查點](https://beam.apache.org/documentation/programming-guide/#user-initiated-checkpoint) 。使用檢查點時，轉換的每項輸出都會與其唯一 ID 保存到穩定的存儲空間，然後再傳送到下一階段。在 Dataflow 的重排傳送中重試時，會中繼已設置檢查點的輸出。 雖然您的代碼可能會運行多次，但 Dataflow 可確保僅存儲其中一個運行的輸出。 Dataflow 使用一致的存儲區，以防止將重複項寫入穩定的存儲空間。\n## “正好一次”輸出傳送\nApache Beam SDK 包含 [內置接收器](https://beam.apache.org/documentation/io/connectors/) ，旨在確保它們不會產生重複項。請儘可能使用這些內置接收器之一。\n如果您需要 [編寫自己的接收器](https://beam.apache.org/documentation/io/developing-io-overview/#sinks) ，最好的方法是使函數對象具有 [冪等性](https://beam.apache.org/documentation/programming-guide/#user-code-idempotence) ，以便它可以根據需要經常重試，而不會導致意外的副作用。 但是，實現接收器功能的轉換的某些組件通常是不確定的，並且在重試時可能會發生變化。\n例如，在窗口化聚合中，窗口中的記錄集可能是不確定的。具體而言，窗口可能會嘗試使用元素 e0、e1、e2 觸發。工作器在提交窗口處理之前可能會崩潰，但不會在這些元素作爲副作用發送之前崩潰。當工作器重啓時，該窗口會再次觸發，並且延遲元素 e3 到達。由於此元素在提交窗口之前到達，不會計爲延遲數據，因此係統會使用元素 e0、e1、e2、e3 再次調用 `DoFn` 。然後，這些元素會發送到副作用操作。在這種情況下，冪等性沒有幫助，因爲每次都會發送不同的邏輯記錄集。\n如需在 Dataflow 中解決非不確定性，請使用內置的 `Reshuffle` 轉換。當 Dataflow 重排數據時，Dataflow 會持久地寫入數據，以便在重排後重試操作時，所有非確定性元素都處於穩定狀態。使用 `Reshuffle` 轉換可保證只有一個 `DoFn` 輸出版本可以超越重排邊界。以下模式可確保副作用操作始終接收要輸出的確定性記錄：\n```\nc.apply(Window.<..>into(FixedWindows.of(Duration.standardMinutes(1)))) .apply(GroupByKey.<..>.create()) .apply(new PrepareOutputData()) .apply(Reshuffle.<..>of()) .apply(WriteToSideEffect());\n```\n要確保 Dataflow 運行程序知道在執行 `DoFn` 之前元素必須穩定，請將 [RequiresStableInput](https://beam.apache.org/releases/javadoc/current/org/apache/beam/sdk/transforms/DoFn.RequiresStableInput.html) 註解添加到 `DoFn` 。\n## 瞭解詳情\n- [設置流水線流處理模式](https://cloud.google.com/dataflow/docs/guides/streaming-modes?hl=zh-cn) \n- [使用 Pub/Sub 進行流式傳輸](https://cloud.google.com/dataflow/docs/concepts/streaming-with-cloud-pubsub?hl=zh-cn) \n- [Streaming Engine：用於高度可擴縮、低延遲數據處理的執行模型](https://medium.com/google-cloud/streaming-engine-execution-model-1eb2eef69a8e) \n- 詳細瞭解 [Apache Beam 執行模型](https://beam.apache.org/documentation/runtime/model/) \n- [Lambda 之後：Dataflow 中的“正好一次”處理，第 1 部分](https://cloud.google.com/blog/products/data-analytics/after-lambda-exactly-once-processing-in-google-cloud-dataflow-part-1?hl=zh-cn) \n- [Lambda 之後：Dataflow 中的“正好一次”處理，第 2 部分（確保低延遲）](https://cloud.google.com/blog/products/gcp/after-lambda-exactly-once-processing-in-cloud-dataflow-part-2-ensuring-low-latency?hl=zh-cn) \n- [Lambda 之後：Dataflow 中的“正好一次”處理，第 3 部分（來源和接收器）](https://cloud.google.com/blog/products/gcp/after-lambda-exactly-once-processing-in-cloud-dataflow-part-3-sources-and-sinks?hl=zh-cn)", "guide": "Dataflow"}