{"title": "Cloud SQL - Access control with Google Cloud tags", "url": "https://cloud.google.com/sql/docs/postgres/tags", "abstract": "# Cloud SQL - Access control with Google Cloud tags\nThis page describes Google Cloud tags and how to use them with Cloud SQL. To add tags to your Cloud SQL instances using `gcloud` now, see [Attach and manage tags on Cloud SQL instances](/sql/docs/postgres/manage-tags) . To add tags to your Cloud SQL instances using the Google Cloud console now, see [Create and manage tags on your instance](/resource-manager/docs/tags/tags-creating-and-managing) .\n", "content": "## Overview\nGoogle Cloud are a way to organize your Cloud SQL resources.\nTags are applied at higher levels of the [resource hierarchy](/resource-manager/docs/cloud-platform-resource-hierarchy) across Google Cloud. Cloud SQL and other instances inherit the tags. They are managed using [Resource Manager](/resource-manager/docs/tags/tags-overview) . You can add a reference to tags in [IAM policy bindings](/iam/docs/tags-access-control) to grant conditional access to resources.\nTags are different from [labels](/resource-manager/docs/creating-managing-labels#what-are-labels) , which are another way to organize and filter your instances. Tags and labels work independently of each other, and you can use both on the same instance. For more information about using labels in Cloud SQL, see [Label instances](/sql/docs/mysql/label-instance) .\n## What are tags?\nTags are key-value pairs you can apply to your resources for fine-grained access control.\nA tag key could be a property, such as `environment` , and the tag value could be an attribute, such as `development` or `production` . A tag can have only one value for a given key on a particular resource.\nTags are created at the Organization level. Tags are attached to resources, such as a project or a Cloud SQL instance, through the [Resource Manager](/resource-manager/docs/tags/tags-overview) , which is used across Google Cloud.\n## Grant permissions based on conditional tag bindings\nOnce a tag is attached to or inherited by a Cloud SQL instance, you can [use the tag](/iam/docs/conditions-attribute-reference#resource-tags) with IAM Conditions to grant access to Cloud SQL resources conditionally. IAM Conditions let you impose fine-grain access control to Cloud SQL instances. To use IAM Conditions, you reference the tags in IAM policy bindings. For more information on how to use tags to grant conditional access to Cloud SQL instances, see [Use IAM conditions](/sql/docs/postgres/iam-conditions) .\n## Restrictions\nTags have the following restrictions:\n- [Organization policies](/resource-manager/docs/organization-policy/tags-organization-policy) can conditionally reference tags inherited from the Project level and above, but don't support tags that are directly attached to Cloud SQL instances.\n- [Cloud Audit logs](/storage/docs/audit-logging) show the creation and deletion of tags, but entries are not generated for attaching tags and viewing tag bindings on Cloud SQL instances.## What's next\n- Learn how to [create and manage tags on your instance](/resource-manager/docs/tags/tags-creating-and-managing) using Resource Manager.\n- See specific`gcloud`commands for Cloud SQL in [Manage tags on Cloud SQL](/sql/docs/postgres/manage-tags) .\n- Learn about [IAM conditions](/sql/docs/postgres/iam-overview#iam-conditions) .\n- Learn how to [use IAM conditions with Cloud SQL](/sql/docs/postgres/iam-conditions) .", "guide": "Cloud SQL"}