{"title": "Cloud SQL - SQL Server Reporting Services (SSRS)", "url": "https://cloud.google.com/sql/docs/sqlserver/ssrs?hl=zh-cn", "abstract": "# Cloud SQL - SQL Server Reporting Services (SSRS)\nCloud SQL supports [SQL Server Reporting Services (SSRS)](https://learn.microsoft.com/en-us/sql/reporting-services/create-deploy-and-manage-mobile-and-paginated-reports?view=sql-server-ver16) which helps you create, deploy, and manage paginated reports.\nThis page provides the prerequisites, setup procedure, and limitations for using SSRS in Cloud SQL.\n", "content": "## Before you begin\nBefore using SSRS on Cloud SQL, you must have the following:\n- A Cloud SQL instance to host the report server database\n- A host where you install and run SSRS. It can be either a Compute Engine VM or a host that doesn't use Compute Engine. For installation instructions, see [Install SQL Server Reporting Services](https://learn.microsoft.com/en-us/sql/reporting-services/install-windows/install-reporting-services?view=sql-server-ver16) .\n- A Cloud DNS record to assign a hostname for your Cloud SQL instance. You can create a hostname by using one of the following options:- Cloud DNS: Use [Cloud DNS](/dns/docs/overview) to create a hostname that points to your instance.\n- Custom DNS zone: If you manage your own DNS zone, then [create an A record](/dns/docs/records) that maps your preferred hostname to the IP address of your instance.\n- Local hostname mapping: Modify your system's`hosts`file to create a custom alias for your instance.\n- Two existing Cloud SQL logins, a setup login and a service login. To create a login, see [gcloud sql users create](/sdk/gcloud/reference/sql/users/create) . **Note:** Cloud SQL doesn't support using Windows logins for SSRS.If you want to use Windows authentication, then you must use Managed Active Directory to join the SQL Server instance and the host running SSRS. For more information, see [Use Managed Microsoft AD with Cloud SQL](/sql/docs/sqlserver/configure-ad) .## Procedure\nTo set up SSRS in Cloud SQL, perform the following steps:\n- [Acquire an SSRS lease](/sql/docs/sqlserver/ssrs#acquire) .\n- [Set up SSRS](/sql/docs/sqlserver/ssrs#setup) .\n- [Release an SSRS lease](/sql/docs/sqlserver/ssrs#release) .\n### Acquire an SSRS lease\nSSRS requires elevated permissions during setup. To acquire an SSRS lease for your instance, use the following command:\nUse the following command to acquire a lease:\n```\ngcloud sql instances acquire-ssrs-lease INSTANCE_NAME \\--project=PROJECT_NAME \\--setup-login=SETUP_LOGIN \\--service-login=SERVICE_LOGIN \\--report-database=REPORT_DATABASE \\--duration=DURATION \\\n```\nThe following table describes this operation's `gcloud` parameters:\n| 0     | 1                                                           | 2                               | 3    |\n|:------------------|:------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|:--------------------------------------------------------------------------------------------------------------------------|:--------------|\n| Parameter   | Description                                                        | Allowed values                           | Default value |\n| --setup-login  | Required. The login used to connect to the instance during SSRS setup. This is the first login that is requested in Report Server Configuration Manager when setting a report server database.           | This must be a existing SQL Server login, such as sqlserver                | nan   |\n| --service-login | Required. The SQL Server login used by report server to connect to the report server database during SSRS setup. This is the second login that is requested in Report Server Configuration Manager when setting a report server database. | This must be an existing SQL Server login and must be different from the setup login.          | None.   |\n| --report-database | Required. An existing or a new report database name on the instance.                                          | Certain special characters are not allowed in the report database name, such as spaces, brackets, non-English characters. | nan   |\n| --duration  | Optional. The number of hours that the SSRS lease is active during which you can perform the SSRS setup.                                 | Between 1 and 12 hours. For example, 4h                     | 5 hours  |\nUsing the REST API, you can acquire an SSRS lease on an instance. To acquire an SSRS lease, specify the following:\n- Two different SQL Server logins, the setup login and service login\n- The report database name\n- The duration for which the lease is active\nOnly the `DURATION` field is optional. For more information, see [ AcquireSsrsLeaseContext](/sql/docs/sqlserver/admin-api/rest/v1/instances#AcquireSsrsLeaseContext) :- : the ID of the project.\n- : the name of the instance.\n- : the SQL Server login that's used to connect to the SQL Server instance during SSRS setup. This the first login that is requested in Report Server Configuration Manager when setting a report server database.\n- : the SQL Server login that's used by report server to connect to the report server database during SSRS setup. This is the second login that is requested in Report Server Configuration Manager when setting a Report Server Database.\n- : an existing or a new report database name on the instance. Microsoft doesn't allow certain special characters in the report database name, such as spaces, brackets, non-English characters.\n- : Optional. The number of hours that the SSRS lease is active during which you can perform the SSRS setup. Between 1 and 12 hours, for example,`4h`.\nHTTP method and URL:\n```\nPOST https://sqladmin.googleapis.com/sql/v1/projects/PROJECT_ID/instances/INSTANCE_NAME/acquireSsrsLease\n```\nRequest JSON body:\n```\n{  \"acquireSsrsLeaseContext\": {    \"setupLogin\": SETUP_LOGIN,    \"serviceLogin\": SERVICE_LOGIN,    \"reportDatabase\": REPORT_DATABASE,    \"duration\": DURATION,  }}\n```\nUsing the REST API, you can acquire an SSRS lease on an instance. To acquire an SSRS lease, specify the following:\n- Two different SQL Server logins, the setup login and service login\n- The report database name\n- The duration for which the lease is active\nOnly the `DURATION` field is optional. For more information, see [ AcquireSsrsLeaseContext](/sql/docs/sqlserver/admin-api/rest/v1beta4/instances#AcquireSsrsLeaseContext) :- : the ID of the project.\n- : the name of the instance.\n- : the SQL Server login that's used to connect to the SQL Server instance during SSRS setup. This the first login that is requested in Report Server Configuration Manager when setting a report server database.\n- : the SQL Server login that's used by report server to connect to the report server database during SSRS setup. This is the second login that is requested in Report Server Configuration Manager when setting a Report Server Database.\n- : an existing or a new report database name on the instance. Microsoft doesn't allow certain special characters in the report database name, such as spaces, brackets, non-English characters.\n- : Optional. The number of hours that the SSRS lease is active during which you can perform the SSRS setup. Between 1 and 12 hours, for example,`4h`.\nHTTP method and URL:\n```\nPOST https://sqladmin.googleapis.com/sql/v1beta4/projects/PROJECT_ID/instances/INSTANCE_NAME/acquireSsrsLease\n```\nRequest JSON body:\n```\n{  \"acquireSsrsLeaseContext\": {    \"setupLogin\": SETUP_LOGIN,    \"serviceLogin\": SERVICE_LOGIN,    \"reportDatabase\": REPORT_DATABASE,    \"duration\": DURATION,  }}\n```\n### Set up SSRS\n**Note:** To automate the setup process described in this section, you can use any scripting solution, such as PowerShell.\nTo perform the SSRS setup, follow these steps:\n- Open Reporting Services Configuration Manager on the host where SSRS is installed.\n- Connect to your local report server instance.\n- Click **Change Database** .- Enter the SQL Server hostname created in Cloud DNS and the SQL Server login credentials for the setup login used for the SSRS lease.\n- Enter the name of a new report server database or existing report database used for the SSRS lease.\n- Enter the SQL Server login credentials for the service login used for the SSRS lease.\n- Click **Next** and finish through the last step.\n- If not already set, then configure the **Web Service URL** and **Web Portal URL** . The Web Portal should load successfully within a few seconds.\n### Release an SSRS lease\nYou can release a lease manually, or you can wait until the lease automatically expires. Releasing the lease is required to revert any elevated permissions needed for setup and to allow the service login to connect to the report database. The service login can't access the report database until the lease expires or is released manually. The following command releases an SSRS lease.\nUse the following command to release a lease:\n```\ngcloud sql instances release-ssrs-lease INSTANCE_NAME \\--project=PROJECT_NAME\n```Using the REST API, you can release an SSRS lease for an instance. As shown in the following request example, you only need to provide the instance name and project ID.- : the ID of the project.\n- : the name of the instance.\nHTTP method and URL:\n```\nPOST https://sqladmin.googleapis.com/v1/projects/PROJECT_ID/instances/INSTANCE_NAME/releaseSsrsLease\n```Using the REST API, you can release an SSRS lease for an instance. As shown in the following request example, you only need to provide the instance name and project ID.- : the ID of the project.\n- : the name of the instance.\nHTTP method and URL:\n```\nPOST https://sqladmin.googleapis.com/sql/v1beta4/projects/PROJECT_ID/instances/INSTANCE_NAME/releaseSsrsLease\n```\n## Limitations\n- Active Directory logins are not supported for setting up the report database.\n- The report database name can contain only alphanumeric characters and hyphens.\n- You must acquire a lease for changing the login used to connect to the report database through Report Server Configuration Manager.\n- For a database that is processed by a service login, the import sql files and delete replicated database operations can fail between the completion of the SSRS setup and the release of the lease.\n- You must delete and recreate the database user for the service login on an imported report database. This is because the existing user in the imported database doesn't belong to the new instance.\n- When adding new report servers for a scale-out deployment in SSRS, you must acquire and release the SSRS lease for every new Windows VM hosting a report server. Each Cloud SQL instance requires that you configure the new report database by using the existing report database.\n- You must create a new lease every time you want to change the login credentials for the report server database in Report Server Configuration Manager.", "guide": "Cloud SQL"}