{"title": "Cloud SQL - About linked servers", "url": "https://cloud.google.com/sql/docs/sqlserver/linked-servers", "abstract": "# Cloud SQL - About linked servers\nLinked servers give SQL Server the ability to read data from remote data sources and execute commands on remote databases. This page provides information about Cloud SQL instance permissions, things to consider when implementing linked servers, and the limitations of using linked servers.\n", "content": "## Linked server instance permissions\nTo set up linked servers, you need the following instance and user permissions:\n- `ALTER ANY LINKED SERVER`: Cloud SQL grants this permission when you add the`cloudsql enable linked servers`flag to your instance.\n- `ALTER ANY LOGIN`: Cloud SQL automatically grants this permission to the administrative user for the Cloud SQL instance. This permission allows you to create a mapping between a login on Cloud SQL and a security account on a linked server.\nFor a list of the default permissions available for Cloud SQL instances, see [Default SQL Server users](/sql/docs/sqlserver/users#default-users) .\nFor information about how to grant the `ALTER ANY LINKED SERVER` or `ALTER ANY LOGIN` permission to additional accounts, see the example at [Granting serverpermissions](/sql/docs/sqlserver/users#grant-command) .\n## Considerations when using linked servers\nThis section has recommendations for handling security, performance, and reliability on linked servers.\n### Security\nTo mitigate potential [security vulnerabilities](https://www.netspi.com/blog/technical/network-penetration-testing/how-to-hack-database-links-in-sql-server/) , you need to ensure that linked servers have strong security protocols in place, such as the following:\n- Implement appropriate authentication and authorization mechanisms, such as [SSL encryption](/sql/docs/sqlserver/configure-ssl-instance) .\n- Implement strict [password policies](https://learn.microsoft.com/en-us/sql/relational-databases/security/password-policy?view=sql-server-ver16) .\n- Ensure that only authorized users have access to the linked server.\n- Ensure that sensitive data is properly encrypted and secured.\n- Ensure that logins only have access to the resources that you use during the configuration.\n### Performance\nThere are a few factors that might impact performance on linked servers:\n- Linked servers can introduce latency and degrade performance when queries are complex, depending on the volume of data each server transfers. This can cause problems for applications that require real-time data synchronization.\n- When you use linked servers to run a query, a database engine creates a new connection and fetches data for every query you run. Data isn't cached and the server might [copy the entire table across the network](https://www.brentozar.com/archive/2021/07/why-are-linked-server-queries-so-bad/) every time you use a linked server.\n- Cloud SQL can't [create an optimized execution plan](https://datasteve.com/2020/04/02/linked-server-in-sql-server-the-good-the-bad-and-the-way-to-make-it-perfect/) for the remote server because it doesn't know how the remote server handles indexes and statistics.\nTo optimize performance, do the following:\n- Carefully design your queries and ensure that only the necessary data is being transferred between servers.\n- Leverage the [SQL Server distributed queriesfeature](https://learn.microsoft.com/en-us/host-integration-server/core/query-processor2) .\n- Distribute queries across multiple servers.\n- Regularly monitor and optimize your linked server configuration to help ensure that it's running smoothly.\n### Reliability\nAny interruptions or failures in the link between servers can lead to significant downtime and potentially cause data loss.\nTo ensure reliable operation, it's important to implement appropriate failover and redundancy mechanisms. This can include the following:\n- Implement a backup linked server for failover.\n- Monitor server availability and performance.\n- Regularly test and validate your linked server configurations.## Limitations\nLinked servers for Cloud SQL have the following limitations:\n- Linked servers can't use data sources other than SQL Server.\n- Active Directory Authentication isn't available for linked Servers.\nFor a full list of limitations for linked servers, see [Unsupported features &services](https://learn.microsoft.com/en-us/sql/linux/sql-server-linux-editions-and-components-2019?view=sql-server-ver16#Unsupported) .\n## What's next\n- Learn how to [enable, add, and configure linkedservers](/sql/docs/sqlserver/manage-linked-servers) .", "guide": "Cloud SQL"}