{"title": "Cloud SQL - About instance settings", "url": "https://cloud.google.com/sql/docs/postgres/instance-settings", "abstract": "# Cloud SQL - About instance settings\nThis page provides information about the settings available for Cloud SQL instances.\n", "content": "## Settings for Cloud SQL for PostgreSQL\n| Setting        | Modifiable after creation?      | Possible values                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       |\n|:---------------------------------------|:-----------------------------------------------|:-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| Instance ID       | N            | Composed of lowercase letters, numbers, and hyphens; must start with a letter. The total length must be 98 characters or less.                                                                                                                                                                                                                                                                                                                                                                                                                                                           |\n| Region         | N            | For Cloud SQL Enterprise Plus edition: asia-east1 — Taiwan asia-northeast1 — Tokyo asia-northeast2 — Osaka asia-northeast3 — Seoul asia-south1 — Mumbai asia-south2 — Delhi asia-southeast1 — Singapore asia-southeast2 — Jakarta australia-southeast1 — Sydney australia-southeast2 — Melbourne europe-central2 — Warsaw europe-north1 — Finland europe-southwest1 — Madrid europe-west1 — Belgium europe-west2 — London europe-west3 — Frankfurt europe-west4 — Netherlands europe-west6 — Zürich europe-west8 — Milan europe-west9 — Paris europe-west12 — Turin me-central1 — Doha me-central2 — Dammam me-west1 — Tel Aviv northamerica-northeast1 — Montréal northamerica-northeast2 — Toronto southamerica-east1 — San Paulo us-central1 — Iowa us-east1 — South Carolina us-east4 — Northern Virginia us-east5 — Columbus us-south1 — Dallas us-west1 — Oregon us-west2 — Los Angeles us-west3 — Salt Lake City us-west4 — Las Vegas For Cloud SQL Enterprise edition: africa-south1 — Johannesburg asia-east1 — Taiwan asia-east2 — Hong Kong asia-northeast1 — Tokyo asia-northeast2 — Osaka asia-northeast3 — Seoul asia-south1 — Mumbai asia-south2 — Delhi asia-southeast1 — Singapore asia-southeast2 — Jakarta australia-southeast1 — Sydney australia-southeast2 — Melbourne europe-central2 — Warsaw europe-north1 — Finland europe-southwest1 — Madrid europe-west1 — Belgium europe-west2 — London europe-west3 — Frankfurt europe-west4 — Netherlands europe-west6 — Zürich europe-west9 — Paris europe-west10 — Berlin europe-west12 — Turin me-central1 — Doha me-central2 — Dammam me-west1 — Tel Aviv northamerica-northeast1 — Montréal northamerica-northeast2 — Toronto southamerica-east1 — São Paulo southamerica-west1 — Santiago us-central1 — Iowa us-east1 — South Carolina us-east4 — Northern Virginia us-east5 — Columbus us-south1 — Dallas us-west1 — Oregon us-west2 — Los Angeles us-west3 — Salt Lake City us-west4 — Las Vegas |\n| Zone         | Y            | The possible values depend on the region.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                |\n| Database version      | N            | For Cloud SQL Enterprise Plus edition: Console string API enum string PostgreSQL 15 (default) POSTGRES_15 PostgreSQL 14 POSTGRES_14 PostgreSQL 13 POSTGRES_13 PostgreSQL 12 POSTGRES_12 For Cloud SQL Enterprise edition: Console string API enum string PostgreSQL 15 (default) POSTGRES_15 PostgreSQL 14 POSTGRES_14 PostgreSQL 13 POSTGRES_13 PostgreSQL 12 POSTGRES_12 PostgreSQL 11 POSTGRES_11 PostgreSQL 10 POSTGRES_10 PostgreSQL 9.6 POSTGRES_9_6                                                                                                                                                                                                                                                                                                                                                                            |\n| SSL mode        | Y            | Enforces/enables SSL as follows: ALLOW_UNENCRYPTED_AND_ENCRYPTED: allows non-SSL/non-TLS and SSL/TLS connections. For SSL connections, the client certificate is not verified. This is the default value. ENCRYPTED_ONLY: only allows connections encrypted with SSL/TLS. TRUSTED_CLIENT_CERTIFICATE_REQUIRED: only allows connections encrypted with SSL/TLS and with valid client certificates. When you use these values, you must set requireSsl to a compatible value or unset to avoid the conflict between values of two settings. For more information, see IpConfiguration.                                                                                                                                                                                                                                                                                                                                            |\n| Set edition       | Y            | ENTERPRISE or ENTERPRISE PLUS                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   |\n| Set password policy     | Y            | Configured or not.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      |\n| Private IP        | After it's activated, it can't be deactivated. | Activated or deactivated.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    |\n| Public IP        | Y            | Activated or deactivated.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    |\n| Authorized networks     | Y            | If Public IP is enabled, IP addresses authorized to connect to the instance. You can also specify this value as an IP address range, in CIDR notation.                                                                                                                                                                                                                                                                                                                                                                                                                                                    |\n| Private path for Google Cloud services | Y            | Activated or deactivated.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    |\n| Data cache        | Y            | Activated or deactivated.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    |\n| Machine type       | Y            | Select from Shared core or Dedicated core. For Shared core, each machine type is classified by the number of CPUs (cores) and amount of memory for your instance. For Dedicated core, instead of selecting a predefined configuration, select the Custom radio button to create a custom machine type. Learn more                                                                                                                                                                                                                                                                                                                                                                                                             |\n| Cores         | Y            | For Cloud SQL Enterprise Plus edition: 2 to 128 (predefined machine types only) For Cloud SQL Enterprise edition: 1 to 96 (must be either 1 or an even number) Partial for shared vCPU                                                                                                                                                                                                                                                                                                                                                                                                                                            |\n| Memory         | Y            | For Cloud SQL Enterprise Plus edition: 16 to 864 GB per vCPU (predefined machine types only) For Cloud SQL Enterprise edition: 0.9 to 6.5 GB per vCPU (must be a multiple of 256 MB and at least 3.75 GB)                                                                                                                                                                                                                                                                                                                                                                                                                                       |\n| Storage type       | N            | SSD (default value) HDD (Cloud SQL Enterprise edition only)                                                                                                                                                                                                                                                                                                                                                                                                                                                                            |\n| Storage capacity      | Y (Increase only)        | Instances with at least one unshared vCPU can have up to 64 TB. Instances with a shared vCPU can have up to 3054 GB. Note that creating or increasing storage capacity to 64 TB might increase latency of common operations, such as backups, dependent on your workload.                                                                                                                                                                                                                                                                                                                                                                                                                        |\n| Enable automatic storage increases  | Y            | On (default value) Off                                                                                                                                                                                                                                                                                                                                                                                                                                                                                     |\n| Automatic storage increase limit  | Y            | In GBs. 0 (the default) means there is no limit.                                                                                                                                                                                                                                                                                                                                                                                                                                                                               |\n| Backups        | Y            | On (default value) Off                                                                                                                                                                                                                                                                                                                                                                                                                                                                                     |\n| Locations options      | Y            | Multi-region (default value) Region There is also a drop-down menu with a list of multi-regions when you select Multi-region or regions when you select Region.                                                                                                                                                                                                                                                                                                                                                                                                                                                  |\n| Instance deletion protection   | Y            | Activated or deactivated.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    |\n| Enable point-in-time recovery   | Y (see note)         | On (default value) Off                                                                                                                                                                                                                                                                                                                                                                                                                                                                                     |\n| Availability: Single zone    | Y            | On (default value) Off                                                                                                                                                                                                                                                                                                                                                                                                                                                                                     |\n| High availability (regional)   | Y            | On Off (default value)                                                                                                                                                                                                                                                                                                                                                                                                                                                                                     |\n| Maintenance: Preferred window   | Y            | Any (default value) Day of the week                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  |\n| Maintenance: Order of update   | Y            | Any (default value) Later Earlier                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  |\n| Database flags       | Y            | See Configuring Database Flags.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   |\n## Impact of changing instance settings\nFor most instance settings, Cloud SQL applies the change immediately and connectivity to the instance is unaffected.\nChanging the number of CPUs or the memory size results in the instance going offline for less than 60 seconds. The total time for the changes to take effect can take several minutes.\nChanging an instance's zone, configuring the private IP, changing its network, and enabling high availability results in the instance going offline for several minutes.\nCloud SQL automatically manages the value of the `max_connections` flag based on the amount of memory on the instance (for more information, see [supportedflags](https://cloud.google.com/sql/docs/postgres/flags#list-flags-postgres) ). PostgreSQL requires that the value of `max_connections` is always at least as large on a read replica as it is on its primary. Therefore, if the read replicas have less memory than the primary, changing the amount of memory on the primary might result in its read replicas going offline for less than 60 seconds. This happens because the read replicas might need to receive a new value of `max_connections`\nto remain consistent with the change on the primary, and updating the value of `max_connections` requires restarting PostgreSQL. To prevent this from happening, set the `max_connections` flag on the primary to a value of your choice.\nPlan to make these kinds of changes when your service can handle an outage of this duration.\n## What's next\n- Learn how to [edit your instance](/sql/docs/postgres/edit-instance) .\n- Learn more about [database flags](/sql/docs/postgres/flags) .\n- Learn how to [authorize IP access for yourinstance](/sql/docs/postgres/configure-ip) .\n- Learn more about [replication options](/sql/docs/replication) .\n- See [pricing](/sql/docs/postgres/pricing) for your instance.\n- Learn more about [options for connecting to your instance](/sql/docs/%0Apostgres/external-connection-methods) .\n- Learn how to [configure an IP address for your instance](/sql/docs/%0Apostgres/configure-ip) .", "guide": "Cloud SQL"}