{"title": "Cloud SQL - Optimize high CPU usage in instances", "url": "https://cloud.google.com/sql/docs/postgres/optimize-cpu-usage", "abstract": "# Cloud SQL - Optimize high CPU usage in instances\nHigh CPU utilization adversely affects the performance of your instance. Any activity that's performed on the instance uses CPU. Hence, if there's a high CPU utilization notice, you should first identify the root cause of the issue, whether that's poorly written queries, long running transactions, or any other database activity.\nThis document describes the ways to identify CPU bottlenecks in an instance and mitigate the CPU utilization issues in the instance.\n", "content": "## Identify the CPU bottlenecks\n### Use query insights to identify queries that have high CPU consumption\n[Query insights](/sql/docs/postgres/using-query-insights) helps you detect, diagnose, and prevent query performance problems for Cloud SQL databases.\n### Use the pg_proctab extension\nUse the [pg_proctab](/sql/docs/postgres/extensions#pg_proctab) extension with the combination of the `pg_top` utility to get operating system outputs that give per process CPU utilization information.\n### Use queries\nEach active connection to the database takes some amount of CPU, so if the instance has a high number of connections, cumulative utilization could be high. Use the following query to get the information about the number of connections by state.\n```\nSELECT   state,   usename,   count(1) FROM   pg_stat_activity WHERE   pid <> pg_backend_pid() group by   state,   usename order by   1;\n```\nThe output looks similar to the following:\n```\n        state        |    usename    | count ---------------------+---------------+------- active              | ltest         |   318 active              | sbtest        |    95 active              |               |     2 idle                | cloudsqladmin |     2 idle in transaction | ltest         |    32 idle in transaction | sbtest        |     5                     | cloudsqladmin |     3                     |               |     4(8 rows)\n```\nIf the active connections count is high, check for long running queries or wait events that are blocking the queries from executing.\nIf the idle connection count is high, execute the following query to terminate the connections, after taking the necessary approvals.\n```\nSELECT   pg_terminate_backend(pid) FROM   pg_stat_activity WHERE   usename = 'sbtest'   and pid <> pg_backend_pid()   and state in ('idle');\n```\nYou can also terminate the connections individually with `pg_terminate_backend` using the following query:\n```\nSELECT pg_terminate_backend (<pid>);\n```\nHere, you can obtain the PID from `pg_stat_activity` .\nHere's an example of a query that returns long running queries. In this case, you can identify the queries that have been active for more than 5 minutes.\n```\nSELECT   pid,   query_start,   xact_start,   now() - pg_stat_activity.query_start AS duration,   query,   state FROM   pg_stat_activity WHERE   (    now() - pg_stat_activity.query_start  ) > interval '5 minutes' order by 4 desc;\n```\nUse the EXPLAIN PLAN to investigate a poorly written query and rewrite the query, if necessary. Optionally, consider cancelling the long running query with the following command with necessary approvals.\n```\nSELECT pg_cancel_backend(<pid>);\n```\nThe AUTOVACUUM activity that clears the dead tuples is a CPU-intensive operation. If your instance uses PostgreSQL version 11 or later, use the following query to check if there's any active AUTOVACUUM or VACUUM activity in progress.\n```\nSELECT   relid :: regclass,   pid,   phase,   heap_blks_total,   heap_blks_scanned,   heap_blks_vacuumed,   index_vacuum_count,   max_dead_tuples,   num_dead_tuples FROM   pg_stat_progress_vacuum;\n```\nCheck if there's an ongoing VACUUM activity in an instance using the following query:\n```\nSELECT   pid,   datname,  usename,   query FROM   pg_stat_activity WHERE   query like '%vacuum%';\n```\nAdditonally, you can [optimize and troubleshoot VACUUM operations in PostgreSQL](https://cloud.google.com/solutions/optimizing-monitoring-troubleshooting-vacuum-operations-postgresql) .\nSet up the `pg_stat_statements` extension to get enhanced dictionary information about instance activity.\nFrequent checkpoints degrade performance. Consider adjusting the `checkpoint_timeout` flag if the PostgreSQL alert log reports the `checkpoint occurring too frequently` warning.\nEnsure that the query planner has the latest statistics about tables to choose the best plan for queries. The ANALYZE operation collects statistics about the contents of tables in the database, and stores the results in the pg_statistic system catalog. Subsequently, the query planner uses these statistics to help determine the most efficient execution plans for queries. The AUTOVACUUM process automatically analyzes the tables periodically, so run the following command to check if all the tables have been analyzed and have the latest metadata available to the planner.\n```\nSELECT   relname,   last_autovacuum,   last_autoanalyze FROM   pg_stat_user_tables;\n```\nThere are other factors and flag settings or system factors that influence the performance of your query. Run the following query to check the wait events and wait event type to get the insights about the performance of other system settings.\n```\nSELECT   datname,   usename,   (    case when usename is not null then state else query end  ) AS what,   wait_event_type,   wait_event,   backend_type,   count(*) FROM   pg_stat_activity GROUP BY   1,   2,   3,   4,   5,   6 ORDER BY   1,   2,   3,   4 nulls first,   5,   6;\n```\nThe output looks similar to this:\n```\n   ..  | .. | what           | wait_event_type |      wait_event      | ..    | count-..--+-..-+----------------+-----------------+----------------------+-..----+------ .. ..  | .. | active         | IO              | CommitWaitFlush      | ..    |   750 ..  | .. | idle           | IO              | CommitWaitFlush      | ..    |   360 ..  | .. | active         | LWLock          | BufferMapping        | ..    |   191  \n```\nFrequent sequential scans over tables of more than a few tens of rows usually indicate a missing index. When the scans touch thousands or even hundreds of thousands of rows, it can cause excessive CPU usage.\nFrequent sequential scans on tables with hundreds of thousands of rows can cause excessive CPU usage. Avoid sequential scans on such tables by creating necessary indices.\nRun the following query to check the number of times sequential scans are initiated on any table.\n```\nSELECT   relname,   idx_scan,    seq_scan,   n_live_tup FROM   pg_stat_user_tables WHERE   seq_scan > 0 ORDER BY   n_live_tup desc;\n```\nLastly, if the CPU is still high and you feel those queries are legitimate traffic then consider increasing the CPU resources in your instance to avoid database crash or downtime.", "guide": "Cloud SQL"}