{"title": "Cloud SQL - Cloud SQL for PostgreSQL features", "url": "https://cloud.google.com/sql/docs/postgres/features", "abstract": "# Cloud SQL - Cloud SQL for PostgreSQL features\n[MySQL](/sql/docs/mysql/features)\n[SQL Server](/sql/docs/sqlserver/features)\n**Note:** For information about the supported versions of database engines, see [Database versions and version policies](/sql/docs/postgres/db-versions) .\n", "content": "## PostgreSQL features by Cloud SQL editions\nFor more information about the features for each edition of Cloud SQL for PostgreSQL, see [Introduction to Cloud SQL editions](/sql/docs/postgres/editions-intro) .\n## PostgreSQL feature support for Cloud SQL\n- Fully managed PostgreSQL databases in the cloud.\n- Instances available in the Americas, EU, Asia, and Australia. See [alllocations where you can create Cloud SQLinstances](/sql/docs/postgres/locations) .\n- Supports migration from source databases to Cloud SQL destination databases using [Database Migration Service(DMS)](/database-migration/docs/postgres/configure-source-database) .\n- Customer data encrypted on Google's internal networks and in database tables, temporary files, and backups.\n- Support for secure external connections with the Cloud SQL Auth Proxy or with the SSL/TLS protocol.\n- Data replication between multiple zones with automatic failover.\n- Import and export databases using SQL dump files.\n- Support for PostgreSQL client-server protocol and standard PostgreSQL connectors.\n- Automated backups, on-demand backups, and point-in-time recovery.\n- Instance cloning.\n- Integration with Google Cloud Observability logging and monitoring.\n- Support for multiple [PostgreSQL versions](/sql/docs/postgres/db-versions) .\n- Logical replication## Supported PostgreSQL extensions for Cloud SQL\nCloud SQL supports many PostgreSQL extensions. For a complete list of these extensions, see [Configure PostgreSQLextensions](/sql/docs/postgres/extensions) .\n## Supported PostgreSQL procedural languages for Cloud SQL\nCloud SQL supports the [PL/pgSQL SQL procedurallanguage](https://www.postgresql.org/docs/current/static/plpgsql.html) .\n## Supported languages for Cloud SQL for PostgreSQL\nYou can use Cloud SQL with App Engine applications running in the flexible environment that are written in:\n- C#\n- Go\n- Java\n- Node.js\n- PHP\n- Python\n- Ruby\nYou can also use Cloud SQL with external applications using the standard PostgreSQL client-server protocol.\n## How you can connect to Cloud SQL for PostgreSQL instances\nYou can connect to a Cloud SQL instance from:\n- A`psql`client. [Learn more](/sql/docs/postgres/connect-admin-ip) .\n- Third-party tools that use the standard PostgreSQL client-server protocol.\n- External applications. [Learnmore](/sql/docs/postgres/connect-external-app) .\n- App Engine applications. [Learnmore](/sql/docs/postgres/connect-app-engine) .\n- Applications running on Compute Engine. [Learnmore](/sql/docs/postgres/connect-compute-engine) .\n- Applications running on Google Kubernetes Engine. [Learnmore](/sql/docs/postgres/connect-kubernetes-engine) .\n- Cloud Functions. [Learn more](/sql/docs/postgres/connect-functions) .- Cloud Run. [Learn more](/sql/docs/mysql/connect-run) .Connecting to Cloud SQL with Private Google access isn't supported.\n## Differences between standard PostgreSQL and Cloud SQL for PostgreSQL\nIn general, the PostgreSQL functionality provided by a Cloud SQL instance is the same as the functionality provided by a locally-hosted PostgreSQL instance. However, there are a few differences between a standard PostgreSQL instance and a Cloud SQL instance.\n### Unsupported features for Cloud SQL for PostgreSQL\n- Any features that require `SUPERUSER` privilegesAn exception to this rule is made for the `CREATE EXTENSION` statement, but only for [supported extensions](#extensions) .\n- Custom background workers\n- The `psql` client in Cloud Shell doesn't support operations that require a reconnection, such as connecting to a different database using the `\\c` command.\n- Low-Level Virtual Machine (LLVM) Just-in-Time (JIT) compilation.\n### Notable differences between PostgreSQL and Cloud SQL for PostgreSQL\n- Some PostgreSQL options and parameters aren't enabled for editing as [Cloud SQL flags](/sql/docs/postgres/flags) .To request the addition of a configurable Cloud SQL flag, use the [Cloud SQL Discussiongroup](https://groups.google.com/forum/#!forum/google-cloud-sql-discuss) .", "guide": "Cloud SQL"}