{"title": "Cloud SQL - Data cache overview", "url": "https://cloud.google.com/sql/docs/postgres/data-cache", "abstract": "# Cloud SQL - Data cache overview\n**Note:** This page contains features related to Cloud SQL editions. For more information about Cloud SQL editions, see [Introduction to Cloud SQL editions](/sql/docs/mysql/editions-intro) .\nThis page provides an overview of data cache, our recommendations on choosing workloads on which to enable data cache, and the limitations of using a data cache.\nData cache is an optional feature that stores data pages on high-speed local solid state drives (SSD) to accelerate query processing. Data cache extends the OS page cache to use both the memory and the local SSD.\nYou can enable data cache when you [create an instance](/sql/docs/postgres/create-instance) .\nWhen you enable data cache on your instance, this is how Cloud SQL processes read and write requests:\n- Read request: Cloud SQL prioritizes reading data from the main memory, followed by the data cache, and then the instance's storage. This allows for the read operations to be processed with the lowest possible latency.\n- Write request: Cloud SQL commits the data to the instance's storage and simultaneously writes it to the data cache.", "content": "## Recommendations\nData cache provides performance benefits for certain workload types. We recommend that you enable data cache for the following workload types:\n- Workloads where the working dataset doesn't fit in the main memory.Using a data cache delivers maximum performance benefits when the entire working dataset can't fit in the instance's main memory. In this scenario, Cloud SQL stores the working dataset in the main memory and the data cache. The working dataset is generally smaller than the full dataset.\n- Workloads with more read operations than write operations.Use a data cache for workloads that are predominantly made up of read operations.## Limitations\n- When a data cache becomes full, it removes the stored data based on the least recently used analysis to accommodate subsequent updates to the data cache.\n- If an instance is stopped, then the contents of the data cache are lost. This can lead to reduced performance while the data cache gets repopulated as the instance is restarted.", "guide": "Cloud SQL"}