{"title": "Cloud SQL - Cloud SQL Language Connectors overview", "url": "https://cloud.google.com/sql/docs/postgres/language-connectors", "abstract": "# Cloud SQL - Cloud SQL Language Connectors overview\nThis page summarizes the Cloud SQL Language Connectors and how to use them with your instances.\nCloud SQL Language Connectors are libraries that provide encryption and [IAM](/iam) authorization when connecting to a Cloud SQL instance. Cloud SQL Language Connectors create authorized connections to the proxy-side server on behalf of a user's application and pass that connection to the application's database driver. They don't provide a network path to a Cloud SQL instance if one is not already present.\nCloud SQL Language Connectors use a client-side component to connect to a proxy server on the Cloud SQL instance. The connector creates a temporary certificate that authorizes the holder to connect to the server-side proxy. The server-side proxy limits access to the Cloud SQL database by requiring a valid TLS certificate in order to connect.\nCloud SQL currently supports the following Cloud SQL Language Connectors:\n- [Cloud SQL Java connector](/sql/docs/postgres/connect-connectors#java) \n- [Cloud SQL Python connector](/sql/docs/postgres/connect-connectors#python) \n- [Cloud SQL Go connector](/sql/docs/postgres/connect-connectors#go) \n- [Cloud SQL Node.js connector](/static/sql/docs/postgres/connect-connectors#node.js) \nCloud SQL recommends using Cloud SQL Language Connectors to connect to your Cloud SQL instance. You can also to connect to a Cloud SQL instance include [using a database client](/sql/docs/postgres/connect-admin-ip) or the [Cloud SQL Auth Proxy](/sql/docs/postgres/sql-proxy) . For more information about connecting to a Cloud SQL instance, see [About connection options](/sql/docs/postgres/connect-overview) .\n", "content": "## Benefits of Cloud SQL Language Connectors\nCloud SQL Language Connectors provide the following benefits with connecting to a Cloud SQL instance:\n- **IAM authorization** : Uses identity and access management (IAM) permissions to control who or what can connect to your Cloud SQL instances.\n- **Convenience** : Removes the requirement to manage SSL certificates, configure firewall rules, or enable authorized networks.\n## What's next- [Connect using the Cloud SQL Java Connector](/sql/docs/postgres/connect-connectors#java) .\n- [Connect using the Cloud SQL Python Connector](/sql/docs/postgres/connect-connectors#python) .\n- [Connect using the Cloud SQL Go Connector](/sql/docs/postgres/connect-connectors#go) .\n- [Connect using the Cloud SQL Node.js Connector](/static/sql/docs/postgres/connect-connectors#node.js) .\n- Learn more about the [Cloud SQL Auth Proxy](/sql/docs/postgres/sql-proxy) .", "guide": "Cloud SQL"}