{"title": "Cloud SQL - Private Service Connect overview", "url": "https://cloud.google.com/sql/docs/postgres/about-private-service-connect", "abstract": "# Cloud SQL - Private Service Connect overview\nThis page describes concepts associated with Private Service Connect. You can use Private Service Connect for the following purposes:\n- Connect to a Cloud SQL instance from multiple VPC networks that belong to different groups, teams, projects, or organizations\n- Connect to either a primary instance or any of its read replicas", "content": "## Service attachment\nWhen you [create a Cloud SQL instance](/sql/docs/postgres/create-instance) and configure the instance to use Private Service Connect, Cloud SQL creates a service attachment for the instance automatically. A [service attachment](/vpc/docs/about-vpc-hosted-services#service-attachments) is an attachment point that VPC networks use to access the instance.\nYou create a [Private Service Connect endpoint](#psc-endpoint) that the VPC network uses to connect to the service attachment. This enables the network to access the instance.\nEach Cloud SQL instance has one service attachment to which the Private Service Connect endpoint can connect through the VPC network. If there are multiple networks, then each network has its own endpoint.\n## Private Service Connect endpoint\nA [Private Service Connect endpoint](/vpc/docs/private-service-connect#endpoints) is a forwarding rule that's associated with an internal IP address. As part of creating the endpoint, you specify the service attachment that's associated with the Cloud SQL instance. The network can then access the instance through the endpoint.\nIn addition to specifying the service attachment, you provide an IP address in the VPC network and a service attachment URI. To obtain this URI, use the [Cloud SQL Admin API](/sql/docs/postgres/admin-api) . The network can access the Cloud SQL instance from the IP address that's associated with the endpoint.\n**Note:** To create a Private Service Connect endpoint, you need the [compute.networkAdmin](/iam/docs/understanding-roles#compute.networkAdmin) role. This role grants full control over the VPC network that initiates a connection to a Cloud SQL instance.You must create this endpoint in each VPC network where database access is needed. To access the endpoint from any region in that network, you must [configure global access](/vpc/docs/about-accessing-vpc-hosted-services-endpoints#global-access) for the endpoint.\n## DNS names and records\nFor instances with Private Service Connect enabled, we recommend that you use the DNS name because different networks can connect to the same instance and Private Service Connect endpoints in each network might have different IP addresses. Additionally, the Cloud SQL Auth Proxy requires DNS names to connect to these instances.\nCloud SQL doesn't create [DNS records](/dns/docs/dns-overview#records) automatically. Instead, a suggested DNS name is provided from the instance lookup API response. We recommend that you create the DNS record in a [private DNS zone](/dns/docs/dns-overview#private_zone) in the corresponding VPC network. This provides a consistent way of connecting from different networks.\n## Allowed Private Service Connect projects\nAllowed projects are associated with VPC networks and are specific to each Cloud SQL instance. If an instance isn't contained in any allowed projects, then you can't enable Private Service Connect for the instance.\nFor these projects, you can create Private Service Connect endpoints for each instance. If a project isn't allowed explicitly, then you can still create an endpoint for the instances in the project, but the endpoint remains in a `PENDING` state.\n## What's next\n- Learn more about [private IP](/sql/docs/postgres/private-ip) .\n- Learn more about [connecting to an instance using Private Service Connect](/sql/docs/postgres/configure-private-service-connect) .", "guide": "Cloud SQL"}