{"title": "Cloud SQL - Monitor Cloud SQL instances", "url": "https://cloud.google.com/sql/docs/postgres/monitor-instance", "abstract": "# Cloud SQL - Monitor Cloud SQL instances\nThis page describes how you can monitor Cloud SQL instances in the following ways:\n- [Use the Cloud SQL System insights dashboard.](/sql/docs/postgres/use-system-insights) \n- [Monitor an instance by using the Cloud Monitoring dashboard.](#cloud-monitoring) \n- [View metrics on the Cloud SQL instance Overview page.](#monitoring-overview) \n- [Compare metrics from multiple instances.](#monitoring-multiple) ", "content": "## Use the Cloud SQL System Insights dashboard\n**    Preview     ** This feature is subject to the \"Pre-GA Offerings Terms\" in the General Service Terms section   of the [Service Specific Terms](/terms/service-terms#1) .     Pre-GA features are available \"as is\" and might have limited support.    For more information, see the [launch stage descriptions](/products#product-launch-stages) .\nThe Cloud SQL System insights dashboard helps you detect and analyze system performance problems.\nFor more information, see [Use System insights to improve system performance](/sql/docs/postgres/use-system-insights) .\n## Monitor an instance by using the Cloud Monitoring dashboard\nCloud Monitoring offers predefined dashboards for several Google Cloud products, including a default Cloud SQL [monitoring dashboard](https://console.cloud.google.com/monitoring/dashboards/resourceList/cloudsql_database) . You can use this dashboard to monitor the general health of your primary and replica instances. You can also create your own [custom dashboards](/monitoring/charts/dashboards) to display data that's of interest to you.\n### Set up alerts\nYou can use Cloud Monitoring to [set up alerts](/monitoring/alerts/using-alerting-ui#viewing_policies) for a project or a specified instance.\nFor example, you can set up an alert for a message to be sent to specific email IDs when the **Memory usage** metric for a Cloud SQL instance exceeds the threshold of 80%.\n## View metrics on the Cloud SQL instance Overview page\nView some of the key metrics for a Cloud SQL instance on its Overview page as follows:\n- In the Google Cloud console, go to the **Cloud SQL Instances** page. [Go to Cloud SQL Instances](https://console.cloud.google.com/sql) \n- To open the **Overview** page of an instance, click the instance name.\n- The default metrics chart appears at the top of the page.\n- Optional: Select another metric from the **Chart** drop-down list.The chart shows the data for the selected metric. **Note:** If you select a database-specific metric, then any instances with more than 500 databases report only a single aggregated value.\n### Available metrics\nThe usage charts help you respond proactively as your application needs change. From these metrics, you can gain insights into issues of throughput and latency as well as instance usage costs.\n| Metric       | Description                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                             |\n|:---------------------------------|:-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| Storage usage (GB)    | You can use the storage usage metric to help you understand your storage costs. For more information about storage usage charges, see Storage and Networking Pricing. Point-in-time recovery uses write-ahead logging (WAL) archiving. For new Cloud SQL instances that have point-in-time recovery enabled or for existing instances that enable point-in-time recovery after this feature for storing WAL logs in Cloud Storage is available, logs are no longer stored on disk; instead they're stored in Cloud Storage in the same region as the instances. To see whether an instance's logs are stored in Cloud Storage, check the bytes_used_by_data_type metric for the instance. If the value for the archived_wal_log data type is 0, the instance's logs are stored in Cloud Storage. After you use a PostgreSQL client such as psql or pgAdmin to connect to a database of the instance, run the following command: show archive_command. If any WALs are archived in Cloud Storage, then you see -async_archive -remote_storage. All other existing instances that have point-in-time recovery enabled continue to have their logs stored on disk. The change to storing logs in Cloud Storage is available at a later time. The write-ahead logs used in point-in-time recovery are deleted automatically with their associated automatic backup, which generally happens after the value set for transactionLogRetentionDays is met. This is the number of days of transaction logs that Cloud SQL retains for point-in-time recovery, from 1 to 35 for Cloud SQL Enterprise Plus edition and 1 to 7 for Cloud SQL Enterprise edition. When you restore a backup on a Cloud SQL instance before enabling point-in-time recovery, you lose the WAL logs that allow the operability of point-in-time recovery. For instances that have write-ahead logs stored in Cloud Storage, the logs are stored in the same region as the primary instance. This log storage (up to seven days, the maximum length for point-in-time recovery) generates no additional cost per instance. If your instance has point-in-time recovery enabled, and if the size of your write-ahead logs on disk is causing an issue for your instance, then disable point-in-time recovery and re-enable it to ensure that new logs are stored in Cloud Storage in the same region as the instance. This deletes existing write-ahead logs, so you can't perform a point-in-time-restore earlier than the time that you re-enabled point-in-time recovery. However, although the existing logs are deleted, the disk size remains the same. To avoid unexpected storage issues, we recommend enabling automatic storage increases for all instances when using point-in-time recovery. This recommendation applies only if your instance has point-in-time recovery enabled and your logs are stored on disk. To delete the logs and recover storage, you can disable point-in-time recovery. Note, however, that decreasing the write-ahead logs used doesn't shrink the size of the disk provisioned for the instance. |\n| CPU usage      | You can use this metric to monitor whether your instance has sufficient CPU for your application needs. If this value is running too high, you can increase the size of your machine type to give your instance more CPU capability.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      |\n| Memory usage      | The amount of memory being used by your instance.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    |\n| Read/write operations   | The Number of Reads metric is the number of read operations served from disk that do not come from cache. You can use this metric to help you understand whether your instance is correctly sized for your environment. If needed, you can move to a larger machine type to serve more requests from cache and reduce latency. The Number of Writes metric is the number of write operations to disk. Write activity is generated even if your application is not active, because Cloud SQL instances write to a system table approximately every second (except for replicas).                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   |\n| Ingress/Egress bytes (bytes/sec) | The amount of network traffic coming into or leaving the instance.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                |\n## Compare metrics from multiple instances\n- In the Google Cloud console, go to the **Cloud SQL Instances** page. [Go to Cloud SQL Instances](https://console.cloud.google.com/sql) \n- From the Cloud SQL **Instances** page, choose up to five instances to  compare by selecting the checkbox to the left of the instance name.\n- On the **Info Panel** on the right, select the **Monitoring** tab.\n- From the metrics drop-down, select the metric to use for comparing instances.You can see the data for a specific moment by holding the pointer over the  chart.## What's next\n- [Instance settings](/sql/docs/postgres/instance-settings) \n- [Cloud SQL metrics](/sql/docs/postgres/admin-api/metrics)", "guide": "Cloud SQL"}