{"title": "Cloud SQL - Launch checklist for Cloud SQL", "url": "https://cloud.google.com/sql/docs/launch-checklist", "abstract": "# Cloud SQL - Launch checklist for Cloud SQL\n", "content": "## Introduction\nThis provides recommended activities to complete for launching a commercial application that uses Cloud SQL. This checklist focuses on Cloud SQL-specific activities. To use the platform checklist, [Launch Checklist for Google Cloud](/docs/platform-launch-checklist) , to understand the activities also complete for all services.\nThis is designed for developers who are proficient with Cloud SQL. If you are just starting out with Cloud SQL, these instructions will not teach you how to use Cloud SQL; instead, new users can start with a [Quickstart guide](/sql/docs/mysql/quickstart) .\nThis checklist is broken down into three sections:\n- Architecture Design and Development\n- Alpha Testing\n- Final Launch\nThe sections are presented in the order we recommend that you use them as you prepare to launch your application. For example, start with the ; it contains activities that we recommend you do early in your app's development lifecycle. Similarly, the contains activities we recommend when you are closer to launch. However, the exact timeline of the checklist activities and the time required for them depends on your application development time frame.\n## Architecture Design and Development Checklist\nWe recommend that you use this checklist in the early stages of the development of your application. You can work on the checklist activities in parallel; however, we recommend that you start the software architecture-related activities as early as possible as they require more time to complete.\n| Activity                                                                                                     |\n|:-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| ❑ (for example, no SUPER privilege).                                                                                              |\n| ❑ Ensure that your DevOps team is familiar with the Google Cloud console and the gcloud CLI, including the gcloud CLI. Both tools use the public Cloud SQL API. Either tool may be used to manage (create, edit, delete) instances, update user passwords, trigger a restore, and complete other management tasks. You can also use third-party management tools, because Cloud SQL uses standard wire protocols. |\n| ❑ Consult Cloud SQL community support on Stack Overflow for information and practical advice about Cloud SQL.                                                                           |\n| ❑ Subscribe to the Cloud SQL announce group. Posts are made to this group for service updates and issue and incident reports. The Google Cloud Status Dashboard also provides information about Cloud SQL and other Google Cloud services.                                           |\n## Alpha Testing Checklist\nUse the when you are close to code complete and want to get initial metrics about your application.\n| Activity                                                                                                                                                           |\n|:---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| ❑ Remain current on the drivers that provide data access for your development platform.                                                                                                                                       |\n| ❑ Load-test early, often and realistically. Verify that your application can survive restarts of the Cloud SQL instance during maximum load. If your application is making a lot of connections, make sure the reconnect after a server restart has the right amount of backoff to avoid hitting the cap on the number of pending connections. For more information, see the FAQ Are there any size or QPS limits? Be aware that a big, cold buffer will take quite some time to fill. Whenever possible, optimize queries to avoid the creation of temporary tables because operations involving temporary tables can be especially slow. |\n| ❑ If you are connecting from Compute Engine, make sure the firewall behavior related to idle connections does not harm the application. If necessary, make sure to make the changes to TCP Keepalive persistent across reboots. For more information, see Connecting to Cloud SQL from Compute Engine.                                                                                   |\n| ❑ Observe the connection limits for App Engine apps. Connection pools are the recommended way to achieve this.                                                                                                                                 |\n| ❑ Make sure there is a strategy in place for doing schema changes and the impact of doing them is well understood. We recommend that you create a clone of an instance to test a schema change.                                                                                                             |\n## Final Launch Checklist\nUse the shortly before and during your launch.\n| Activity                                                                        |\n|:-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| ❑ There are no Cloud SQL specific activities for launch. If you have followed this checklist to this point, your project’s Cloud SQL service will be ready for your application’s launch. We recommend that you also review the Final Launch Checklist in the Launch Checklist for Google Cloud. |", "guide": "Cloud SQL"}