{"title": "Cloud SQL - Diagnose issues", "url": "https://cloud.google.com/sql/docs/postgres/diagnose-issues", "abstract": "# Cloud SQL - Diagnose issues\nThis page contains a list of the most frequent issues you might run into when working with Cloud SQL instances and steps you can take to address them. Also review the [Known issues](/sql/docs/postgres/known-issues) , [Troubleshooting](/sql/docs/postgres/troubleshooting) , and [Support page](/sql/docs/postgres/support) pages.\n", "content": "## View logs\nTo see information about recent operations, you can view the [Cloud SQL instance operation logs](/sql/docs/postgres/logging#logs) or the [PostgreSQL error logs](/sql/docs/postgres/logging) .\n## Connection issues\nSee the [Debugging connectionissues](/sql/docs/postgres/debugging-connectivity) page or the [Connectivity](/sql/docs/postgres/troubleshooting#connectivity) section in the troubleshooting page for help with connection problems.\n## Instance issues\n### Backups\nFor the best performance for [backups](/sql/docs/postgres/backup-recovery/backups) , keep the number of tables to a reasonable number.\nFor other backups issues, see the [Backups](/sql/docs/postgres/troubleshooting#backups) section in the troubleshooting page.\n### Import and export\nImports into Cloud SQL and exports out of Cloud SQL can take a long time to complete, depending on the size of the data being processed. This can have the following impacts:\n- You can't stop a long-running Cloud SQL instance operation.\n- You can perform only one import or export operation at a time for each instance, and a long-running  import or export blocks other operations, such as daily automated backups.  Serverless  exports allow you to run other operations, including editing instances, import, failover, and  unblocking daily automated backups.\nYou can decrease the amount of time it takes to complete each operation by using the Cloud SQL import or export functionality with smaller batches of data.\nFor exports, you can perform the export from a [read replica](/sql/docs/postgres/replication/create-replica) or use [serverless export](/sql/docs/postgres/import-export#serverless) to minimize the impact on database performance and allow other operations to run on your instance while an export is running.\n**Note:** Serverless export costs extra. See the [pricing page](/sql/docs/postgres/pricing#export-offload) .\nFor other import and export issues, see the [Import and export](/sql/docs/postgres/troubleshooting#import-export) section in the troubleshooting page.\n### Disk space\n**Storage Used**\n`VACUUM FULL`\n[Learn more](https://www.postgresql.org/docs/current/static/routine-vacuuming.html)### Suspended state\nThere are various reasons why Cloud SQL may suspend an instance, including:\n- Billing issuesFor example, if the credit card for the project's billing account has expired, the instance may be suspended. You can check the billing information for a project by going to the Google Cloud console [billing page](https://console.cloud.google.com/billing) , selecting the project, and viewing the billing account information used for the project. After you resolve the billing issue, the instance returns to runnable status within a few hours.\n- KMS key issuesFor example, if the KMS key version used to encrypt the user data in the Cloud SQL instance is not present, or if it has been disabled or destroyed. See [Using customer-managed encryption keys (CMEK)](/sql/docs/postgres/configure-cmek) .\n- Legal issuesFor example, a violation of the [Google Cloud Acceptable Use Policy](/terms/aup) may cause the instance to be suspended. For more information, see \"Suspensions and Removals\" in the [Google Cloud Terms of Service](/terms) .\n- Operational issuesFor example, if an instance is stuck in a crash loop (it crashes while starting or just after starting), Cloud SQL may suspend it.\nWhile an instance is suspended, you can continue to view information about it or you can delete it, if billing issues triggered the suspension.\nCloud SQL users with Platinum, Gold, or Silver [support packages](/support) can contact our support team directly about suspended instances. All users can use the earlier guidance along with the [google-cloud-sql](http://stackoverflow.com/questions/tagged/google-cloud-sql) forum.\n## Performance\n### Overview\nCloud SQL supports performance-intensive workloads with up to 60,000 IOPS and no extra cost for I/O. IOPS and throughput performance depends on disk size, instance vCPU count, and I/O block size, among other factors.\nYour instance's performance also depends on your [choice of storage type](/sql/docs/postgres/choosing-ssd-hdd) and workload.\nLearn more about:\n- [Persistent disks and performance](/compute/docs/disks/performance#size_price_performance) .\n- [Performance and throttling metrics](/compute/docs/disks/performance#review_performance_and_throttling_metrics) .\n- [Optimizing disk performance](/compute/docs/disks/performance#optimize_disk_performance) .\n- [Other factors that affect performance](https://cloud.google.com/compute/docs/disks/optimizing-pd-performance#performance_factors) .### Keep a reasonable number of database tables\nDatabase tables consume system resources. A large number can affect instance performance and availability, and cause the instance to lose its SLA coverage. [Learn more](/sql/docs/postgres/operational-guidelines) .\n### Enable query logs\nYou can log slow queries for Cloud SQL for PostgreSQL by setting [log_min_duration_statement](https://cloud.google.com/sql/docs/postgres/flags#list-flags-postgres) flag. The queries that ran for at least the specified amount of time will be logged. If this value is specified without units, it is taken as milliseconds. Navigate to Operations Logging to view the logs.\n### General performance tips\nImprove query performance by using [Query Insights](/sql/docs/postgres/using-query-insights) .\nFor slow database selects, consider the following:\n- Caching is important for read performance. Check the various`blks_hit / (blks_hit + blks_read)`ratios from the [PostgreSQL Statistics Collector](https://www.postgresql.org/docs/current/static/monitoring-stats.html) . Ideally, the ratio is above 99%. If not, consider increasing the size of your instance's RAM.\n- If your workload consists of CPU intensive queries (sorting, regular expressions, other complex functions), your instance might be throttled; add vCPUs.\n- Check the location of the reader and database - latency affects read performance even more than write performance.\n- Investigate non-Cloud SQL specific performance improvements, such as adding appropriate indexing, reducing data scanned, and avoiding extra round trips.[EXPLAIN](https://www.postgresql.org/docs/current/static/sql-explain.html)\n## Troubleshoot\nFor other Cloud SQL issues, see the [troubleshooting](/sql/docs/postgres/troubleshooting) page.\n## Error messages\nFor specific API error messages, see the [Error messages](/sql/docs/error-messages) reference page.\n## Troubleshoot customer-managed encryption keys (CMEK)\nCloud SQL administrator operations, such as create, clone, or update, might fail due to Cloud KMS errors, and missing roles or permissions. Common reasons for failure include a missing Cloud KMS key version, a disabled or destroyed Cloud KMS key version, insufficient IAM permissions to access the Cloud KMS key version, or the Cloud KMS key version is in a different region than the Cloud SQL instance. Use the following troubleshooting table to diagnose and resolve common problems.\n| For this error...              | The issue might be...                                           | Try this...                                                      |\n|:----------------------------------------------------------------------|:----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|:----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| Per-product, per-project service account not found     | The service account name is incorrect.                                      | Make sure you created a service account for the correct user project. GO TO THE SERVICE ACCOUNTS PAGE.                               |\n| Cannot grant access to the service account       | The user account does not have permission to grant access to this key version.                            | Add the Organization Administrator role on your user or service account. GO TO THE IAM ACCOUNTS PAGE                                |\n| Cloud KMS key version is destroyed         | The key version is destroyed.                                         | If the key version is destroyed, you cannot use it to encrypt or decrypt data.                                     |\n| Cloud KMS key version is disabled          | The key version is disabled.                                         | Re-enable the Cloud KMS key version. GO TO THE CRYPTO KEYS PAGE                                         |\n| Insufficient permission to use the Cloud KMS key      | The cloudkms.cryptoKeyEncrypterDecrypter role is missing on the user or service account you are using to run operations on Cloud SQL instances, or the Cloud KMS key version doesn't exist. | Add the cloudkms.cryptoKeyEncrypterDecrypter role on your user or service account. GO TO THE IAM ACCOUNTS PAGE If the role is already on your account, see Creating a key to learn how to create a new key version. See note. |\n| Cloud KMS key is not found           | The key version does not exist.                                        | Create a new key version. See Creating a key. See note.                                           |\n| Cloud SQL instance and Cloud KMS key version are in different regions | The Cloud KMS key version and Cloud SQL instance must be in the same region. It does not work if the Cloud KMS key version is in a global region or multi-region.       | Create a key version in the same region where you want to create instances. See Creating a key. See note.                              |\n**Note: ** If the instance is in a failed state during the`create`operation, you must delete it, add the role to the account you are using, and create a new instance with an active Cloud KMS key version.\n| For this error...                                       | The issue might be...             | Try this...                              |\n|:-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------|:----------------------------------------------------------------------|:--------------------------------------------------------------------------------------------------------------------------------|\n| CMEK resource re-encryption failed because the Cloud KMS key is inaccessible. Please ensure that the primary key version is enabled and the permission is granted properly. | The key version isn't enabled or doesn't have the proper permissions. | Re-enable the Cloud KMS key version: GO TO THE CRYPTO KEYS PAGE Confirm it has proper permissions: GO TO THE IAM ACCOUNTS PAGE |\n| CMEK resource re-encryption failed due to server internal error. Please retry later                       | There is a server internal error.          | Retry re-encryption. For more information, see Re-encrypt an existing CMEK-enabled instance or replica       |", "guide": "Cloud SQL"}