{"title": "Cloud SQL - Cloud SQL 數據庫災難恢復", "url": "https://cloud.google.com/sql/docs/postgres/intro-to-cloud-sql-disaster-recovery?hl=zh-cn", "abstract": "# Cloud SQL - Cloud SQL 數據庫災難恢復\n本頁面介紹 Cloud SQL 中的災難恢復。\n", "content": "## 概覽\n在 Google Cloud 中，數據庫災難恢復 (DR) 的目的是讓處理過程不中斷，尤其是當某個區域出現故障或無法訪問時。 [Cloud SQL](https://cloud.google.com/sql/docs/features?hl=zh-cn) 是一項區域性服務（當 [Cloud SQL 配置爲實現高可用性](https://cloud.google.com/sql/docs/postgres/high-availability?hl=zh-cn) 時）。因此，當託管 Cloud SQL 數據庫的 Google Cloud 區域不可用時，Cloud SQL 數據庫也會不可用。\n如需繼續處理，您必須儘快在輔助區域中提供該數據庫。災難恢復方案要求您在 Cloud SQL 中配置跨區域讀取副本。您也可以根據導出/導入執行故障切換，但這種方法需要花費更長時間，尤其是對於大型數據庫而言。\n以下業務場景是保證跨區域故障切換配置的示例：\n- 業務應用的服務等級協議高於區域 [Cloud SQL 服務等級協議](https://cloud.google.com/sql/sla?hl=zh-cn) （可用性爲 99.95%）。通過故障切換切換到另一個區域，您可以緩解中斷所造成的影響。\n- 業務應用的所有層級已經屬於多區域，其可在區域發生服務中斷時繼續處理。跨區域故障切換配置可確保數據庫的使用不受中斷。\n- 所需的恢復時間目標 (RTO) 和恢復點目標 (RPO) 都以分鐘爲單位，而不是以小時爲單位。與重新創建數據庫相比，通過故障切換切換到另一個區域的速度更快。\n一般來說，災難恢復過程包含兩種變化形式：\n- 數據庫通過故障切換切換到輔助區域。數據庫準備就緒並供應用使用後，它將作爲新的主數據庫並持續作爲主數據庫。\n- 數據庫通過故障切換切換到輔助區域，但在主區域從故障中恢復後，將回到主區域。\n此 Google Cloud SQL 數據庫災難恢復概覽介紹了第二個變體：發生故障的數據庫恢復並回退到主要區域。對於因爲網絡延遲或者因爲某些資源僅在主要區域中可用而必須在主要區域運行的數據庫，這種災難恢復變體尤爲有用。使用此變體時，數據庫只會在主要區域服務中斷期間在輔助區域運行。\n## 災難恢復架構\n下圖顯示了支持高可用性 Cloud SQL 實例進行數據庫災難恢復的最小架構：\n該架構的工作原理如下：\n- Cloud SQL 的兩個實例（主實例和備用實例）位於單個區域（主要區域）內的兩個不同地區中。系統將使用區域永久性磁盤同步實例。\n- 一個 Cloud SQL 實例（跨區域只讀副本）位於另一個區域（輔助區域）。對於災難恢復，設置跨區域只讀副本以使用只讀副本設置與主實例同步（使用異步複製）。\n主實例和備用實例共享同一區域磁盤，因此它們的狀態相同。\n由於此類設置使用異步複製，因此跨區域只讀副本可能會滯後於主實例。發生故障切換時，跨區域只讀副本可能支持 RPO 等於零。\n## 基本災難恢復過程概覽\n當主要區域不可用，且主實例無法通過故障切換切換到輔助區域繼續進行處理時，便會啓動基本災難恢復過程。災難恢復過程會設置必須手動或自動執行的操作步驟，從而減少區域性故障並在輔助區域中建立正在運行的主實例。\n下圖展示了此災難恢復過程：\n災難恢復過程包括以下步驟：\n- 運行主實例的主要區域 (R1) 不可用。\n- 運營團隊識別並正式確認災難，並確定是否需要故障切換。\n- 如果需要執行故障切換，則將輔助區域 (R2) 中的跨區域只讀副本用作新的主實例。\n- 客戶端連接已重新配置爲繼續處理新的主實例，並訪問 R2 中的主實例。\n此基本過程會再次建立一個正常運行的主數據庫。但是，它不會建立完整的災難恢復架構，其中新的主實例本身具有一個備用實例和一個跨區域只讀副本。\n## 完整災難恢復過程概覽\n完整的災難恢復過程可確保爲 HA 啓用單個實例（即新的主實例），並確保該實例具有跨區域只讀副本。完整的 DR 過程還會提供回退到原始主區域中的原始部署的機制。\n### 通過故障切換切換到輔助區域\n完整災難恢復過程在基本災難恢復過程的基礎上進行了擴展，它在故障切換之後增加了建立完整災難恢復架構的步驟。下圖展示了故障切換之後的完整數據庫災難恢復架構：\n完整數據庫災難恢復過程包括以下步驟：\n- 運行主數據庫的主要區域 (R1) 不可用。\n- 運營團隊識別並正式確認災難，並確定是否需要故障切換。\n- 如果需要故障切換，您可以 [將輔助區域 (R2) 中的跨區域讀取副本提升爲新的主實例](https://cloud.google.com/sql/docs/postgres/replication/cross-region-replicas?hl=zh-cn#promote-a-replica) 。\n- 客戶端連接已重新配置爲訪問並處理新的主實例 (R2)。\n- 系統會在 R2 中創建並啓動一個新的備用實例並將其添加到主實例中。備用實例與主實例位於不同的可用區。主實例現在具有高可用性，因爲已爲它創建備用實例。\n- 在第三個區域 (R3) 中，系統會創建一個新的跨區域只讀副本並將其附加到主實例。此時，完整災難恢復架構將被重新創建且正常運行。\n如果原始主要區域 (R1) 在實現第 6 步之前可用，則跨區域只讀副本可以放在區域 R1 中，而不是立即放在區域 R3 中。在此情況下，回退到原始主要區域 (R1) 的步驟不太複雜，所需步驟較少。\n### 避免出現腦裂狀態\n主要區域 (R1) 故障並不意味着原始主實例及其備用實例會自動關停、移除或在 R1 再次可用時無法訪問。如果 R1 可用，客戶端可能會在原始主實例上讀取和寫入數據（甚至意外讀取和寫入數據）。在這種情況下， [腦裂情況](https://wikipedia.org/wiki/Split-brain_(computing)) 可能會出現，即有些客戶端訪問舊主數據庫中的過時數據，而有些客戶端訪問新的主數據庫中的最新數據，從而導致業務出現問題。\n爲避免出現腦裂情況，在 R1 可用後，您必須確保客戶端無法再訪問原始主實例。理想情況下，您應先使原始主實例無法訪問，再開始使用新的主實例，然後刪除無法訪問的原始主實例。\n### 在故障切換後建立初始備份\n在故障切換中，當您將跨區域讀取副本提升爲新的主實例時，新主實例中的事務可能不會完全與原始主實例中的事務同步。因此，這些事務在新實例中不可用。\n根據最佳做法，我們建議您在故障切換開始時以及在客戶訪問數據庫之前立即備份新的主實例。此類備份表示在進行故障切換時處於一致的已知狀態。如果客戶在訪問新的主實例時遇到問題，則此類備份對於監管目的或恢復爲已知狀態而言可能很重要。\n### 回退到原始的主要區域\n如前所述，本教程提供回退到原始區域 (R1) 的步驟。回退過程有兩個不同版本。\n- 如果您在第三區域 (R3) 中創建了新的跨區域只讀副本，則必須在主要區域 (R1) 中創建另一個（第二個）跨區域只讀副本。\n- 如果您在主要區域 (R1) 中創建了新的跨區域只讀副本，則無需在 R1 中另外創建一個跨區域只讀副本。\n當 R1 中存在跨區域只讀副本後，Cloud SQL 實例便可以回退到 R1。由於此回退操作是手動觸發而不是根據服務中斷觸發的，因此您可以爲此維護活動選擇合適的日期和時間。\n因此，爲實現具有主實例和備用實例以及跨區域只讀副本的完整災難恢復，您需要執行兩次故障切換。第一次故障切換由服務中斷觸發（真正的故障切換），第二次故障切換會重新建立啓動部署（回退或切換）。\n## 後續步驟\n- 探索有關 Google Cloud 的參考架構、圖表、教程和最佳實踐。查看我們的 [雲架構中心](https://cloud.google.com/architecture?hl=zh-cn) 。", "guide": "Cloud SQL"}