{"title": "Cloud SQL - Configure PostgreSQL extensions", "url": "https://cloud.google.com/sql/docs/postgres/extensions", "abstract": "# Cloud SQL - Configure PostgreSQL extensions\nYou can extend PostgreSQL by bundling SQL objects into a package and using them as a unit. This page contains information about configuring the PostgreSQL extensions that Cloud SQL supports.\n", "content": "## Use PostgreSQL extensions\nYou can install only the extensions that are supported by Cloud SQL. For more information, see [PostgreSQL extensions supported by Cloud SQL](#postgresql-extensions-supported-by-cloud-sql) .\n**Note:** You can only install extensions on the primary instance, not the read replica. Once installed, the extension replicates to the read replica.\n### Install an extension\nBefore using an extension, install it:\n- In the psql tool, run the [CREATE EXTENSION](https://www.postgresql.org/docs/current/static/sql-createextension.html) command.\n**Note:** You must set flags before creating some extensions, such as `pglogical` . For more information, see [Configure external replicas](/sql/docs/postgres/replication/configure-external-replica) .\n### Requirement for superuser privileges\nIn Cloud SQL, extensions can only be created by users that are part of the `cloudsqlsuperuser` role. When you create a new PostgreSQL instance, the default `postgres` user is created for you (although you must set the user's password). The default `postgres` user is part of the `cloudsqlsuperuser` role. For more information, see [About PostgreSQL users](/sql/docs/postgres/users) .\n**Note:** If you import a database containing an extension that was created by a custom user, you can't delete that user without deleting the entire imported database.\n### Inter-database connections\nThe target instances for connections must be in the same VPC network as the connecting instance.\nFor cluster instances, you can't choose the **Require trusted client certificates** option in the Google Cloud console. Additionally, to connect to databases within the same instance, you cannot set host to localhost or to `127.0.0.1` . Instead, you must use the IP address shown for your instance in the Google Cloud console.\n### Request support for a new extension\nYou cannot create your own extensions in Cloud SQL.\nTo request support for an extension, click **+1** on the open issue or create a new issue. For a list of open Cloud SQL issues and information about creating new issues, see [Search for or create issues and feature requests, by product](/support/docs/issue-trackers#trackers-list) .\n## PostgreSQL extensions supported by Cloud SQL\nFor information about using a specific extension, see the documentation link in one of the tables below.\nCloud SQL support for PostgreSQL extensions can be divided into these categories:\n- [PostGIS extensions](#postgis) \n- [Data type extensions](#data-type-extensions) \n- [Language extensions](#language-extensions) \n- [Miscellaneous extensions](#miscellaneous-extensions) \n### PostGIS\nThe [PostGIS 3.0 extension](https://postgis.net/docs/manual-3.0/) is supported for Cloud SQL for PostgreSQL for all major versions.\nThe following table contains the PostGIS extension versions for each Cloud SQL for PostgreSQL version:\n| 0        | 1     |\n|:---------------------------------|:------------------|\n| Cloud SQL for PostgreSQL version | PostGIS extension |\n| PostgreSQL 9.6     | 3.2.5    |\n| PostgreSQL 10     | 3.2.5    |\n| PostgreSQL 11     | 3.2.5    |\n| PostgreSQL 12     | 3.2.5    |\n| PostgreSQL 13     | 3.2.5    |\n| PostgreSQL 14     | 3.2.5    |\n| PostgreSQL 15     | 3.2.5    |\nFor a specific PostgreSQL major version, in the [CREATE EXTENSION](https://www.postgresql.org/docs/current/static/sql-createextension.html) command, you can specify a PostGIS extension version by using the `VERSION` clause.\nThe PostGIS extension includes the following:\n- [postgis](http://www.postgis.net/) \n- [postgis_raster](https://postgis.net/docs/RT_reference.html) \n- [postgis_sfcgal](http://www.sfcgal.org/) \n- [postgis_tiger_geocoder](http://postgis.net/docs/Geocode.html) \n- [postgis_topology](http://postgis.net/docs/manual-dev/Topology.html) \n- [address_standardizer](https://postgis.net/docs/manual-dev/Extras.html) \n- [address_standardizer_data_us](https://postgis.net/docs/manual-dev/Extras.html) \nFor more information, see [PostGIS Installation](http://postgis.net/docs/manual-2.3/postgis_installation.html) .\nAdditionally, Cloud SQL for PostgreSQL includes version 3.3.0 of the [pgRouting](https://github.com/pgRouting) extension, which extends PostGIS. The pgRouting extension enhances geospatial processing through network routing and analysis.\nYou can manually upgrade PostGIS and its related extensions to their latest version. To learn more about upgrading your PostGIS extensions, see [Upgrading PostGIS](https://postgis.net/workshops/postgis-intro/upgrades.html#upgrading-postgis) .\n### Data type extensions\n| 0    | 1                                                                       |\n|:---------------|:---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| Extension  | Description                                                                     |\n| btree_gin  | Provides sample GIN operator classes that implement B-tree equivalent behavior. Cloud SQL for PostgreSQL 9.6 uses version 1.0. PostgreSQL 10 uses version 1.2. All other versions use version 1.3.                      |\n| btree_gist  | Provides GiST index operator classes that implement B-tree equivalent behavior. Cloud SQL for PostgreSQL 9.6 uses version 1.2. PostgreSQL 10, 11, 12, and 13 use version 1.5. PostgreSQL 14 uses version 1.6.                    |\n| chkpass  | Implements a data type chkpass that is designed for storing encrypted passwords. Cloud SQL for PostgreSQL 9.6 and 10 use version 1.0. Not supported for other versions.                              |\n| citext   | Provides a case-insensitive character string type citext. Cloud SQL for PostgreSQL 9.6 uses version 1.3. PostgreSQL 10 uses version 1.4. PostgreSQL 11 uses version 1.5. PostgreSQL 12, 13, and 14 use version 1.6.                  |\n| cube   | Implements a data type cube for representing multidimensional cubes. Cloud SQL for PostgreSQL 9.6 and 10 use version 1.2. PostgreSQL 11 uses version 1.3. PostgreSQL 12 and 13 use version 1.4. PostgreSQL 14 uses version 1.5.               |\n| hstore   | Implements the hstore data type for storing sets of key/value pairs within a single PostgreSQL value. Cloud SQL for PostgreSQL 9.6 and 10 use version 1.4. PostgreSQL 11 uses version 1.5. PostgreSQL 12 uses version 1.6. PostgreSQL 13 uses version 1.7. PostgreSQL 14 uses version 1.8. |\n| isn   | Provides data types for some international product numbering standards. Cloud SQL for PostgreSQL 9.6 and 10 use version 1.1. All other versions use version 1.2.                                |\n| ip4r   | Provides data types for IPv4/v6 addresses, and address ranges, plus index support. Cloud SQL for PostgreSQL uses version 2.4.                                        |\n| ltree   | Implements a data type ltree for representing labels of data stored in a hierarchical tree-like structure. Cloud SQL for PostgreSQL 9.6, 10, 11, and 12 use version 1.1. PostgreSQL 13 and 14 use version 1.2.                    |\n| lo    | Support for managing Large Objects (also called LOs or BLOBs). Cloud SQL for PostgreSQL uses version 1.1.                                             |\n| postgresql-hll | Introduces a new data type, hll, which is a HyperLogLog data structure. Also see postgresql-hll in this document. Cloud SQL for PostgreSQL uses version 2.16.                                |\n| prefix   | Provides prefix-matching, plus index support. Cloud SQL for PostgreSQL uses version 1.2.0.                                                 |\n### Language extensions\n| 0   | 1                                                  |\n|:----------|:--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| Extension | Description                                                |\n| plpgsql | A loadable procedural language for creating functions, procedures and triggers. You also can use this language for direct execution of code in DO blocks. Cloud SQL for PostgreSQL uses version 1.0. |\n| plv8  | Provides a procedural language for enabling JavaScript. Cloud SQL for PostgreSQL uses version 3.1.2, which in turn uses V8 JavaScript engine version 9.9.            |\n### Miscellaneous extensions\n| 0      | 1                                                                                                                                                                         |\n|:----------------------|:---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| Extension    | Description                                                                                                                                                                      |\n| amcheck    | Provides functions for verifying the logical consistency of the structure of relations, enabling the pg_amcheck application to check for corruption.                                                                                                                                    |\n| auto_explain   | Enables automatic logging of execution plans of slow statements, for troubleshooting and more. Provides an automated way to perform the functionality of the EXPLAIN command. Also see auto_explain in this document.                                                                                                                   |\n| dblink    | Provides functions to connect to PostgreSQL databases from within a database session. Also see dblink in this document. Cloud SQL for PostgreSQL uses version 1.2. Note: If you're using Private Service Connect to connect to a Cloud SQL instance, then this extension can't be used with your instance.                                                                                              |\n| decoderbufs   | A PostgreSQL logical decoder that delivers output data as Protocol Buffers, adapted for Debezium.                                                                                                                                                 |\n| dict_int    | An add-on dictionary template for full-text search that controls the indexing of integers. Cloud SQL for PostgreSQL uses version 1.0.                                                                                                                                       |\n| earthdistance   | Provides two approaches to calculating great circle distances on the surface of the Earth. Cloud SQL for PostgreSQL uses version 1.1.                                                                                                                                       |\n| fuzzystrmatch   | Provides several functions to determine similarities and distance between strings. Cloud SQL for PostgreSQL uses version 1.1.                                                                                                                                         |\n| intagg    | Provides an integer aggregator and an enumerator. Cloud SQL for PostgreSQL uses version 1.1.                                                                                                                                                  |\n| intarray    | Provides a set of functions and operators for manipulating null-free arrays of integers and performing indexed searches on them. Cloud SQL for PostgreSQL 9.6, 10, 11, and 12 use version 1.2. PostgreSQL 13 uses version 1.3. PostgreSQL 14 uses version 1.5.                                                                                                         |\n| oracle_fdw   | Provides a foreign data wrapper (fdw) for accessing Oracle databases easily and efficiently. Cloud SQL for PostgreSQL uses version 1.2.                                                                                                                                       |\n| orafce    | Provides functions and operators that emulate a subset of functions and packages from an Oracle database. Use these functions to port Oracle applications to PostgreSQL. Cloud SQL for PostgreSQL uses version 3.25.1.                                                                                                                   |\n| pageinspect   | Inspects the contents of database pages at a low level. Also see pageinspect in this document. Cloud SQL for PostgreSQL 9.6 uses version 1.5. PostgreSQL 10 uses version 1.6. PostgreSQL 11 and 12 use version 1.7. PostgreSQL 13 and 14 use version 1.8.                                                                                                          |\n| pgAudit    | Collects audit data. Cloud SQL for PostgreSQL 9.6 uses pgAudit, version 1.1.4. Cloud SQL for PostgreSQL 10 uses pgAudit, version 1.2.3. Cloud SQL for PostgreSQL 11 uses pgAudit, version 1.3.3. Cloud SQL for PostgreSQL 12 uses pgAudit, version 1.4.2. Cloud SQL for PostgreSQL 13 uses pgAudit, version 1.5.1. Cloud SQL for PostgreSQL 14 uses pgAudit, version 1.6.1. Possible values to set for the audit log files for all versions of pgAudit are READ, WRITE, FUNCTION, ROLE, DDL, MISC, and ALL. For versions 1.4.2 through 1.6.1, you can also set the value of MISC_SET. For more information about using this extension with Cloud SQL, see Audit for PostgreSQL using pgAudit. |\n| pg_bigm    | Enables full-text search, and allows a two-gram (bigram) index for faster full-text search. Also see pg_bigm in this document.                                                                                                                                         |\n| pg_buffercache  | Provides a means for examining what's happening in the shared buffer cache in real time. Cloud SQL for PostgreSQL 9.6 uses version 1.2. PostgreSQL 10, 11, 12, 13, and 14 use version 1.3.                                                                                                                          |\n| pg_cron    | Provides a cron-based job scheduler. This extension enables cron syntax to schedule PostgreSQL commands directly from the database. For more information about the extension, see pg_cron in this document. Cloud SQL for PostgreSQL uses version 10 (or higher).                                                                                                        |\n| pgcrypto    | Provides cryptographic functions for PostgreSQL. Cloud SQL for PostgreSQL uses version 1.3.                                                                                                                                                  |\n| pglogical    | Provides logical replication for PostgreSQL. See Setting up logical replication and decoding. Cloud SQL for PostgreSQL uses version 2.4.3. Note: If you're using Private Service Connect to connect to a Cloud SQL instance, then this extension can't be used with your instance.                                                                                                    |\n| pgfincore    | A set of functions to manage pages in operating system disk cache memory from PostgreSQL. Also see pgfincore in this document. Cloud SQL for PostgreSQL uses version 1.2.                                                                                                                              |\n| pg_freespacemap  | Examines the free space map (FSM). Also see pg_freespacemap in this document. Cloud SQL for PostgreSQL uses version 1.2.                                                                                                                                           |\n| pg_hint_plan   | Enables you to improve PostgreSQL execution plans using hints, which are simple descriptions in SQL comments. Also see pg_hint_plan in this document.                                                                                                                                   |\n| pgoutput    | This plugin is used by logical replication for change data capture. pgoutput is a default plugin and is therefore supported on all versions of Cloud SQL for PostgreSQL.                                                                                                                               |\n| pg_partman   | Enables you to create and manage time-based and serial-based table partition sets. Also see pg_partman in this document. Cloud SQL for PostgreSQL uses version 4.5.1.                                                                                                                               |\n| pg_prewarm   | Provides a convenient way to load relation data into either the operating system buffer cache or the PostgreSQL buffer cache. Cloud SQL for PostgreSQL 9.6 and 10 use version 1.1. PostgreSQL 11, 12, 13, and 14 use version 1.2.                                                                                                                |\n| pg_proctab   | Enables you to use pg_top with Cloud SQL for PostgreSQL, and generate reports from the operating system process table. Also see pg_proctab in this document.                                                                                                                                 |\n| pg_repack    | Lets you remove bloat from tables and indexes. Optionally, lets you perform an online CLUSTER (order tables by cluster index). Also see pg_repack in this document. Cloud SQL for PostgreSQL uses version 1.4.8.                                                                                                                    |\n| pgrowlocks   | Provides row locking information for the specified table. Cloud SQL for PostgreSQL uses version 1.2.                                                                                                                                                |\n| pgstattuple   | Provides various functions to obtain tuple-level statistics. Cloud SQL for PostgreSQL 9.6 uses version 1.4. All other versions use version 1.5.                                                                                                                                     |\n| nan     | nan                                                                                                                                                                        |\n| pg_similarity   | Provides support for similarity queries on PostgreSQL. Cloud SQL for PostgreSQL uses version 1.0.                                                                                                                                                 |\n| pg_stat_statements | Provides a means for tracking execution statistics of all SQL statements executed. Cloud SQL for PostgreSQL 9.6 uses version 1.4. PostgreSQL 10 and 11 use version 1.6. PostgreSQL 12 uses 1.7. PostgreSQL 13 uses 1.8. PostgreSQL 14 uses 1.9.                                                                                                             |\n| pgTAP     | Provides a unit testing framework for PostgreSQL, written in PL/pgSQL and PL/SQL. Cloud SQL for PostgreSQL uses version 1.1.0.                                                                                                                                         |\n| pg_trgm    | Provides functions and operators for determining the similarity of alphanumeric text based on trigram matching, as well as index operator classes that support fast searching for similar strings. Cloud SQL for PostgreSQL 9.6 and 10 use version 1.3. PostgreSQL 11 and 12 use version 1.4. PostgreSQL 13 uses 1.5. PostgreSQL 14 uses version 1.6.                                                                                   |\n| pgtt     | Creates and manages DB2 or Oracle-style global temporary tables in a PostgreSQL database. Cloud SQL for PostgreSQL uses version 2.9.0.                                                                                                                                       |\n| pgvector    | An open source extension for storing and searching vector embeddings in PostgreSQL databases. Cloud SQL for PostgreSQL uses version 0.5.1.                                                                                                                                      |\n| nan     | nan                                                                                                                                                                        |\n| pg_visibility   | Provides a way to examine the visibility map (VM) and the page-level visibility information of a table. Also see pg_visibility in this document. Cloud SQL for PostgreSQL uses version 1.2.                                                                                                                          |\n| pg_wait_sampling  | Collects sampling statistics of wait events, providing wait event data for processes on servers. Cloud SQL for PostgreSQL uses version 1.1.                                                                                                                                      |\n| PL/Proxy    | Procedural language handler that allows remote procedure calls among PostgreSQL databases, with optional sharding. Also see PL/Proxy in this document. Cloud SQL for PostgreSQL uses version 2.10.0. Note: If you're using Private Service Connect to connect to a Cloud SQL instance, then this extension can't be used with your instance.                                                                                     |\n| postgres_fdw   | Allows foreign data wrappers to be created within instances or across instances. Also see postgres_fdw in this document. Cloud SQL for PostgreSQL 9.6, 10, 11, 12, and 13 use version 1.0. PostgreSQL 14 uses version 1.1. Note: If you're using Private Service Connect to connect to a Cloud SQL instance, then this extension can't be used with your instance.                                                                                |\n| postgresql_anonymizer | Masks or replaces personally identifiable information (PII) or sensitive data from a PostgreSQL database. For more information, see the postgresql_anonymizer section. Cloud SQL for PostgreSQL uses version 1.0.0.                                                                                                                    |\n| rdkit     | A collection of cheminformatics and machine-learning software. You can use this extension for comparing, manipulating, and identifying molecular structures. Cloud SQL for PostgreSQL uses version 4.2.0.                                                                                                                      |\n| refint    | Includes functions to check foreign key restraints, the referencing table, and the referenced table. This extension also demonstrates the Server Programming Interface (SPI). Cloud SQL for PostgreSQL uses version 1.0.                                                                                                                   |\n| sslinfo    | Provides information about the SSL certificate that the current client provided when it connected to the instance. Cloud SQL for PostgreSQL uses version 1.2.                                                                                                                                  |\n| tablefunc    | Includes various functions that return tables (multiple rows). Cloud SQL for PostgreSQL uses version 1.0.                                                                                                                                               |\n| tsm_system_rows  | Provides the table sampling method SYSTEM_ROWS, which can be used in the TABLESAMPLE clause of a SELECT command. Cloud SQL for PostgreSQL uses version 1.0.                                                                                                                                  |\n| tsm_system_time  | Provides the table sampling method SYSTEM_TIME, which can be used in the TABLESAMPLE clause of a SELECT command. Cloud SQL for PostgreSQL uses version 1.0.                                                                                                                                  |\n| unaccent    | A text search dictionary that removes accents (diacritic signs) from lexemes. Cloud SQL for PostgreSQL uses version 1.1.                                                                                                                                           |\n| uuid-ossp    | Provides functions to generate universally unique identifiers (UUIDs) using one of several standard algorithms. Cloud SQL for PostgreSQL uses version 1.1.                                                                                                                                  |\n## More about some PostgreSQL extensions\nThis section describes more information about some of the supported PostgreSQL extensions in the tables above.\n### auto_explain\nTo begin using this extension on an instance, set the `cloudsql.enable_auto_explain` flag to `on` . For information about setting flags, and to review the flags supported for this extension, see [Configure database flags](/sql/docs/postgres/flags) .\nAlternatively, for a user that has the `cloudsqlsuperuser` role (only), you can use the `load` command to load this extension for one session.\n### dblink\nFrom within a database session, you can use this extension to connect to PostgreSQL databases and execute queries.\nCurrently, this extension works for two Cloud SQL private IP instances within the same VPC network, or for cross databases within the same instance.\n**Note:** In Cloud SQL, the use of client certificates with dblink isn't supported.\nFor additional information, see [dblink](https://www.postgresql.org/docs/current/dblink.html) in the PostgreSQL documentation.\nTo connect to databases, or to connect to the same instance as another user, you must specify a password. For example purposes (but not for production purposes), here is a code snippet:\n```\n  SELECT * FROM dblink (    'dbname=name port=1234 host=host user=user password=password',    'select id, name from table' \\  ) AS t(id int, name text);\n```\nAlternatively, to only set up a connection, here is a code snippet for example purposes (not for production purposes):\n```\n  SELECT dblink_connect('dbname=dblinktest user=postgres host=name_or_ip password=xxx');\n```\nTo connect to the same instance as the same user, you can connect without a password. For example:\n- Set the following database flag to enable local connections without a password `cloudsql.allow_passwordless_local_connections`\n- Connect without specifying a host, which implies connecting to the same instance. Here is an example:```\nSELECT *  FROM dblink('dbname=finance user=alice',              'select income from revenue')    AS revenue(income integer);\n```The result could be similar to the following:```\n      income      --------      1000      (1 row)\n```\nTo connect to databases within the same instance, you cannot set host to localhost or to `127.0.0.1` . Instead, you must use the IP address shown for your instance in the Google Cloud console.\nAlso see [postgres_fdw](#postgres_fdw) and [PL/Proxy](#pl-proxy) in this document.\n### pageinspect\nThis extension inspects the contents of database pages at a low level. For more information, see [pageinspect](https://www.postgresql.org/docs/11/pageinspect.html) in the PostgreSQL documentation.\n### pg_bigm\nThis extension enables full-text search, and allows a two-gram (bigram) index for faster full-text search.\nTo begin using this extension on an instance, set the `cloudsql.enable_pg_bigm` flag to `on` . The following flags also are supported:\n- `pg_bigm.enable_recheck`\n- `pg_bigm.gin_key_limit`\n- `pg_bigm.similarity_limit`\nFor information about setting flags, and to review the flags supported for this extension, see [Configure database flags](/sql/docs/postgres/flags) .\n### pg_cron\nTo begin using [pg_cron](https://github.com/citusdata/pg_cron) on an instance, set the `cloudsql.enable_pg_cron` flag to `on` . For information about setting flags, and to review the flags supported for this extension, see [Configure database flags](/sql/docs/postgres/flags) .\nThe jobs are configured as background workers, so you might need to use standard PostgreSQL techniques (such as the `max_worker_processes` flag) to adjust the number of those background workers.\nFor this extension, Cloud SQL supports the background worker mode, but not the libpq interface. Therefore, trust authentication directly involving this extension is not required.\n### pgfincore\nThis extension contains functions for managing pages in operating system disk cache memory from PostgreSQL. For more information, see the [pgfincore documentation](https://github.com/klando/pgfincore) .\n### pg_freespacemap\nThis extension examines the free space map (FSM). For more information, see [pg_freespacemap](https://www.postgresql.org/docs/11/pgfreespacemap.html) in the PostgreSQL documentation.\n### pg_hint_plan\nTo begin using this extension on an instance, set the `cloudsql.enable_pg_hint_plan` flag to `on` . For information about setting flags, and to review the flags supported for this extension, see [Configure database flags](/sql/docs/postgres/flags) .\nAlternatively, for only a user with the `cloudsqlsuperuser` role, you can use the `load` command to load this extension for one session.\n### pg_partman\nThis extension enables you to create and manage time-based and serial-based table partition sets.\nIn Cloud SQL, this extension doesn't include the background worker for automatic partition maintenance. Instead, you can use, for example, [Cloud Scheduler](https://cloud.google.com/scheduler) to drive maintenance by calling [maintenance functions](https://github.com/pgpartman/pg_partman/blob/master/doc/pg_partman.md#maintenance-functions) at a regular interval.\n### pg_proctab\nHere are the steps to use the [pg_proctab](https://gitlab.com/pg_proctab/pg_proctab) extension to enable the [pg_top](https://pg_top.gitlab.io/) utility:\n- In the psql tool, run the [CREATE EXTENSION](https://www.postgresql.org/docs/current/static/sql-createextension.html) command for pg_proctab.\n- Download and run [pg_top](https://pg_top.gitlab.io/) .\n- When connecting to a Cloud SQL for PostgreSQL instance, add the`-r`option for connecting to a remote database, for getting metrics.\nThe following instance-wide metrics, which are included in the output, include usage by other supporting agents and services in the instance:\n- Load average\n- CPU states (% user, nice, system, idle, and iowait)\n- Memory (used, free, and cached)\n### pg_repack\nThis extension enables you to remove bloat from tables and indexes. Optionally, you can use this extension to perform an online CLUSTER (order tables by cluster index). For more information, see the [pg_repack documentation](http://reorg.github.io/pg_repack/) . Additionally, for use of this extension in Cloud SQL, a special procedure is needed for adding privileges to a user.\nIf a user outside of the `cloudsqlsuperuser` role wants to use an extension, you must grant the user `cloudsqlsuperuser` privileges. For more information, in this document, see [Requirement for superuser privileges](#requirement-for-superuser-privileges) . The following example uses the `GRANT` command to add the necessary privileges.\nFor example purposes below, `csuper1` is a `cloudsqlsuperuser` and `testdb` is a database owned by `testuser` . To create the pg_repack extension in `testdb` , initially run the following commands:\n- Connect to `testdb` as the `cloudsqlsuperuser` :```\npsql -U csuper1 -d testdb;\n```\n- Grant the database owner, which is `testuser,` to `csuper1` :```\nGRANT testuser TO csuper1;\n```\n- Create the extension:```\nCREATE EXTENSION pg_repack;\n```\n- Run the `pg_repack` command on a table, such as `t1` in `testdb` , as `csuper1` :```\npg_repack -h <hostname> -d testdb -U csuper1 -k -t t1\n```\n- After the pg_repack job is completed, revoke the grant that you performed in step 2:```\n REVOKE testuser FROM csuper1;\n```\nThe `pg_repack` command might fail with the following error: `\"ERROR: query failed: SSL SYSCALL error: EOF detected\"`\nIf that error occurs, try setting TCP keepalives to a smaller value and then run the `pg_repack` command. For more information, see [Connections timeout (from Compute Engine)](/sql/docs/postgres/debugging-connectivity#compute-engine) .\n### pgtt\nTo begin using this extension on an instance, set the `pgtt.enabled` flag to `on` . For information about setting flags, and to review the flags supported for this extension, see [Configuring database flags](/sql/docs/postgres/flags) .\n### pg_visibility\nThis extension provides a way to examine the visibility map (VM) and the page-level visibility information of a table. For more information, see [pg_visibility](https://www.postgresql.org/docs/11/pgvisibility.html) in the PostgreSQL documentation.\n### PL/Proxy\nThis extension is a procedural language handler that allows remote procedure calls among PostgreSQL databases, with optional sharding.\nFor more information, see the [PL/Proxy documentation](https://plproxy.github.io/) .\nThe target instances for connections must be in the same VPC network as the connecting instance. Additionally, you cannot choose, in the Google Cloud console, the **Allow only SSL connections** button for cluster instances.\nTo connect to databases within the same instance, you cannot set host to localhost or to `127.0.0.1` . Instead, you must use the IP address shown for your instance in the Google Cloud console.\nAlso see [postgres_fdw](#postgres_fdw) and [dblink](#dblink) in this document.\n### postgresql_anonymizer\nTo begin using this extension on an instance, set the `cloudsql.enable_anon` flag to `on` . For information about setting flags, and to review the flags supported for this extension, see [Configuring database flags](/sql/docs/postgres/flags) .\n### postgres_fdw\nThis extension allows tables from other (\"foreign\") PostgreSQL databases to be exposed as \"foreign\" tables in the current database. Those tables then are available for use, almost as if they were local tables. For more information, see [postgres_fdw](https://www.postgresql.org/docs/11/postgres-fdw.html) in the PostgreSQL documentation.\nThis extension works for two Cloud SQL private IP instances within the same VPC network, or for cross databases within the same instance.\nTo connect to databases within the same instance, you cannot set host to localhost or to `127.0.0.1` . Instead, you must use the IP address shown for your instance in the Google Cloud console.\nAdditionally, for an instance where foreign data is stored, you can choose the **Allow only SSL connections** option in the Google Cloud console. You can't choose the **Require trusted client certificates** option. Only the `cloudsqlsuperuser` can be the owner of a `postgres_fdw` foreign data wrapper.\nAlso see [PL/Proxy](#pl-proxy) and [dblink](#dblink) in this document.\n### postgresql-hll\nThis extension introduces a new data type, `hll` , which is a HyperLogLog data structure. For more information, see the [postgresql-hll documentation](https://github.com/citusdata/postgresql-hll) .", "guide": "Cloud SQL"}