{"title": "Cloud SQL - Introduction to Cloud SQL for MySQL editions", "url": "https://cloud.google.com/sql/docs/mysql/editions-intro", "abstract": "# Cloud SQL - Introduction to Cloud SQL for MySQL editions\nThis page describes Cloud SQL editions and key features.\nCloud SQL offers the following editions to support your various business and application needs. Each edition provides different performance and availability characteristics to meet the needs of your applications.\n- **Cloud SQL Enterprise edition** : provides all core capabilities of Cloud SQL and is suitable for applications requiring a balance of performance, availability, and cost.\n- **Cloud SQL Enterprise Plus edition** : provides the best performance and availability to run applications requiring the highest level of availability and performance in addition to the capabilities of the Cloud SQL Enterprise edition.\n**Note:** Cloud SQL Enterprise edition supports all existing capabilities of Cloud SQL available as of July 12, 2023, at the same price. All existing instances prior to the launch of Cloud SQL editions on July 12, 2023, are automatically updated to a Cloud SQL Enterprise edition instance.\nCloud SQL editions are only available for Cloud SQL for MySQL and Cloud SQL for PostgreSQL.\n", "content": "## Cloud SQL editions features\nThe following table provides an overview of the features available for each edition:\n| Unnamed: 0     | Enterprise            | Enterprise Plus           |\n|:-----------------------------|:---------------------------------------------------------|:--------------------------------------------------------|\n| Pricing model    | Enterprise pricing          | Enterprise Plus pricing         |\n| Database versions   | MySQL 5.6, 5.7, 8.0          | MySQL 8.0            |\n| Machine type     | General purpose machine family       | Performance optimized N family       |\n| Machine configuration limits | Up to 96 vCPU Up to 624 GB RAM 1:6.5 core:memory ratio | Up to 128 vCPU Up to 864 GB RAM 1:8 core:memory ratio |\n| Availability SLA    | 99.95%             | 99.99%             |\n| Maintenance downtime   | < 60 seconds            | < 10 seconds           |\n| Data cache     | No              | Yes              |\n| Point-in-time log retention | Up to 7 days            | Up to 35 days           |\n## Performance enhancements\nCloud SQL for MySQL Enterprise Plus edition offers the following enhancements:\n- **Improved read performance using data cache** : Data cache leverages a fast, local SSD to store data pages that are read frequently. You can get up to three times improvement in read performance compared to reading from a persistent disk. Data cache is an optional feature and can be enabled during instance creation, or after the instance has been created.\n- **Enhanced write performance** : Cloud SQL Enterprise Plus edition delivers up to two times the improvement in write latency. This makes it suitable for write intensive applications requiring low latency and high throughput.\n- **Engine autotuning** : auto-tuning of engine configurations to match the capabilities of the underlying instance platform.## Cloud SQL Enterprise Plus edition region support\nThe Cloud SQL Enterprise Plus edition supports the following regions:\n- `asia-east1`— Taiwan\n- `asia-northeast1`— Tokyo\n- `asia-northeast2`— Osaka\n- `asia-northeast3`— Seoul\n- `asia-south1`— Mumbai\n- `asia-south2`— Delhi\n- `asia-southeast1`— Singapore\n- `asia-southeast2`— Jakarta\n- `australia-southeast1`— Sydney\n- `australia-southeast2`— Melbourne\n- `europe-central2`— Warsaw\n- `europe-north1`— Finland\n- `europe-southwest1`— Madrid\n- `europe-west1`— Belgium\n- `europe-west2`— London\n- `europe-west3`— Frankfurt\n- `europe-west4`— Netherlands\n- `europe-west6`— Zürich\n- `europe-west8`— Milan\n- `europe-west9`— Paris\n- `europe-west12`— Turin\n- `me-central1`— Doha\n- `me-central2`— Dammam\n- `me-west1`— Tel Aviv\n- `northamerica-northeast1`— Montréal\n- `northamerica-northeast2`— Toronto\n- `southamerica-east1`— San Paulo\n- `us-central1`— Iowa\n- `us-east1`— South Carolina\n- `us-east4`— Northern Virginia\n- `us-east5`— Columbus\n- `us-south1`— Dallas\n- `us-west1`— Oregon\n- `us-west2`— Los Angeles\n- `us-west3`— Salt Lake City\n- `us-west4`— Las Vegas## Pricing\nFor more information about Cloud SQL editions pricing, see [Cloud SQL pricing](/sql/pricing) .\n## Cloud SQL editions FAQs\nThis section provides answers to frequently asked questions about Cloud SQL editions.\n### Does Cloud SQL Enterprise Plus edition support all engines?\nCloud SQL Enterprise Plus edition is supported on Cloud SQL for MySQL and Cloud SQL for PostgreSQL.\n### How is Cloud SQL pricing changing?\nCloud SQL instances that you created before July 12, 2023, have become Cloud SQL Enterprise edition instances with no change in features or pricing. Instances created after July 12, 2023, can be either Cloud SQL Enterprise edition or Cloud SQL Enterprise Plus edition. Cloud SQL Enterprise Plus edition has a new pricing structure. For more information about Cloud SQL pricing, see [Cloud SQL pricing](/sql/pricing) .\n### What can I do to prepare for these changes?\nYou can create Cloud SQL Enterprise Plus edition and Cloud SQL Enterprise edition instances in regions where supported using Google Cloud console and [gcloud CLI](/sdk/gcloud) .\n### Can I mix and match editions?\nYes, you can. Cloud SQL Enterprise Plus edition and Cloud SQL Enterprise edition provide different levels of database performance availability and data protection capabilities. You can select the Cloud SQL editions that best meets your varying application needs.\n### Can I migrate between editions?\nYou can upgrade your instance to Cloud SQL Enterprise Plus edition or switch to Cloud SQL Enterprise edition by using [in-place upgrade](/sql/docs/mysql/upgrade-cloud-sql-instance-to-enterprise-plus-in-place) .\nYou can move your instance between Cloud SQL Enterprise edition and Cloud SQL Enterprise Plus edition with [Database Migration Service](/database-migration) using the following two ways:\n- [Upgrade an instance to Cloud SQL Enterprise Plus edition by using IP allowlists](/sql/docs/mysql/upgrade-cloud-sql-instance-to-enterprise-plus-vpc-peering) \n- [Upgrade an instance to Cloud SQL Enterprise Plus edition by using VPC peering](/sql/docs/mysql/upgrade-cloud-sql-instance-to-enterprise-plus-vpc-peering)", "guide": "Cloud SQL"}