{"title": "Cloud SQL - Managing a tempdb database", "url": "https://cloud.google.com/sql/docs/sqlserver/managing-tempdb", "abstract": "# Cloud SQL - Managing a tempdb database\nThis page describes the management of the tempdb database in Cloud SQL for SQL Server.\nThe tempdb database is a system database that holds many objects, including temporary tables, stored procedures, and more. In your instances, you can perform common operations on this database.\nYou can manage the tempdb database of your instance in a way that meets your needs.\nA tempdb database is recreated each time an instance is restarted. To prevent the loss of user permissions, Cloud SQL provides permissions to the `sqlserver` user after an instance is restarted.\n", "content": "## Overview\nThe `sqlserver` [user](/sql/docs/sqlserver/users) has the ALTER permission for managing the tempdb database options.\nSee the [general information](https://docs.microsoft.com/en-us/sql/relational-databases/databases/tempdb-database) about managing a tempdb database.\n## Managing tempdb files\nAfter you [connect](/sql/docs/sqlserver/connect-overview) to an instance, the `sqlserver` [user](/sql/docs/sqlserver/users) can manage the tempdb files.\n### Number of files\nThe user has the CONTROL permission on the tempdb database. The user can control settings for the number of files (and more). For example, the user can perform these operations:\n- `ALTER DATABASE [tempdb] ADD FILE`\n- `ALTER DATABASE [tempdb] REMOVE`\n**Note:** See [Physical properties of tempdb in SQL Server](https://docs.microsoft.com/en-us/sql/relational-databases/databases/tempdb-database?view=sql-server-ver15#physical-properties-of-tempdb-in-sql-server) , which includes recommendations related to these settings. Review the information about the number of tempdb data files that would correspond to a given number of logical processors. By default, Cloud SQL creates a minimum of eight files for instances that have greater than or equal to eight logical processors. As included in those recommendations, if the number of logical processors is fewer than or equal to eight, the number of files created is equal to the number of logical processors.\n### File size\nThe user can control the size of files in the tempdb database. For information about using the `ALTER DATABASE` statement to change the file size options, see [ALTER DATABASE (Transact-SQL) File and Filegroup Options](https://docs.microsoft.com/en-us/sql/t-sql/statements/alter-database-transact-sql-file-and-filegroup-options?redirectedfrom=MSDN&view=sql-server-ver15) .\n## What's next\n- Learn about [Instance settings](/sql/docs/sqlserver/instance-settings) .\n- Learn about [Monitoring Cloud SQL instances](/sql/docs/sqlserver/monitor-instance) .", "guide": "Cloud SQL"}