{"title": "Cloud SQL - Cloud SQL overview", "url": "https://cloud.google.com/sql/docs/introduction", "abstract": "# Cloud SQL - Cloud SQL overview\nCloud SQL is a fully managed relational database service for MySQL, PostgreSQL, and SQL Server. This frees you from database administration tasks so that you have more time to manage your data.\nThis page discusses basic concepts and terminology for Cloud SQL, which provides SQL data storage for Google Cloud. For a more in-depth explanation of key concepts, see the [key terms](/sql/docs/key-terms) and [features](/sql/docs/features) pages. For information about how Cloud SQL databases compare with one another, see [Cloud SQL feature support by databaseengine](/sql/docs/feature_support) .\n", "content": "## Database configurations with Cloud SQL\nThe following video shows you the benefits of using Cloud SQL. It also demonstrates how to do the following:\n- Create a Cloud SQL instance\n- Create database tables and import .sql data from Cloud Storage\n- Explore data with SQL statements\n- Connect to BigQuery Federated Queries and Data Studio\n- Connect to Compute Engine using the Cloud SQL Auth proxy (previously called the Cloud SQL proxy)\n## Use cases for Cloud SQL\nCloud SQL provides a cloud-based alternative to local MySQL, PostgreSQL, and SQL Server databases. You should use Cloud SQL if you want to spend less time managing your database and more time using it.\nMany applications running on Compute Engine, App Engine and other services in Google Cloud use Cloud SQL for database storage.\n## What Cloud SQL provides\nCloud SQL offers many services so you don't have to build and maintain them yourself. You can focus on your data and let Cloud SQL handle the following operations:\n- [Backups](/sql/docs/mysql/backup-recovery/backups) \n- [High availability and failover](/sql/docs/mysql/high-availability) \n- [Network connectivity](/sql/docs/mysql/connect-overview) \n- [Export and import](/sql/docs/mysql/import-export) \n- [Maintenance and updates](/sql/docs/mysql/maintenance) \n- [Monitoring](/sql/docs/mysql/monitor-instance) \n- [Logging](/sql/docs/mysql/logging) ## What is a Cloud SQL instance?\nEach Cloud SQL instance is powered by a virtual machine (VM) running on a host Google Cloud server. Each VM operates the database program, such as MySQL Server, PostgreSQL, or SQL Server, and service agents that provide supporting services, such as logging and monitoring. The high availability option also provides a standby VM in another zone with a configuration that's identical to the primary VM.\nThe database is stored on a scalable, durable network storage device called a `persistent disk` that attaches to the VM. A static IP address sits in front of each VM to ensure that the IP address an application connects to persists throughout the lifetime of the Cloud SQL instance.\nCloud SQL instance overview:\n## Database administration\nCloud SQL lets you create and delete databases and database users, but it isn't a database administration tool. There are many database administration tools you can choose from, depending on your database engine, including the following:\n- [phpMyAdmin](https://www.phpmyadmin.net/) for MySQL\n- [MySQL Workbench](https://www.mysql.com/products/workbench/) for MySQL\n- [Toad Edge](https://www.quest.com/products/toad-edge/) for MySQL and PostgreSQL\n- [pgAdmin.org](https://www.pgadmin.org/) for PostgreSQL\n- [SQL Server Management Studio](https://docs.microsoft.com/en-us/sql/ssms/download-sql-server-management-studio-ssms?view=sql-server-ver15) for SQL Server\n- [Visual Studio Code](https://code.visualstudio.com/) for SQL Server## Cloud SQL pricing\nCloud SQL pricing varies with your configuration settings, and depends on:\n- How much storage you provision, in GiB per month\n- How many CPUs you select for your Cloud SQL instance\n- How much memory you select for your Cloud SQL instance\n- Where you choose to host your data\n- How much network traffic leaves your instance\n- How many IP addresses you assign and use\nCheck out some [Cloud SQL pricingexamples](/sql/docs/pricing-examples) . For more information, see the [pricing](/sql/pricing) page.\nYou can create an account to evaluate how Cloud SQL performs in real-world scenarios. New customers also get $300 in free credits to spend on Cloud SQL to run, test, and deploy workloads. You won't be charged until you upgrade.Sign up to [ try Cloud SQL for free](https://console.cloud.google.com/freetrial?redirectPath=/sql) .\n## Connect to a Cloud SQL managed database\nConnecting to a Cloud SQL managed database is similar to connecting to a self-managed database. Depending on how you configure it, your Cloud SQL instance has a public IP address (which can be accessed from outside of Google Cloud, using the internet), or a private IP address (which can only be accessed through a [Virtual Private Cloud (VPC) network](/vpc/docs/overview) ). In addition, Cloud SQL provides different authorization options to control who is allowed to connect to your instance, such as the [Cloud SQL Auth Proxy](/sql/docs/mysql/sql-proxy) .\nFor more details on how to connect, authorize, and authenticate to your Cloud SQL instance, see the [Connecting Overview](/sql/docs/mysql/connect-overview) page.\n## Cloud SQL updates\nOver the life of a Cloud SQL instance, two kinds of updates can occur:\n- **Configuration updates** , which are done by the user.\n- **System updates** , which are performed by Cloud SQL.\n### Configuration updates\nAs your database's usage grows and new workloads are added, you might want to update your database configuration to adapt accordingly. Configuration updates include:\n- Increasing compute resources\n- Modifying a database flag\n- Enabling high availability\nAlthough Cloud SQL makes these updates possible with the click of a [button](/sql/docs/mysql/edit-instance) , some configuration updates can require downtime.\n### System updates\nKeeping the database instance up and running requires operational effort beyond configuration updates. Servers and disks need to be replaced and upgraded. Operating systems need to be patched as new vulnerabilities are discovered. Database programs need to be upgraded as the database software provider releases new features and fixes new issues. Normally, a database administrator performs each of these updates regularly in order to ensure their systems stay reliable, protected, and up-to-date. Cloud SQL attends to these regular system updates for you, so you can spend less time managing your database and more time developing great applications.\nThe process Cloud SQL uses to perform system updates varies based on which part of the system is getting updated. In general, Cloud SQL system updates are divided into three categories: hardware updates, online updates, and maintenance.\n**Hardware updates** improve the physical infrastructure, such as swapping out a defective machine host or replacing an old disk. Google Cloud performs hardware updates without interruption to your application. For example, when updating a database server, Google Cloud uses live migration, an advanced technology that reliably migrates a VM from the original host to a new one while the VM stays running.\n**Online updates** enhance the software of the supporting service agents that sit adjacent to the database program on the VM. These updates are performed while the database is up and running, serving traffic. Online updates do not cause downtime for your application.\n[Maintenance updates](/sql/docs/mysql/maintenance) apply upgrades to the operating system and the database program. Because these updates require an instance restart, they incur some downtime. For this reason, Cloud SQL lets you schedule maintenance to occur at a time that is the least disruptive to your application.\n## What's next\nTry out one or more of the quickstarts for:\n- [MySQL](/sql/docs/mysql/connect-instance-cloud-shell) \n- [PostgreSQL](/sql/docs/postgres/connect-instance-cloud-shell) \n- [SQL Server](/sql/docs/sqlserver/connect-instance-cloud-shell)", "guide": "Cloud SQL"}