{"title": "Cloud SQL - Use Looker with Cloud SQL", "url": "https://cloud.google.com/sql/docs/postgres/looker", "abstract": "# Cloud SQL - Use Looker with Cloud SQL\nThis page gives a short overview of Looker and describes the benefits of using it with Cloud SQL. To use Looker with Cloud SQL now, see the [instructions for connecting Looker to Cloud SQL](https://docs.looker.com/setup-and-management/database-config/google-cloud-sql) .\nLooker is an enterprise platform for business intelligence, data applications, and embedded analytics. Looker helps you explore, share, and visualize your company's data so that you can make better business decisions.\n", "content": "## How Looker works\nLooker lets data experts at each organization describe their data using a lightweight modeling language called LookML. LookML tells Looker how to query data, so everyone in the organization can create easy-to-read reports and dashboards to explore patterns of data. Looker offers additional features for creating custom data applications and experiences.\nLooker's platform works with transactional databases and analytical datastores. Looker lets you create consistent data models on top of all your data with speed and accuracy. It also offers a unified surface to access all of an organization's data.\n## Restrictions\nCloud SQL doesn't support the following [Looker features](https://docs.looker.com/setup-and-management/database-config/google-cloud-sql#feature_support) :\n- Persistent Native Derived Tables\n- Stable views\n- Case sensitive\n- Oauth credentials\n- Connection pooling\n- HLL sketches\n- Incremental PDTS\n- Materialized views\n- Approximate count distinct\nGoogle Cloud SQL doesn't support `CREATE TABLE AS SELECT` statements, so you must use the [create_process](https://docs.looker.com/reference/view-params/create_process) LookML parameter to define Persistent Native Derived Tables (PDTs).\n## Looker integration with Cloud SQL\nLooker supports hosting in Google Cloud. Because Looker is platform independent, it connects to data in Cloud SQL and other public clouds.\nIf you already have a Looker instance running, see the [instructions for connecting Looker to Cloud SQL](https://help.looker.com/hc/en-us/articles/4420182816531-Google-Cloud-SQL) .\n## What's next\nThere are many options related to administering Looker, customizing its data model, and exposing data to users. For more information, see the following resources:\n- [Looker Documentation](https://docs.looker.com/) \n- [Looker Help Center](https://help.looker.com/) \n- [Looker Training](https://training.looker.com/)", "guide": "Cloud SQL"}