{"title": "Cloud SQL - Upgrade the database major version by migrating data", "url": "https://cloud.google.com/sql/docs/postgres/upgrade-major-db-version-migrate", "abstract": "# Cloud SQL - Upgrade the database major version by migrating data\nThis page describes how to migrate your data to an instance running a later version of PostgreSQL. Before proceeding with this method, consider [upgrading the database major version in-place](/sql/docs/postgres/upgrade-major-db-version-inplace) .\nThere are two ways to upgrade the database major version of your Cloud SQL for PostgreSQL instance by migrating your data.\n- **Option 1** . Use the [Database Migration Service (DMS)](/database-migration/docs/postgres/configure-source-database) . DMS supports migrating from a Cloud SQL for PostgreSQL instance. You can also use it to upgrade your database version.\n- **Option 2** . Move your data from one version of PostgreSQL to another bydata from the current instance andthat  data into a new instance running the later version of PostgreSQL. This process  involves downtime; you put the current instance into read-only mode before  starting the export.\nThe rest of this page discusses the second option.\n", "content": "## Plan a major version upgrade\n- Choose a target major version.See the [list of versions that Cloud SQL supports](/sql/docs/postgres/db-versions) .\n- Consider the features offered in each PostgreSQL version and address incompatibilities.New major versions introduce incompatible changes that might require you to modify the application code, the schema, or the database settings before you can upgrade your database instance. Review the release notes of your target major version to determine the incompatibilities that you need to address. If you're skipping major versions, address the incompatibilities listed for each version that you're skipping.- [PostgreSQL 15](https://www.postgresql.org/docs/15/release-15.html) \n- [PostgreSQL 14](https://www.postgresql.org/docs/14/static/release-14.html) \n- [PostgreSQL 13](https://www.postgresql.org/docs/13/static/release-13.html) \n- [PostgreSQL 12](https://www.postgresql.org/docs/12/static/release-12.html) \n- [PostgreSQL 11](https://www.postgresql.org/docs/11/static/release-11.html) \n- [PostgreSQL 10](https://www.postgresql.org/docs/10/static/release-10.html) \n- Test the upgrade with a dry run.Perform a dry run of the end-to-end upgrade process with a test instance before you upgrade the production database. You might want to test the upgrade using a [clone](/sql/docs/postgres/clone-instance) instead of your production database to avoid any performance impact from the export on your production workload.In addition to validating that the upgrade completes successfully, run tests to understand the expected downtime of the upgrade, confirm your upgrade workflow, and ensure that the application behaves as expected on the upgraded database. If you haven't enabled [automatic storage increases](/sql/docs/postgres/instance-settings#automatic-storage-increase-2ndgen) , take note of the disk storage used by the upgraded dry run instance to determine whether you need to increase the storage capacity for the production instance before upgrading.\n- Decide when you want to upgrade. **Note:** Upgrades require the instance to become unavailable for a period of time. Be sure to schedule your upgrade when database activity is low.## Migrate your data\nMigrating entails using the [pg_dump](https://www.postgresql.org/docs/14/static/app-pgdump.html) command to [export the data](/sql/docs/postgres/import-export/import-export-dmp#export) from the source instance and the [pg_restore](https://www.postgresql.org/docs/14/static/app-pgrestore.html) command to [import the data](/sql/docs/postgres/import-export/import-export-dmp#import) into the target instance.\nTo migrate your data to a Cloud SQL instance running a more recent database version, follow these steps:\n- Create the target instance with the desired PostgreSQL version.Make sure the target instance has:- Sufficient storage to hold all of the current instance's data.\n- The same authorized networks as the current instance. [Learn more](/sql/docs/postgres/configure-ip) .\n- The same user accounts, with the same PostgreSQL privileges and passwords.\nFor more information, see [Creating an instance](/sql/docs/postgres/create-instance) .\n- Confirm that you can [connect to the new instance](/sql/docs/postgres/connect-admin-ip) with your local PostgreSQL tools and update them, if necessary.\n- Export the current instance's data to a PostgreSQL dump file, following the instructions in [Exporting data for Import into Cloud SQL](/sql/docs/postgres/import-export/import-export-dmp#external-server) .Do export the `postgres` system database. The `postgres` database is the default database you connect to before you have created any other databases. Once you create another database, switch to it in order to create tables and insert data. Don't use the `postgres` database for your application's data.\n- [Create a Cloud Storage bucket](/storage/docs/creating-buckets) if needed, and upload your SQL dump file to the bucket.\n- Import the data to the target instance, following the instructions in [Importing PostgreSQL databases from Cloud Storage](/sql/docs/postgres/import-export/import-export-dmp#import_data_using_pg_restore_) .\n- Optional. After completing the upgrade process, set up replication between the source and target instances using `pglogical` to update the target with all changes that have occurred since the initial dump was started. Once the two instances are in sync, you can promote the target instance.For information about using `pglogical` to implement continuous replication, see [Configure your source](/database-migration/docs/postgres/configure-source-database) .\n- Update your applications to connect to the new instance.\n- When you're confident that your new instance is operating successfully, delete the old instance. **Note:** After deleting an instance, the instance name can't be reused for up to a week.## What's next\n- Learn about [importing and exporting data](/sql/docs/postgres/import-export) .\n- Learn about [options for connecting to an instance](/sql/docs/postgres/external-connection-methods) .\n- Learn more about [setting PostgreSQL flags](/sql/docs/postgres/flags) .", "guide": "Cloud SQL"}