{"title": "Cloud SQL - Manage your data using Cloud SQL Studio", "url": "https://cloud.google.com/sql/docs/mysql/manage-data-using-studio", "abstract": "# Cloud SQL - Manage your data using Cloud SQL Studio\n**    Preview     ** This product or feature is subject to the \"Pre-GA Offerings Terms\" in the General Service Terms section   of the [Service Specific Terms](/terms/service-terms#1) .     Pre-GA products and features are available \"as is\" and might have limited support.    For more information, see the [launch stage descriptions](/products#product-launch-stages) .\nThis page describes how to explore and manage your Cloud SQL data using Cloud SQL Studio in the Google Cloud console.\nCloud SQL Studio lets authorized users interact directly with the SQL database and run SQL queries from the Google Cloud console to access and manipulate data. You can perform a range of actions that you would perform on a SQL command line client, such as creating tables and indexes, modifying tables, or setting up views.\nCloud SQL Studio includes an **Explorer** pane that integrates with a query editor and a SQL query results table. You can run DDL, DML, and DQL statements from this one interface. For example, instead of configuring a third-party database query tool, you can create a table and query your data using the query editor in Cloud SQL Studio.\nYou can use the **Explorer** pane to view and interact with your database objects. You create, alter, and delete the database objects, such as the following:\n- Tables\n- Columns\n- Indexes and keys\n- Functions\nYou can also use the **Explorer** pane to seed `SELECT` queries for tables.\n**Note:** System-level views in the `INFORMATION_SCHEMA` schema is read-only.\nIf you're new to Cloud SQL, see [Cloud SQL overview](/sql/docs/MySQL/introduction) .\n#", "content": "## Required roles and permissions\nTo get the permissions that you need to complete the tasks in this document,   ask your administrator to grant you the [Cloud SQL Admin ](https://cloud.google.com/iam/docs/understanding-roles#cloudsql.admin) ( `roles/cloudsql.admin` ) IAM role on the project.    For more information about granting roles, see [Manage access](/iam/docs/granting-changing-revoking-access) .\nYou might also be able to get  the required permissions through [custom  roles](/iam/docs/creating-custom-roles) or other [predefined  roles](/iam/docs/understanding-roles) .\nTo use Cloud SQL Studio, you must have the following permissions:\n- `cloudsql.instances.get`\n- `cloudsql.users.list`\n- `cloudsql.databases.list`\n- `cloudsql.instances.executeSql`\nAdditionally, ensure that you have database-level permissions for the database that you're using for authentication, and the password for the privileged database user that you'll be using. IAM authentication is not supported in Cloud SQL Studio.\n### Explore your data\nTo access the **Explorer** pane, follow these steps:\n- In the Google Cloud console, go to the **Cloud SQL Instances** page. [Go to Cloud SQL Instances](https://console.cloud.google.com/sql) \n- Select an instance from the list.\n- In the navigation menu, click **Cloud SQL Studio** .\n- Sign in to Cloud SQL Studio using the name of your database, username, and password. The **Explorer** pane displays a list of the objects in your database.\n### Create, modify, and query your data\nUsing the SQL editor, you can run a combination of DDL, DML, and DQL statements. You can compose a query yourself, or you can populate the query editor with a template using the explorer.\nTo structure, modify, or query your data, follow these steps:\n- In the Google Cloud console, go to the **Cloud SQL Instances** page. [Go to Cloud SQL Instances](https://console.cloud.google.com/sql) \n- Select an instance from the list.\n- In the navigation menu, click **Cloud SQL Studio** .\n- Sign in to Cloud SQL Studio using the name of your database, username, and password.\n- Compose a query using one of the following methods:- To compose your own query, follow these steps:- Open a new tab by clickingadd.\n- When the query editor appears, write your query.\n- To compose a query starting with a template, follow these steps:- In the **Explorer** pane, next to a database object or collection, clickmore_vert **View actions** . One or more available actions appear.\n- Click an action. The query editor populates with a template.\n- Replace any placeholders in the template.\n- Run your queries using either of the following approaches:- To execute all the statements in the query editor, click **Run** .\n- To run specific statements, select one or multiple statements, and click **Run selected** .\n- The results of your queries appear in the **Results** tab. If multiple result sets are available, select a result from the **All results** drop-down list.\n### Limitations\n- Cloud SQL Studio supports lightweight queries. Responses over 8MB might be truncated. Cloud SQL Studio indicates when partial results are returned.\n- You can only run queries for Cloud SQL instances that are running.\n- Cloud SQL Studio doesn't support external servers.\n- Requests taking longer than one minute are canceled. For Cloud SQL for MySQL 5.6 and 5.7, long running DDL statements timing out may cause orphaned files or tables that can't be safely rolled back. Be cautious with queries like`ALTER TABLE`on large tables.\n- Cloud SQL Studio doesn't keep a database connection open after execution of a SQL script is completed. Similarly, editor tabs don't share a common session and every execution starts a new session.\n- When you run a mix of DML, DQL, and DDL statements, only results from the DQL queries will be displayed.\n- Closing your browser or browser tab doesn't stop the query execution in Cloud SQL Studio. The query will run until it completes or times out.\n- Cloud SQL Studio doesn't support running`SELECT`queries on`BLOB`data. If the SQL script produces a`BLOB`column in the output, then the SQL script fails with an error.\n- [Cloud SQL for MySQL client commands](https://dev.mysql.com/doc/refman/8.0/en/mysql-commands.html) aren't supported and can't be executed in Cloud SQL Studio.\n- The`root`user is not supported in Cloud SQL Studio.\n- Cloud SQL Studio always requires a database even if Cloud SQL for MySQL doesn't require a database to connect.\n- Users with empty passwords are not supported in Cloud SQL Studio.\n- `USE database`is stateful only for the active query execution and doesn't function the same as in the [gcloud CLI](/sdk/gcloud) .\n- The database user must have the permission to connect from the localhost.\n- When running multiple queries and one of them fails, the first encountered error is returned. Some of the statements in the batch prior to the error might have executed successfully. You can wrap multiple queries in a `transaction` statement to prevent this issue:```\nSTART TRANSACTION;    YOUR_SQL_STATEMENTSCOMMIT;\n```Replace the following:- : the statements you want to run as part of this query", "guide": "Cloud SQL"}