{"title": "Cloud SQL - Connect to Cloud SQL for MySQL from Cloud Shell", "url": "https://cloud.google.com/sql/docs/mysql/connect-instance-cloud-shell", "abstract": "# Cloud SQL - Connect to Cloud SQL for MySQL from Cloud Shell\n# Connect to Cloud SQL for MySQL from Cloud Shell\nThis page shows you how to create and connect to a MySQL instance and perform basic SQL operations by using the Google Cloud console and a client. The resources created in this quickstart typically cost less than a dollar, assuming you complete the steps, including the cleanup, in a timely manner.To follow step-by-step guidance for this task directly in the Google Cloud console, click **Guide me** :\n [Guide me](https://console.cloud.google.com/?walkthrough_id=sql--mysql--quickstart) ", "content": "## Before you begin **Note:** The name you use for your project must be between 4 and 30 characters. When you type the name, the form suggests a project ID, which you can edit. The project ID must be between 6 and 30 characters, with a lowercase letter as the first character. You can use a dash, lowercase letter, or digit for the remaining characters, but the last character cannot be a dash.- Enable the necessary Google Cloud APIs.\nIn the Google Cloud console, go to the **APIs** page.\n [Go to APIs](https://console.cloud.google.com/apis) \nEnable the Cloud SQL Admin API.\nClick the following button to open Cloud Shell, which provides   command-line access to your Google Cloud resources directly from the browser.   Cloud Shell can be used to run the `gcloud` commands presented throughout this quickstart.\n [Open Cloud Shell](/console/sql/instances?cloudshell=true) \nRun the [gcloud services enable](/sdk/gcloud/reference/services/enable) command   as follows using Cloud Shell to enable the APIs required for this quickstart.:\n```\ngcloud services enable sqladmin.googleapis.com\n```\nThis command enables the following APIs:- Cloud SQL Admin API\n## Create a Cloud SQL instanceIn this quickstart, you use the Google Cloud console. To use the [gcloud CLI](/sdk/gcloud) , cURL, or PowerShell, see [Create instances](/sql/docs/mysql/create-instance) .- In the Google Cloud console, go to the **Cloud SQL Instances** page. [Go to Cloud SQL Instances](https://console.cloud.google.com/sql) \n- Click **Create Instance** .\n- Click **Choose MySQL** .\n- Enter`myinstance`for **Instance ID** .\n- Enter a password for the`root`user.\n- Click **Create** .You're returned to the instances list. You can click the new instance right away to see the details, but it won't be available for other operations until it initializes and starts. **Note:** In this example, the instance is created using default settings, including a public IP address.\n## Connect to your instanceIn this quickstart, we'll use the mysql client in Cloud Shell to connect to your instance.\n **Note: ** Cloud Shell doesn't work with a private IP address. These instructions are only for an instance with a public IP address.- Optional: If you're running a local instance of MySQL, stop it before connecting to your Cloud SQL instance. Otherwise, you might encounter errors such as`address already in use`.\n- In the [Google Cloud console](https://console.cloud.google.com/) , click the Cloud Shell icon ( ) in the upper right corner.When Cloud Shell finishes initializing, a message, such as the following one, appears: following one, appears:```\nWelcome to Cloud Shell! Type \"help\" to get started.\nYour Cloud Platform project in this session is set to sample-project.\nUse \"gcloud config set project [PROJECT_ID]\" to change to a different project.\nusername@sample-project:~ (sample-project)$\n```\n- At the Cloud Shell prompt, connect to your Cloud SQL instance. Use the `gcloud sql connect` command as follows. Replace the instance name if your instance name is different.```\ngcloud sql connect myinstance --user=root\n```\n- Click **Authorize** in the message box to authorize Cloud Shell to make API calls.A message indicates that your IP is being allowlisted for incoming connections,  after which you're prompted to enter your password.\n- Enter your root password.The `mysql` prompt appears.\n## Create a database and upload data\n- Create a SQL database on your Cloud SQL instance:```\nCREATE DATABASE guestbook;\n```\n- Insert sample data into the guestbook database:```\nUSE guestbook;CREATE TABLE entries (guestName VARCHAR(255), content VARCHAR(255),    entryID INT NOT NULL AUTO_INCREMENT, PRIMARY KEY(entryID));    INSERT INTO entries (guestName, content) values (\"first guest\", \"I got here!\");    INSERT INTO entries (guestName, content) values (\"second guest\", \"Me too!\");\n```\n- Retrieve the data:```\nSELECT * FROM entries;\n```The result is:```\n+--------------+-------------------+---------+\n| guestName | content   | entryID |\n+--------------+-------------------+---------+\n| first guest | I got here!  |  1 |\n| second guest | Me too!   |  2 |\n+--------------+-------------------+---------+\n2 rows in set (0.00 sec)\nmysql>\n```\n## Clean upTo avoid incurring charges to your Google Cloud account for   the resources used on this page, follow these steps.- In the Google Cloud console, go to the **Cloud SQL Instances** page. [Go to Cloud SQL Instances](https://console.cloud.google.com/sql) \n- Select the`myinstance`instance to open the **Instance details** page.\n- In the icon bar at the top of the page, click **Delete** .\n- In the **Delete instance** window, type your instance's name and then click **Delete** .\n### Optional cleanup stepsIf you're not using the APIs that were enabled as part of this quickstart, you can disable them.- APIs that were enabled within this quickstart:- Cloud SQL Admin API- In the Google Cloud console, go to the **APIs** page. [Go to APIs](https://console.cloud.google.com/apis) \n- Select the Cloud SQL Admin API and then click the **Disable API** button.\n## What's next\n- Learn about [creating Cloud SQL instances](/sql/docs/mysql/create-instance) .\n- Learn about creating [MySQL users](/sql/docs/mysql/create-manage-users) and [databases](/sql/docs/mysql/create-manage-databases) for your Cloud SQL instance.\n- See the [Cloud SQL pricing information](/sql/docs/mysql/pricing) .\n- In this quickstart you connected to the instance by using Cloud Shell. Learn about all of the [connectivity options](/sql/docs/mysql/connect-overview#connection_options) in Cloud SQL. How you connect depends on your networking configuration, such as if your Cloud SQL instance has a public or private IP address. See how to configure your Cloud SQL instance with a [public IP](/sql/docs/mysql/configure-ip) and a [private IP](/sql/docs/mysql/configure-private-ip) address.\n- Learn about connecting to a Cloud SQL instance from other Google Cloud applications:- [From an application running on the App Engine standard environment](/sql/docs/mysql/connect-app-engine) \n- [From an application running on Compute Engine](/sql/docs/mysql/connect-compute-engine) \n- [From an application running on GKE](/sql/docs/mysql/connect-kubernetes-engine) \n- [From Cloud Functions](/sql/docs/mysql/connect-functions) \n- [From Cloud Run](/sql/docs/mysql/connect-run)", "guide": "Cloud SQL"}