{"title": "Cloud SQL - Use System insights to improve system performance", "url": "https://cloud.google.com/sql/docs/postgres/use-system-insights", "abstract": "# Cloud SQL - Use System insights to improve system performance\nThis page describes how you can use the Cloud SQL System insights dashboard. The System insights dashboard displays metrics for the resources that your instance uses and helps you detect and analyze system performance problems.\n", "content": "## View the System insights dashboard\nTo view the System insights dashboard, do the following:\n- In the Google Cloud console, go to the **Cloud SQL Instances** page. [Go to Cloud SQL Instances](https://console.cloud.google.com/sql) \n- Click the name of an instance.\n- Select the **System insights** tab from the SQL navigation panel on the left.\nThe System insights dashboard opens.The System insights dashboard shows the following information:\n- Your instance details\n- [Events timeline](/sql/docs/postgres/use-system-insights#events_timeline) : shows the system events, in a chronological order. This information helps you evaluate the impact of system events on the health and performance of the instance.\n- [Summary cards](/sql/docs/postgres/use-system-insights#summary) : provide an overview of the instance health and performance by displaying the latest and aggregated values for the CPU utilization, disk utilization, and log errors metrics.\n- [Metrics charts](/sql/docs/postgres/use-system-insights#metrics) : show the information about the operating system and database metrics that help you gain insight into several issues, such as throughput, latency, and cost.\nThe dashboard offers the following high-level options:\n- To view either two charts side-by-side or only one chart per row, click **Customize view** . You can also use this option to choose the metrics to display on the dashboard.\n- To keep the dashboard up to date, enable the **Auto Refresh** option. When you enable **Auto Refresh** , the dashboard data is updated every minute.\n- The time selector shows `1 day` selected by default. To change the period, select one of the other predefined periods or click **Custom** and define a start and end time. Data is available for the last 30 days.\n- To create an absolute link to the dashboard, click the **Copy Link** button. You can share this link with other Cloud SQL users who have the same permissions.## Summary cards\nThe following table describes the summary cards displayed at the top of the System insights dashboard. These cards provide a brief overview of the instance's health and performance during the chosen time period.\n| Summary card    | Description                                                                     |\n|:----------------------------|:--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| CPU utilization - P99 | P50 | The P99 and P50 CPU utilization values over the selected period.                                                       |\n| Peak connections   | The ratio of the peak connections to the maximum connections for the selected period. The peak connection count might be higher than the maximum count in case the maximum count has recently changed, such as due to instance scaling or manually changing the max_connections setting. |\n| Transaction ID utilization | The latest transaction ID utilization value for the selected period.                                                      |\n| Disk utilization   | The latest disk utilization value.                                                               |\n| Log errors     | The number of errors that were logged.                                                              |\n## Metrics charts\nThe toolbar on each chart card provides the following set of standard options:\n- To hide or display the legend, click.\n- To view metric values for a specific moment in the selected period, move the cursor over the chart.\n- To view a chart in full-screen mode, click . To exit full-screen mode, click **Esc** .\n- To zoom a chart, click the chart and drag horizontally along the x-axis or vertically along the y-axis. To revert the zoom operation, click . Zoom operations apply at the same time to all charts on a dashboard.\n- To view additional options, click . Most charts offer these options:- **Download a PNG image** .\n- **View in Metrics Explorer** . View the metric in [Metrics Explorer](/monitoring/charts/metrics-explorer) . You can view other Cloud SQL metrics in the Metrics Explorer after selecting the **Cloud SQL Database** resource type.\n- **Add to custom dashboard** . Provide a name for the dashboard or select an existing custom dashboard. View and edit the dashboard using [Cloud Monitoring](#cloud-monitoring) .The following table describes the Cloud SQL metrics that appear by default on the Cloud SQL System insights dashboard.\n`cloudsql.googleapis.com/database/`\n**Note:** Cloud SQL for PostgreSQL instances with more than 500 databases report a single aggregated value for database metrics.\n[Launch stages](/monitoring/api/metrics#metric-stage) of these metrics: ,\n| Metric name and type                                             | Description                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                |\n|:--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|:---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| New connections per second BETA postgresql/new_connection_count                                   | The rate of the number of new connections that you create on your Cloud SQL for PostgreSQL instance, per second. Cloud SQL calculates and displays this metric per database. This metric is available for PostgreSQL version 14 and later.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        |\n| Wait event types BETA postgresql/backends_in_wait                                      | The number of connections for each wait event type in a Cloud SQL for PostgreSQL instance.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            |\n| Wait events BETA postgresql/backends_in_wait                                       | The number of wait events in a Cloud SQL for PostgreSQL instance. The dashboard displays this metric as wait event name:wait event type.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                |\n| Transaction count BETA postgresql/transaction_count                                      | The number of transactions in the commit and rollback states in a Cloud SQL for PostgreSQL instance.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         |\n| Memory components BETA memory/components                                        | The memory components available to the database. The value for each memory component is calculated as the percentage of the total memory available to the database.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          |\n| Max replica byte lag BETA postgresql/external_sync/max_replica_byte_lag                                 | The maximum replication lag (in bytes) among all the databases on the external server (ES) replica.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          |\n| Query latency GA postgresql/insights/aggregate/latencies                                    | The aggregated query latency distribution by P99, P95, and P50 per user and database. Only available for instances with Query insights enabled.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               |\n| Database load per database/user/client address GA postgresql/insights/aggregate/execution_time                           | The accumulated query execution time per database, user, or client address. This is the sum of CPU time, I/O wait time, lock wait time, process context switch, and scheduling for all processes involved in query execution. Only available for instances with Query insights enabled.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            |\n| CPU utilization GA cpu/utilization                                          | The current CPU utilization represented as a percentage of the reserved CPU that's currently in use.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         |\n| Disk storage by type GA disk/bytes_used_by_data_type                                     | The breakdown of instance disk usage by data types, including data, binlog, and tmp_data. This metric helps you understand your storage costs. For more information about storage usage charges, see Storage and networking pricing. Point-in-time recovery (PITR) uses write-ahead log (WAL) archiving. These logs update regularly and use storage space. Write-ahead logs are automatically deleted with their associated automatic backup, which generally happens after about 7 days. If the size of your write-ahead logs is causing an issue for your instance, you can increase your storage size, but the write-ahead log size increase in disk usage might be temporary. To avoid unexpected storage issues, Google recommends enabling automatic storage increases when using PITR. To delete the logs and recover storage, you can disable point-in-time recovery. Note, however, that decreasing the storage used does not shrink the size of the storage provisioned for the instance. Temp data is included in the storage usage metric. Temp data is removed as part of maintenance and is allowed to increase beyond user-defined capacity limits to avoid a disk full event, at no charge to the user. A newly created database uses about 100 MB for system tables and files.                                                                                                                                                                                                                                                                                                                                                                                                                      |\n| Disk storage by type GA disk/bytes_used_by_data_type                                     | The breakdown of instance disk usage by data types, including data, binlog, and tmp_data. This metric helps you understand your storage costs. For more information about storage usage charges, see Storage and networking pricing. Point-in-time recovery uses write-ahead logging (WAL) archiving. For new Cloud SQL instances that have point-in-time recovery enabled or for existing instances that enable point-in-time recovery after this feature for storing WAL logs in Cloud Storage is available, logs will no longer be stored on disk; instead they'll be stored in Cloud Storage in the same region as the instances. To see whether an instance's logs are stored in Cloud Storage, check the bytes_used_by_data_type metric for the instance. If the value for the archived_wal_log data type is 0, the instance's logs are stored in Cloud Storage. All other existing instances that have point-in-time recovery enabled continue to have their logs stored on disk. The change to storing logs in Cloud Storage will be made available at a later time. The write-ahead logs used in point-in-time recovery are deleted automatically with their associated automatic backup, which generally happens after the value set for transactionLogRetentionDays is met. This is the number of days of transaction logs that Cloud SQL retains for point-in-time recovery, from 1 to 7. For instances that have write-ahead logs stored in Cloud Storage, the logs are stored in the same region as the primary instance. This log storage (up to seven days, the maximum length for point-in-time recovery) generates no additional cost per instance. If your instance has point-in-time recovery enabled, and if the size of your write-ahead logs on disk is causing an issue for your instance, then disable point-in-time recovery and re-enable it to ensure that new logs are stored in Cloud Storage in the same region as the instance. This deletes existing write-ahead logs, so you can't perform a point-in-time restore earlier than the time that you re-enabled point-in-time recovery. However, although the existing logs are deleted, the disk size remains the same. To avoid unexpected storage issues, we recommend enabling automatic storage increases for all instances when using point-in-time recovery. This recommendation applies only if your instance has point-in-time recovery enabled and your logs are stored on disk. To delete the logs and recover storage, you can disable point-in-time recovery. Note, however, that decreasing the write-ahead logs used doesn't shrink the size of the disk provisioned for the instance. Temp data is included in the storage usage metric. Temp data is removed as part of maintenance and is allowed to increase beyond user-defined capacity limits to avoid a disk full event, at no charge to the user. A newly created database uses about 100 MB for system tables and files. |\n| Disk read/write ops GA disk/read_ops_count, disk/write_ops_count                                  | The Number of Reads metric indicates the number of read operations served from disk that do not come from cache. You can use this metric to understand whether your instance is correctly sized for your environment. If needed, you can move to a larger machine type to serve more requests from cache and reduce latency. The Number of Writes metric indicates the number of write operations to disk. Write activity is generated even if your application is not active because Cloud SQL instances, barring replicas, write to a system table approximately every second.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                     |\n| Connections by status GA postgresql/num_backends_by_state                                    | The number of connections grouped by these statuses: idle, active, idle_in_transaction, idle_in_transaction_aborted, disabled, and fastpath_function_call. For information about these statuses, see the state text row in the pg_stat_activity documentation.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  |\n| Connections per database GA postgresql/num_backends                                      | The number of connections held by the database instance.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                     |\n| Ingress/egress bytes GA network/received_bytes_count, network/sent_bytes_count                               | The network traffic in terms of the number of ingress bytes (bytes received) and egress bytes (bytes sent) to and from the instance, respectively.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                              |\n| IO wait breakdown by type GA postgresql/insights/aggregate/io_time                                  | The breakdown of I/O wait time for SQL statements by read and write types. Only available for instances with Query insights enabled.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 |\n| Deadlock count by database GA postgresql/deadlock_count                                     | The number of deadlocks per database.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         |\n| Block read count GA postgresql/blocks_read_count                                      | The number of blocks read per second from the disk and from the buffer cache.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               |\n| Rows processed by operation GA postgresql/tuples_processed_count                                  | The number of rows processed per operation per second.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                     |\n| Rows in database by state GA postgresql/tuple_size                                      | The number of rows for each database state. Cloud SQL reports this metric if the number of databases in the instance is less than 50.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 |\n| Oldest transaction by age GA postgresql/vacuum/oldest_transaction_age                                 | The age of the oldest transaction that's blocking the vacuum operation.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 |\n| WAL archiving GA replication/log_archive_success_count, replication/log_archive_failure_count                           | The number of write-ahead log files that were successfully or unsuccessfully archived per minute.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          |\n| Transaction ID utilization GA postgresql/transaction_id_utilization                                  | The percentage of transaction IDs used in the instance.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                     |\n| Connection count per application name GA postgresql/num_backends_by_application                               | The number of connections to the Cloud SQL instance, grouped by applications. Connections without an application name are grouped as Unknown.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               |\n| Rows fetched vs. rows returned vs. rows written Rows fetched GA: postgresql/tuples_fetched_count Rows returned GA: postgresql/tuples_returned_count Rows written GA: postgresql/tuples_processed_count | Rows fetched is the number of rows fetched as a result of queries in the instance. Rows returned is the number of rows scanned while processing the queries in the instance. Rows written is the number of rows written in the instance while performing insert, update, and delete operations. If the difference between rows returned and rows fetched is so large that their values aren't shown in the same scale, then the value of rows fetched is shown as 0 because it's negligible compared to the value of rows returned.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 |\n| Temp data size GA postgresql/temp_bytes_written_count                                     | The total amount of data (in bytes) used for query execution and performing algorithms such as join and sort.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       |\n| Temp files GA postgresql/temp_files_written_count                                      | The number of temporary files used for query execution and performing algorithms such as join and sort.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         |\nAlso, the Cloud Logging metric, ( `logging.googleapis.com/log_entry_count` ), shows the total numbers of error and warning log entries.\nThese are extracted from `postgres.log` , which is the database log, and `pgaudit.log` , which contains data access information.\nFor more information, see [Cloud SQL metrics](/sql/docs/postgres/admin-api/metrics) .\n## Events timeline\nThe dashboard provides the details of the following events:\n| Event name   | Description                                | Operation type |\n|:---------------------|:------------------------------------------------------------------------------------------------------------------------------------------|:-----------------|\n| Instance restart  | Restarts the Cloud SQL instance                           | RESTART   |\n| Instance failover | Initiates a manual failover of a high availability (HA) primary instance to a standby instance, which becomes the primary instance.  | FAILOVER   |\n| Instance maintenance | Indicates that the instance is currently in maintenance. Maintenance typically causes the instance to be unavailable for 1 to 3 minutes. | MAINTENANCE  |\n| Instance backup  | Performs an instance backup.                            | BACKUP_VOLUME |\n| Instance update  | Updates the settings of a Cloud SQL instance.                        | UPDATE   |\n| Promote replica  | Promotes a Cloud SQL replica instance.                         | PROMOTE_REPLICA |\n| Start replica  | Starts replication on a Cloud SQL read replica instance.                     | START_REPLICA |\n| Stop replica   | Stops replication on a Cloud SQL read replica instance.                     | STOP_REPLICA  |\n| Recreate replica  | Recreates resources for a Cloud SQL replica instance.                      | RECREATE_REPLICA |\n| Create replica  | Creates a Cloud SQL replica instance.                          | CREATE_REPLICA |\n| Data import   | Imports data into a Cloud SQL instance.                         | IMPORT   |\n| Instance export  | Exports data from a Cloud SQL instance to a Cloud Storage bucket.                   | EXPORT   |\n| Restore backup  | Restores a backup of a Cloud SQL instance. This operation might cause your instance to restart.           | RESTORE_VOLUME |\n## What's next\n- [About instance settings](/sql/docs/postgres/instance-settings) \n- [Cloud SQL metrics](/sql/docs/postgres/admin-api/metrics) \n- [REST Resource: instances](/sql/docs/postgres/admin-api/rest/v1beta4/instances)", "guide": "Cloud SQL"}