{"title": "Apigee - Suspend task", "url": "https://cloud.google.com/apigee/docs/api-platform/get-started/what-apigee", "abstract": "# Apigee - Suspend task\n**Announcement:** Application Integration is now available for your Google Cloud project. You can now use both Apigee Integration and Application Integration within the same Google Cloud project. [Learn more](/apigee/docs/api-platform/integration/using-application-integration)\nThe **Suspend** task lets you temporarily pause and then resume the execution of an integration.\nDuring an integration execution, when the control reaches a Suspend task, execution is halted, and all tasks after the Suspend task are suspended. Integration resumes the execution when any of the following events occur:\n- Expiry of the specified suspension time.\n- After receiving a resume execution request from the`Suspensions`API.\nYou can also configure an output variable ( **Suspension result** ) for the Suspend task and set it to any value and use the value to create branching conditions for executing the downstream tasks.\n", "content": "## Compare Approval task, Suspend task, and Timer task\nAll the three ( [Approval](/apigee/docs/api-platform/integration/approval-task) , [Suspend](/apigee/docs/api-platform/integration/run-suspend-task) , and [Timer](/apigee/docs/api-platform/integration/run-timer-task) ) tasks perform a similar function of pausing and resuming an integration. However, there are subtle differences among them. The following table describes the differences amongst the three tasks.\n| Approval task                                              | Suspend task                                                      | Timer task                                   |\n|:-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|:-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|:------------------------------------------------------------------------------------------------------------------------------------------------------|\n| Doesn't support automatic resumption of an integration and requires manual intervention to resume the integration.                     | Supports both manual and automatic resumption of an integration. If there is no manual intervention to revoke the suspension, the integration will automatically resume execution after the expiry of the suspension time limit. | Supports only automatic resumption of an integration. The integration execution automatically resumes after the exipry of the suspension time limit. |\n| Can't resume an integration via an API call. You must manually resolve the suspension by using the Integrations UI.                     | Can resume an integration by using the Suspensions API for integrations.                                       | Supports only automatic resumption of an integration.                         |\n| Users receive notification when an integration pauses (suspended).                                 | Users don't receive any notification when an integration pauses (suspended).                                      | Users don't receive any notification when an integration pauses (suspended).                   |\n| Supports a output variable (boolean), which allows you to perform conditional checks before resuming an integration. However, the output variable can only have the value as either true or false. | Supports a output variable (string), which allows you to perform conditional checks before resuming an integration. You can set any value to the output variable.                 | Doesn't support any output variables.                             |\n## Configure the Suspend task\nTo configure the **Suspend** task, perform the following steps:\n- In the [Apigee UI](https://apigee.google.com) , select your.\n- Click **Develop > Integrations** .\n- Select an existing integration or create a new integration by clicking **Create Integration** .If you are creating a new integration:- Enter a name and description in the **Create Integration** dialog.\n- Select a **Region** for the integration from the list of supported regions.\n- Click **Create** .\nThis opens the integration in the .\n- In thenavigation bar, click **+Add a task/trigger > Tasks** to view the list of available tasks.\n- Click and place the **Suspend** task element in the integration editor.\n- Click the **Suspend** task element on the designer to view the **Suspend** task  configuration pane.\n- Configure the remaining fields using the [Configuration properties](#params) for the task as detailed in the tables below.All changes to the properties are saved automatically.## Configuration properties\nThe following table describes the configuration properties of the Suspend task.\n| 0     | 1   | 2                                                                                                                     |\n|:------------------|:----------|:----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| Property   | Data type | Description                                                                                                                  |\n| Suspension Time | Integer | Time (in minutes) till which the integration execution must be suspended. The maximum time limit is 44640 minutes (31 days) which is also the default value. If the integration execution doesn't resume within the specified time limit, integration automatically resumes the execution after the expiry of the time limit and sets the value of the Suspension result variable to Expired.                     |\n| Suspension result | String | A variable to store the result of the Suspend task. Setting the value to this variable is optional. You can set this variable to any value based on your requirement. This variable is helpful if you want to have more control over your integration's execution flow. For example, you can read the suspension result and configure conditional decisions based on the value in any of your downstream tasks.                |\n| Suspension Id  | String | A unique identifier for the Suspend task. The value of this variable is set immediately after the integration is suspended. You can get the identifier value from the execution logs page in the integration UI. You can also get the get the identifier value from the response object of an API if you are using an API to trigger the integration. You can resume the integration execution either by using the suspension ID or by using the integration's execution ID. |\n## Revoke a suspension with the Suspensions API\nThe Suspensions API lets you revoke a suspension via a API call. To revoke a suspension with the **Suspensions** API, you must have either the execution ID of the integration or the suspension ID of the Suspend task. To revoke a suspension, you must issue a `POST` request to the following API:\n```\nhttps://REGION-integrations.googleapis.com/v1/{name=projects/PROJECT/locations/LOCATION/integrations/INTEGRATION_ID/executions/EXECUTION_ID/suspensions/SUSPENSION_ID}:lift\n \n```\nIn this API, the `` is optional. However, you must provide either the `` or the `` . If you don't have any of the ID values, you can substitute the value with `-` . In this API, `` , `` , and `` are required fields.\n**Note:** - If you don't specify both the execution ID and the suspension ID, the API doesn't run and reports an error.\n- If you don't specify the`suspension_result`, value of the suspension result  is set to`Resolved`.\nAfter you revoke the suspension, integration execution resumes and executes the downstream tasks after the Suspend task.\nThe following examples show how to revoke a suspension by using the **suspensions** API.\n## Error handling strategy\nAn error handling strategy for a task specifies the action to take if the task fails due to a [temporary error](/apigee/docs/api-platform/integration/error-handling) . For information about how to use an error handling strategy, and to know about the different types of error handling strategies, see [Error handling strategies](/apigee/docs/api-platform/integration/error-handling-strategy) .", "guide": "Apigee"}