{"title": "Apigee - Step 5: Create an environment group", "url": "https://cloud.google.com/apigee/docs/api-platform/get-started/what-apigee", "abstract": "# Apigee - Step 5: Create an environment group\nYou are currently viewing version 1.4 of the Apigee hybrid documentation. **This version is end of life.** You should upgrade to a newer version. For more information, see [Supported versions](/apigee/docs/hybrid/supported-platforms#supported-versions) .\nIn this step, you will create an environment and an environment group.\nIn Apigee, API proxies are deployed to , which provide isolated contexts for your proxies. Environments are organized into , which provide hostnames for all the proxies deployed to environments within the group. You must have at least one environment and at least one environment group. To learn more, see [About environments and environment groups](/apigee/docs/api-platform/fundamentals/environments-overview) .\n", "content": "## \n Create an environment\nCreate the environment first before creating the environment group. You can create an environment using the Apigee hybrid UI or using the CLI. You may want to use the UI for these steps to familiarize yourself with it.\nTo access the hybrid UI and add an environment, perform the following steps:- Open the [Apigee UI](https://apigee.google.com) . If this is the first time you are logging in, hybrid displays a  consent dialog. If you are prompted to select from more than one account, choose the account  that owns the project you created in [Step 2: Create a Google Cloud project](/apigee/docs/hybrid/v1.4/precog-gcpproject) . Then click **Allow** .\n- Your browser navigates to the hybrid UI main landing page:\n- Ensure that your hybrid-enabled organization is selected from the organization drop-down list.  If it is not selected, select it from the drop-down list, as the following example shows: **Note:** When you select a hybrid-enabled organization from the drop-down list, the hybrid  UI displays the Apigee organization name and the Google Cloud project name in the header.  The Apigee organization name and Google Cloud project name are the same.\n- Click **Admin > Environments > Overview** .The **Environments** view is displayed, with no environments (yet):\n- Click **+Environment** .The **New environment** dialog is displayed:\n- Enter the following information in the **New Environment** dialog:- **Display name** **(Required)** : A friendly name for the environment that is used in the UI.   For example,`My First Environment`or`test`. Unlike the **Environment\n  name** , the **Display name** can include uppercase and other special   characters.\n- **Environment name** **(Required)** : The programmatic name for the environment; also known   as the.For example, `my-environment` or `test` . **Caution:** An environment name can contain only lowercase   letters, numbers, and hyphens. You cannot use uppercase letters or any other special   characters. In addition, the **Environment name** can be up to a maximum of   32 characters long. For example:`my-test-env`or`my-test-env-42`.The **Display name** and the **Environment name** can be   different.\n- **Description** (): Additional information about the environment that   you want to add as a reminder of the purpose of the environment. For example,`Created   during initial installation`.\n- Click **Create** .Apigee creates the new environment and indicates that it is **Pending Provisioning** :In a few moments, it changes to :However, you're not quite done. You also need to add your new environment to the  runtime's `overrides.yaml` file—but first you've got to install the runtime,  so let's not get ahead of ourselves.\nTo create an environment with the [Create  environments API](/apigee/docs/reference/apis/apigee/rest/v1/organizations.environments) , perform the following steps:- Open a terminal on the device you are using to manage Apigee.\n- On the command line, get your `gcloud` authentication credentials, as the following example shows:```\nTOKEN=$(gcloud auth print-access-token)\n```To check that your token was populated, use `echo` , as the following example shows:```\necho $TOKEN\n```This should display your token as an encoded string.For more information, see [gcloud command-line tool overview](https://cloud.google.com/sdk/gcloud/) .\n- Create environment variables for the elements of the environment. You will use the following variable in   the command to create it:- **ENV_NAME** **(Required)** is the programmatic ID for your    environment. The environment name can contain lowercase letters, dashes, and numbers and    must start with a lowercase letter. This name will be used as the identifier and cannot be    changed after creation```\nexport ENV_NAME=ENVIRONMENT_NAME\n```\n- **ENV_DISPLAY_NAME** **(Required)** is the user-friendly name    of your environment. This value does not need to be unique, and can include spaces and    special characters. For example, \"My Example Environment\".```\nENV_DISPLAY_NAME=FRIENDLY_NAME\n```\n- **ORG_NAME** **(Required)** is your organization ID. Make sure you    have defined the`ORG_NAME`environment variable from [Step 4: Create an organization](/apigee/docs/hybrid/v1.4/precog-provision) :```\necho $ORG_NAME\n```\n- **ENV_DESCRIPTION** is information about the    environment that you'd like to use as a reminder of its purpose. For example, \"Example    environment for Apigee Hybrid instructions\".```\nENV_DESCRIPTION=DESCRIPTION_TEXT\n```\n- Send an authenticated`POST`request to the Create environments API. **Note:** After you create a hybrid-enabled organization,   you cannot delete the organization, change the organization ID, or change the Google Cloud project that is   bound to your organization. To change any of these things, contact [Apigee Support](https://cloud.google.com/apigee/support/) .The following example shows the request structure that creates an organization, using the following command:```\ncurl -H \"Authorization: Bearer $TOKEN\" -X POST -H \"content-type:application/json\" -d '{\n \"name\": \"'\"$ENV_NAME\"'\",\n \"displayName\": \"'\"$ENV_DISPLAY_NAME\"'\",\n \"description\": \"'\"$ENV_DESCRIPTION\"'\"\n }' \"https://apigee.googleapis.com/v1/organizations/$ORG_NAME/environments\"\n```On a successful creation request, the Environments API should respond with a message similar  to the following:```\n{  \"name\": \"organizations/hybrid-example/operations/c2aee040-7e79-4fd4-b0cf-79ca1b7098a8\",  \"metadata\": {    \"@type\": \"type.googleapis.com/google.cloud.apigee.v1.OperationMetadata\",    \"operationType\": \"INSERT\",    \"targetResourceName\": \"organizations/hybrid-example/environments/example-env\",    \"state\": \"IN_PROGRESS\"  }}\n```As the `state` property in the response indicates, Apigee has started to create  the new environment, so its state is `IN_PROGRESS` . This process can take several  minutes.## \n Create an environment group\nNow create an environment group and assign the environment you just created to it.  Environment groups allow you to group environments together, and provide the hostnames for  routing the proxies deployed to the environments within the group. You must create at least  one environment group, and you must assign at least one hostname to the group. For an overview  of environment groups, see [About environments and  environment groups](/apigee/docs/api-platform/fundamentals/environments-overview) .\n**Note: ** Every environment group you create with an attached environment must be included in all override files where the environment is used.\nTo create an environment group using the Apigee UI, perform the following steps:- Open the [Apigee UI](https://apigee.google.com) .\n- Your browser navigates to the hybrid UI main landing page.\n- Ensure that your hybrid-enabled organization is selected from the organization drop-down list.   If it is not selected, select it from the drop-down list.\n- Click **Admin > Environments > Groups** .The **Environment Groups Overview** view is displayed, with any created environment groups: \n- Click **+Environment Group** .The **Add an Environment Group** dialog is displayed. \n- Enter a name and then click **Add** .\n- Hold the pointer over the newly-created environment group and then click **Edit** edit .Add a hostname that all proxies deployed to environments within this group will use. This   should be a domain you have management access to. If you need to register a domain, see a   domain registrar like [Google Domains](https://domains.google) .\n- \n- Click **Add (+)** .\n- The **Add environment** dialog displays.\n- \n- Select an environment from the list and then click **Add** .\nTo create an environment group using the command line, perform the following steps:- On the command line, get your `gcloud` authentication credentials, as the following example shows:```\nTOKEN=$(gcloud auth print-access-token)\n```To check that your token was populated, use `echo` , as the following example shows:```\necho $TOKEN\n```This should display your token as an encoded string.For more information, see [gcloud command-line tool overview](https://cloud.google.com/sdk/gcloud/) .\n- Make sure you have the **DOMAIN** environment variable set as the following example shows:```\necho $DOMAIN\n```This is the hostname that all proxies deployed to environments within this group will   use. This should be a domain you have management access to.If it is not set, create it with the domain you plan to use for your Apigee hybrid installation.   For example:```\nexport DOMAIN=YOUR-DOMAIN.COM\n```\n- Make sure you have the **ENV_NAME** environment variable set to the environment you just   created in the previous steps. For example:```\necho $ENV_NAME\n```\n- Create an environment variable for your intended environmnet group name. For example:```\nexport ENV_GROUP=ENVIRONMENT_GROUP_NAME\n```\n- Create the environment group with the following command:```\ncurl -H \"Authorization: Bearer $TOKEN\" -X POST -H \"content-type:application/json\" \\\n -d '{\n  \"name\": \"'\"$ENV_GROUP\"'\",\n  \"hostnames\":[\"'\"$DOMAIN\"'\"]\n }' \\\n \"https://apigee.googleapis.com/v1/organizations/$ORG_NAME/envgroups\"\n \n```\n- Assign the environment to the new group with the following command:```\ncurl -H \"Authorization: Bearer $TOKEN\" -X POST -H \"content-type:application/json\" \\\n -d '{\n  \"environment\": \"'\"$ENV_NAME\"'\",\n }' \\\n \"https://apigee.googleapis.com/v1/organizations/$ORG_NAME/envgroups/$ENV_GROUP/attachments\"\n \n```\n**Congratulations!** Now that you've created a Google Cloud account and project, provisioned an org, enabled the  necessary APIs, and created a new environment and environment group, you're ready  to install and set up the Apigee hybrid runtime.\n## Next step\nTo continue with the installation, see [Part 2: Hybrid runtime setup: Before you begin](/apigee/docs/hybrid/v1.4/install-before-begin) .", "guide": "Apigee"}