{"title": "Apigee - Where is your data stored?", "url": "https://cloud.google.com/apigee/docs/api-platform/get-started/what-apigee", "abstract": "# Apigee - Where is your data stored?\nYou are currently viewing version 1.1 of the Apigee hybrid documentation. **This version is end of life.** You should upgrade to a newer version. For more information, see [Supported versions](/apigee/docs/hybrid/supported-platforms#supported-versions) .\nThis section explains which data is stored in your local runtime plane for Apigee hybrid, and which data is maintained in the management plane (in the Apigee Cloud).\n", "content": "## Data stored in the runtime plane\nYou manage the runtime plane services, including data stored in the runtime plane. The following data is stored by the runtime Cassandra (and accessed from or by the management plane through MART):\n- **Key management system (KMS) data** , including  companies, developers, developer apps, API products, OAuth tokens  (including access and refresh tokens, and authorization codes), and API keys\n- **Key value map** (KVM) data (can be created/managed using KVM policies)\n- **Environment cache** data\n- **OAuth data** , including access tokens, refresh tokens, and authorization  codes\n- **Quota data** , including buckets and counters## Data stored in the management plane\nThe following data is stored in the management plane:\n- [API proxies](/apigee/docs/api-platform/fundamentals/build-simple-api-proxy) \n- [TargetServers](/apigee/docs/api-platform/reference/api-proxy-configuration-reference#baseconfiguration-baseconfigurationelements) \n- [Keystores](/apigee/docs/reference/apis/apigee/rest/v1/organizations.environments.keystores) \nYou create these entities in the management plane (for example, in the hybrid UI or with the [Apigee APIs](/apigee/docs/reference/apis/apigee/rest) ), and the related data is replicated in the runtime plane by the Synchronizer, which pulls this data down and stores it in the runtime plane where the MP can access it.\nFor more information, see [Synchronizer](/apigee/docs/hybrid/v1.1/what-is-hybrid#synchronizer) .\n## Data sent from the runtime plane to the management plane\nThe runtime plane sends the following data (asynchronously) to the management plane:\n- Analytics\n- Deployment status events\n- Debug data## Data sent to Stackdriver for your GCP project\n- Log data\n- Metrics## Data stored only in the management plane\n- Audit logs\n- RBAC\n- Users\nFor information about the various types of data generated by the hybrid services, and the mechanisms by which hybrid collects and surfaces this data to you, see [Data collection overview](/apigee/docs/hybrid/v1.1/data-collection-overview) .", "guide": "Apigee"}