{"title": "Apigee - Configure alerts", "url": "https://cloud.google.com/apigee/docs/api-platform/get-started/what-apigee", "abstract": "# Apigee - Configure alerts\n**Announcement:** Application Integration is now available for your Google Cloud project. You can now use both Apigee Integration and Application Integration within the same Google Cloud project. [Learn more](/apigee/docs/api-platform/integration/using-application-integration)\nYou can configure alerts to notify you when an event occurs. For example, you can create an alert to notify you when there is an authentication failure by an integration.\nYou can set alerts in the following two ways:\n- [Alerts in Cloud Monitoring](#alert-cloud-monitoring) \n- [Alerts in Cloud Logging](#alert-cloud-logging) ", "content": "## Alerts in Cloud Monitoring\nYou can create and configure Cloud Monitoring alerts to notify you when an Apigee Integration resource exceeds a specified threshold. For example, you can create an alert to notify you when the total data processed for an integration exceeds a specified threshold value or if integration execution count reaches beyond a certain limit.\nFor more information about alerting in Cloud Monitoring, see [Alerting overview](/monitoring/alerts) .\n### Before you begin\n- Make sure that you have the **Monitoring Editor (roles/monitoring.editor)** IAM role granted on your Google Cloud project. For information about granting roles, see [Manage access](/iam/docs/granting-changing-revoking-access) .\n- Learn about the general concepts of alerting policies, see [Alerting overview](/monitoring/alerts) .\n- Configure notification channels to receive alerts, see [Create and manage notification channels](/monitoring/support/notification-options) .\n### Create an alert\n- In the Google Cloud console, go to the **Monitoring > Alerting** page. [Go to Alerting](https://console.cloud.google.com/monitoring/alerting) \n- Click **+ Create Policy** .\n- To select the resource, metric, and filters for Apigee Integration, follow these steps:- Click **Select a metric** .\n- In the **Filter by resource or metric name** input field, enter`Integration Version`and select it.\n- In the **Active metric categories** menu, select a metrics type, and then **Active Metrics** . For a list of metrics types, see [integrations metric type](/monitoring/api/metrics_gcp#gcp-integrations) .\n- Click **Apply** .\n- Click **Next** to open the **Configure alert trigger** section.\n- Set a threshold value to trigger the alert.\n- Click **Next** to open the **Configure notifications and finalize alert ** section.\n- (Optional) To add notifications to your alerting policy, click **Notification channels** and select one or more notification  channels from the drop-down list. Click **OK** .To be notified when incidents are opened and closed, check **Notify on incident closure** . By default, notifications are sent only when  incidents are opened.\n- (Optional) Use the **Documentation** text field to enter any information that you  want included in a notification message.\n- Click **Alert policy name** and enter a name for the alerting policy.\n- Click **Create Policy** .\nFor more sample alerts, see [Alert policy templates for Apigee Integration](https://github.com/GoogleCloudPlatform/monitoring-dashboard-samples/tree/master/alerts/google-application-integration) .\nThe alerts are sent to the essential contacts configured in your Google Cloud Project. For more information on adding essential contacts, see [Managing contacts for notifications](/resource-manager/docs/managing-notification-contacts) .\n## Alerts in Cloud Logging\nYou can create and configure log-based alerts to notify you whenever a specific message appears in your included logs. For example, the following lists some use cases for which you can create a log-based alert: messages that match a specific pattern, failed integration execution status, specific severity log, and integrations with the execution time time higher than certain value.\n### Create an alert\nYou can create log-based alerts from the **Logs Explorer** page in the Google Cloud console or by using the Monitoring API. For detailed instructions, see the following sections:\n- [Create a log-based alert by using the Logs Explorer](/logging/docs/alerting/log-based-alerts#lba-definition) \n- [Create a log-based alert by using the Monitoring API](/logging/docs/alerting/log-based-alerts#lba-by-api) \n**Note:** You may incur additional charges for using Cloud Monitoring API directly. For more information, see [Cloud Monitoring pricing](/monitoring#section-7) .\n## What's next\n- Learn more about [configuring log-based alerts](/logging/docs/alerting/log-based-alerts) .", "guide": "Apigee"}