{"title": "Apigee - Step 3: Create the apigee namespace", "url": "https://cloud.google.com/apigee/docs/api-platform/get-started/what-apigee", "abstract": "# Apigee - Step 3: Create the apigee namespace\nThis step explains how to create the `apigee` Kubernetes namespace in which most Apigee hybrid components operate.\nCreate the namespace that will be used for most Apigee hybrid resources.  This should match the `namespace` field in the `overrides.yaml` file. If this is not present in `overrides.yaml` , the  default namespace is `apigee` .\n**Note:** You can use any namespace.`apigee`is the default namespace. If you use a different namespace, be sure to replace`apigee`with the name of your namespace in the following commands.\n- Check if the namespace already exists:```\nkubectl get namespace apigee\n```If the namespace exists, your output includes:```\nNAME     STATUS   AGEapigee   Active   1d\n```\n- If the namespace does not already exist, create it:```\nkubectl create namespace apigee\n```\nNow that hybrid has a space to operate in, the next step is to create the Google Cloud service accounts and credentials required to configure hybrid runtime components\n", "content": "## Next step\nstepper_buttons is defined in localvars Iterate over all the buttons in the data dictionary If the button's step matches the current step in the process, make the button disabled [1](/apigee/docs/hybrid/v1.11/helm-install-create-cluster) If the button's step matches the current step in the process, make the button disabled [2](/apigee/docs/hybrid/v1.11/helm-install-download-charts) If the button's step matches the current step in the process, make the button disabled If the button's step matches the next step [3](/apigee/docs/hybrid/v1.11/helm-install-create-namespace) If the button's step matches the current step in the process, make the button disabled In all other cases (previous buttons or future buttons (after the next one), make them links [(NEXT) Step 4: Set up service accounts](/apigee/docs/hybrid/v1.11/helm-install-service-accounts) If the button's step matches the current step in the process, make the button disabled [5](/apigee/docs/hybrid/v1.11/helm-install-create-tls-certificates) If the button's step matches the current step in the process, make the button disabled [6](/apigee/docs/hybrid/v1.11/helm-install-create-overrides) If the button's step matches the current step in the process, make the button disabled [7](/apigee/docs/hybrid/v1.11/helm-install-enable-synchronizer-access) If the button's step matches the current step in the process, make the button disabled [8](/apigee/docs/hybrid/v1.11/helm-install-cert-manager) If the button's step matches the current step in the process, make the button disabled [9](/apigee/docs/hybrid/v1.11/helm-install-crds) If the button's step matches the current step in the process, make the button disabled [10](/apigee/docs/hybrid/v1.11/helm-install-check-cluster) If the button's step matches the current step in the process, make the button disabled [11](/apigee/docs/hybrid/v1.11/helm-install-helm-charts) If the button's step matches the current step in the process, make the button disabled [12](/apigee/docs/hybrid/v1.11/helm-install-workload-identity)", "guide": "Apigee"}