{"title": "Apigee - Step 5: Add a new environment in the hybrid UI", "url": "https://cloud.google.com/apigee/docs/api-platform/get-started/what-apigee", "abstract": "# Apigee - Step 5: Add a new environment in the hybrid UI\nYou are currently viewing version 1.1 of the Apigee hybrid documentation. **This version is end of life.** You should upgrade to a newer version. For more information, see [Supported versions](/apigee/docs/hybrid/supported-platforms#supported-versions) .\nYou can now try out the hybrid UI and add a new environment. Without an environment, you have nowhere to deploy your API proxies. Additionally, if you don’t create an environment as described in this section, then several steps in the hybrid runtime installation process will fail.\nThe hybrid UI includes functionality that lets you do the following in a hybrid-enabled organization:\n- Create, edit, and delete environments\n- Assign environment-level access control to GCP project users\n- Deploy and undeploy API proxies to your cluster\n- Get the deployment status of pods in your cluster\n**To access the hybrid UI and add an environment:**\n- Open the [Apigee UI](https://apigee.google.com) .If this is the first time you are logging in, hybrid displays a consent dialog box:\n- If you are prompted to select from more than one account, choose the account that owns the  project you created in [Step 2: Create a Google Cloud project](/apigee/docs/hybrid/v1.1/precog-gcpproject) .\n- Click **Allow** .Your browser navigates to the hybrid UI main landing page:\n- Ensure that your hybrid-enabled organization is selected from the organization drop-down list.  If not, select it from the drop-down list, as the following example shows:Note that when you select a hybrid-enabled organization from the drop-down list, the hybrid  UI displays the Apigee organization name and the GCP project name in the header. In many cases,  the Apigee organization name and GCP project name are the same.\n- Click **Admin > Environments > Overview** .The **Environments** view is displayed, with no environments (yet):\n- Click **+Environment** in the upper right corner of the UI.The **Define a new environment** dialog box is displayed:\n- Enter the following information in the **New Environment** dialog box:- **Display name:** A friendly name for the environment that is used in the UI.   For example, \"My First Environment\" or \"test\". Unlike, the **Environment\n  name** , the **Diplay name** can include upper case and other special   characters. Required.\n- **Environment name:** The programmatic name for the environment; also known   as the. Required.For example, \"my-environment\" or \"test\".An environment name can contain only lower-case   letters, numbers, and hyphens. You cannot use upper-case letters or any other special   characters. In addition, the **Environment name** can be up to a maximum of   32 characters long. For example:`my-test-env`or`my-test-env-42`.You will also use this name in the `overrides.yaml` file when you [install the hybrid runtime](/apigee/docs/hybrid/v1.1/install-before-begin) .The **Display name** and the **Environment name** can be   different.\n- **Description:** Additional information about the environment that   you want to add as a reminder of the purpose of the environment. For example, \"Created   during initial installation\". Optional.\n- Click **Create** .Apigee creates the new environment and indicates that it is \"Pending Provisioning\":In a few moments, it will be \"provisioned\":However, you’re not quite done. You also need to add your new environment to the  runtime’s overrides.yaml file—but first you've got to install the runtime,  so let's not get ahead of ourselves.\n**Congratulations!** Now that you've created a GCP account and project, gotten an org provisioned, had a snack, added some service accounts and other users, and created a new environment, you're ready to install the hybrid runtime on your Kubernetes cluster.\n", "content": "## Next step\nTo continue with the installation, see [Runtime installation: Before you begin](/apigee/docs/hybrid/v1.1/install-before-begin) .", "guide": "Apigee"}