{"title": "Apigee - Apigee Adapter for Envoy overview", "url": "https://cloud.google.com/apigee/docs/api-platform/get-started/what-apigee", "abstract": "# Apigee - Apigee Adapter for Envoy overview\n", "content": "## What is Apigee Adapter for Envoy?\nApigee Adapter for Envoy is an Apigee-managed API gateway that uses [Envoy](https://www.envoyproxy.io/docs/envoy/latest/intro/what_is_envoy) to proxy API traffic. Envoy is a popular, open source edge and service proxy designed for cloud-native applications. You can run Apigee Adapter for Envoy on premises or in a multi-cloud environment.\nWith Apigee Adapter for Envoy, you get a relatively small footprint API gateway application running close to your backend applications. Apigee Adapter for Envoy relies on Apigee for:\n- API authentication and authorization (with API keys and OAuth)\n- Quota management\n- API analytics## \n Installation options\nYou can use the Apigee Adapter for Envoy in the following context:\n- As a service deployed to the Istio service mesh integrated with Apigee hybrid. See [ Using Apigee Adapter for Envoy with Apigee hybrid](/apigee/docs/api-platform/envoy-adapter/v1.0.x/example-hybrid) .## \n Apigee Adapter for Envoy\nThe following figure shows the high level architecture for Apigee Adapter for Envoy. This architecture consists of management plane components deployed on Google Cloud Platform (GCP) and data plane components running remotely on premises or in a cloud provider environment. The data plane includes the Envoy proxy and Apigee Remote Service. The role of each component is described following the figure.- A consumer or client app accesses an API endpoint exposed by the Envoy proxy.\n- The Envoy proxy passes the security context (using HTTP headers) to the Apigee Remote Service. The Apigee Remote Service acts as a policy decision point (PDP) and advises Envoy to allow or deny access to the API consumer for the request.\n- If the call is allowed, the Envoy proxy forwards the request to the backend.\n- The Apigee Remote Service asynchronously polls the management plane and downloads proxy, API product, and  other configuration that it needs to operate.## Why use Apigee Adapter for Envoy?\nMoving the API management component close to backend target applications can reduce network latency. While you can install Apigee on-premises in a private cloud, a full deployment of Apigee is necessarily large and complex to support its full feature-set and data-heavy features like key management, monetization, and analytics. This means that deploying Apigee on premises in each data-center is not always desirable.\nBenefits of using Apigee Adapter for Envoy include:\n- Reduced latency of API traffic for services that run in close proximity.\n- Use of the full suite of Edge Analytics metrics, dashboards, and APIs.\n- Keeps API traffic within the enterprise-approved boundaries for security or compliance  purposes.\n- Asynchronous communication with Apigee allows API traffic data to be captured and  sent to Apigee without affecting latency.\n- If internet connection is lost, the Envoy proxy continues to operate  and process API calls normally. When connectivity is restored, the adapter syncs  to the Apigee management plane to pull down the latest configuration data.## \n Next step\n[Install Apigee Adapter for Envoy](/apigee/docs/api-platform/envoy-adapter/v1.0.x/getting-started)", "guide": "Apigee"}