{"title": "Apigee - APIs overview", "url": "https://cloud.google.com/apigee/docs/api-platform/get-started/what-apigee", "abstract": "# Apigee - APIs overview\n**    Preview    — Apigee API hub ** This feature is subject to the \"Pre-GA Offerings Terms\" in the General Service Terms section   of the [Service Specific Terms](/terms/service-terms#1) .     Pre-GA features are available \"as is\" and might have limited support.    For more information, see the [launch stage descriptions](/products#product-launch-stages) .\nThe **API** page provides detailed information about an API. When you  select an API from the **APIs** list page, the API page **Overview** tab is displayed.\nThe **Overview** tab has the following sections:\n- [General](#general) \n- [Scorecard](#scorecard) \n- [Deployments](#deployments) \n- [Versions](#versions) \n- [Related](/apigee/docs/api-hub/dependencies#related) \n- [Dependencies](/apigee/docs/api-hub/dependencies#dependencies) ", "content": "## General\nThe general pane displays top-level information about an API, including the following:\n- **Display name:** Display name for the API. Defined when registering the API. To edit   the display name, see [   Edit API registration details](/apigee/docs/api-hub/register-apis#edit-api-registration-details) .\n- **Description:** Description of the API. Defined when registering the API. To edit   the description, see [Edit API   registration details](/apigee/docs/api-hub/register-apis#edit-api-registration-details) .\n- System and custom [taxonomy elements](/apigee/docs/api-hub/taxonomies) \n- **Document version:** A link that opens the spec revision currently assigned to the   deployment. This button appears only if the API has a recommended deployment set, and   that deployment has a [version](/apigee/docs/api-hub/versions) assigned.\n- **Get access** : Provides instructions on how to access this API. To modify these   instructions, see [Edit deployment](/apigee/docs/api-hub/deployments#edit) .   This button appears only when there is a recommended deployment set.\nIf unknown labels or tags are attached through the public API, they are not displayed in the UI.  Only labels that define known taxonomies are displayed.\nTaxonomy values can be assigned a text description or URL. In this pane, if a taxonomy value is  assigned a text description, an info info icon  is displayed next to the value that when hovered over, displays the description. If the value  is a URL, the taxonomy value displayed becomes a hyperlink that opens the URL in a new browser  tab. See [Add taxonomy](/apigee/docs/api-hub/taxonomies#add-taxonomy) for more  information.\n**Required permissions:** You must have [ edit permissions](/apigee/docs/api-hub/get-started-api-hub#roles) to make changes to an API registration.\n### Edit an API\nSee [ Edit API registration details](/apigee/docs/api-hub/register-apis#edit-api-registration-details) .\n### Delete an API\nSee [Delete API](/apigee/docs/api-hub/register-apis#delete-api) .\n## Scorecard\nScorecards help teams understand how the quality of an API has been  measured. Across a portfolio of APIs, a thoughtful approach to scoring can  help drive consistency across different areas, such as design standards,  security profiles, reliability, or other dimensions that are important to  the business. API hub comes with OpenAPI linting already configured.\nA scorecard represents a group of scores that are not easily reduced to a  single quantity.\nA score is a single value that represents some aspect of the quality of an  API. Quality can be defined in any context (design, reliability, compliance,  etc.) and is often a matter of opinion.\n### Hide the scorecard\nTo hide the scorecard UI for every API, see [ Disable or enable API scorecard](/apigee/docs/api-hub/customize-display#disable-score) .\n### Select scorecard version\nSelect the version to use for the scorecard in the **Score this spec** drop-down list:\nWhere:\n- **Latest:** This spec revision has the most recent upload  timestamp.\n- **Recommended:** This spec has one of its revisions assigned to  the recommended deployment. Use this spec if you are a consumer of the  API.\n### Customize the scorecard\nTo customize and configure the scorecard, use the [  registry command line tool](https://github.com/apigee/registry/tree/main/cmd/registry) .\nSee also: [  How are scores calculated?](https://github.com/apigee/registry-experimental/tree/main/samples#how-are-scores-calculated)\nIf you want to display a status icon next to the errors and warnings  on the scorecard, [  define thresholds](https://github.com/apigee/registry-experimental/blob/main/samples/googleapis-openapi/artifacts/apihub-lint-error-percentage.yaml#L24) :\nWhere:\n| Type | Icon | Description                  |\n|:--------|-------:|:--------------------------------------------------------------------------------|\n| Alert | nan | Display this icon when the threshold is within the range defined for alerts. |\n| Warning | nan | Display this icon when the threshold is within the range defined for warnings. |\n| OK  | nan | Display this icon when the threshold is within the range defined for OK.  |\n### Lint summary\nThe API hub scorecard default configuration reports lint warnings and  lint errors for [  OpenAPI v2](https://swagger.io/specification/v2/) and [  OpenAPI v3](https://swagger.io/specification/) specifications that have been [uploaded](/apigee/docs/api-hub/revisions#add-revision) to  API hub. API hub and registry include a default linter based on [Spectral](https://meta.stoplight.io/docs/spectral) .  This linter is provided as a reference example of linting capabilities  (with no expectation of support for Spectral itself), using the [  OpenAPI Rules ruleset](https://meta.stoplight.io/docs/spectral/4dec24461f3af-open-api-rules) with some exceptions enabled to reduce noise  from common errors. Extending with custom linters is not currently  supported.\nSee [  API Style Guides in the Registry](https://github.com/apigee/registry-experimental/blob/main/lint/style_guide_documentation.md) for instructions on updating the  linter configuration.\n## Deployments\n**Required permissions:** You must have [ edit permissions](/apigee/docs/api-hub/get-started-api-hub#roles) to make changes to an API deployment.\nThe **Deployments** tab displays all deployments for the API configured by the API Editor.  Deployments represent live environments where the API is deployed. Deployments are  ordered (descending) by the **Environment** name. The following information is displayed:\n- Environment\n- Documentation\n- Recommended deployment indicatorpush_pin\n- Gateway\n- Usage guidance\n- External channel\n- Get access\nFor more information, see [Manage deployments](/apigee/docs/api-hub/deployments) .\n## Versions\nThe **Versions** tab displays all versions that have been defined for the API. Versions are  ordered (descending) by version number. The following information is displayed:\n- Version\n- Lifecycle stage\n- Last revision\n- End of life\nFor more information, see [Manage versions](/apigee/docs/api-hub/versions) .\n## Related\nThe **Related** pane, displayed at the bottom of the API **Overview** page, provides  links to miscellaneous information related to the API. For example, implementation source code,  design documentation, and infrastructure systems. For more information, see [Related](/apigee/docs/api-hub/dependencies#related) .## Dependencies\nThe **Dependencies** pane, displayed at the bottom of the API **Overview** page,  lists all dependencies of the API, including other internal APIs  (present in API hub), external third-party APIs (not present in API hub), and  other production systems. For example, databases and storage solutions. For more  information, see [Dependencies](/apigee/docs/api-hub/dependencies#dependences) .## What's next?\n- [Manage versions](/apigee/docs/api-hub/versions) \n- [Manage deployments](/apigee/docs/api-hub/deployments) \n- [Manage revisions](/apigee/docs/api-hub/revisions) \n- [Declare dependencies](/apigee/docs/api-hub/dependencies)", "guide": "Apigee"}