{"title": "Apigee - Step 9: Install the Apigee hybrid CRDs", "url": "https://cloud.google.com/apigee/docs/api-platform/get-started/what-apigee", "abstract": "# Apigee - Step 9: Install the Apigee hybrid CRDs\nThis step explains how to install the Custom Resource Definitions (CRDs) for Apigee hybrid.\n", "content": "## Install the Apigee CRDs:\n**Note:** From this step onwards, all commands should be run from`$APIGEE_HELM_CHARTS_HOME`directory.\n**Note:** This is the only supported method for installing Apigee CRDs. Do not use`kubectl apply`without`-k`, do not omit`--server-side`.\n**Note:** This step requires elevated cluster permissions.\n- Perform a dry-run of the installation by running   the following command:```\nkubectl apply -k apigee-operator/etc/crds/default/ \\\n --server-side \\\n --force-conflicts \\\n --validate=false \\\n --dry-run=server\n```\n- After checking the installation with `--dry-run` , install the Apigee CRDs with   the following command:```\nkubectl apply -k apigee-operator/etc/crds/default/ \\\n --server-side \\\n --force-conflicts \\\n --validate=false\n```\n- Validate the installation with the`kubectl get crds`command:```\nkubectl get crds | grep apigee\n```Your output should look something like the following:```\napigeedatastores.apigee.cloud.google.com     2023-10-09T14:48:30Z\napigeedeployments.apigee.cloud.google.com     2023-10-09T14:48:30Z\napigeeenvironments.apigee.cloud.google.com     2023-10-09T14:48:31Z\napigeeissues.apigee.cloud.google.com      2023-10-09T14:48:31Z\napigeeorganizations.apigee.cloud.google.com     2023-10-09T14:48:32Z\napigeeredis.apigee.cloud.google.com       2023-10-09T14:48:33Z\napigeerouteconfigs.apigee.cloud.google.com     2023-10-09T14:48:33Z\napigeeroutes.apigee.cloud.google.com      2023-10-09T14:48:33Z\napigeetelemetries.apigee.cloud.google.com     2023-10-09T14:48:34Z\ncassandradatareplications.apigee.cloud.google.com   2023-10-09T14:48:35Z\n```\n**Note:** You may see warnings about deprecated terms. This will not  impact the installation of the Apigee hybrid CRDs.\nYou have now installed the structure for Apigee hybrid. Next you will check the readiness of your Kubernetes cluster before installing the Apigee Helm charts.\n## Next step\nstepper_buttons is defined in localvars Iterate over all the buttons in the data dictionary If the button's step matches the current step in the process, make the button disabled [1](/apigee/docs/hybrid/v1.11/helm-install-create-cluster) If the button's step matches the current step in the process, make the button disabled [2](/apigee/docs/hybrid/v1.11/helm-install-download-charts) If the button's step matches the current step in the process, make the button disabled [3](/apigee/docs/hybrid/v1.11/helm-install-create-namespace) If the button's step matches the current step in the process, make the button disabled [4](/apigee/docs/hybrid/v1.11/helm-install-service-accounts) If the button's step matches the current step in the process, make the button disabled [5](/apigee/docs/hybrid/v1.11/helm-install-create-tls-certificates) If the button's step matches the current step in the process, make the button disabled [6](/apigee/docs/hybrid/v1.11/helm-install-create-overrides) If the button's step matches the current step in the process, make the button disabled [7](/apigee/docs/hybrid/v1.11/helm-install-enable-synchronizer-access) If the button's step matches the current step in the process, make the button disabled [8](/apigee/docs/hybrid/v1.11/helm-install-cert-manager) If the button's step matches the current step in the process, make the button disabled If the button's step matches the next step [9](/apigee/docs/hybrid/v1.11/helm-install-crds) If the button's step matches the current step in the process, make the button disabled In all other cases (previous buttons or future buttons (after the next one), make them links [(NEXT) Step 10: Check cluster readiness](/apigee/docs/hybrid/v1.11/helm-install-check-cluster) If the button's step matches the current step in the process, make the button disabled [11](/apigee/docs/hybrid/v1.11/helm-install-helm-charts) If the button's step matches the current step in the process, make the button disabled [12](/apigee/docs/hybrid/v1.11/helm-install-workload-identity)", "guide": "Apigee"}