{"title": "Apigee - Apigee deployment services", "url": "https://cloud.google.com/apigee/docs/api-platform/get-started/what-apigee", "abstract": "# Apigee - Apigee deployment services\nYou are currently viewing version 1.1 of the Apigee hybrid documentation. **This version is end of life.** You should upgrade to a newer version. For more information, see [Supported versions](/apigee/docs/hybrid/supported-platforms#supported-versions) .\n(AD) is a [ CustomResourceDefinition](https://kubernetes.io/docs/concepts/extend-kubernetes/api-extension/custom-resources/#customresourcedefinitions) (CRD) used to define, update, and release stateless Apigee hybrid components in a Kubernetes cluster. For example, AD is used to deploy message processors to the cluster, and the release of these components are triggered by updating the version in the AD.\nBefore AD, certain hybrid resources were maintained manually and individually. However, with AD all these resources are maintained as an atomic deployment unit.\nWhen you list the Apigee hybrid pods in your Kubernetes cluster, you will see these pods listed. These pods do the work to deploy and maintain the AD and validate deployment configurations.\n| Pod name      | Description                                                                              |\n|:--------------------------------|:--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| apigee-deployment-controller | Apigee Deployment Controller is a Kubernetes custom controller that creates and updates low level Kubernetes and Istio resources that are required to deploy and maintain the AD. For example, the controller carries out the release of message processors. See also adc and adah in the Configuration property reference. |\n| apigee-deployment-admissionhook | Apigee Admission Hook is a service used to validate the ApigeeDeployment configuration before persisting it in Kubernetes cluster. For example, the Admission Hook validates fields. See also What are admission webhooks. See also adah in the Configuration property reference.           |\nTo get a list of the ApigeeDeployments in your cluster, execute this command:\n```\nkubectl get ad -n namespace\nNAME            AGE\napigee-mart-my_org        4h\napigee-runtime-my_org-my_env      4h\napigee-synchronizer-my_org-my_env     4h\napigee-udca-my_org-my_env       4h\n``", "content": "`", "guide": "Apigee"}