{"title": "Apigee - Approval task", "url": "https://cloud.google.com/apigee/docs/api-platform/get-started/what-apigee", "abstract": "# Apigee - Approval task\n**Announcement:** Application Integration is now available for your Google Cloud project. You can now use both Apigee Integration and Application Integration within the same Google Cloud project. [Learn more](/apigee/docs/api-platform/integration/using-application-integration)\nThe **Approval** task lets you configure approval-based integrations. It also lets you to control the flow of an integration.\nYou can use the **Approval** task to send approval request emails to one or more integration users. The email includes a link to the integration where the users can manually approve or reject the request.\nDuring an integration execution, when the control reaches the **Approval** task, execution is halted, and all tasks after the **Approval** task are suspended. The integration resumes the execution only when a user manually approves or rejects the approval request.\nAn **Approval** task can be used for the following purposes:\n- To suspend and branch an integration based on user approval or rejection.\n- To suspend an integration until a specified duration.\n- To use as a breakpoint to debug the integration.", "content": "## Compare Approval task, Suspend task, and Timer task\nAll the three ( [Approval](/apigee/docs/api-platform/integration/approval-task) , [Suspend](/apigee/docs/api-platform/integration/run-suspend-task) , and [Timer](/apigee/docs/api-platform/integration/run-timer-task) ) tasks perform a similar function of pausing and resuming an integration. However, there are subtle differences among them. The following table describes the differences amongst the three tasks.\n| Approval task                                              | Suspend task                                                      | Timer task                                   |\n|:-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|:-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|:------------------------------------------------------------------------------------------------------------------------------------------------------|\n| Doesn't support automatic resumption of an integration and requires manual intervention to resume the integration.                     | Supports both manual and automatic resumption of an integration. If there is no manual intervention to revoke the suspension, the integration will automatically resume execution after the expiry of the suspension time limit. | Supports only automatic resumption of an integration. The integration execution automatically resumes after the exipry of the suspension time limit. |\n| Can't resume an integration via an API call. You must manually resolve the suspension by using the Integrations UI.                     | Can resume an integration by using the Suspensions API for integrations.                                       | Supports only automatic resumption of an integration.                         |\n| Users receive notification when an integration pauses (suspended).                                 | Users don't receive any notification when an integration pauses (suspended).                                      | Users don't receive any notification when an integration pauses (suspended).                   |\n| Supports a output variable (boolean), which allows you to perform conditional checks before resuming an integration. However, the output variable can only have the value as either true or false. | Supports a output variable (string), which allows you to perform conditional checks before resuming an integration. You can set any value to the output variable.                 | Doesn't support any output variables.                             |\n## Configure the Approval task\nTo configure the **Approval** task:\n- In the [Apigee UI](https://apigee.google.com) , select your.\n- Click **Develop > Integrations** .\n- Select an existing integration or create a new integration by clicking **Create Integration** .If you are creating a new integration:- Enter a name and description in the **Create Integration** dialog.\n- Select a **Region** for the integration from the list of supported regions.\n- Click **Create** .\nThis opens the integration in the .\n- In thenavigation bar, click **+Add a task/trigger > Tasks** to view the list of available tasks.\n- Click and place the **Approval** task element in the integration editor.\n- Click the **Approval** task element on the designer to view the Approval task  configuration pane.\n- Configure the displayed fields using the [Configuration properties](#params) for the task as detailed in the table below.All changes to the properties are saved automatically.## Configuration properties\nThe following table describes the configuration properties of the **Approval** task.\n| 0         | 1   | 2                                                                                                                            |\n|:-----------------------------------|:-------------|:--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| Property       | Data type | Description                                                                                                                         |\n| Recipients       | String Array | Email addresses to which notification is sent when the task is suspended. Enter multiple email addresses separated by a comma. Note: In your Google Cloud project, you must grant the Apigee Integration Approver IAM role to all the email addresses provided in the Recipients field. For information on granting IAM roles, see Granting, changing, and revoking access.                                 |\n| Custom notification message  | String  | Custom message to include in the email notification when the task is suspended. The value can be a literal or a variable. If the custom message is available in a variable, click VAR and select the variable.                                                                        |\n| Reminder frequency (in minutes) | Integer  | Frequency of reminder notifications. If the suspension is in an unresolved state, you can send reminder email notifications requesting authorized users to resolve the suspension.                                                                               |\n| Time until expiration (in minutes) | Integer  | Time period of the suspension. If the suspension is not resolved within the time, the suspension is rejected by default.                                                                                              |\n| On expiration      | Boolean  | Action to be taken after the suspension has expired. You can choose either to reject the suspension or lift the suspension. By default the suspension is rejected.                                                                                   |\n| isApproved (Approval)    | Boolean  | Output variable which has the status of the suspension after resolution. The isApproved variable is set to True if the suspension is approved and set to False if the suspension is rejected. Tip: Use the isApproved variable when specifying edge conditions for subsequent tasks to control the flow of the integration. For more information about edge conditions, see Edges conditions. Following is a sample edge condition configured using the isApproved variable: $TASK_ID_isApproved$ = TRUE |\n## Error handling strategy\nAn error handling strategy for a task specifies the action to take if the task fails due to a [temporary error](/apigee/docs/api-platform/integration/error-handling) . For information about how to use an error handling strategy, and to know about the different types of error handling strategies, see [Error handling strategies](/apigee/docs/api-platform/integration/error-handling-strategy) .", "guide": "Apigee"}