{"title": "Apigee - Timer task", "url": "https://cloud.google.com/apigee/docs/api-platform/get-started/what-apigee", "abstract": "# Apigee - Timer task\n**Announcement:** Application Integration is now available for your Google Cloud project. You can now use both Apigee Integration and Application Integration within the same Google Cloud project. [Learn more](/apigee/docs/api-platform/integration/using-application-integration)\nThe **Timer** task lets you add a time delay to the integration execution flow.\nDuring an integration execution, when the control reaches the Timer task, execution is paused for the specified time limit, and all tasks after the Timer task are suspended. This task supports only automatic resumption of an integration. The integration execution automatically resumes after the exipry of the suspension time limit. For example, if you set the timer task to 180 seconds, the execution is paused for 3 minutes before resuming automatically.\n", "content": "## Compare Approval task, Suspend task, and Timer task\nAll the three ( [Approval](/apigee/docs/api-platform/integration/approval-task) , [Suspend](/apigee/docs/api-platform/integration/run-suspend-task) , and [Timer](/apigee/docs/api-platform/integration/run-timer-task) ) tasks perform a similar function of pausing and resuming an integration. However, there are subtle differences among them. The following table describes the differences amongst the three tasks.\n| Approval task                                              | Suspend task                                                      | Timer task                                   |\n|:-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|:-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|:------------------------------------------------------------------------------------------------------------------------------------------------------|\n| Doesn't support automatic resumption of an integration and requires manual intervention to resume the integration.                     | Supports both manual and automatic resumption of an integration. If there is no manual intervention to revoke the suspension, the integration will automatically resume execution after the expiry of the suspension time limit. | Supports only automatic resumption of an integration. The integration execution automatically resumes after the exipry of the suspension time limit. |\n| Can't resume an integration via an API call. You must manually resolve the suspension by using the Integrations UI.                     | Can resume an integration by using the Suspensions API for integrations.                                       | Supports only automatic resumption of an integration.                         |\n| Users receive notification when an integration pauses (suspended).                                 | Users don't receive any notification when an integration pauses (suspended).                                      | Users don't receive any notification when an integration pauses (suspended).                   |\n| Supports a output variable (boolean), which allows you to perform conditional checks before resuming an integration. However, the output variable can only have the value as either true or false. | Supports a output variable (string), which allows you to perform conditional checks before resuming an integration. You can set any value to the output variable.                 | Doesn't support any output variables.                             |\n## Configure the Timer task\nTo configure the **Timer** task:\n- In the [Apigee UI](https://apigee.google.com) , select your.\n- Click **Develop > Integrations** .\n- Select an existing integration or create a new integration by clicking **Create Integration** .If you are creating a new integration:- Enter a name and description in the **Create Integration** dialog.\n- Select a **Region** for the integration from the list of supported regions.\n- Click **Create** .\nThis opens the integration in the .\n- In thenavigation bar, click **+Add a task/trigger > Tasks** to view the list of available tasks.\n- Click and place the **Timer** task element in the integration editor.\n- Click the **Timer** task element on the designer to view the **Timer** task  configuration pane.\n- Configure the remaining fields using the [Configuration properties](#params) for the task. For example, if you set **Timeout after** to`180`and **Time unit** to`Seconds`, the execution is paused for 3 minutes before resuming automatically.\n- Changes to the properties are saved automatically.## Configuration properties\nThe following table describes the configuration properties of the Timer task.\n| 0    | 1        | 2                                                                  |\n|:--------------|:------------------------------|:-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| Property  | Data type      | Description                                                                |\n| Timeout after | Integer      | Time till which the integration execution must be paused. Integration automatically resumes the execution of the next downstream task after the expiry of the time limit. Default value: 120 seconds (2 minutes). Maximum time limit allowed: 44640 minutes (31 days). |\n| Time unit  | Seconds, Minutes, Hours, Days | Time unit for the Timeout after property.                                                        |\n## Error handling strategy\nAn error handling strategy for a task specifies the action to take if the task fails due to a [temporary error](/apigee/docs/api-platform/integration/error-handling) . For information about how to use an error handling strategy, and to know about the different types of error handling strategies, see [Error handling strategies](/apigee/docs/api-platform/integration/error-handling-strategy) .", "guide": "Apigee"}