{"title": "Apigee - Clone integrations", "url": "https://cloud.google.com/apigee/docs/api-platform/get-started/what-apigee", "abstract": "# Apigee - Clone integrations\n**Announcement:** Application Integration is now available for your Google Cloud project. You can now use both Apigee Integration and Application Integration within the same Google Cloud project. [Learn more](/apigee/docs/api-platform/integration/using-application-integration)\nCloning an integration creates a full copy of its original integration version. You can use cloning to create a new integration version within the same integration, or to create a completely new independent integration that is a full copy of the original integration version.\n", "content": "## Clone within the same integration\nTo clone of an integration version within the same integration, perform the following steps:\n- In the [Apigee UI](https://apigee.google.com) , select your.\n- Click **Develop > Integrations** .\n- Select the existing integration that you want to clone.\n- Click the **Versions** dropdown and select the version you want to clone.\n- In the designer toolbar, clickmore_vert(Actions menu) and select **Clone integration** .\n- Select **Create new version** .The **Create new version** pane appears.\n- (Optional) Enter a name for the new clone version.\n- Click **OK** .\n- A new clone of the integration version is created in the same integration.## Clone as a new integration\nTo create a new independent integration that is a full copy of the original integration version, perform the following steps:\n- In the [Apigee UI](https://apigee.google.com) , select your.\n- Click **Develop > Integrations** .\n- Select an existing integration that you want to clone.\n- Click the **Versions** dropdown and select the version you want to clone.\n- In the designer toolbar, clickmore_vert(Actions menu) and select **Clone integration** .\n- Select **Create new integration from current version** .The **Create new integration** pane appears.\n- Enter a name and a description for the clone integration.\n- Select a **Region** for the clone integration from the list of [supported regions](/apigee/docs/api-platform/integration/system-limits#supported-regions) .\n- Click **Create** .A new cloned integration is created in the selected region.## Considerations\n- Cloning an integration doesn't clone the authentication profiles associated with that integration. You must manually create a copy of the associated authentication profiles in the same region as the cloned integration. For information about creating authentication profiles, see [Create authentication profiles in Apigee Integration](/apigee/docs/api-platform/integration/configuring-auth-profile) \n- You can't have two integrations with the same name in the same region.", "guide": "Apigee"}