{"title": "Apigee - Understand integration versions", "url": "https://cloud.google.com/apigee/docs/api-platform/get-started/what-apigee", "abstract": "# Apigee - Understand integration versions\n**Announcement:** Application Integration is now available for your Google Cloud project. You can now use both Apigee Integration and Application Integration within the same Google Cloud project. [Learn more](/apigee/docs/api-platform/integration/using-application-integration)\nIntegrations are design time entities that are often developed in collaboration with multiple authors. Although an integration can only be actively edited by one author at a time, teams can collaborate on an integration and track changes in state through its .\nA version of an integration can be in any of the following states:\n- `DRAFT`: The state of an integration version actively being edited by an author.  When an integration is in`DRAFT`, edit capabilities are only available to the current author.  The integration is locked for editing by others.\n- `SNAPSHOT`: When a new author takes over editing a version, the existing version  is converted to`SNAPSHOT`and a new`DRAFT`is created.\n- `ACTIVE`: The state of a published version.\n- `DELETED`: The state of a version that has been deleted by an author, or remains  untouched for a specified period of time.\nOnly a `DRAFT` version of the integration is editable and only an `ACTIVE` version of the integration can be run from the integration editor or fired by a configured trigger.\n", "content": "## Viewing Version History\nTo view the version history of an integration, use the following steps:\n- In the [Apigee UI](https://apigee.google.com) , select your.\n- Click **Develop > Integrations** .\n- Select an existing integration. This opens the integration in the.\n- Click the **Version** drop-down in the designer toolbar. The drop-down lists all available versions of the integration, along with a color indicating the version status:- **Green** : The version is currently active.\n- **Yellow** : The version is currently being edited.\n- **Gray** : The version is inactive.\n- Click on a version, and the integration editor displays the requested version in its last modified state.## Create a new version\nTo create a new version of an existing integration:\n- Click the **Version** drop-down in the integration editor toolbar.\n- Select **Create New Version** .\n- (Optional) Add a label to the new version to help other editors identify the version.\n- Click **OK** .## Delete a version\nTo delete a version of an integration that is no longer in use, perform the following steps:\n**Caution** : Deleting all versions of an integration will result in deleting the entire integration.\n- Click the **Version** drop-down, and select the version to delete.The integration editor displays the requested version in its last modified state.\n- In the toolbar, clickmore_vert(Actions menu) and select **Delete the current version** .\n- In the confirmation dialog, click **OK** .", "guide": "Apigee"}