{"title": "Apigee - Step 2: Create a Google Cloud project", "url": "https://cloud.google.com/apigee/docs/api-platform/get-started/what-apigee", "abstract": "# Apigee - Step 2: Create a Google Cloud project\nYou are currently viewing version 1.1 of the Apigee hybrid documentation. **This version is end of life.** You should upgrade to a newer version. For more information, see [Supported versions](/apigee/docs/hybrid/supported-platforms#supported-versions) .\nApigee hybrid requires that you have a project, which you can create after you create a Google Cloud account.\nThis section describes how to create a new Google Cloud project. If you want to use an existing Google Cloud project (of which you are an owner) with hybrid, skip to [Step 3: Enable APIs](/apigee/docs/hybrid/v1.1/precog-enableapi) .\n**To create a new Google Cloud project:**\n- Open the [Google Cloud console](https://console.cloud.google.com) and log in with the account you created in [Step 1: Create a Google Cloud account](/apigee/docs/hybrid/v1.1/precog-gcpaccount) .\n- Click the **Project Selector** at the top of the view.The **Project Selector** dialog box displays:\n- Click **New Project** in the upper right.The **New Project** view displays.\n- Enter a friendly name for your project in the **Project name** field.Google Cloud generates a corresponding project ID below the **Project name** field, as  the following example shows:You can change the generated project ID by clicking **Edit** , but the project  ID must be unique.Take note of the **project ID** . You will use it later in this setup process. **NOTE:** After you create the project, youchange the project ID.\n- In the **Billing account** field, select the account that you will use to pay  for your project. If you do not yet have a paid or trial account, contact [Apigee Sales](https://pages.apigee.com/contact-sales-reg.html) .\n- In the **Location** field, select a folder for your project. Folders are an  optional part of the Google Cloud project resource tree.\n- Click **Create** .Google Cloud creates your new project.\nAfter you create your project, you must enable the Apigee API to it, as described in the next step.\n", "content": "## Next step\nstepper_buttons is defined in localvars Iterate over all the buttons in the data dictionary If the button's step matches the current step in the process, make the button disabled [1](/apigee/docs/hybrid/v1.1/precog-gcpaccount) If the button's step matches the current step in the process, make the button disabled If the button's step matches the next step [2](/apigee/docs/hybrid/v1.1/precog-gcpproject) If the button's step matches the current step in the process, make the button disabled In all other cases (previous buttons or future buttons (after the next one), make them links [(NEXT) Step 3: Enable APIs](/apigee/docs/hybrid/v1.1/precog-enableapi) If the button's step matches the current step in the process, make the button disabled [4](/apigee/docs/hybrid/v1.1/precog-provision) If the button's step matches the current step in the process, make the button disabled [5](/apigee/docs/hybrid/v1.1/precog-add-environment)", "guide": "Apigee"}