{"title": "Apigee - Expand Cassandra persistent volumes", "url": "https://cloud.google.com/apigee/docs/api-platform/get-started/what-apigee", "abstract": "# Apigee - Expand Cassandra persistent volumes\nYou are currently viewing version 1.2 of the Apigee hybrid documentation. **This version is end of life.** You should upgrade to a newer version. For more information, see [Supported versions](/apigee/docs/hybrid/supported-platforms#supported-versions) .\nThis process allows you to expand the persistent volumes used by the Apigee hybrid Cassandra database to accommodate greater storage needs without needing to create new nodes just to provide more storage.\nThe Apigee hybrid `cassandra` component uses persistent volumes to store data. The size of the persistent volume is defined during installation and initial configuration. This initial storage size is an immutable value and cannot be changed. Therefore, any new node added to the cluster will use the same persistent volume size.\nIt is possible to increase the size of the existing persistent volume by making the changes directly on the Persistent volume Claim, but new nodes will still use the smaller initial persistent volume size.\nIf your hybrid Cassandra database is nearing its storage capacity, you can use this procedure to expand the existing persistent volumes and allow new nodes to expand their persistent volumes as well.\n", "content": "## Process\n- Before proceeding with the Persistent volume expansion, make sure \"`allowVolumeExpansion: true`\"  is set on the StorageClass when it is created:```\nkubectl get sc standard -o json | jq .allowVolumeExpansion true\n```\n- Update the Volume size for the existing Persistent Volume Configuration (PVC):```\nkubectl -n apigee edit pvc \n```\n- Delete the statefulset without cascading deletion:```\nkubectl -n apigee delete sts --cascade=false apigee-cassandra\n```\n- Update the overrides.yaml and apply the changes:```\ncassandra:  storage:    capacity: 20Gi\n``````\n./apigeectl apply -c cassandra -f overrides.yaml\n```\n- Rolling restart the Cassandra pods to reflect the new size. Delete the Cassandra pods one at a time. Verify that the statefulset is healthy before proceeding to the next nodes:```\nkubectl -n apigee delete pod apigee-cassandra-2\nkubectl -n apigee get sts\n NAME    READY AGE\n apigee-cassandra 3/3  64s\n```\n- Verify the Cassandra pods are coming up with the new volume size:```\nkubectl -n apigee get pvc\n```", "guide": "Apigee"}