{"title": "Apigee - DNS setup quickstart", "url": "https://cloud.google.com/apigee/docs/api-platform/get-started/what-apigee", "abstract": "# Apigee - DNS setup quickstart\nYou are currently viewing version 1.3 of the Apigee hybrid documentation. **This version is end of life.** You should upgrade to a newer version. For more information, see [Supported versions](/apigee/docs/hybrid/supported-platforms#supported-versions) .\nThis topic offers an example showing how to use [Google Cloud DNS](https://cloud.google.com/dns) to configure a DNS zone with a record set that points to your Apigee hybrid ingress IP address (typically this address will be a [static IP that you previously configured](/apigee/docs/hybrid/v1.3/precog-add-dns#reserve-a-static-ip) during the hybrid installation.)\n**Note: ** If you already have your own domain and DNS zone to use, you do not need to do these steps. You can simply configure your own zone with a new record set pointing to your ingress load balancer, as described in [ Step 5: Configure your DNS](/apigee/docs/hybrid/v1.3/precog-add-dns) .\n", "content": "## \n Get a registered domain\nYou can register a domain name through [Google Domains](https://domains.google/) or another domain registrar of your choice.\n## \n  Create a managed zone and record set\nThis section explains how to create a DNS zone and record set in Google Cloud DNS.\n- Create a managed zone and record set for your domain. This is the address you will use  to make API proxy calls to hybrid.- Create a managed public zone. For instructions, see [  Create a managed public zone](https://cloud.google.com/dns/docs/set-up-dns-records-domain-name#create_a_managed_public_zone) .\n- Create a new record set with the following selections. For instructions, see [Create a new record](https://cloud.google.com/dns/docs/set-up-dns-records-domain-name#create_a_new_record) .- **DNS Name** : The name of the endpoint external API calls communicate with, like`api-services`or`example-endpoint`\n- **Resource Record Type** : **A** \n- **TTL** and **TTL Unit** : Accept defaults\n- **IP Address** : The static IP you created\n- In the **Zone details** view, copy the DNS name of the **A** record you just created and save it to a **DOMAIN** environment variable. Be careful to not include the period at the end.```\nexport DOMAIN=dns_name_of_record\n```## \n Add your DNS servers to Cloud DNS\n \n- In this step, you copy the DNS servers from your domain to [Google Cloud DNS](https://cloud.google.com/dns/) .  Doing so allows Google Cloud to manage the DNS for your Google Cloud Project.\n- The **Zone details** view lists four DNS servers as the NS data for your new  zone. Copy the DNS record data as shown in the following example:## \n Configure your domain to use the Google Cloud name servers\nGo to your domain registrar and edit your domain's DNS settings to use the Google Cloud Name servers.\nThe following screenshot shows an example of entering the Google Cloud name servers in [Google Domains](https://domains.google.com) :\nGoogle Cloud DNS now manages the DNS records for your domain.\n## Next step\nstepper_buttons is defined in localvars Iterate over all the buttons in the data dictionary If the button's step matches the current step in the process, make the button disabled [1](/apigee/docs/hybrid/v1.3/precog-gcpaccount) If the button's step matches the current step in the process, make the button disabled [2](/apigee/docs/hybrid/v1.3/precog-gcpproject) If the button's step matches the current step in the process, make the button disabled [3](/apigee/docs/hybrid/v1.3/precog-enableapi) If the button's step matches the current step in the process, make the button disabled [4](/apigee/docs/hybrid/v1.3/precog-provision) If the button's step matches the current step in the process, make the button disabled If the button's step matches the next step [5](/apigee/docs/hybrid/v1.3/precog-add-dns) If the button's step matches the current step in the process, make the button disabled In all other cases (previous buttons or future buttons (after the next one), make them links [(NEXT) Step 6: Create an environment group](/apigee/docs/hybrid/v1.3/precog-add-environment)", "guide": "Apigee"}