{"title": "Apigee - Prerequisites", "url": "https://cloud.google.com/apigee/docs/api-platform/get-started/what-apigee", "abstract": "# Apigee - Prerequisites\nYou are currently viewing version 1.8 of the Apigee hybrid documentation. **This version is end of life.** You should upgrade to a newer version. For more information, see [Supported versions](/apigee/docs/hybrid/supported-platforms#supported-versions) .\nBefore you can install Apigee hybrid, you must meet the following prerequisites:\n| Done? | Prerequisite     | Description                                                                                                       |\n|--------:|:-----------------------------|:------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n|  nan | Google Cloud billing account | You must have a Google Cloud account with active billing. For more information, see Create a new billing account.                                                                             |\n|  nan | Google Cloud project   | Create a new Google Cloud project for the Apigee hybrid installation. For more information, see Creating a project. If you'd prefer to use Cloud Identity to manage your organizational identity with Apigee, see Cloud Identity Help. Although not needed for Apigee hybrid, Cloud Identity might be useful if you plan to use other Google Cloud services or have multiple members of your organization access the product. |\n|  nan | Software      | Install the following software on your administrative machine: gcloud CLI (required for command line provisioning steps). After the gcloud CLI is installed, run gcloud components update to get the latest gcloud components. curl (recommended)                                             |\n**Note:** If you plan to enable Google Cloud [ Virtual Private Cloud (VPC) Service Controls](https://cloud.google.com/vpc-service-controls) with your Apigee hybrid installation, see [Using VPC Service Controls with Apigee and Apigee hybrid](/apigee/docs/api-platform/security/vpc-sc) for instructions before you proceed.\n", "content": "## \n Next step\nEach of these steps is described in the sections that follow.\n[Let's Go!](/apigee/docs/hybrid/v1.8/precog-overview)", "guide": "Apigee"}