{"title": "Apigee - Get started with Registry API", "url": "https://cloud.google.com/apigee/docs/api-platform/get-started/what-apigee", "abstract": "# Apigee - Get started with Registry API\n**    Preview    — Apigee API hub ** This feature is subject to the \"Pre-GA Offerings Terms\" in the General Service Terms section   of the [Service Specific Terms](/terms/service-terms#1) .     Pre-GA features are available \"as is\" and might have limited support.    For more information, see the [launch stage descriptions](/products#product-launch-stages) .\nThe Registry API is an [ open-source project](https://github.com/apigee/registry) that allows teams to upload and share machine-readable descriptions of APIs that are in use and in development. These descriptions include API specifications in standard formats like [OpenAPI](https://www.openapis.org/) , the [ Google API Discovery Service Format](https://developers.google.com/discovery) , and the [ Protocol Buffers Language](https://developers.google.com/protocol-buffers) . These API specifications can be used by tools like linters, browsers, documentation generators, test runners, proxies, and API client and server generators. The Registry API itself can be seen as a machine-readable enterprise API catalog designed to back online directories, portals, and workflow managers.\nThe Registry API is formally described by the Protocol Buffer source files in [ google/cloud/apigeeregistry/v1](https://github.com/apigee/registry/blob/main/google/cloud/apigeeregistry/v1) . It closely follows the Google API Design  Guidelines at [aip.dev](https://aip.dev/) and presents a developer experience  consistent with production Google APIs.\nThe Registry API is aimed at the API Platform  Team, whose mission is to assure and improve (govern) the APIs in their entire  organization.\nThe API hub experience is primarily aimed at consumers and producers of APIs within an organization whose main concerns are finding and listing APIs in their organization's catalog. API hub interacts with the Registry API. You do not need to install the Registry API from GitHub to use API hub.\nFor Registry API details, see:\n- [  Apigee Registry APIs](/apigee/docs/reference/apis/apigeeregistry/rest) \n- [  https://github.com/apigee/registry](https://github.com/apigee/registry", "content": ")", "guide": "Apigee"}