{"title": "Apigee - Call REST Endpoint task", "url": "https://cloud.google.com/apigee/docs/api-platform/get-started/what-apigee", "abstract": "# Apigee - Call REST Endpoint task\n**Announcement:** Application Integration is now available for your Google Cloud project. You can now use both Apigee Integration and Application Integration within the same Google Cloud project. [Learn more](/apigee/docs/api-platform/integration/using-application-integration)\nThe **Call REST Endpoint** task lets you call any third-party REST API from your integration. The response from the REST API call will be available to you in an integration variable and can be used in other down-stream tasks.\n**Note:** - The network configuration of the **Call REST Endpoint** task allows it to call  endpoints only available over the public internet. Hence, the task can't connect to hosts  or IPs that reside only within a private network such as a VPC, even if that  VPC is peered with your other Google Cloud services such as Apigee X.\n- This task can process a maximum of 50 MB of REST response.", "content": "## Before you begin\n- To connect to an authentication endpoint for the REST API call, ensure that you have either [created an OAuth 2.0 profile](/apigee/docs/api-platform/integration/configuring-auth-profile#createAuthProfile) or [attached a user-managed service account](/application-integration/docs/access-control#add-service-account) to your integration. If your API does not require authentication, then the **Authentication profile** field in the task configuration pane can be left empty. To see a list of configurations, see [Configuration properties](#params) .If your integration has both OAuth 2.0 profile and a user-managed service account configured, then by default the OAuth 2.0 profile is used for authentication. If neither OAuth 2.0 profile nor user-managed service account is configured, then the execution fails.\n- If your integration has a service account attached, then based on the REST endpoint URL, grant the required IAM role to that service account. For example, if your REST endpoint URL calls a Cloud Storage service, then grant the required IAM role for the Cloud Storage service.For information about granting roles to a service account, see [Manage access to service accounts](/iam/docs/manage-access-service-accounts) .\n- Ensure that [VPC Service Controls](/apigee/docs/api-platform/integration/vpcsc-integration) is **NOT** setup for Apigee Integration in your Google Cloud project. **Warning:** **Cloud Function** does not function or stops functioning if [VPC Service Controls](/apigee/docs/api-platform/integration/vpcsc-integration) is setup for Apigee Integration in your Google Cloud project.## Configure the Call REST Endpoint task\nTo configure the **Call REST Endpoint** task:\n- In the [Apigee UI](https://apigee.google.com) , select your.\n- Click **Develop > Integrations** .\n- Select an existing integration or create a new integration by clicking **Create Integration** .If you are creating a new integration:- Enter a name and description in the **Create Integration** dialog.\n- Select a **Region** for the integration from the list of supported regions.\n- Click **Create** .\nThis opens the integration in the .\n- In thenavigation bar, click **+Add a task/trigger > Tasks** to view the list of available tasks.\n- Click and place the **Call REST Endpoint** element in the integration editor.\n- Click the **Call REST Endpoint** element on the designer to view the **Call REST Endpoint** task  configuration pane.\n- Configure the displayed fields using the [configuration properties](#params) of the task as detailed in the table below.Changes to the properties are saved automatically.## Configuration properties\nThe following table describes the configuration properties of the **Call REST Endpoint** task.\n| 0        | 1          | 2                                                                                                                                               |\n|:-------------------------------|:----------------------------------------|:--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| Property      | Data type        | Description                                                                                                                                             |\n| Label       | String         | Optional: add a label for your task.                                                                                                                                      |\n| Authentication     | String         | Optional: configures and stores the authentication details for connections to external systems. For more information, see Create authentication profiles in Apigee Integration.                                                                                                   |\n| Endpoint base URL    | String         | REST endpoint URL without the query parameters.                                                                                                                                    |\n| HTTP method     | nan          | HTTP method to use. You can select any of the following HTTP methods: DELETE GET HEAD PATCH POST PUT                                                                                                                      |\n| URL query string parameters | Query string key : String Value: String | Query parameters required for the REST API call. The query parameters are in the form of key-value pairs where key is the key name and the value is the corresponding key value. You can enter more than one key-value pair by clicking on the plus icon.                                                                                 |\n| HTTP headers     | HTTP header key: String Value: String | HTTP headers required for the REST API call. The HTTP headers are in the form of key-value pairs where key is the key name and the value is the corresponding key value. You can enter more than one key-value pair by clicking on the plus icon.                                                                                   |\n| Follow redirects    | Boolean         | Follow URL redirects. You can select any one of the values: True : Calls the redirected URL if the Endpoint base URL is forwarded to another URL. False: Does not call the redirected URL if the Endpoint base URL is forwarded to another URL.                                                                                   |\n| Task should fail on HTTP error | Boolean         | Exception handling strategy when the REST API call fails. The Call REST Endpoint fails if the HTTP response code is 4xx or 5xx. For a list of error codes, see Error codes. For other HTTP response codes, return error code and error message in the response. Note: For errors that are not related to REST API call, such as incorrect URL, the task always fail irrespective of what this option is set to. You can select any one of the values: True : Throws an exception. False: Does not throw an exception. But returns the error code and the error message in the response. |\n| Response header (<Task name>) | String         | Uncompressed response header from the REST APIs response.                                                                                                                                 |\n| Response body (<Task name>) | String         | Uncompressed response body from the REST APIs response.                                                                                                                                  |\n| Response status (<Task name>) | String         | HTTP response code and the corresponding code text from the REST APIs response.                                                                                                                            |\n## Best practices\nFor information about the usage limits that apply to the **Call REST Endpoint** task, see [ Usage limits](/apigee/docs/api-platform/integration/system-limits#usage-limits) .\n## Error handling strategy\nAn error handling strategy for a task specifies the action to take if the task fails due to a [temporary error](/apigee/docs/api-platform/integration/error-handling) . For information about how to use an error handling strategy, and to know about the different types of error handling strategies, see [Error handling strategies](/apigee/docs/api-platform/integration/error-handling-strategy) .", "guide": "Apigee"}