{"title": "Apigee - Step 1: Create a cluster", "url": "https://cloud.google.com/apigee/docs/api-platform/get-started/what-apigee", "abstract": "# Apigee - Step 1: Create a cluster\nYou are currently viewing version 1.3 of the Apigee hybrid documentation. **This version is end of life.** You should upgrade to a newer version. For more information, see [Supported versions](/apigee/docs/hybrid/supported-platforms#supported-versions) .\n**Upgrading: ** If you are upgrading to Apigee hybrid v1.3.0, see [Upgrading Apigee hybrid](/apigee/docs/hybrid/v1.3/upgrade) for instructions. If you are performing a new installation, continue with the configurations described below.\n", "content": "## \n Creating a cluster\nUse the following instructions to create a user cluster:\n- [GKE on AWS overview documentation](https://cloud.google.com/anthos/gke/docs/aws) .\n- [Installing GKE on AWS](https://cloud.google.com/anthos/gke/docs/aws/how-to/installation-overview) .\nWhen you have a cluster installed and running, go to the next step.\n## Next step\nstepper_buttons is defined in localvars Iterate over all the buttons in the data dictionary If the button's step matches the current step in the process, make the button disabled If the button's step matches the next step [1](/apigee/docs/hybrid/v1.3/install-create-cluster-aws-gke) If the button's step matches the current step in the process, make the button disabled In all other cases (previous buttons or future buttons (after the next one), make them links [(NEXT) Step 2: Install cert-manager and ASM](/apigee/docs/hybrid/v1.3/install-download-cert-manager-istio-aws-gke) If the button's step matches the current step in the process, make the button disabled [3](/apigee/docs/hybrid/v1.3/install-download-install-aws-gke) If the button's step matches the current step in the process, make the button disabled [4](/apigee/docs/hybrid/v1.3/install-copy-overrides-aws-gke) If the button's step matches the current step in the process, make the button disabled [5](/apigee/docs/hybrid/v1.3/install-apply-hybrid-aws-gke)", "guide": "Apigee"}