{"title": "Apigee - Create and deploy a new API proxy", "url": "https://cloud.google.com/apigee/docs/api-platform/get-started/what-apigee", "abstract": "# Apigee - Create and deploy a new API proxy\nYou are currently viewing version 1.1 of the Apigee hybrid documentation. **This version is end of life.** You should upgrade to a newer version. For more information, see [Supported versions](/apigee/docs/hybrid/supported-platforms#supported-versions) .\nNow that you've configured and the hybrid UI, and installed and configured the runtime, you're ready to see how it all works together.\nThis section walks you through the following:\n- **Create a new API proxy** in the Apigee UI using the  API Proxy Wizard\n- **Deploy your new proxy** to your cluster with the UI\n", "content": "## 1. Create a new API proxy using the hybrid UI\nThis section describes how to create a new API proxy in the UI by using the API Proxy Wizard.\n**To create a simple API proxy using the API Proxy Wizard:**\n- Open [Apigee UI](https://apigee.google.com) in a browser.\n- Select **Develop > API Proxies** in the main view.\n- From the **Environment** drop-down list, select the environment in which you want  to create a new API proxy. This section assumes the name of the environment is \"test\". You  created at least one environment in [Step 5: Add an environment](/apigee/docs/hybrid/v1.1/precog-add-environment) .The hybrid UI displays a list of API proxies for that environment. If you haven’t created any  proxies yet, the list is empty.\n- Click **+Proxy** in the upper right.The API Proxy Wizard starts\n- Select **Reverse proxy** (most common), and click **Next** .The **Proxy details** view is displayed.\n- Configure your proxy with the following settings:- **Proxy Name:** Enter \"myproxy\". The remaining steps in this section assume   that this is your proxy's ID.\n- **Proxy Base Path:** Automatically set to \"/myproxy\". The **Proxy Base\n  Path** is part of the URL used to make requests to your API. Edge uses the URL to   match and route incoming requests to the proper API proxy.\n- (Optional) ** Description:** Enter a description for your new API proxy, such   as \"Testing Apigee hybrid with a simple proxy\".\n- **Target (Existing API):** Enter \"https://mocktarget.apigee.net\". This defines the   target URL that Apigee invokes on a request to the API proxy. The mocktarget service is   hosted at Apigee and returns simple data. It requires no API key or access token.\nYour API proxy's details should look like the following:\n- Click **Next** .\n- On the **Policies** screen, select **Pass through (none)** as the  security option.\n- Click **Next** .\n- On the **Summary** screen, click **Create** .Hybrid generates the proxy (sometimes referred to as ): **NOTE:** In this case, the hybrid UI doesdeploy the proxy to  your cluster. You will do this in [the next step](#deploy) .\n- Click **Exit** .Hybrid displays the **Proxies** view, which displays a list of API proxies. The  new proxy should be at the top of the list, with a gray status indicator, meaning that it has  not yet been deployed.## 2. Deploy your proxy to the cluster using the hybrid UI\nAfter creating a new proxy, you must deploy it so that you can try it out. This section describes how to deploy your new proxy using the hybrid UI.\n**To deploy an API proxy in the hybrid UI:**\n- In the hybrid UI, select **Develop > API Proxies** .Be sure the \"test\" environment is selected.The UI displays your new proxy in the proxies list:\n- Click on the \"myproxy\" proxy.The UI displays the **API Proxies Overview** tab for that proxy.Notice that under **Deployments** , the **Revision** column shows  \"Not deployed\".\n- In the **Revision** column, expand the drop-down selector to choose the revision  to deploy.The drop down list displays only \"1\" and \"Undeploy\".\n- Select \"1\"—the revision that you want to deploy—from the drop down list.The UI prompts you to confirm the deployment:\n- Click **Deploy** .The UI begins the process of deploying revision 1 of your new proxy to the cluster.Note that deployment is not an instantaneous process. Hybrid's \"eventually consistent\"  deployment model means that a new deployment will be rolled out to the cluster over a short  period of time and not immediately.\nWhile there are [several ways](/apigee/docs/api-platform/deploy/ui-deploy-overview#viewing-deployment-status) to check the deployment status of a proxy in the UI, the next two steps explain how to call the API proxy you just deployed and how to check the deployment status with a call to the [Apigee APIs](/apigee/docs/reference/apis/apigee/rest) .\n## \n 3. Call the API proxy\nWhen the [UI indicates your proxy is deployed](/apigee/docs/hybrid/v1.1/ui-deploy-overview#view-deployment-status) , you can try calling it:\n- If you used the wildcard character '*' for the`envs.hostAlias`property  as instructed in [Configure the cluster](/apigee/docs/hybrid/v1.1/install-copy-overrides) ,  follow these steps before continuing:- Get the external IP for the`istio-ingressgateway`service. For example:```\nkubectl get services -n istio-system\n```In the output, you will see something like this, where `34.68.41.240` is the external ingress IP address:```\nNAME      TYPE   CLUSTER-IP  EXTERNAL-IP  PORT(S)\nistio-ingressgateway  LoadBalancer 10.43.255.19 34.68.41.240  80:31381/TCP,443:31391\n```\n- Copy the value of the`EXTERNAL-IP`to use in the next step. In this   example, you would copy`34.68.41.240`.- Call the proxy using cURL or the REST client of your choice:```\ncurl -v -k https://34.68.41.240/myproxy\n```If the call succeeds, you will see the following output:```\nHello, Guest!\n```", "guide": "Apigee"}