{"title": "Apigee - Step 1: Create an AKS cluster", "url": "https://cloud.google.com/apigee/docs/api-platform/get-started/what-apigee", "abstract": "# Apigee - Step 1: Create an AKS cluster\nYou are currently viewing version 1.1 of the Apigee hybrid documentation. **This version is end of life.** You should upgrade to a newer version. For more information, see [Supported versions](/apigee/docs/hybrid/supported-platforms#supported-versions) .\nThis step explains how to set up your shell environment and create a Microsoft® Azure Kubernetes Service (AKS) cluster suitable for testing Apigee hybrid.\nThere are many variations on how to create clusters in AKS. This topic walks through a basic scenario to help get you started with hybrid. For more detailed information about create clusters on AKS, see also [Quickstart: Deploy an Azure Kubernetes Service cluster using the Azure CLI](https://docs.microsoft.com/en-us/azure/aks/kubernetes-walkthrough) and [Quickstart: Deploy an Azure Kubernetes Service (AKS) cluster using the Azure portal](https://docs.microsoft.com/en-us/azure/aks/kubernetes-walkthrough)\n", "content": "## \n Set up your terminal shell\nBe sure you have the [ Azure CLI (az)](https://docs.microsoft.com/en-us/cli/azure/install-azure-cli?view=azure-cli-latest) and [kubectl](https://kubernetes.io/docs/tasks/tools/install-kubectl/) installed in your local shell. The Azure CLI tool provides the primary command-line interface for Azure, and `kubectl` provides the primary command-line interface for running commands against Kubernetes clusters.\n## \n Create a resource group\nCreate a resource group either using Azure console or with the Azure CLI. For example:\n```\naz group create --name my-hybrid-rg --location eastus\n```\n## \n Create a virtual network\nCreate a virtual network with a non-conflicting CIDR range. For example:\n```\naz network vnet create \\\n --name my-hybrid-rg-vnet \\\n --resource-group my-hybrid-rg \\\n --address-prefixes 120.38.1.0/24 \\\n --subnet-name my-hybrid-rg-vnet-subnet \\\n --subnet-prefix 120.38.1.0/26\n```\n## \n Create an AKS cluster\n**Note: ** Apigee does not support [GKE Sandbox](https://cloud.google.com/kubernetes-engine/sandbox) or [gVisor](https://github.com/google/gvisor) .\nIn this step, you will create an AKS cluster.\n- Open the [Microsoft® Azure Portal](https://portal.azure.com/) .\n- Click **Kubernetes services** .\n- Create a cluster with the following minimum configuration settings.The configuration values shown below are for example purposes only. They are  generally the default values and are suitable for testing purposes. It is up to you  to decide how to configure your cluster to suit your requirements.| Tab   | Attribute       | Value                                                |\n|:---------------|:----------------------------------|:-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| Basics   | Subscription      | Your subscription name                                            |\n| nan   | Resource group     | The resource group you created previously                                       |\n| nan   | Region       | The region you specified previously. For example: (US) East US                                  |\n| nan   | Kubernetes cluster name   | The name of the cluster. For example: my-hybrid-aks-cluster                                   |\n| nan   | Kubernetes version    | Choose version 1.13 or a later version                                        |\n| nan   | DNS name prefix     | The DNS name prefix. For example: my-hybrid-aks-cluster-dns                                   |\n| nan   | Node count      | 3                                                 |\n| nan   | Node size       | DS3 Standard Using virtual cpus less than 4 may result in the failure of Cassandra pod creation due to not enough cpus. Storage will be provisioned using kubernetes stateful dynamic provisioner |\n| Scale   | Virtual nodes      | Disabled                                                |\n| nan   | VM scale sets      | Enabled                                                |\n| Authentication | Enable RBAC      | Yes                                                 |\n| nan   | Service principal     | Default                                                |\n| Networking  | HTTP application routing   | No                                                 |\n| nan   | Load balancer      | Standard                                                |\n| nan   | Network configuration    | Advanced                                                |\n| nan   | Virtual network     | The virtual network name. You can select the virtual network you created previously, or create a new one by clicking the Create new link. For example: my-hybrid-rg-vnet       |\n| nan   | Cluster subnet     | Example: default (10.240.0.0/16)                                          |\n| nan   | Kubernetes service address range | The service address range. Be sure to use a non-competing address range. For example: 10.0.0.0/16                         |\n| nan   | Kubernetes DNS service IP address | For example: 10.0.0.10                                            |\n| nan   | Docker Bridge address    | For example: 172.17.0.1/16                                           |\n| Monitoring  | Enable container monitoring  | Yes                                                 |\n| nan   | Log Analytics workspace   | For example: DefaultWorkspace-66f9d75c-2cd9-47dd-ad0f-c43d888e9cef-EUS                                |\n| Tags   | nan        | nan                                                 |\n- Click **Review and Create** .\n- When the cluster creation completes, go to the next step.## \n Set cluster credentials\nAdd the kubernetes cluster credentials for the newly created cluster using the following command if not already added. For example:\n```\naz aks get-credentials --resource-group my-hybrid-rg --name my-hybrid-aks-cluster\n```\n## \n Set the current context\nA is a group of access parameters. Each context contains a Kubernetes cluster, a user and a namespace. The current context is the cluster that is currently the default for `kubectl` : all `kubectl` commands run against that cluster.\nMake sure the current context is set to the cluster you just created. For example:\n```\nkubectl config current-context\n my-hybrid-aks-cluster-context\n```\nIf the context is not set to your cluster as expected, follow these steps to change it:\n- List all the contexts to determine which is thecontext. In the  following example, the context is set to the`my-hybrid-aks-ext01`:```\nkubectl config get-contexts\nCURRENT NAME       CLUSTER         AUTHINFO\n   my-hybrid-aks-cluster my-hybrid-aks-cluster   clusterUser_my-hybrid-rg2_myhybrid-aks-cluster\n*   my-hybrid-aks-ext01  my-hybrid-aks-ext01   clusterUser_my-hybrid-rg_my-hybrid-aks-ext01\n```\n- If necessary, set the current context to the cluster you just created (the cluster  into which you intend to install Apigee hybrid). Assuming the previous`get-contexts`output,  if the cluster name you created were`my-hybrid-aks-cluster`, you would switch to the`my-hybrid-aks-cluster`context, as follows:```\nkubectl config use-context my-hybrid-aks-cluster\n```Where `my-hybrid-aks-cluster` is the name of the cluster context to switch to.## \n Summary\nYou now have a Kubernetes cluster running in AKS. Your shell environment is set up, and you are ready to install the Apigee hybrid runtime software on your local machine.\n## Next step\nstepper_buttons is defined in localvars Iterate over all the buttons in the data dictionary If the button's step matches the current step in the process, make the button disabled If the button's step matches the next step [1](/apigee/docs/hybrid/v1.1/install-create-cluster-aks) If the button's step matches the current step in the process, make the button disabled In all other cases (previous buttons or future buttons (after the next one), make them links [(NEXT) Step 2: Install apigeectl](/apigee/docs/hybrid/v1.1/install-download-install-aks) If the button's step matches the current step in the process, make the button disabled [3](/apigee/docs/hybrid/v1.1/install-copy-overrides-aks) If the button's step matches the current step in the process, make the button disabled [4](/apigee/docs/hybrid/v1.1/install-apply-hybrid-aks)", "guide": "Apigee"}