{"title": "Apigee - For Each Parallel task", "url": "https://cloud.google.com/apigee/docs/api-platform/get-started/what-apigee", "abstract": "# Apigee - For Each Parallel task\n**Announcement:** Application Integration is now available for your Google Cloud project. You can now use both Apigee Integration and Application Integration within the same Google Cloud project. [Learn more](/apigee/docs/api-platform/integration/using-application-integration)\nThe **For Each Parallel** task lets you run other integrations (sub-integrations) from your main integration. As the task name suggests, the sub-integrations run in parallel.\nThis task uses the API **Trigger ID** as a handle to identify the integrations to run. For example, if you specify the API **Trigger ID** as `api_trigger/APITriggerX` , the task runs all the sub-integrations that have  the `api_trigger/APITriggerX` trigger ID.\nAfter running a sub-integration, you can also read the response of the sub-integration in your main integration. Use this task to run sub-integrations as dependencies of the main integration.\n", "content": "## Before you begin\n- Ensure that you have [attached a user-managed service account](/application-integration/docs/access-control#add-service-account) to your integration. If your integration does not have user-managed service account configured, then by default the [default service account](/application-integration/docs/access-control#default-service-account) (`service-` `` `@gcp-sa-apigee.iam.gserviceaccount.com`) is used for authentication.\n- Ensure that your service account has the **Application Integration Invoker** IAM role. For information about granting roles to a service account, see [Manage access to service accounts](/iam/docs/manage-access-service-accounts) .## Configure the For Each Parallel task\nTo configure the **For Each Parallel** task:\n- In the [Apigee UI](https://apigee.google.com) , select your.\n- Click **Develop > Integrations** .\n- Select an existing integration or create a new integration by clicking **Create Integration** .If you are creating a new integration:- Enter a name and description in the **Create Integration** dialog.\n- Select a **Region** for the integration from the list of supported regions.\n- Click **Create** .\nThis opens the integration in the .\n- In thenavigation bar, click **+Add a task/trigger > Tasks** to view the list of available tasks.\n- Click and place the **For Each Parallel** task element in the integration editor.\n- Click the **For Each Parallel** task element on the designer to open the **For Each Parallel** task configuration pane.\n- Configure the displayed fields using the [Configuration properties](#params) for the task as detailed in the tables below.All changes to the properties are saved automatically.## Configuration properties\nThis section describes the configuration properties of the **For Each Parallel** task.\n### Input properties\n| 0      | 1            | 2             | 3                                                                                                                                                                                             |\n|:------------------------|:----------------------------------------------|:---------------------------------------------------|:------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| Property Name   | Parameter Name        | Data type           | Description                                                                                                                                                                                           |\n| Array Selection   | List to iterate        | An array of type string, integer, double, or JSON. | List of values for which the sub-integrations must run. A separate sub-integration thread runs for each value in the list, and all the threads run in parallel. You can pass the iterated value to the sub-integration by setting the Where to map individual array elements field. You can also pass additional values from the main integration to the sub-integration in the Map to additional sub-integration input(s) field.                                                                                    |\n| Sub-integration Details | API Trigger ID        | String            | Trigger ID of the published sub-integration to run. This value is available in the Trigger ID field of the API Trigger in the sub-integration.                                                                                                                                                         |\n| Sub-integration Details | Execution strategy       | nan            | SYNC: Runs the sub-integrations in synchronous mode. In this mode, the main integration waits for the sub-integrations to complete before continuing with the downstream tasks. ASYNC: Runs the sub-integrations in asynchronous mode. In this mode, the main integration does not wait for the sub-integrations to complete. Immediately after calling the sub-integrations, the main integration runs the downstream tasks.                                                                                     |\n| Sub-integration Details | Run all integrations with this API Trigger ID | nan            | Runs all integrations that have the same API Trigger ID. For example, if integration A and integration B, have the same API Trigger ID, both the integrations A and B are run for each item in List to iterate. Note: If you select this option, the response from the sub-integrations is not be available in the main integration. If you want to use the response of the sub-integrations, select the Run a single integration option.                                                                                 |\n| Sub-integration Details | Run a single integration      | nan            | Runs only the integration specified in the Integration name field. You can use the response from the sub-integrations by configuring the Collect values from sub-integration output(s) section.                                                                                                                                             |\n| On each execution  | Where to map individual array elements  | String            | The name of the sub-integration input variable where the array elements should be mapped. The array elements can be mapped directly to a sub-integration input variable. If a single sub-integration is selected, you can select the sub-integration input variable from a dropdown list.                                                                                                                      |\n| On each execution  | Map to additional sub-integration input(s) | String            | Additional sub-integration mapping option. Integration variable to map from: The name of the variable in the current integration to be passed to the sub-integration's input variable. Sub-integration input to map to: The name of the sub-integration input variable to map to. This field takes values in the form of key-value pairs, where the key is a variable in the main integration, and the value is the corresponding input variable in the sub-integration. For example, consider your main integration has the productID variable, which you want to map to the subIntProductID sub-integration variable; you must select productID from the Integration variable to map from field and enter subIntProductID in the Sub-integration input to map to field. |\n| On each execution  | Collect values from sub-integration output(s) | String            | If the execution strategy is synchronous (SYNC) and a single sub-integration (Run a single integration) is selected, the outputs of the sub-integration can be collected into array variables in the current integration. Sub-integration output to collect from: The name of the sub-integration output variable to be aggregated. Integration variable to collect into: The name of the variable in the current integration to collect the aggregated outputs.                                                                             |\n| Execution Settings  | Integrations to execute at a time (parallel) | Integer           | Maximum number of parallel executions allowed for sub-integrations. The default value is 50 (10000 maximum). All sub-integrations in a cohort run completely before the next cohort of sub-integrations run.                                                                                                                                          |\n| Execution Settings  | Ignore failures        | Boolean           | You can specify any one of the following values: True: Task ignores sub-integration failures and runs all executions. False: Task fails for sub-integration failures and ends all executions.                                                                                                                                              |\n## \n Best practices\nWe recommend the following best practices when using the **For Each Parallel** task:\n- Set your cohort size based on any quota limitations imposed by your sub-integrations.\n- Use a **SYNC** execution strategy when you want to collect the output of the sub-integration for later use.\n- Use an **ASYNC** execution strategy when your sub-integration might run longer than **2 minutes** .\nFor information about the usage limits that apply to the **For Each Parallel** task, see [ Usage limits](/apigee/docs/api-platform/integration/system-limits#usage-limits) .\n## Considerations\nIn general, do not use a **SYNC** execution strategy if your sub-integration takes longer than **2 minutes** to run or you plan to use this task in conjunction with naturally asynchronous tasks like the Approval task.\n## Error handling strategy\nAn error handling strategy for a task specifies the action to take if the task fails due to a [temporary error](/apigee/docs/api-platform/integration/error-handling) . For information about how to use an error handling strategy, and to know about the different types of error handling strategies, see [Error handling strategies](/apigee/docs/api-platform/integration/error-handling-strategy) .", "guide": "Apigee"}