{"title": "Apigee - Error catcher trigger", "url": "https://cloud.google.com/apigee/docs/api-platform/get-started/what-apigee", "abstract": "# Apigee - Error catcher trigger\n**Announcement:** Application Integration is now available for your Google Cloud project. You can now use both Apigee Integration and Application Integration within the same Google Cloud project. [Learn more](/apigee/docs/api-platform/integration/using-application-integration)\nThe **Error Catcher** trigger lets you invoke an [error catcher](/apigee/docs/api-platform/integration/error-catcher) that is defined or customized to handle the failure of an identified trigger, task, or edge condition in your integration.\n", "content": "## Add an Error Catcher trigger\n**Error Catcher**\n- In the [Apigee UI](https://apigee.google.com) , select your.\n- Click **Develop > Integrations** .\n- Select an existing integration or create a new integration by clicking **Create Integration** .If you are creating a new integration:- Enter a name and description in the **Create Integration** dialog.\n- Select a **Region** for the integration from the list of supported regions.\n- Click **Create** .\nThis opens the integration in the .\n- In thenavigation bar, click **+Add a task/trigger > Triggers** to view the list of available triggers.\n- Click and place the **Error Catcher** trigger element in the integration designer.## Configure the Error Catcher trigger\nClick the **Error Catcher** trigger element in the integration designer to view the trigger configuration pane.\nThe **Configuration** tab displays the **Error catcher ID** , which is auto-generated when you add the trigger in your integration designer. You can optionally edit the auto-generated ID if needed. No further configuration is required for this trigger.\n**Note:** Error catcher IDs are unique to each **Error Catcher** trigger, therefore you can't have more than one **Error Catcher** trigger with the same **Error catcher ID** .\n## Create the error catcher logic\nOnce you have added the **Error Catcher** trigger in the integration designer, you can create your custom [error catcher](/apigee/docs/api-platform/integration/error-catcher) logic using the available tasks in Apigee Integration. Click and place the desired [integration tasks](/apigee/docs/api-platform/integration/how-to#configure-integration-tasks) elements in the integration designer and connect them with your **Error Catcher** trigger.\n### Attach the error catcher\nOnce you have created your custom error catcher logic, you can use it to handle the errors or execution failures at both, the [task](/apigee/docs/api-platform/integration/error-catcher#task) and [event](/apigee/docs/api-platform/integration/error-catcher#event) levels. To use or attach an error catcher in your main integration, perform the following steps:\n- Click the existing trigger or task in your main integration to open the trigger or task configuration  pane.\n- In the configuration pane, expand the **Error handling** section and go to **Error catcher** .\n- Click **Select error catcher** and select the **Error Catcher** trigger ID that you want to use.A red indicator appears on the respective trigger or task element indicating that the element is attached to an error catcher.\n**Notes:** - You can't attach multiple error catchers to the same task or trigger in your main integration.\n- Error catchers can't be nested. This means that you cannot invoke an Error catcher trigger using another Error catcher trigger in your integration.\n- You cannot establish an edge connection between the tasks configured inside an error catcher and the tasks or triggers used in your main integration flow.\nThe following image shows a sample integration flow that uses error catcher:", "guide": "Apigee"}