{"title": "Apigee - Manage taxonomies", "url": "https://cloud.google.com/apigee/docs/api-platform/get-started/what-apigee", "abstract": "# Apigee - Manage taxonomies\n**    Preview    — Apigee API hub ** This feature is subject to the \"Pre-GA Offerings Terms\" in the General Service Terms section   of the [Service Specific Terms](/terms/service-terms#1) .     Pre-GA features are available \"as is\" and might have limited support.    For more information, see the [launch stage descriptions](/products#product-launch-stages) .\n**Required permissions:** You must have [administrator permissions](/apigee/docs/api-hub/permissions#roles) to view the **Settings** page and manage taxonomies.\nTaxonomies provide a way of organizing APIs and provide flexible options for defining API  metadata. A taxonomy, as defined in the system, is simply a named list of values that provides  categorization options for specific information. The **Taxonomies** settings page  allows you to view and manage the different taxonomies that are available in the  system.\nSystem taxonomies define values that have special meaning in API hub, and may be presented in a  special way in the UI or dictate behavior. System taxonomies are predefined by the system and are  more restricted in how they can be changed or extended; however, their list of values can be  modified to some extent.\nCustom taxonomies define any custom information that you would like to attach to  APIs. If you have [administrator permissions](/apigee/docs/api-hub/permissions#roles) , you can create and modify this list any way you wish.\nMost taxonomies are exclusive; labels group items into non overlapping (single-selection)  collections. But where needed, taxonomies can be configured to allow multiple labels to be  assigned to a single object. These multiple-selection taxonomies are marked as such in their  configuration.\n", "content": "## Predefined System taxonomies\nThe following predefined **System taxonomies** cannot be deleted and have specific portions  of the configuration that are not editable. Some of these predefined system taxonomies also  specify predefined elements:\n- **Target users:** The intended users (consumers) of an API (multiple selections allowed)\n- **Style (primary):** The primary architectural style of the API (single-selection only)\n- **Team:** The producing team responsible for an API (single-selection only)\n- **Business unit:** The business unit responsible for an API (single-selection only)\n- **Gateway:** The proxy used to serve and protect the API (single-selection only)## Custom taxonomies\nCustom taxonomies provide a method for attaching custom information to an API. For example:\n- **Approvals:** Review status, such as **Compliant** or **Regulated** \n- **Topics:** A categorization of an API by subject matter, such as **Finance** or **HR** \n- **Attributes:** A feature of an API such as **Contains PII** \n- **Product:** The consumer product an API was designed to support## Add taxonomy\nTo add a taxonomy:\n- In the Google Cloud console, go to the **API hub** , **Settings** , **Taxonomies** page. [Go to API hub taxonomies](https://console.cloud.google.com/apigee/hub/settings/taxonomies) \n- Click **Add custom taxonomy** .\n- Specify the following:- **ID:** An identifier for an API resource. The ID can contain only lowercase letters,    numbers, and hyphens. The ID must be unique in the project. IDs must be between 4 and 63   characters long. IDs cannot be changed once a taxonomy has been created. For example,    for the API resource name:`projects/my-project/locations/global/apis/my-api`,    the resource ID is`my-api`.\n- **Name:** The display name for the taxonomy\n- **Description:** A short description for the taxonomy\n- **Options** :- **Limit to one selection:** If selected, only one value of the taxonomy can be     applied to an API at any given time. If multiple values are already applied to APIs     and this option is enabled, the multiples remain.\n- **Exclude from search filters:** If selected, this taxonomy is not visible on     the **Filter** pane.- **Taxonomy elements:** A list of **Name** and **Description** or **URL** pairs that define the values that are available for the taxonomy.- **Name:** The name is automatically generated based on the taxonomy display     name. This name is displayed when you rest the mouse over theinfoinfo icon on the **Overview** page.\n- **URL:** If a URL is entered, the taxonomy element is displayed as the URL.\n- Click **Add element** to add another element.\n- Click **Save** (or **Cancel** ).\n**Note:** Anytime a **System taxonomy** is unset on a resource, the value **Not\n specified** is displayed in the UI. Taxonomy selection components also display **Not\n specified** as an option if applicable. A taxonomy can become unset if a [custom taxonomy is deleted](#delete-taxonomy) , for example.\n## Edit taxonomy\nTo edit a taxonomy:\n- In the Cloud console, go to the **API hub** , **Settings** , **Taxonomies** page. [   Go to API hub taxonomies](https://console.cloud.google.com/apigee/hub/settings/taxonomies) \n- Clickedit **Edit** next to a system taxonomy,   ormore_vert **More** >edit **Edit** next to a custom taxonomy.\n- Make modifications as necessary. Not all fields for **System taxonomies** can be modified. See [Predefined System taxonomies](#system-taxonomies) for more information. **Note:** If you delete a **Taxonomy element** from any taxonomy, you are presented   with a confirmation dialog indicating that the values for that taxonomy will be removed   from all APIs that currently have that element assigned.\n- Click **Save** (or **Cancel** ).## Delete taxonomy\n**Caution:** Deleting a taxonomy removes it from any API that used the taxonomy.\nTo delete a taxonomy:\n- In the Cloud console, go to the **API hub** , **Settings** , **Taxonomies** page. [   Go to API hub taxonomies](https://console.cloud.google.com/apigee/hub/settings/taxonomies) \n- Click more_vert **More** > delete **Delete ** next to the desired taxonomy. **Note:** You can delete only custom taxonomies.\n- Click **Delete** (or **Cancel** ) at the confirmation prompt.## Reorder taxonomy list\nTaxonomies can be reordered to determine the order they appear in the API **Filter** pane and the API **Overview** page.\nTo reorder the taxonomy list:\n- In the Cloud console, go to the **API hub** , **Settings** , **Taxonomies** page. [Go to API hub taxonomies](https://console.cloud.google.com/apigee/hub/settings/taxonomies) \n- Click anarrow_upwardup orarrow_downwarddown arrow until the lifecycle is at   the desired position.\n-", "guide": "Apigee"}