{"title": "Apigee - GKE production cluster requirements", "url": "https://cloud.google.com/apigee/docs/api-platform/get-started/what-apigee", "abstract": "# Apigee - GKE production cluster requirements\nYou are currently viewing version 1.1 of the Apigee hybrid documentation. **This version is end of life.** You should upgrade to a newer version. For more information, see [Supported versions](/apigee/docs/hybrid/supported-platforms#supported-versions) .\nThis section describes the basic requirements for setting up a Google Kubernetes Engine (GKE) cluster suitable for an Apigee hybrid production installation.\nA production cluster can consume significant resources because it  includes more nodes and larger virtual machine configurations than a non-production  setup. Also, a production cluster might be hosted in multiple zones and regions worldwide.\n", "content": "## \n Creating the cluster\nFor information about creating GKE clusters, see [ Creating a cluster](https://cloud.google.com/kubernetes-engine/docs/how-to/creating-a-cluster) in the GKE documentation.\n## Production cluster requirements\nFollow these requirements when creating your production cluster:\n### Software versions\n| Requirement  | Value                                                       |\n|:-------------------|:------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| Kubernetes version | Version 1.13 or later You can find the supported Kubernetes cluster versions by issuing the following command: gcloud container get-server-config Supported versions are returned under the validMasterVersions: heading. |\n| kubectl version | Version 1.13.x or later. See Install and Set Up kubectl.                                          |\n### Cluster template configuration\nChoose these template configuration options for your production GKE cluster:\n| Configuration  | Value                                                                     |\n|:-------------------|:--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| Cluster template | Standard cluster                                                                  |\n| Location type  | Regional (recommended)                                                                |\n| Availability zones | 3                                                                      |\n| Autoscaling  | Enable autoscaling for your nodes, with the minimum and maximum number of instances set to the same number. GKE will give you a warning about setting the values to the same number. You can ignore this warning. For more information, see Scale and autoscale hybrid services. |\n| Storage   | Storage is provisioned dynamically using the StatefulSet dynamic provisioner.                                                   |\n### Node requirements\nA [ node pool](https://cloud.google.com/kubernetes-engine/docs/concepts/node-pools) is a group of nodes within a cluster that all have the same configuration. By default, you must configure two node pools in your cluster -- one for the stateful Cassandra pods and one for the rest of the pods, which are stateless. Configure these two node pools as described below:\nConfigure a stateful node pool as follows:\n| Configuration   | Value                                 |\n|:------------------------|:---------------------------------------------------------------------------------------------------------------------------------------|\n| Name     | apigee-data NOTE: You must use the name apigee-data. If you want to use another node pool name, see Configure dedicated node pools. |\n| Minimum number of nodes | 3                                  |\n| Machine type   | N1-standard-8 (Standard machine type with 8 vCPUs, 30 GB of memory)                 |\n| Storage     | Storage will be provisioned dynamically using StatefulSet dynamic provisioner               |\nConfigure a stateless node pool as follows:\n| Configuration   | Value                                  |\n|:------------------------|:---------------------------------------------------------------------------------------------------------------------------------------------|\n| Name     | apigee-runtime NOTE: You must use the name apigee-runtime. If you want to use another node pool name, see Configure dedicated node pools. |\n| Minimum number of nodes | 3 (1 per zone)                                |\n| Machine type   | N1-standard-4 (Standard machine type with 4 vCPUs, 15 GB of memory)                   |", "guide": "Apigee"}