{"title": "Apigee - Configure forward proxying for API proxies", "url": "https://cloud.google.com/apigee/docs/api-platform/get-started/what-apigee", "abstract": "# Apigee - Configure forward proxying for API proxies\nYou are currently viewing version 1.2 of the Apigee hybrid documentation. **This version is end of life.** You should upgrade to a newer version. For more information, see [Supported versions](/apigee/docs/hybrid/supported-platforms#supported-versions) .\nForward proxies provide a single point through which multiple machines send requests to an external server. They can enforce security policies, log and analyze requests, and perform other actions so that requests adhere to your business rules. With Apigee hybrid, you can configure a forward proxy that intermediates your API proxies and an external TargetEndpoint (a backend target server).\nTo use an HTTP forward proxy between hybrid and the TargetEndpoint, you must configure the outbound proxy settings in your overrides file. These environment-scoped properties route target requests from hybrid to the HTTP forward proxy. You also need to ensure `use.proxy` is set to \"true\" for any TargetEndpoint that you want to go through an HTTP forward proxy. See the bottom of the page for instructions.\nTo configure a hybrid environment for forwarding proxying, add the [envs.httpProxy property](/apigee/docs/hybrid/v1.2/config-prop-ref#envs) to your overrides file and apply it to the cluster. For example:\n```\nenvs:  - name: test    httpProxy:      scheme: HTTP      host: 10.12.0.47      port: 3128      ...\n```\n**NOTE: ** The`scheme`can be HTTP or HTTPS and must be uppercase.\nFor details on each of the `envs.httpProxy` configuration properties refer to the [Configuration property reference](/apigee/docs/hybrid/v1.2/config-prop-ref#envs) .\nForward proxying is configured for an environment; all traffic going from API proxies in that environment to backend targets goes through the specified HTTP  forward proxy. If the traffic for a specific target of an API proxy should go directly to the backend target, bypassing the forward proxy, then set the following property in the TargetEndpoint to override the HTTP forward proxy:\n```\n<Property name=\"use.proxy\">false</Property>\n```\nFor more information on setting the TargetEndpoint properties, including how to configure the connection to the target endpoint, see [Endpoint properties reference](/apigee/docs/api-platform/reference/endpoint-properties-reference) .\nSet `use.proxy` to \"true\" for any TargetEndpoint that you want to go through an HTTP forward proxy:\n```\n<Property name=\"use.proxy\">true</Property>\n``", "content": "`", "guide": "Apigee"}