{"title": "Apigee - Step 1: Create a Google Cloud account", "url": "https://cloud.google.com/apigee/docs/api-platform/get-started/what-apigee", "abstract": "# Apigee - Step 1: Create a Google Cloud account\nYou are currently viewing version 1.1 of the Apigee hybrid documentation. **This version is end of life.** You should upgrade to a newer version. For more information, see [Supported versions](/apigee/docs/hybrid/supported-platforms#supported-versions) .\nBefore you do anything, you'll need a [Google Cloud console](https://console.cloud.google.com) account and project. This step describes how to create a Google Cloud account. If you already have Cloud Identity or GSuite configured for your organization, you can skip to the next step ( [Step 2: Create a Google Cloud project](/apigee/docs/hybrid/v1.1/precog-gcpproject) ).\n**NOTE:** These instructions involve creating a Google account with your corporate email address and enabling Google Cloud access for that account. If you'd prefer to set up Cloud Identity for your organization, please see [Set up CloudIdentity](#cloud-identity) .\nIf you choose to set up Cloud Identity, domain verification is required.\n**To create a Google Cloud account:**\n- Open [Google Cloud console](https://console.cloud.google.com) in a browser.\n- When prompted to sign in, create a new account by clicking **Create account** :\n- Follow the instructions to register your corporate email address as a [Google account](https://support.google.com/accounts/answer/27441) .  Alternatively, you can use a Gmail account or other Google account.\n- Continue to the [Google Cloud console](https://console.cloud.google.com) and accept the Google Cloud terms presented. **NOTE:** You do not need to activate Google Cloud to use Apigee  hybrid, but a free trial with a $300 credit is provided if you'd like to test out Google Cloud  services.", "content": "## Set up Cloud Identity\nIf you'd prefer to use Cloud Identity to manage your organizational identity with Apigee, please take note of the following:\n- General information on Cloud Identity can be found [here](https://support.google.com/cloudidentity/answer/7319251) or in the [Cloud Identity Help Center](https://support.google.com/cloudidentity) .\n- Cloud Identity provides multiple ways to create users from your organization in bulk,  including sync tools with your [LDAP server](https://support.google.com/cloudidentity/answer/106368) and the ability to configure [SSO](https://support.google.com/cloudidentity/topic/7558768) .\n- Using Cloud Identity with Google Cloud provides you with a Google Cloud: this allows for more  advanced resource hierarchy configuration. Although not needed for Apigee hybrid, it  might be useful if you plan to use other Google Cloud services or have multiple members of your  organization access the product.\n- To use Cloud Identity, you must [verify ownership of the domain](https://support.google.com/cloudidentity/answer/7331243) that you plan to use.## Next step\nstepper_buttons is defined in localvars Iterate over all the buttons in the data dictionary If the button's step matches the current step in the process, make the button disabled If the button's step matches the next step [1](/apigee/docs/hybrid/v1.1/precog-gcpaccount) If the button's step matches the current step in the process, make the button disabled In all other cases (previous buttons or future buttons (after the next one), make them links [(NEXT) Step 2: Create a Google Cloud project](/apigee/docs/hybrid/v1.1/precog-gcpproject) If the button's step matches the current step in the process, make the button disabled [3](/apigee/docs/hybrid/v1.1/precog-enableapi) If the button's step matches the current step in the process, make the button disabled [4](/apigee/docs/hybrid/v1.1/precog-provision) If the button's step matches the current step in the process, make the button disabled [5](/apigee/docs/hybrid/v1.1/precog-add-environment)", "guide": "Apigee"}