{"title": "Apigee - What is Apigee API hub?", "url": "https://cloud.google.com/apigee/docs/api-platform/get-started/what-apigee", "abstract": "# Apigee - What is Apigee API hub?\n**    Preview    — Apigee API hub ** This feature is subject to the \"Pre-GA Offerings Terms\" in the General Service Terms section   of the [Service Specific Terms](/terms/service-terms#1) .     Pre-GA features are available \"as is\" and might have limited support.    For more information, see the [launch stage descriptions](/products#product-launch-stages) .\nApigee API hub enables you to consolidate and organize information about all of the APIs in your company's organization. It includes APIs at all stages of their lifecycle, from design and implementation through deprecation and retirement. API hub allows developers to discover APIs easily and leverage the work of other teams wherever possible. API platform teams can use API hub to centrally manage their portfolio of APIs.\n", "content": "## Discover and manage APIs with Apigee API hub\nMany organizations are challenged by the increasing number of APIs that they  develop and use. As the number of APIs increases, they become harder to track,  which can lead to duplication rather than reuse, an expensive inefficiency.  When APIs proliferate without design standards and governance checks, the  API landscape grows inconsistent, slowing teams down, when a well-organized  API program helps them go faster.\nAPI hub allows developers to upload and share descriptions of APIs that are  either currently available or in development. These descriptions include  standard formats like [OpenAPI](https://www.openapis.org/) , the [ Google API Discovery Service Format](https://developers.google.com/discovery) , and the [ Protocol Buffers Language](https://developers.google.com/protocol-buffers) .\nThe API hub experience is primarily aimed at consumers and producers of APIs  within an organization whose main concerns are finding and listing APIs in  their organization's catalog.\nAPI hub interacts with [API Registry](/apigee/docs/api-hub/get-started-registry-api) to view and manage your organization's APIs. Permissions in API hub and  API Registry are controlled through Google Cloud IAM. For details, see [Roles](/apigee/docs/api-hub/permissions#roles) .\n## Key benefits of Apigee API hub\nAPI hub allows developers to:\n- Discover and explore the full inventory of API assets\n- Quickly find existing APIs\n- Easily add APIs\n- Minimize API duplication\n- Follow consistent standards\n- Identify API dependencies and improve supportability for apps\nBut perhaps most importantly, bringing everything about APIs together into  one place can accelerate the consistency and utilization of an API  portfolio. With organization-wide visibility, many find they need less  explicit governance even as their APIs become more standardized and easy to  use.\n## What's next?\n[  Get started with API hub](/apigee/docs/api-hub/get-started-api-hub)", "guide": "Apigee"}