{"title": "Apigee - Decommission a hybrid org", "url": "https://cloud.google.com/apigee/docs/api-platform/get-started/what-apigee", "abstract": "# Apigee - Decommission a hybrid org\nYou are currently viewing version 1.7 of the Apigee hybrid documentation. **This version is end of life.** You should upgrade to a newer version. For more information, see [Supported versions](/apigee/docs/hybrid/supported-platforms#supported-versions) .\nThis document outlines the steps to decommission an org from a hybrid deployment. Decommissioning an org means deleting all data related to the org across all Cassandra pods in all Kubernetes clusters.\nPlease ensure there is no live traffic going to the org you plan to remove.\n", "content": "## Limitations\nOnly one org can be decommissioned at a time. Decommissioning multiple orgs simultaneously is not supported.\n## Get the org name\nSome commands in these instructions require you to use a properly formatted org name.\nTo get the org name for use in commands on this page:- Retrieve the org name from the org's`overrides.yaml`file.\n- If the org name contains any dashes (\"-\"), replace them with underscores (\"_\").## Instructions\nFollow these instructions to decommission an org from a hybrid deployment.\n- Back up the org- If it's not already enabled, enable backups on the hybrid deployment. In multi-region   setups, use the hybrid deployment operating in the primary region. See [Cassandra backup overview](/apigee/docs/hybrid/v1.7/cassandra-backup-overview) for information on hybrid backups.\n- Trigger a hybrid backup job using the following command:```\nkubectl create job -n apigee --from=cronjob/apigee-cassandra-backup BACKUP_JOB_NAME\n```The can be any valid container name.\n- Once the backup job completes, use the \"Check the status of the backup job\" and   \"Check the backup logs\" instructions in [Monitoring backups](/apigee/docs/hybrid/v1.7/monitor-cassandra-backups) to verify the backup was successful.\n- **(Optional)** If you have configured Apigee Telemetry (Metrics and Logger) on the org to be deleted, follow these steps to reconfigure them so that the metrics and log data apply to a new org/project.\n- Run this command for the org where you want to send the data. Be sure to use the`overrides.yaml`file for the org. For example, if the org to be decommissioned is  \"test-dev\" the`overrides.yaml`file should contain an`org: test-dev`org field.```\napigeectl apply --telemetry -f overrides.yaml\n```\n- Run this command, making sure to use the correct org/project:```\nkubectl -n apigee get apigeetelemetry apigee-telemetry -oyaml | grep `gcpProjectID:`\n```\n- Delete the org's Kubernetes resources from the hybrid deployment.Be sure to use the `overrides.yaml` file for the org. For example, if the org to be decommissioned is  \"test-dev\" the `overrides.yaml` file should contain an `org: test-dev` org field.For multi-region hybrid deployments, run these commands against each hybrid deployment in  each region.```\nkubectl config current-context # Verify the current context is the correct context for the hybrid deploymentapigeectl check-ready -f overrides.yaml # Check the deployment statusapigeectl delete --settings virtualhost -f overrides.yamlapigeectl check-ready -f overrides.yaml # Check the deployment statusapigeectl delete --all-envs -f overrides.yamlapigeectl check-ready -f overrides.yaml # Check the deployment statusapigeectl delete --org -f overrides.yamlapigeectl check-ready -f overrides.yaml # Check the deployment status    \n```\n- Delete the org data from the hybrid deployment. **Once this step is complete all org data\n will be gone from the hybrid deployment.** - Exec into the`apigee-cassandra-default-0`pod:```\nkubectl exec -it -n apigee apigee-cassandra-default-0 -- /bin/bash\n```\n- Execute the following command. Copy the list of all the names that are shown in the output.   This list will be needed later.```\nfind /opt/apigee/data/apigee-cassandra/ -iname '*ORG_NAME_hybrid' -type d -maxdepth 2 -printf \"%f\\n\"\n```See [Get org name](#get-org-name) for instructions on how to find and prepare the .Exit from the `apigee-cassandra-default-0` pod.\n- Create a Cassandra debug client pod as described in [Create a client container for debugging](/apigee/docs/hybrid/v1.7/ts-cassandra#create-a-client-container-for-debugging) .   Move on to the next step after getting a`cqlsh`prompt.\n- Execute the following commands in the`cqlsh`prompt:```\ndesc keyspaces;\n```Make sure this command returns no errors.For each name in the list created earlier from the `apigee apigee-cassandra-default-0` ,   run the following commands:```\ndrop keyspace \n```Exit from the Cassandra debug client pod.\n- Perform a rolling restart of all Cassandra pods. Restarting the Cassandra pods can be done in  any order as long as only one Cassandra pod is restarted at a time. For multi-region  deployments, perform a rolling restart on all Cassandra pods in each hybrid region.Run the following command and verify the state shows \"Running\":```\nkubectl get apigeeds -n apigee\n```Restart a single Cassandra pod with the following command:```\nkubectl delete pod -n apigee CASSANDRA_POD_NAME\n```Wait for the pod to reach `Running` state using:```\nkubectl get pods -n apigee\n```Restart the next Cassandra pod.\n- After executing the`cqlsh`commands, run the following commands on all   Cassandra pods in the hybrid deployment. For multi-region hybrid deployments, run the   commands on all Cassandra pods in all hybrid regions.```\nkubectl exec -it -n apigee CASSANDRA_POD_NAME -- /bin/bash\n``````\nfind /opt/apigee/data/apigee-cassandra/ -iname '*ORG_NAME_hybrid' -type d -maxdepth 2\n```See [Get org name](#get-org-name) for instructions on how to find and prepare the .```\nfind /opt/apigee/data/apigee-cassandra/ -iname '*ORG_NAME_hybrid' -type d -maxdepth 2 -exec rm -rf {} +\n```\n- Exit from the Cassandra pod.", "guide": "Apigee"}