{"title": "Apigee - Error handling strategies", "url": "https://cloud.google.com/apigee/docs/api-platform/get-started/what-apigee", "abstract": "# Apigee - Error handling strategies\n**Announcement:** Application Integration is now available for your Google Cloud project. You can now use both Apigee Integration and Application Integration within the same Google Cloud project. [Learn more](/apigee/docs/api-platform/integration/using-application-integration)\nThe error handling strategy for a task specifies the action to take if the task fails due to a temporary error. To configure an error handling strategy for a task, do the following:\n- Click the existing task in your integration editor to open the task configuration  pane.\n- Expand the **Error handling** section and go to **Error handling strategy** .\n- If your integration is running in synchronous mode, click **Strategy for synchronous executions** and select the [type of strategy](#type) that you want to use.\n- If your integration is running in asynchronous mode, click **Strategy for asynchronous executions** and select the [type of strategy](#type) that you want to use.", "content": "## Types of error handling strategies\n- The following tables describes the different error handling strategies that you can use for a task:\n- | Strategy type      | Description                                                                                                                                |\n|:------------------------------------|:----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| Fatal        | Stops the execution of the entire integration and marks the execution status as Failed.                                                                                                             |\n| Ignore        | Ignores the failure of the task. The integration continues to run the next tasks assuming the failed task has Succeeded.                                                                                                    |\n| nan         | Stops execution of the task and marks the integration status as Failed. If an alternate path to the final task (leaf task) exists, tasks in the alternate path are run. If all tasks in the alternate path run successfully, marks the integration status as Succeeded.                                                                 |\n| Restart integration with backoff | Runs the entire integration from the first task. However, the task might fail again. To avoid repeat failure, specify the time interval between restarts in the Retry interval (in seconds) field and the number of permitted restart attempts in the Maximum retry count field.                                                              |\n| Retry task with exponential backoff | Runs the integration from the failed task. If the task fails during a retry, the time interval between each retry attempt increases by the power of 2. There is a delay of 1 to 5 seconds that is added to the backoff time. For example, if the specified retry interval is 3 seconds, the first retry occurs after 3 seconds. The second retry occurs after 9 seconds, the third retry after 81 seconds, and so on. The process continues until the maximum number of retries is reached or the task succeeds, whichever is earlier. |\n| Retry task with fixed interval  | Runs the integration from the failed task. If the task fails during a retry, the time interval between each retry attempt remains constant. For example, if the specified retry interval is 3 seconds, retries occur every 3 seconds. The process continues until the maximum number of retries is reached or the task succeeds, whichever is earlier.                                             |\n| Retry task with linear backoff  | Runs the integration from the failed task. If the task fails during a retry, the time interval between each retry attempt increases linearly. There is a delay of 1 to 5 seconds that is added to the backoff time. For example, if the specified retry interval is 3 seconds, the first retry occurs after 3 seconds. The second retry occurs after 6 seconds, the third retry after 9 seconds, and so on. The process continues until the maximum number of retries is reached or the task succeeds, whichever is earlier.   |\n-", "guide": "Apigee"}