{"title": "Apigee - Get started with connectors", "url": "https://cloud.google.com/apigee/docs/api-platform/get-started/what-apigee", "abstract": "# Apigee - Get started with connectors\nThis tutorial shows you how to use Apigee Integration and connectors to create a sample integration that triggers the publication of a Cloud Pub/Sub message. The tutorial assumes that you have a working knowledge of [Apigee Integration](/apigee/docs/api-platform/integration/what-is-apigee-integration) .\nIn this example, calling an API endpoint triggers the publication of a message to a Cloud Pub/Sub topic. The steps below describe how to configure the API trigger and Pub/Sub connection required to run a successful integration.\n", "content": "## Before you begin\nBefore beginning this tutorial, confirm your Google Cloud login credentials and organization details. This information is required to access connectors UI. Your Apigee credentials are required to access the connectors task within the Apigee Integration designer. Additional prerequisite steps are described below:\n- Before creating a connection , complete the following steps: **Note** : These steps are only required if you are enabling the Apigee Integration  and Connectors add-ons for the first time for use with Apigee.- Create a new Apigee instance. New Apigee instances can  be provisioned with the [Provisioning UI](https://apigee.google.com/setup?project=) .For the list of regions supporting connectors,   see [Supported connector regions](/apigee/docs/api-platform/connectors/manage-connections#supported-regions) .\n- Confirm that the Apigee Integration and connectors features are entitled to  your Apigee subscription.\n- Enable the Apigee Integration and connectors features using the following command:```\ncurl -H \"Authorization: Bearer $(gcloud auth print-access-token)\" -H \\\"content-type:application/json\" \\\"https://apigee.googleapis.com/v1/organizations/PROJECT_ID:setAddons\" -XPOST \\-d '{\"addonsConfig\": {\"integrationConfig\": {\"enabled\": true}, \"connectorsPlatformConfig\": {\"enabled\": true}}}'\n``` **Warning** : When you run an add-on command, it overwrites any existing add-ons. Therefore, if you have any existing add-ons, include them in the add-on command. Otherwise, the command to enable Apigee Integration and connectors will disable all other add-ons in your existing organization. And if an add-on is disabled, Apigee deletes all configurations of the add-on (feature). For example, if you disable the Integrations add-on, all integrations are deleted.\n- If you don't have a service account, create a service account.A service account is a special type of Google account intended to represent a non-human    user that needs to authenticate and be authorized to access data in Google APIs.    If you don't have a service account, you must create a service account. For more    information, see [Creating a service account](/iam/docs/creating-managing-service-accounts#creating) .\n## Enable required services\n- Connectors requires that you enable the following Google services:\n- | 0       | 1     |\n|:-----------------------------|:-------------------|\n| Name       | Title    |\n| apigee.googleapis.com  | Apigee API   |\n| secretmanager.googleapis.com | Secret Manager API |\n| connectors.googleapis.com | Connectors API  |\n- If these services have not been enabled for your project previously, you are prompted to enable them when creating the connection in the Create Connection page.\n- To understand how to enable services, see [Enabling services](/service-usage/docs/enable-disable#enabling) .## What's next\n- Learn how to [create and use a Pub/Sub connection in your integration](/apigee/docs/api-platform/integration/get-started-connectors) .\n- See the list of [supported connectors](/integration-connectors/docs/all-integration-connectors) .\n- Learn how to [create and manage connections](/integration-connectors/docs/manage-connectors) .-", "guide": "Apigee"}