{"title": "Apigee - Call Integration task", "url": "https://cloud.google.com/apigee/docs/api-platform/get-started/what-apigee", "abstract": "# Apigee - Call Integration task\n**Announcement:** Application Integration is now available for your Google Cloud project. You can now use both Apigee Integration and Application Integration within the same Google Cloud project. [Learn more](/apigee/docs/api-platform/integration/using-application-integration)\nThe **Call Integration** task lets you invoke or call other integrations created within your Google Cloud project.\nThe **Call Integration** task is useful in scenarios where you need to define multiple small integrations (sub-integrations) that is controlled using a main integration (parent integration). After running a sub-integration, you can also read the response of the sub-integration in your main integration.\n", "content": "## Before you begin\n- The **Call Integration** task uses the API trigger to identify and call other integrations and sub-integrations. Therefore, you must ensure that the integrations you want to call are configured using the API trigger. For information about configuring an API trigger see [API trigger](/apigee/docs/api-platform/integration/configuring-api-trigger) .\n- Ensure that you have [attached a user-managed service account](/application-integration/docs/access-control#add-service-account) to your integration. If your integration does not have user-managed service account configured, then by default the [default service account](/application-integration/docs/access-control#default-service-account) (`service-` `` `@gcp-sa-apigee.iam.gserviceaccount.com`) is used for authentication.\n- Ensure that your service account has the **Application Integration Invoker** IAM role. For information about granting roles to a service account, see [Manage access to service accounts](/iam/docs/manage-access-service-accounts) .## Configure the Call Integration task\nTo configure the **Call Integration** task:\n- In the [Apigee UI](https://apigee.google.com) , select your.\n- Click **Develop > Integrations** .\n- Select an existing integration or create a new integration by clicking **Create Integration** .If you are creating a new integration:- Enter a name and description in the **Create Integration** dialog.\n- Select a **Region** for the integration from the list of supported regions.\n- Click **Create** .\nThis opens the integration in the .\n- In thenavigation bar, click **+Add a task/trigger > Tasks** to view the list of available tasks.\n- Click and place the **Call Integration** element in the integration editor.\n- Click the **Call Integration** task element on the designer to view the **Call Integration** task configuration pane.\n- Configure the following sub integration details:- **API Trigger ID:** Type the [API trigger ID](/apigee/docs/api-platform/integration/configuring-api-trigger#configure-an-api-trigger) of the integration that you want to call. You can call a single integration or multiple integrations with the same trigger ID.\n- **Run all integrations with this API Trigger ID:** Select this option to call all the integrations   that have the same API **Trigger ID** .For example, if integration `A` and integration `B` , have the same API **Trigger ID** , both the integrations `A` and `B` are run. **Note** : If you select this option, the response from the sub-integrations   will not be available in the main integration. If you want to access the response of the   sub-integrations, select the **Run a single integration** option.\n- **Run a single integration** : Select this option to call only the integration specified in the **Integration name** field. You can access and map the response from the sub-integration   by configuring the fields detailed in [Map sub-integration response variables](#params) .\n- **Execution strategy:** Select the execution modes for the sub-integrations that you want to call.- **SYNC** : Runs the sub-integration in synchronous mode. In this mode, the main integration  waits for the sub-integrations to complete before continuing with the downstream tasks.\n- **ASYNC** : Runs the sub-integration in asynchronous mode. In this mode, the main integration does not wait for the sub-integrations to complete. Immediately after calling the sub integrations, the main integration runs the downstream tasks.If this option is selected, set the **Execution delay (in milliseconds)** . When set, this specifies the  time delay until the integration is run.\nAll changes to the properties are saved automatically.## Map sub-integration response variables\n| Property        | Description                                                                                                                             |\n|:----------------------------------------|:------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| Map to sub-integration input(s)   | Maps values from the main integration to the sub-integration. This field takes values in the form of key-value pairs, where the key is a variable in the main integration, and the value is the corresponding input variable in the sub-integration. For example, if you want to map the main integration's productID variable to the subIntProductID sub-integration variable, select productID from the Integration variable to map from field and enter subIntProductID in the Subintegration input to map to field. |\n| Map values to sub-integration output(s) | Maps the sub-integration output variables to the main integration variables. Click Subintegration output to map from and select the sub-integration. Click Integration variable to map to and select the corresponding main integration variable. Note: This field is only displayed when the Run a single integration option is selected with the SYNC execution strategy.                                     |\n## Best practices\nFor information about the usage limits that apply to the **Call Integration** task, see [ Usage limits](/apigee/docs/api-platform/integration/system-limits#usage-limits) .\n## Error handling strategy\nAn error handling strategy for a task specifies the action to take if the task fails due to a [temporary error](/apigee/docs/api-platform/integration/error-handling) . For information about how to use an error handling strategy, and to know about the different types of error handling strategies, see [Error handling strategies](/apigee/docs/api-platform/integration/error-handling-strategy) .", "guide": "Apigee"}