{"title": "Apigee - Part 1: Google Cloud services and hybrid UI configuration", "url": "https://cloud.google.com/apigee/docs/api-platform/get-started/what-apigee", "abstract": "# Apigee - Part 1: Google Cloud services and hybrid UI configuration\nYou are currently viewing version 1.1 of the Apigee hybrid documentation. **This version is end of life.** You should upgrade to a newer version. For more information, see [Supported versions](/apigee/docs/hybrid/supported-platforms#supported-versions) .\n", "content": "## Prerequisites\nThis section describes tasks you must accomplish before you set up the hybrid UI and Google Cloud services.\n| To ensure that you can provision your organization (as described in this section):       |\n|:-------------------------------------------------------------------------------------------------------------|\n| Obtain permission from your Apigee account representative; for more information, contact Apigee Sales.  |\n| Install the gcloud CLI, which is part of the Google Cloud SDK, as described in Installing Google Cloud SDK. |\nAfter you have satisfied the above prerequisites, you can continue with [the steps in next section](#process) .\n## Process overview\nThe general process for setting up the hybrid UI/Google Cloud services is as follows:\n- **Create a Google Cloud account** using the Google Cloud Platform Console. This account will be bound to a new hybrid organization.\n- **Create a Google Cloud project** in the Console. Then request that Apigee make it hybrid enabled. This can take 24 to 48 hours for us to do for you, so you better get crackin'!\n- **Enable APIs** in the Console. Without these, hybrid services wouldn’t be able to talk to one another or other services.\n- **Create an organization** with the Apigee APIs. Once you have an organization, you're almost ready to make API calls and create API proxies.\n- **Add an environment** . If you don't do this, you won't be able to complete the hybrid runtime installation, nor will you have anywhere to deploy your API proxies to.\nEach of these steps is described in the sections that follow.\n[Let's Go!](/apigee/docs/hybrid/v1.1/precog-gcpaccount)", "guide": "Apigee"}