{"title": "Apigee - Part 2: Hybrid runtime setup", "url": "https://cloud.google.com/apigee/docs/api-platform/get-started/what-apigee", "abstract": "# Apigee - Part 2: Hybrid runtime setup\nYou are currently viewing version 1.4 of the Apigee hybrid documentation. **This version is end of life.** You should upgrade to a newer version. For more information, see [Supported versions](/apigee/docs/hybrid/supported-platforms#supported-versions) .\n", "content": "## \n Supported platforms\nSee [Apigee hybrid: supported platforms](/apigee/docs/hybrid/supported-platforms) .\n## \n Minimum cluster configurations\nYour cluster must meet minimum configuration requirements. For details, see [Minimum cluster configurations](/apigee/docs/hybrid/v1.4/cluster-overview) .\n## \n Cluster permissions\nEach supported platform has its own permission requirements for creating a cluster. After the cluster is created. As cluster owner, you can proceed to install the Apigee-specific components (including Apigee, ASM, and cert-manager) into the cluster. However, if you want to delegate to another user the installation of the runtime components into the cluster, you can manage the necessary permissions through Kubernetes [authn-authz](https://kubernetes.io/docs/reference/access-authn-authz/rbac/) .\nTo install the hybrid runtime components into the cluster, a non-cluster-owner user should  have CRUD permission on these resources:\n- ClusterRole\n- Webhooks (ValidatingWebhookConfiguration and MutatingWebhookConfiguration)\n- PriorityClass\n- ClusterIssuer\n- CustomerResourceDefinitions\n- StorageClass (optional, if the default StorageClass is not used)## Prerequisites\nThis section describes tasks you must accomplish before you begin the runtime plane quickstart install.\n| Complete the following tasks to ensure that you can successfully begin the runtime installation (as described in this section):                   |\n|:-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| Complete the Google Cloud and UI setup steps in Configure Google Cloud services and hybrid UI.                            |\n| Have a domain name you can use for your Apigee hybrid installation. This should be a domain you have management access to. If you need to register a domain, see a domain registrar like Google Domains. |\n**Note about clusters:** You can create a new separate cluster for  Apigee hybrid or you can install it in a cluster that is running other workloads.- **Shared cluster:** If you install Apigee hybrid in a cluster running other   workloads, you need to upgrade and maintain your GKE/AKS cluster at the versions and features   required in common for Apigee hybrid and for your other workloads. You may want to develop   a plan to migrate one or more workloads in case conflicts arise between supported versions and   requirements.\n- **Separate cluster:** Creating a dedicated cluster for Apigee hybrid adds   isolation. It also adds the operational effort of maintaining the new cluster.\nBoth options are valid.\n**Note about VPC Service Controls:** If you plan to enable Google Cloud [ Virtual Private Cloud (VPC) Service Controls](https://cloud.google.com/vpc-service-controls) with your Apigee hybrid installation, see [Using VPC Service Controls with Apigee and Apigee hybrid](/apigee/docs/api-platform/security/vpc-sc) for instructions before you proceed.\nAfter you have satisfied the above prerequisites, go to the quickstart for your platform:\n| 0          |\n|:---------------------------------------|\n| Let's get started and create a cluster |", "guide": "Apigee"}