{"title": "Apigee - API hub prerequisites", "url": "https://cloud.google.com/apigee/docs/api-platform/get-started/what-apigee", "abstract": "# Apigee - API hub prerequisites\n**    Preview    — Apigee API hub ** This feature is subject to the \"Pre-GA Offerings Terms\" in the General Service Terms section   of the [Service Specific Terms](/terms/service-terms#1) .     Pre-GA features are available \"as is\" and might have limited support.    For more information, see the [launch stage descriptions](/products#product-launch-stages) .\nThis document describes the steps you must complete prior to provisioning API hub.\n", "content": "## Prerequisites\nYou must meet the following prerequisites:\n| Done? | Prerequisite     | Description                                                                                                                                            |\n|--------:|:-----------------------------|:-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n|  nan | Google Cloud billing account | You must have a Google Cloud account with active billing. For more information, see Create a new billing account.                                                                                                                  |\n|  nan | Google Cloud project   | Create a new Google Cloud project. Project names must adhere to the following guidelines: Start with a lower-case letter. For example, my-org is OK, but _my-org is not. Include only lowercase letters, numbers, or hyphens (-). For more information, see Creating a project. Note: API hub does not currently support VPC Service Controls. If your project has VPC-SC enabled, API hub provisioning will fail. You must use a project that does not have VPC-SC enabled.                          |\n|  nan | Software      | Install the following software on your administrative machine: Google Cloud SDK (required for command line; recommended for UI-based installations) Initialize the Cloud SDK, as described in Initializing the gcloud CLI, or otherwise ensure that the Google Cloud project you created in Google Cloud project is the default project for gcloud. Install gcloud beta components: gcloud components install beta curl (optional but strongly suggested) Note: When provisioning using the UI, you do not need to do the steps in this Software row. They are done automatically. |\n|  nan | Permissions     | To provision API hub, you must have the Apigee Registry Admin role. For the service account and CMEK setup, you should have either the Owner (roles/owner) or Cloud KMS Admin (roles/cloudkms.admin) role. See Before you begin for more information. For information on granting roles, see Manage access to projects, folders, and organizations.                                                         |\n|  nan | Encryption key    | Because information about internal APIs may be considered sensitive, you must have a customer managed encryption key (CMEK). If you don't have one already, you can create one as part of the provisioning process.                                                                                         |\n## Next steps\nEnsure that you have the correct [permissions](/apigee/docs/api-hub/permissions) to provision  API hub.", "guide": "Apigee"}