{"title": "Apigee - About service accounts", "url": "https://cloud.google.com/apigee/docs/api-platform/get-started/what-apigee", "abstract": "# Apigee - About service accounts\nYou are currently viewing version 1.1 of the Apigee hybrid documentation. **This version is end of life.** You should upgrade to a newer version. For more information, see [Supported versions](/apigee/docs/hybrid/supported-platforms#supported-versions) .\nA is a special type of account in Google Cloud that enables components and applications of a system to interact with each other and with other APIs. For more information about Google Cloud, see [About Google Cloud services](/apigee/docs/hybrid/v1.1/what-is-hybrid#about-gcp) .\n**SERVICE ACCOUNT FACTOID** Google Cloud projects have a limit of 100 service accounts—including the default service accounts (if any).\nHybrid uses Google Cloud service accounts to perform a variety of tasks, including:\n- Send log and metrics data\n- Pull trace requests\n- Connect to API gateway for administrative API requests\n- Execute back ups\n- Download proxy bundles\nWhile one service account perform all of these operations, Apigee recommends that you create multiple service accounts, each assigned to a specific task and each with its own set of permissions. This enhances security by compartmentalizing access and limiting each service account's scope and access privileges. As with user accounts, these permissions are applied by assigning one or more roles to the service account.\n", "content": "## Service accounts and roles used by hybrid components\nTo operate properly, Apigee hybrid requires you to create several service accounts. Each service account requires a specific role or roles that enable it to perform its function.\nThe following table describes the service accounts for the hybrid components:\n| Component*                | Role                 | Required for basic install?           | Description                                           |\n|:-----------------------------------------------------------------------|:-----------------------------------------------------------------------|:-----------------------------------------------------------------------|:-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| apigee-cassandra              | Storage Object Admin             | nan                 | Allows Cassandra backups to Google Cloud Storage, as described in Backup and recovery.                        |\n| apigee-logger               | Logs Writer               | nan                 | Allows logging data collection, as described in Logging. Only required for non-GKE cluster installations.                   |\n| apigee-mart               | No role                | nan                 | Allows MART service authentication. This service account should not have a role associated with it; as a result, when you create this service account, do not assign a role to it. |\n| apigee-metrics               | Monitoring Metric Writer            | nan                 | Allows metrics data collection, as described in Metrics collection                             |\n| apigee-org-admin              | Apigee Organization Admin            | nan                 | Lets you call the getSyncAuthorization API and setSyncAuthorization API. You cannot create this service account with the create-service-account tool.        |\n| apigee-synchronizer             | Apigee Synchronizer Manager           | nan                 | Allows the synchronizer to download proxy bundles and environment configuration data. Also enables operation of the trace feature.             |\n| apigee-udca               | Apigee Analytics Agent             | nan                 | Allows the transfer of trace, analytics and deployment status data to the management plane.                       |\n| * This name is used in the downloaded service account key's filename. | * This name is used in the downloaded service account key's filename. | * This name is used in the downloaded service account key's filename. | * This name is used in the downloaded service account key's filename.                            |\nIn addition to creating the service accounts listed in this table, you also download their private keys. You later use these keys to generate access tokens so that you can access the Apigee APIs.\n## Create the service accounts\n**Deleting and recreating service accounts: ** Note that  reusing the name of a deleted service account may result in unexpected behavior. If  you create a service account and delete it, always recreate it with a unique name. For  details, see [ Deleting and recreating service accounts](https://cloud.google.com/iam/docs/service-account-overview#deleting-recreating) .\nThere are several ways to create service accounts, including:\n- () [create-service-account tool](#tool) \n- [Google Cloud console](#gcp) \n- [gcloud SDK](#gcloud) \nEach of these is described in the following sections.\n### Use the service account creation tool\nThe `create-service-account` tool (available after you [download and expand apigeectl](/apigee/docs/hybrid/v1.1/install-download-install) ) creates hybrid component-specific service accounts and assigns the required roles for you. The tool also automatically downloads the service account keys and stores them on your local machine in the specified directory.\n**NOTE:** The`create-service-account`tool cannot create the`apigee-org-admin`service account. To do that, you must use the Google Cloud or the gCloud APIs.\n**To create service accounts with the create-service-account tool:**\n- Download and expand`apigeectl`(if you haven't done so already), as described  in [download and install apigeectl](/apigee/docs/hybrid/v1.1/install-download-install) .\n- Create a directory to store your service account keys. For example:```\nmkdir ./service-accounts\n```\n- Execute the following commands:```\n./tools/create-service-account apigee-metrics ./service-accounts\n./tools/create-service-account apigee-synchronizer ./service-accounts\n./tools/create-service-account apigee-udca ./service-accounts\n./tools/create-service-account apigee-mart ./service-accounts\n./tools/create-service-account apigee-cassandra ./service-accounts\n./tools/create-service-account apigee-logger ./service-accounts\n```These commands create most of the required accounts and stores their keys in the `./service-accounts` directory. These commands do not create the `apigee-org-admin` service account.If these commands fail, make sure you referenced an existing directory in which to store the  key files.For more information on using `create-service-account` , see [create-service-account reference](/apigee/docs/hybrid/v1.1/create-service-account) .\n- Create the`apigee-org-admin`service account. To do this, [use the Google Cloud console](#gcp) .\n### Use the Google Cloud console\nYou can create service accounts with the Google Cloud console.\n**NOTE:** To create service accounts in the Google Cloud console, you must have the Google Cloud Service Account Admin role or greater.\n**To create service accounts with the Google Cloud console:**\n- Open the [Google Cloud console](https://console.cloud.google.com) and log in with the user account you created in [Step 1: Create a Google Cloud account](/apigee/docs/hybrid/v1.1/precog-gcpaccount) .\n- Select the project that you created in [Step 2: Create a Google Cloud project](/apigee/docs/hybrid/v1.1/precog-gcpproject) .\n- Select **IAM & admin > Service accounts** .The console displays the **Service accounts** view. This view displays a list of  the project's service accounts. (In most cases, there will be no accounts listed yet, although  there might be default service accounts in the list, depending on how you created your  project.)\n- To create a new service account, click **+Create Service Account** at the top of  the view.The **Service account details** view displays.\n- In the **Service account name** field, enter the name of the service account.Apigee recommends that you use a name that reflects the service account's role; you  can set the name of the service acount to be the same name as the component that uses it. For  example, set the name of the Logs Writer service account `apigee-logger` .For more information about the service accounts names and roles, see [Service accounts and roles used by hybrid components](#recommended-sas) .As you enter a name, Google Cloud generates a unique service account ID for you, which is  structured like an email address, as the following example shows:You can optionally add a description in the **Service account description** field. Descriptions are helpful at reminding you what a particular service account is used  for.\n- Click **Create** .Google Cloud creates a new service account and displays the **Service account permissions** view, as the following example shows:Use this view to assign a role to your new service account.\n- Click the **Select a role** drop-down list.\n- Select the role for the service account, as described in [Service accounts and roles used by hybrid components](#recommended-sas) . If the  Apigee roles do not appear in the drop down list, refresh the page.For example, for the logging component, select the Logs Writer role.If necessary, enter text to filter the list of roles by name. For example, to list only the  Apigee roles, enter \"Apigee\" in the filter field, as the following example shows:You can add more than one role to a service account, but Apigee recommends that  you only use one role for each of the recommended service accounts. To change the roles of a  service account after you have created it, use the **IAM & admin** panel in the  Google Cloud. **NOTE:** If you do not see the roles listed in [Recommended service accounts](#recommended-sas) , check with your Apigee account  representative to be sure that your account was properly configured and that your  organization was provisioned.\n- Click **Continue** .Google Cloud displays the **Grant users access to this service account** view:\n- Under **Create key (optional)** , click **Create Key** .Google Cloud gives you the option to download a JSON or P12 key:\n- Select JSON (the default) and click **Create** .Google Cloud saves the key file in JSON format to your local machine and displays a confirmation when  it is successful, as the following example shows:You will later use some of the service account keys to configure hybrid runtime services.  For example, when you configure the hybrid runtime, you will specify the location of the service  account keys using the `.serviceAccountPath` properties.These keys are used by the service accounts to get access tokens, which the service account  then uses to make requests against the Apigee APIs on your behalf. (But that's not for a while  yet; for now, just remember where you saved it.)\n- Repeat steps 4 through 11 for each service account listed in [Service accounts and roles used by hybrid components](#recommended-sas) (except the`apigee-mart`account—which has no role associated with it—so  do not assign it a role).When you're finished, you should have the following service accounts (in addition to the  defaults, if any): In the Google Cloud console, service accounts are indicated with a icon.\nAfter you create a service account, if you want to add or remove a role to it, you must use the **IAM & Admin** view. You cannot manage roles for service accounts in the **Service accounts** view.\n**TIP:** Apigee hybrid includes a validator that checks  your service accounts' key files and permissions when [apigeectl](/apigee/docs/hybrid/v1.1/cli-reference) applies the Apigee hybrid runtime components to your cluster. This validation is  enabled by default. For more information, see [Service account validation](/apigee/docs/hybrid/v1.1/sa-validation) .\n### Use the gcloud service account creation APIs\nYou can create and manage service accounts with the Cloud Identity and Access Management API.\nFor more information, see [Creatingand managing service accounts](https://cloud.google.com/iam/docs/creating-managing-service-accounts) .\n## \n Troubleshooting\n**Deleting and recreating service accounts: ** Note that  reusing the name of a deleted service account, may result in unexpected behavior. If  you create a service account and delete it, always recreate it with a unique name.  For  details, see [ Deleting and recreating service accounts](https://cloud.google.com/iam/docs/service-account-overview#deleting-recreating) .", "guide": "Apigee"}