{"title": "Apigee - Configuring TLS for Cassandra", "url": "https://cloud.google.com/apigee/docs/api-platform/get-started/what-apigee", "abstract": "# Apigee - Configuring TLS for Cassandra\nYou are currently viewing version 1.1 of the Apigee hybrid documentation. **This version is end of life.** You should upgrade to a newer version. For more information, see [Supported versions](/apigee/docs/hybrid/supported-platforms#supported-versions) .\n", "content": "## \n How to configure TLS for Cassandra in the runtime plane\nCassandra provides secure communication between a client machine and a database cluster and between nodes within a cluster. Enabling encryption ensures that data in flight is not compromised and is transferred securely. In Apigee hybrid, TLS is enabled by default for any communication between Cassandra nodes and between clients and Cassandra nodes.\n## \nAbout Cassandra user authentication\nThe hybrid platform uses Cassandra as the backend datastore for runtime plane data. By default, any of the client communications to Cassandra requires authentication. There are three users used by clients that communicate with Cassandra. Default passwords are provided for these users, and you are not required to change them.\nThese users, including a default user, are described below:\n- **DML User** : Used by the client communication to read and write data to Cassandra  (KMS, KVM, Cahce and Quota).\n- **DDL User:** Used by MART for any of the data definition tasks like keyspace  creation, update, and deletion.\n- **Admin User:** Used for any administrative activities performed  on cassandra cluster.\n- **Default Cassandra user:** Cassandra creates a default user when  Authentication is enabled and the username is`cassandra`## \n Changing the default passwords\nApigee hybrid provides default passwords for the Cassandra users. If you want to change the default user passwords, you can do so in the `overrides.yaml` file. Add the following configuration, change the default passwords (\"iloveapis123\") as you wish, and apply the change to your cluster.\nAll the usernames must be in lowercase.\n```\ncassandra:   auth:     default:  \n## the password for the new default user (static username: cassandra)       password: \"iloveapis123\"     admin: \n## the password for the admin user (static username: admin_user)       password: \"iloveapis123\"     ddl: \n## the password for the DDL User (static username: ddl_user)       password: \"iloveapis123\"     dml: \n## the password for the DML User (static username: dml_user)       password: \"iloveapis123\"\n```\nNote the following:\n- Certificate Authority (CA) rotation is not supported.\n- A server certificate which is generated with passphrase is not supported.## Check the Cassandra logs\nCheck the logs as soon as the Cassandra starts up. The log below shows you that the Cassandra client connections are encrypted.\n```\nkubectl logs apigee-cassandra-2 -n apigee -f\nINFO 00:44:36 Starting listening for CQL clients on /10.0.2.12:9042 (encrypted)...\nINFO 00:44:36 Binding thrift service to /10.0.2.12:9160\nINFO 00:44:36 enabling encrypted thrift connections between client and server\nINFO 00:44:36 Listening for thrift clients...\n```", "guide": "Apigee"}