{"title": "Apigee - Cassandra restore overview", "url": "https://cloud.google.com/apigee/docs/api-platform/get-started/what-apigee", "abstract": "# Apigee - Cassandra restore overview\nYou are currently viewing version 1.6 of the Apigee hybrid documentation. **This version is end of life.** You should upgrade to a newer version. For more information, see [Supported versions](/apigee/docs/hybrid/supported-platforms#supported-versions) .\nThis page provides an overview of restoring Cassandra in Apigee hybrid.\n", "content": "## Why use restore?\nYou can use [backups](/apigee/docs/hybrid/v1.6/cassandra-backup-overview) to restore Apigee infrastructure from the ground up in the event of catastrophic failures, such as irrecoverable data loss in your Apigee hybrid instance from a disaster. Restoration takes your data from the backup location and restores the data into a new Cassandra cluster with the same number of nodes. No cluster data is taken from the old Cassandra cluster. The goal of the restoration process is to bring an Apigee hybrid installation back to a previously operational state using backup data from a snapshot.\nThe use of backups to restore is not recommended for the following scenarios:\n- Cassandra node failures.\n- Accidental deletion of data like`apps`,`developers`, and`api_credentials`.\n- One or more regions going down in a multi-region hybrid deployment.\nApigee Cassandra deployments and operational architecture take care of redundancy and fault tolerance for a single region. In most cases, the recommended multi-region production implementation of hybrid means that a region failure can be recovered from another live region using [region decommissioning and expansion procedures]() instead of restoring from a backup.\nBefore you begin implementing a restore from a Cassandra backup, be aware of the following:\n- **Downtime:** There will be downtime for the duration of the restoration.\n- **Data loss:** There will be data loss between the last valid backup and the time the  restoration is complete.\n- **Restoration time:** Restoration time depends on the size of the data and cluster.\n- **Cherry-picking data:** You cannot select only specific data to restore. Restoration  restores the entire backup you select.\n**Note:** When restoring an Apigee hybrid installation from backup, ensure that the backup file is created from the same hybrid version as the installation. For example, if you have a backup file created from Apigee hybrid 1.5.x, use it to restore only an Apigee hybrid 1.5.x installation. If there is version mismatch between the backup file and the hybrid installation, the restoration might not work and Apigee does not support any issues that arise because of such restoration.\n## How to restore?\nCassandra's restoration steps differ slightly depending on whether your Apigee hybrid is deployed in a single region or multiple regions. For the detailed restoration steps, see the following documentation:\n- [Restoring in a single region](/apigee/docs/hybrid/v1.6/restore-cassandra-single-region) \n- [Restoring in a multi-region](/apigee/docs/hybrid/v1.6/restore-cassandra-multi-region)", "guide": "Apigee"}