{"title": "Apigee - Step 2: Install cert-manager", "url": "https://cloud.google.com/apigee/docs/api-platform/get-started/what-apigee", "abstract": "# Apigee - Step 2: Install cert-manager\nYou are currently viewing version 1.4 of the Apigee hybrid documentation. **This version is end of life.** You should upgrade to a newer version. For more information, see [Supported versions](/apigee/docs/hybrid/supported-platforms#supported-versions) .\nThis step explains how to download and install [cert-manager](https://cert-manager.io/docs/) and [Anthos Service Mesh](https://cloud.google.com/service-mesh/docs/overview) (ASM), required for Apigee hybrid to operate.\n", "content": "## \n Install cert-manager\n- Use the following command to install cert-manager v0.14.2 from GitHub.```\nkubectl apply --validate=false -f https://github.com/jetstack/cert-manager/releases/download/v0.14.2/cert-manager.yaml\n```You should see a response that the cert-manager namespace and several cert-manager resources have been created.## \n Summary\nYou now have cert-manager installed, and you are ready to install the ASM to provide the Istio ingress function connectivity for your hybrid runtime plane.\n## Next step\nstepper_buttons is defined in localvars Iterate over all the buttons in the data dictionary If the button's step matches the current step in the process, make the button disabled [1](/apigee/docs/hybrid/v1.4/2-1-install-create-cluster) If the button's step matches the current step in the process, make the button disabled If the button's step matches the next step [2](/apigee/docs/hybrid/v1.4/2-2-install-cert-manager) If the button's step matches the current step in the process, make the button disabled In all other cases (previous buttons or future buttons (after the next one), make them links [(NEXT) Step 3: Install ASM](/apigee/docs/hybrid/v1.4/2-3-install-asm) If the button's step matches the current step in the process, make the button disabled [4](/apigee/docs/hybrid/v1.4/2-4-install-apigeectl) If the button's step matches the current step in the process, make the button disabled [5](/apigee/docs/hybrid/v1.4/2-5-install-service-accounts) If the button's step matches the current step in the process, make the button disabled [6](/apigee/docs/hybrid/v1.4/2-6-install-configure-cluster) If the button's step matches the current step in the process, make the button disabled [7](/apigee/docs/hybrid/v1.4/2-7-install-hybrid-runtime)", "guide": "Apigee"}