{"title": "Apigee - Google Cloud Platform URLs to allow for Hybrid", "url": "https://cloud.google.com/apigee/docs/api-platform/get-started/what-apigee", "abstract": "# Apigee - Google Cloud Platform URLs to allow for Hybrid\nYou are currently viewing version 1.8 of the Apigee hybrid documentation. **This version is end of life.** You should upgrade to a newer version. For more information, see [Supported versions](/apigee/docs/hybrid/supported-platforms#supported-versions) .\nIf you have a restricted VPC environment where external domains need to be allowed, here is a list of Google Cloud urls that Apigee hybrid may need to connect with during install and runtime.\n", "content": "## Google Cloud URLs for all Apigee hybrid installations\nThese URLs are used by all Apigee hybrid installations:\n| URL        | Description                                                                          |\n|:-----------------------------------|:-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| apigee.googleapis.com    | The runtime uses these APIs to learn which proxies, shared flows, etc., it should deploy, and to report its current configuration and health.                                         |\n| apigeeconnect.googleapis.com  | This APIs is needed for apigee-mart-server and apigee-connect communication when you have vpc-sc enabled to talk to the control plane.                                           |\n| binaryauthorization.googleapis.com | Optional. Only for Anthos if binary authorization is enabled                                                             |\n| gcr.io        | Contanier images are hosted in Google Container Registry.                                                              |\n| iamcredentials.googleapis.com  | Required for generating access tokens used by other gcp calls. For example, for runtime to make calls to download runtime contracts from apigee.googleapis.com, the permission is granted by a service account. So the runtime needs to get an access token before making the call to apigee.googleapis.com. |\n| logging.googleapis.com    | This API is needed for the logging agent to send logs to Cloud Logging.                                                           |\n| monitoring.googleapis.com   | Cloud Monitoring service endpoint to export metrics.                                                                |\n| oauth2.googleapis.com    | Authentication and authorization                                                                     |\n| pubsub.googleapis.com    | The runtime subscribes to a pubsub topic to learn when to initialize debug sessions.                                                       |\n| serviceusage.googleapis.com  | Inspect and manage quota for service consumers on Google Cloud Platform. Required by Anthos Service Mesh                                                  |\n| storage.googleapis.com    | The runtime downloads proxies, shared flows, resource files, and keystore aliases from Google Cloud Storage in tenant project.                                             |\n| sts.googleapis.com     | The Security Token Server providers API method for third party developers to exchange third party credentials to Google Cloud Platform tokens.                                         |\n| www.googleapis.com     | Needed for installing Apigee hybrid on Anthos.                                                                 |\n## \n Google Cloud URLs for Anthos installations\nAll Apigee hybrid installations on Anthos (on-prem and multi-cloud) use additional Google Cloud URLs. For more information, see:\n- [Proxy and firewall rules for Anthos on-prem](/anthos/clusters/docs/on-prem/how-to/firewall-rules) \n- [Proxy allowlist for Anthos multi-cloud](/anthos/clusters/docs/multi-cloud/aws/how-to/use-a-proxy#proxy_allowlist_2)", "guide": "Apigee"}