{"title": "Apigee - Part 2: Runtime quickstart", "url": "https://cloud.google.com/apigee/docs/api-platform/get-started/what-apigee", "abstract": "# Apigee - Part 2: Runtime quickstart\nYou are currently viewing version 1.1 of the Apigee hybrid documentation. **This version is end of life.** You should upgrade to a newer version. For more information, see [Supported versions](/apigee/docs/hybrid/supported-platforms#supported-versions) .\n", "content": "## \n Supported platforms\nYou can install hybrid runtime on the following platforms:\n| Platform      | Version  |\n|:-------------------------------|:---------------|\n| Google Kubernetes Engine (GKE) | Version 1.13.x |\n| Anthos (GKE on-prem)   | Version 1.1.x |\n| Azure Kubernetes Service (AKS) | 1.13.x   |\n## Prerequisites\nThis section describes tasks you must accomplish before you begin the runtime plane quickstart install.\n| To ensure that you can successfully begin the runtime installation (as described in this section):                                        |\n|:-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| Complete the GCP and UI setup steps in Configure GCP services and hybrid UI.                                              |\n| Obtain an authorized TLS key/certificate pair (required by the MART ingress gateway). The credentials must be issued by a trusted certificate authority (CA). For an example using the open source Let's Encrypt CA, see Obtain TLS credentials: An example. |\nAfter you have satisfied the above prerequisites, you can continue with the steps in [the next section](#steps) .\n## Process overview\nThe general process for performing the runtime quickstart is as follows:\n- Create a cluster and set up your shell environment.\n- Install apigeectl, plus set up your hybrid project directories, create service accounts, and create TLS certs.\n- Configure the cluster by creating and then applying the settings in an overrides file.\n- Install hybrid runtime, enable Synchronizer access, and expose the MART endpoint to your hybrid organization.\nTo get started, go to the quickstart for your platform:\n| 0    | 1      | 2    |\n|:---------------|:-----------------------|:---------------|\n| GKE Quickstart | GKE on-prem Quickstart | AKS Quickstart |", "guide": "Apigee"}