{"title": "Apigee - Local logging", "url": "https://cloud.google.com/apigee/docs/api-platform/get-started/what-apigee", "abstract": "# Apigee - Local logging\n**Announcement:** Application Integration is now available for your Google Cloud project. You can now use both Apigee Integration and Application Integration within the same Google Cloud project. [Learn more](/apigee/docs/api-platform/integration/using-application-integration)\nLocal logging refers to the integration's data or metadata that is saved during its execution. Apigee uses the saved data to generate the [integration execution logs](/apigee/docs/api-platform/integration/viewing-logs) .\nYou can set the **Local logging** to any of the following three modes:\n- **Enable(sync)** - The log data is persisted (written) during integration's  execution. In this mode, Apigee writes the log data synchronously  after each execution step. This mode guarantees the generation of logs for all the integration executions.Use this mode if your priority is to have a guaranteed generation of logs, and a latency in  integration execution time is acceptable.\n- **Enable(async) (Preview)** - The log data is persisted  (written) after the completion of the integration's execution. In this mode, the  integration takes a relatively lesser time to execute when compared to`Enable(sync)`mode,  because Apigee writes the log data asynchronously  during the integration execution. However,  this mode doesn't guarantee the generation of logs for all the executions. In rare cases,  it's possible that logs aren't generated for an integration execution.Use this mode if your priority is to run your integrations with reduced latency, and the guaranteed  generation of logs is relatively of a lesser importance.\n- **Disable** - The execution logs aren't generated for the integration.\nTo configure the local logging for your integration, do the following steps:\n- Open your integration in the [integration designer](/apigee/docs/api-platform/integration/integrations-ui-layout) .\n- Click the information icon, in the toolbar.\n- Select any one of the **Local logging** modes.\n- Click **Done** .\n**Tip: ** Disabling the local logging improves the overall integration latency, as log events aren't generated for request and response parameters, and other integration variables.\n**Note:** You can disable local logging only for the integrations that run inmode. To configure an integration for synchronous or asynchronous execution mode, set the **AsyncExecution** property in the **IntegrationCallout** policy.  For more information see, [IntegrationCallout policy](/apigee/docs/api-platform/reference/policies/integration-callout-policy#asyncexecution.html) ", "content": ".", "guide": "Apigee"}