{"title": "Apigee - Manage environments", "url": "https://cloud.google.com/apigee/docs/api-platform/get-started/what-apigee", "abstract": "# Apigee - Manage environments\nYou are currently viewing version 1.1 of the Apigee hybrid documentation. **This version is end of life.** You should upgrade to a newer version. For more information, see [Supported versions](/apigee/docs/hybrid/supported-platforms#supported-versions) .\n**More Information** For more information, see:- [About environments and environment groups](/apigee/docs/api-platform/fundamentals/environments-overview) \nYou can manage your environments with a combination of the [Google Cloud console](https://console.cloud.google.com) and the hybrid runtime configuration file. This section describes how to create a new environment, edit an environment's details, and delete an existing environment with the Google Cloud. You must then update your overrides.yaml on the runtime plane to complete the creation or deletion of an environment.\n**Note:** Do not create any new environments until you have installed the hybrid runtime on your cluster as described in [Part 2: Runtime quickstart](/apigee/docs/hybrid/v1.1/install-before-begin) .\n", "content": "## Create a new environment in the UI\nTo create a new environment, you must do the following (in this order):\n- Create a new environment in the Google Cloud console. **AND** \n- Provision the new environment in your overrides file.\n**Note:** After you create a new environment in the UI, there can be a several minute delay before you can provision it in the runtime.\nYou can create up to 75 environments per organization.\n**To create a new environment:**\n- Create the new environment as described in [Creating  environments](/apigee/docs/api-platform/fundamentals/environments-working-with#create) .There can be a several minute delay before the new environment is provisioned.Even when provisioning is done, you have one more step to perform. You must still add the  environment to the runtime's overrides.yaml file.\n- On the Kubernetes administration machine, add the new environment to the runtime's overrides file, as described in [How to add multiple environments](/apigee/docs/hybrid/v1.1/environment-create#how-to-add-multiple-environments) .## Edit an existing environment in the UI\nYou can change the following properties of an existing environment in the UI:\n- Display name\n- Description\nTo edit an existing environment, see [Editing environments](/apigee/docs/api-platform/fundamentals/environments-working-with#edit) .\n## Delete an existing environment\nTo delete an existing environment, you must do the following (in this order):\n- Delete the environment in the UI, as described in this section **AND** \n- Delete the environment from the runtime, as described in [Delete environments](/apigee/docs/hybrid/v1.1/environment-delete) .\n**To delete an existing environment:**\n- Delete the environment in the Apigee UI using the instructions in [Deleting environments](/apigee/docs/api-platform/fundamentals/environments-working-with#delete) .The environment's card in the UI displays a \"Pending Deletion\" label while Apigee deletes the  environment.There can be a several minute delay before the deletion is completed. **Note:** You're not quite done. You must  still delete the environment from the runtime's`overrides.yaml`file.\n- Delete the environment from the runtime's`overrides.yaml`file, as described in [Delete environments](/apigee/docs/hybrid/v1.1/environment-delete) .", "guide": "Apigee"}