{"title": "Apigee - Using integration variables", "url": "https://cloud.google.com/apigee/docs/api-platform/get-started/what-apigee", "abstract": "# Apigee - Using integration variables\n**Announcement:** Application Integration is now available for your Google Cloud project. You can now use both Apigee Integration and Application Integration within the same Google Cloud project. [Learn more](/apigee/docs/api-platform/integration/using-application-integration)\nApigee Integration variables can be accessed by an integration's elements in the following ways:\n| 0  | 1             | 2                                   |\n|:---------|:----------------------------------------------------|:---------------------------------------------------------------------------------------------------------------------------------------------|\n| Element | Usage of variables         | Example                                  |\n| Triggers | Write values to variables       | Pub/Sub trigger writes a message to an input variable                      |\n| Tasks | Read values from variablesWrite values to variables | Read: The Read SFDC record task reads a table name from a variable Write: The Update SFDC record task writes a new table entry to a variable |\n| Edges | Read values from variables       | Edge conditional checks whether a boolean parameter is true. If true, edge is executed.              |\n", "content": "## Variable references\nThe tasks, triggers, and edges in an integration read and write to variables using **variable references** . A variable reference takes the form `$` `` `$` where is the name of the variable. For example, an edge conditional could look like this:\n`NOT ($isNameUnique$ = false OR $numAccounts$ > 1)`\nIn this example, `isNameUnique` is a variable of data type **boolean** and `numAccounts` is a parameter of data type **integer** .\n## Creating or editing variables\nWhen a task or trigger is added to an integration, the Apigee Integration platform will automatically create the variables required to satisfy the default implementation of that task or trigger. In many cases, you may want to edit these variables or add new variables to your integration.\nTo edit an existing variable or add a new variable from the integration UI:\n- Click the **VAR** menu button in the toolbar.\n- To edit an existing variable:- Search or select the variable name from the dropdown list in the **Variable** list dialog.\n- The **Edit variable** dialog will open. Edit the variable details.\n- Click **Save** .\n- To create a new variable:- Click **Create** on the **Variable** list dialog.\n- The **Create variable** dialog will open. Enter the variable details.\n- Click **Save** .The **Variable** list pane can also be accessed by clicking anywhere on the Integration designer. Variables can be searched, edited, or added through the list pane.", "guide": "Apigee"}