{"title": "Apigee - Step 8: Install hybrid runtime", "url": "https://cloud.google.com/apigee/docs/api-platform/get-started/what-apigee", "abstract": "# Apigee - Step 8: Install hybrid runtime\nYou are currently viewing version 1.8 of the Apigee hybrid documentation. **This version is end of life.** You should upgrade to a newer version. For more information, see [Supported versions](/apigee/docs/hybrid/supported-platforms#supported-versions) .\n", "content": "## \n Apply the configuration to the cluster\nUse the following steps to install Apigee hybrid into your cluster:\n- Be sure that you are in the`` `/hybrid-files`directory.```\ncd $HYBRID_FILES\n``` **Note:** Because the overrides file specifies service account files using  paths relative to your`` `/hybrid-files`directory,  you must execute the commands from within that directory.\n- Verify that`kubectl`is set to the correct context using the following command.  The current context should be set to the cluster to which you are deploying Apigee hybrid.```\nkubectl config get-contexts | grep \\*\n```\n- , Verify   that the`KUBECONFIG`variable is set using the following command.```\necho ${KUBECONFIG}\n```\n- Do ainitialization. Doing a dry run lets you check for any errors before any  changes are made to the cluster. Execute the`init`command with  the`--dry-run`flag as follows:```\n${APIGEECTL_HOME}/apigeectl init -f overrides/overrides.yaml --dry-run=client\n```\n- If there are no errors, execute the`init`command as follows:```\n${APIGEECTL_HOME}/apigeectl init -f overrides/overrides.yaml\n```The `init` command installs the [Apigee deployment services](/apigee/docs/hybrid/v1.8/apigee-deployment-services) Apigee Deployment Controller and Apigee Admission Webhook.\n- To check the status of the deployment, you can use the following commands:```\n${APIGEECTL_HOME}/apigeectl check-ready -f overrides/overrides.yaml\n``````\nkubectl get pods -n apigee-system\n``````\nkubectl get pods -n apigee\n```When the pods are ready, go to the next step.\n- Do ainstall. Execute the`apply`command with the`--dry-run`flag.```\n${APIGEECTL_HOME}/apigeectl apply -f overrides/overrides.yaml --dry-run=client\n```\n- If there are no errors, you can apply the [  Apigee-specific runtime components](/apigee/docs/hybrid/v1.8/what-is-hybrid#about-the-runtime-plane) to the cluster with the following command:```\n${APIGEECTL_HOME}/apigeectl apply -f overrides/overrides.yaml\n```\n- To check the status of the deployment, run the following command:```\n${APIGEECTL_HOME}/apigeectl check-ready -f overrides/overrides.yaml\n```Repeat this step until the pods are all ready. The pods may take several minutes to start up.\n**Congratulations!** You've successfully installed and configured the Apigee hybrid runtime plane. Now it's time  to connect it to the outside world.\n## Next step\nstepper_buttons is defined in localvars Iterate over all the buttons in the data dictionary If the button's step matches the current step in the process, make the button disabled [1](/apigee/docs/hybrid/v1.8/install-create-cluster) If the button's step matches the current step in the process, make the button disabled [2](/apigee/docs/hybrid/v1.8/install-cert-manager) If the button's step matches the current step in the process, make the button disabled [3](/apigee/docs/hybrid/v1.8/install-apigeectl) If the button's step matches the current step in the process, make the button disabled [4](/apigee/docs/hybrid/v1.8/install-service-accounts) If the button's step matches the current step in the process, make the button disabled [5](/apigee/docs/hybrid/v1.8/install-create-tls-certificates) If the button's step matches the current step in the process, make the button disabled [6](/apigee/docs/hybrid/v1.8/install-configure-cluster) If the button's step matches the current step in the process, make the button disabled [7](/apigee/docs/hybrid/v1.8/install-enable-synchronizer-access) If the button's step matches the current step in the process, make the button disabled If the button's step matches the next step [8](/apigee/docs/hybrid/v1.8/install-hybrid-runtime) If the button's step matches the current step in the process, make the button disabled In all other cases (previous buttons or future buttons (after the next one), make them links [(NEXT) Step 9: Expose Apigee ingress](/apigee/docs/hybrid/v1.8/install-expose-apigee-ingress) If the button's step matches the current step in the process, make the button disabled [10](/apigee/docs/hybrid/v1.8/install-deploy-proxy)", "guide": "Apigee"}