{"title": "Apigee - Securing the runtime installation", "url": "https://cloud.google.com/apigee/docs/api-platform/get-started/what-apigee", "abstract": "# Apigee - Securing the runtime installation\nYou are currently viewing version 1.1 of the Apigee hybrid documentation. **This version is end of life.** You should upgrade to a newer version. For more information, see [Supported versions](/apigee/docs/hybrid/supported-platforms#supported-versions) .\n[Internal connections](/apigee/docs/hybrid/v1.1/ports#internal)\n| Pod     | Description                     |\n|:--------------------|:---------------------------------------------------------------------------------------------|\n| apigee-logger  | Contains an Apigee logger agent that sends application logs to Stackdriver.     |\n| apigee-metrics  | Contains an Apigee metrics agent that sends application logs to Stackdriver.     |\n| apigee-cassandra | Contains the hybrid runtime persistance layer.            |\n| apigee-synchronizer | Synchronizes configuration between the management (control) plane and runtime (data) plane. |\n| apigee-udca   | Allows transfer of analytics data to the management plane.         |\n| apigee-mart   | Contains the Apigee administrative API endpoint.            |\n| apigee-runtime  | Contains the gateway for API request processing and policy execution.      |\nGoogle recommends that you follow these methods and best practices to harden,  secure, and isolate the runtime  pods:\n| Method      | Description                                                                                                                                                                                                 |\n|:-----------------------------|:-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| Kubernetes security overview | Review the Google Kubernetes Engine (GKE) document Security overview. This document provides an overview of each layer of your Kubernetes infrastructure, and explains how you can configure its security features to best suit your needs. For Google Cloud Engine's current guidance for hardening your GKE cluster, see Hardening your cluster's security.                                                                                                           |\n| Network policies    | Use network policies to restrict communication between Pods and to pods that have access outside the Kubernetes network. For more information, see Creating a cluster network policy in the GKE documentation. A network policy is a specification of how groups of pods are allowed to communicate with each other and other network endpoints. The Kubernetes NetworkPolicy resource uses labels to select pods and define rules which specify what traffic is allowed to the selected pods. You can implement a Container Network Interface (CNI) plugin to add network policies to an Apigee hybrid runtime installation. Network policies let you isolate pods from outside access and enable access to specific pods. You can use an open source CNI plugin, such as Calico to get started. |\n| GKE Sandbox     | Enable GKE Sandbox for the Kubernetes clusters that run Apigee hybrid. See GKE Sandbox for details. NOTE: GKE Sandbox is the Google version of the open source project gVisor, a sandbox runtime that provides a virtualized container environment.                                                                                                                                      ", "content": "|", "guide": "Apigee"}