{"title": "Apigee - Step 1: Create a GKE on-prem cluster", "url": "https://cloud.google.com/apigee/docs/api-platform/get-started/what-apigee", "abstract": "# Apigee - Step 1: Create a GKE on-prem cluster\nYou are currently viewing version 1.1 of the Apigee hybrid documentation. **This version is end of life.** You should upgrade to a newer version. For more information, see [Supported versions](/apigee/docs/hybrid/supported-platforms#supported-versions) .\nYou must create a Kubernetes cluster in [Anthos GKE deployed on-prem](https://cloud.google.com/gke-on-prem/docs/overview) before you can install Apigee hybrid.\n", "content": "## \n Create a GKE on-prem cluster\n**Note: ** Apigee does not support [GKE Sandbox](https://cloud.google.com/kubernetes-engine/sandbox) or [gVisor](https://github.com/google/gvisor) .\nBefore continuing with a hybrid installation, you must first create a Kubernetes cluster in GKE on-prem. There are many variations, some simple and some complex, on how to install GKE on-prem and create user clusters. To get started, see [Overview of installation](https://cloud.google.com/gke-on-prem/docs/how-to/install-overview-basic) in the GKE on-prem documentation.\n## \n Summary\nAfter you have a Kubernetes cluster running in GKE on-prem, you are ready to install the Apigee hybrid runtime plane software on the GKE on-prem admin machine.\n## Next step\nstepper_buttons is defined in localvars Iterate over all the buttons in the data dictionary If the button's step matches the current step in the process, make the button disabled If the button's step matches the next step [1](/apigee/docs/hybrid/v1.1/install-create-cluster-anthos) If the button's step matches the current step in the process, make the button disabled In all other cases (previous buttons or future buttons (after the next one), make them links [(NEXT) Step 2: Install apigeectl](/apigee/docs/hybrid/v1.1/install-download-install-anthos) If the button's step matches the current step in the process, make the button disabled [3](/apigee/docs/hybrid/v1.1/install-copy-overrides-anthos) If the button's step matches the current step in the process, make the button disabled [4](/apigee/docs/hybrid/v1.1/install-apply-hybrid-anthos)", "guide": "Apigee"}