{"title": "Apigee - Scheduling backups in a remote server", "url": "https://cloud.google.com/apigee/docs/api-platform/get-started/what-apigee", "abstract": "# Apigee - Scheduling backups in a remote server\nYou are currently viewing version 1.6 of the Apigee hybrid documentation. **This version is end of life.** You should upgrade to a newer version. For more information, see [Supported versions](/apigee/docs/hybrid/supported-platforms#supported-versions) .\nThis page describes how to schedule backups for Cassandra without the Cloud Storage. In this method, backups are stored on a remote server specified by you instead of a Cloud Storage bucket. Apigee uses SSH to communicate with the remote server.\nYou must schedule the backups as `cron` jobs. Once a backup schedule has been applied to your hybrid cluster, a Kubernetes backup job is periodically executed according to the schedule in the runtime plane. The job triggers a backup script on each Cassandra node in your hybrid cluster that collects all the data on the node, creates an archive (compressed) file of the data, and sends the archive to the server specified in your `overrides.yaml` file.\n**Note:** - You must ensure there is enough space on the file system for the backups, and adjust the frequency of the backups to avoid unnecessarily filling the allotted storage space. Apigee does not dictate a retention policy for the backup files. You may want to create a retention policy for files appropriate to your installation.\n- Applying backup configuration on the existing cluster will rolling restart Cassandra pods.\nThe following steps include common examples for completing specific tasks, like creating an SSH  key pair. Use the methods that are appropriate to your installation.\nThe procedure has the following parts:\n- [Set up the server and SSH](#server-ssh) \n- [Set the schedule and destination for backup](#overrides-backup) \n#", "content": "## \n Set up the server and SSH\n- Designate a Linux or Unix server for your backups. This server must be reachable using SSH from  your Apigee hybrid runtime plane. It must have enough storage for your backups.\n- Set up an SSH server on the server, or ensure that it has a secure SSH server configured. **Caution:** For security purposes, make sure your SSH server is up to date.\n- Create an SSH key pair and store the private key file in a path that is accessible from your hybrid  runtime plane. **You must use a blank password for your key pair or the backup will fail** . For example:```\nssh-keygen -t rsa -b 4096 -C exampleuser@example.com  Enter file in which to save the key (/Users/exampleuser/.ssh/id_rsa): $APIGEE_HOME/hybrid-files/certs/ssh_key  Enter passphrase (empty for no passphrase):  Enter same passphrase again:  Your identification has been saved in ssh_key  Your public key has been saved in ssh_key.pub  The key fingerprint is:  SHA256:DWKo334XMZcZYLOLrd/8HNpjTERPJJ0mc11UYmrPvSA exampleuser@example.com  The key's randomart image is:  +---[RSA 4096]----+  |          +.  ++X|  |     .   . o.=.*+|  |    . o . . o==o |  |   . . . =oo+o...|  |  .     S +E oo .|  |   . .   .. . o .|  |    . . .  . o.. |  |     .  ...o ++. |  |      .. .. +o+. |  +----[SHA256]-----+\n```\n- Create a user account on the backup server with the name`apigee`. Make sure  the new`apigee`user has a home directory under`/home`.\n- On the backup server, create an`ssh`directory in the new`/home/apigee`directory.\n- Copy the public key (`ssh_key.pub`in the previous example) into a file named`authorized_keys`in the new`/home/apigee/ssh`directory. For example:```\ncd /home/apigee\nmkdir .ssh\ncd .ssh\nvi authorized_keys\n```\n- On your backup server, create a backup directory within the`/home/apigee/`directory. The backup directory can be any directory as long as the`apigee`user has access  to it. For example:```\ncd /home/apigee\nmkdir cassandra-backup\n```\n- Test the connection. You need to make sure that your Cassandra pods can connect to your  backup server using SSH:- Log into the shell of your Cassandra pod. For example:```\nkubectl exec -it -n apigee APIGEE_CASSANDRA_DEFAULT_0 -- /bin/bash\n```Where is the name of a Cassandra pod. Change this to   the name of the pod you want to connect from.\n- Connect by SSH to your backup server, using the server IP address:```\nssh apigee@BACKUP_SERVER_IP\n``` **Note:** You may see a warning at this point saying your server's   fingerprint is unrecognized and asks if you would like to continue. For purposes of this   test, this means you can successfully reach your backup server from your Cassandra pod. You   do not need to continue.\n### \n Set the schedule and destination for backup\nYou set the schedule and destination for backups in your `overrides.yaml` file.\n- Add the following parameters to your`overrides.yaml`file:\n```\ncassandra:  backup:    enabled: true    keyFile: \"PATH_TO_PRIVATE_KEY_FILE\"    server: \"BACKUP_SERVER_IP\"    storageDirectory: \"/home/apigee/BACKUP_DIRECTORY\"    cloudProvider: \"HYBRID\" # required verbatim \"HYBRID\" (all caps)    schedule: \"SCHEDULE\"\n``````\ncassandra:  backup:    enabled: true    keyFile: \"/Users/exampleuser/apigee-hybrid/hybrid-files/service-accounts/private.key\"    server: \"34.56.78.90\"    storageDirectory: \"/home/apigee/cassbackup\"    cloudProvider: \"HYBRID\"    schedule: \"0 2 * * *\"\n```\nWhere:| Property    | Description                                                                                                     |\n|:------------------------|:-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| backup:enabled   | Backup is disabled by default. You must set this property to true.                                                                                       |\n| backup:keyFile   | PATH_TO_PRIVATE_KEY_FILE The path on your local file system to the SSH private key file (named ssh_key in the step where you created the SSH key pair).                                                                  |\n| backup:server   | BACKUP_SERVER_IP The IP address of your backup server.                                                                                          |\n| backup:storageDirectory | BACKUP_DIRECTORY The name of the backup directory on your backup server. This must be a directory within home/apigee (the backup directory is named cassandra_backup in the step where you created the backup directory).                                                 |\n| backup:cloudProvider | GCP/HYBRID For a Cloud Storage backup, set the property to GCP. For example, cloudProvider: \"GCP\". For a remote server backup, set the property to HYBRID. For example, cloudProvider: \"HYBRID\".                                                       |\n| backup:schedule   | SCHEDULE The time when the backup starts, specified in standard crontab syntax. Default: 0 2 * * * Note: Avoid scheduling a backup that starts a short time after you apply the backup configuration to your cluster. When you apply the backup configuration, Kubernetes recreates the Cassandra nodes. If the backup starts before the nodes restart, the first backup will fail and the subsequent backups will pass. |\n- Use`apigeectl`to apply the backup configuration to the storage scope of your  cluster:```\n$APIGEECTL_HOME/apigeectl --datastore -f YOUR_OVERRIDES_FILE\n```Where is the path to the overrides file you just edited.\n- Verify the backup job. For example:```\nkubectl get cronjob -n apigee\n``````\nNAME                      SCHEDULE     SUSPEND   ACTIVE   LAST SCHEDULE   AGEapigee-cassandra-backup   33 * * * *   False     0        <none>          94s\n```", "guide": "Apigee"}