{"title": "Apigee - UDCA logs", "url": "https://cloud.google.com/apigee/docs/api-platform/get-started/what-apigee", "abstract": "# Apigee - UDCA logs\nYou are currently viewing version 1.1 of the Apigee hybrid documentation. **This version is end of life.** You should upgrade to a newer version. For more information, see [Supported versions](/apigee/docs/hybrid/supported-platforms#supported-versions) .\nTo troubleshoot the UDCA in Apigee hybrid, look at the log files. UDCA logs are written to stdout/stderr and can be viewed using the [kubectl](https://kubernetes.io/docs/reference/kubectl/overview/) `logs` command.\nOn the Kubernetes administration machine, execute the following command:\n```\nkubectl logs pod_name apigee-udca -n namespace\n```\nThe following table lists common error messages that might appear in the UDCA log files and their meanings. Log messages will include a timestamp and often a stacktrace or other information to help you diagnose and fix the issue.\n| Entry Type | Log message                            | Meaning                                                                |\n|:-------------|:--------------------------------------------------------------------------------------------------------------------------|:----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| Error  | Failed to create directory for dataset dataset_name                  | The directory configured for the given dataset did not exist and the UDCA failed to create it. It could be a permission issue in the setup. This issue prevents UDCA from starting.                    |\n| Error  | Shutdown action was interrupted. It is possible that some data will be lost            | As part of a shutdown, UDCA tries to upload all files on disk. This message indicates that the shutdown took longer than expected and some data might not be uploaded and hence lost.                    |\n| Error  | Scheduled DatasetHandler for dataset dataset_name encountered an exception.            | An attempt to perform an action on the given dataset encountered an unexpected exception while polling the configured directory or while uploading the files.                          |\n| Error  | Upload failed for file filename. Max Retries exceeded! Moving dir to failed folder.          | The UDCA failed to upload the given file and moved the file to the dataset's /failed subdirectory.                                         |\n| Error  | Re-queuing files from failed directory encountered an exception.               | The UDCA requeues files from the /failed directory after a successful upload. This ensures that the UDCA retry to upload files after network/upstream issues are resolved. This message indicates that UDCA experienced an error when trying to requeue the file. |\n| Error  | Shutting down datasetHandler encountered an exception.                 | The UDCA experienced an exception when trying to shut down.                                                   |\n| Error  | Failed to move file from directory_name to directory_name.                | The UDCA encountered an exception while moving a file between sub-directories for internal lifecycle management.                                      |\n| Error  | Failed to delete file filename.                       | The UDCA encountered an exception while deleting a file after a successful upload.                                             |\n| Warning  | Received 429 - Too many Requests from upstream service. Skipping remaining files in this iteration and will retry again | The UDCA received an error that it had exceeded its quota from an upstream service. As a result, the UDCA skipped the remaining files in this iteration and will retry in the next interval.                  |\n| Warning  | File upload failed for filename. error_message                   | The UDCA failed to upload the given file due to the returned error. The UDCA will attempt to upload the file 3 times before moving it to the dataset's /failed subdirectory.                      |\n| Warning  | Request request_URI timed out. Aborting request                   | The specified asynchronous request to upload the file timed out and was cancelled.                                             |\n| Warning  | Request request_URI failed. Exception exception                   | The specified asynchronous request failed with an exception.                                                   |\n| Warning  | Metrics Computation Failed: error_message                    | The periodic computation of the UDCA's file system metrics encountered an exception.                                             ", "content": "|", "guide": "Apigee"}