{"title": "Cloud Architecture Center - Best practices for mitigating ransomware attacks using Google Cloud", "url": "https://cloud.google.com/architecture/reference-patterns/overview", "abstract": "# Cloud Architecture Center - Best practices for mitigating ransomware attacks using Google Cloud\nLast reviewed 2023-08-03 UTC\nCode that was created by a third party to infiltrate your systems to hijack, encrypt, and steal data is referred to as ransomware. To protect your enterprise resources and data from ransomware attacks, you must put multi-layered controls in place across your on-premises and cloud environments. This document describes some best practices to help your organization identify, prevent, detect, and respond to ransomware attacks.\nThis document is part of a series that is intended for security architects and administrators. It describes how Google Cloud can help your organization mitigate the effects of ransomware attacks.\nThe series has the following parts:\n- [Mitigating ransomware attacks using Google Cloud](/architecture/mitigating-ransomware-attacks) \n- Best practices for mitigating ransomware attacks using Google Cloud (this document)", "content": "## Identify your risks and assets\nTo determine your organization's exposure to ransomware attacks, you must develop your understanding of the risks to your systems, people, assets, data, and capabilities. To help you, Google Cloud provides the following capabilities:\n- [Asset management with Cloud Asset Inventory](#manage-your-assets-with-cloud-asset-inventory) \n- [Risk management programs](#risk-assessment) \n- [Data classification](#dlp-classification) \n- [Supply chain risk management](#supply-chain-management) \n### Manage your assets with Cloud Asset Inventory\nTo help mitigate ransomware attacks, you need to know what your organization's assets are, their state, and their purpose, both in Google Cloud and in your on-premises or other cloud environments. For static assets, maintain a baseline of the last known good configuration in a separate location.\nUse [Cloud Asset Inventory](/asset-inventory/docs/overview) to obtain a five-week history of your resources in Google Cloud. Set up [monitoring feeds](/asset-inventory/docs/monitoring-asset-changes) to receive notifications when particular changes to resources occur, or when there are policy deviations. To track changes so that you can watch for attacks that progress over a longer time period, export the feed. To create the export, you can use tools like [Terraform](https://registry.terraform.io/providers/hashicorp/google/latest/docs/resources/cloud_asset_folder_feed) . For this type of analysis, you can export the inventory to a [BigQuery table](/asset-inventory/docs/analyzing-iam-policy-longrunning-bigquery) or a [Cloud Storage bucket](/asset-inventory/docs/analyzing-iam-policy-longrunning-cloud-storage) .\n### Assess and manage your risks\nUse an existing risk assessment framework to help you catalog your risks and determine how capable your organization is in detecting and counteracting a ransomware attack. These assessments check factors like whether you have malware protection controls, properly configured access controls, database protection, and backups.\nFor example, the Cloud Security Alliance (CSA) provides the [Cloud Controls Matrix (CCM)](https://cloudsecurityalliance.org/research/cloud-controls-matrix/) to assist organizations in their cloud risk assessments. For CCM information specific to Google Cloud, see [New CIS Benchmark for Google Cloud Computing Platform](https://www.cisecurity.org/blog/new-cis-benchmark-for-google-cloud-computing-platform/) .\nTo identify potential application gaps and take actions to remediate them, you can use threat models such as [OWASP Application Threat Modeling](https://owasp.org/www-community/Application_Threat_Modeling) . For more information on how you can help mitigate the top 10 OWASP security risks with Google Cloud, see [OWASP Top 10 mitigation options on Google Cloud](/architecture/owasp-top-ten-mitigation) .\nAfter you catalog your risks, determine how to respond to them, and whether you want to accept, avoid, transfer, or mitigate the risks. The [Risk Protection Program](/risk-protection-program) provides access to [Risk Manager](/risk-manager/docs/overview) and cyber insurance. Use Risk Manager to scan your workloads on Google Cloud and implement the security recommendations that help reduce your ransomware-related risks.\n### Configure Sensitive Data Protection\n[Sensitive Data Protection](/dlp) lets you inspect data in your Google Cloud organization and data coming from [external sources](/dlp/docs/how-to-hybrid-jobs) . Configure Sensitive Data Protection to classify and protect your confidential data using [de-identification techniques](/dlp/docs/classification-redaction) . Classifying your data helps you to focus your monitoring and detection efforts on data that matters most to your organization.\nCombine Sensitive Data Protection with other products such as the [Security Command Center](/security-command-center/docs/concepts-security-command-center-overview) or with a third-party SIEM to help ensure appropriate monitoring and alerting on any unexpected changes to your data.\n### Manage risks to your supply chain\nA key attack vector for ransomware attacks is vulnerabilities within the supply chain. The challenge to this attack vector is that most organizations have many vendors that they must track, each with their own list of vendors.\nIf you create and deploy applications, use frameworks such as the [Supply-chain Levels for Software Architects (SLSA)](https://slsa.dev/) . These frameworks help define the requirements and best practices that your enterprise can use to protect your source code and build processes. Using SLSA, you can work through four security levels to improve the security of the software that you produce.\nIf you use open source packages in your applications, consider using [security scorecards](https://opensource.googleblog.com/2020/11/security-scorecards-for-open-source.html) to auto-generate the security score of a particular open source package. Security scorecards are a low-cost, easy-to-use method to get an assessment before your developers integrate open source packages with your systems.\nTo learn about resources that you can use to help verify the security of Google Cloud, see [Vendor security risk assessment](/security/vendor-security-assessment) .\n## Control access to your resources and data\nAs your organization moves workloads outside of your on-premises network, you must manage access to those workloads across all the environments that host your resources and data. Google Cloud supports several controls that help you set up appropriate access. The following sections highlight some of them.\n### Set up zero trust security with BeyondCorp Enterprise\nAs you move your workloads from your on-premises environment to the cloud, your network trust model changes. Zero trust security means that no one is trusted implicitly, whether they are inside or outside of your organization's network.\nUnlike a VPN, zero trust security shifts access controls from the network perimeter to users and their devices. Zero trust security means that the user's identity context is considered during authentication. This security control provides an important prevention tactic against ransomware attacks that are successful only after attackers breach your network.\nUse [BeyondCorp Enterprise](/beyondcorp-enterprise) to set up zero trust security in Google Cloud. BeyondCorp Enterprise provides [threat and data protection](https://support.google.com/a/answer/10104463) and [access controls](/beyondcorp-enterprise/docs/access-protection) . To learn how to set it up, see [Getting started with BeyondCorp Enterprise](/beyondcorp-enterprise/docs/apply-resources) .\nIf your workloads are located both on-premises and in Google Cloud, configure [Identity-Aware Proxy (IAP)](/iap) . IAP lets you extend zero trust security to your applications in both locations. It provides authentication and authorization for users who access your applications and resources, using access control policies.\n### Configure least privilege\nLeast privilege ensures users and services only have the access that they require to perform their specific tasks. Least privilege slows down the ability of ransomware to spread throughout an organization because an attacker can't easily escalate their privileges.\nTo meet your organization's particular needs, use the fine-grained policies, roles, and permissions in [Identity and Access Management (IAM)](/iam) . In addition, analyze your permissions regularly using [role recommender](/iam/docs/recommender-overview) and [Policy Analyzer](/asset-inventory/docs/analyzing-iam-policy) . Role recommender uses machine learning to analyze your settings and provide recommendations to help ensure your role settings adhere to the principle of least privilege. Policy Analyzer lets you see which accounts have access to your cloud resources.\nFor more information about least privilege, see [Using IAM securely](/iam/docs/using-iam-securely) .\n### Configure multi-factor authentication with Titan Security Keys\n[Multi-factor authentication (MFA)](https://wikipedia.org/wiki/Multi-factor_authentication) ensures that users must provide a password and a biometric factor or a possessive factor (like a token) before they can access a resource. As passwords can be relatively easy to discover or steal, MFA helps to prevent ransomware attackers from being able to take over accounts.\nConsider [Titan Security Keys](/titan-security-key) for MFA to help prevent account takeovers and phishing attacks. Titan Security Keys are tamper-resistant and can be used with any service that supports the [Fast IDentity Online (FIDO)](https://developers.google.com/identity/fido) Alliance standards.\nEnable MFA for your applications, [Google Cloud administrators](https://support.google.com/a/answer/9011373) , [SSH connections to your VMs (by using OS Login](/compute/docs/oslogin/setup-two-factor-authentication) ), and for anyone who requires privileged access to sensitive information.\nUse [Cloud Identity](/identity#section-4) to configure MFA for your resources. For more information, see [Enforce uniform MFA to company-owned resources](/identity/solutions/enforce-mfa) .\n### Protect your service accounts\n[Service accounts](/iam/docs/understanding-service-accounts) are privileged identities that provide access to your Google Cloud resources, so attackers would consider them valuable. For best practices on protecting service accounts, see [Best practices for working with service accounts](/iam/docs/best-practices-service-accounts) .\n## Protect your critical data\nThe main goals of a ransomware attack are generally the following:\n- To make your critical data inaccessible until you pay the ransom.\n- To exfiltrate your data.\nTo protect your critical data from attacks, combine various security controls to control access to data, based on the data sensitivity. The following sections describe some best practices that you can use to help protect your data and help effectively mitigate ransomware attacks.\n### Configure data redundancy\nGoogle Cloud has global-scale infrastructure that is designed to provide resiliency, scalability, and high availability. Cloud resilience helps Google Cloud to recover and adapt to various events. For more information, see [Google Cloud infrastructure reliability guide](/architecture/infra-reliability-guide) .\nIn addition to the default resiliency capabilities in Google Cloud, configure redundancy (N+2) on the cloud storage option that you use to store your data. Redundancy helps mitigate the effects of a ransomware attack because it removes a single point of failure and provides backups of your primary systems in case they are compromised.\nIf you use Cloud Storage, you can enable [Object Versioning](/storage/docs/object-versioning) or the [Bucket Lock feature](/storage/docs/bucket-lock) . The Bucket Lock feature lets you to configure a data retention policy for your Cloud Storage buckets.\n**Note:** If you choose data redundancy, regularly test your recovery plans. In addition, ensure your recovery plans include the ability to recover from isolated, backed-up sources if your redundant systems are also compromised (see [Back up your databases and filestores](#heading=h.1pksy0tlsbng) ).\nFor more information about data redundancy in Google Cloud, see the following:\n- [Redundancy across regions with Cloud Storage buckets](/storage/docs/locations) \n- [Copying BigQuery datasets across regions](/bigquery/docs/copying-datasets) \n### Back up your databases and filestores\nBackups let you keep copies of your data for disaster recovery purposes so that you can create a replicated environment. Store backups in both the format that you need it, and in raw source form if possible. To avoid compromising your backup data, store these copies in separate, zones away from your production zone. In addition, back up binaries and executable files separately from your data.\nWhen planning for a replicated environment, ensure that you apply the same (or stronger) security controls in your mirror environment. Determine the time it takes you to recreate your environment and to recreate any new administrator accounts that you require.\nFor some examples of backups in Google Cloud, see the following:\n- [Backups in Cloud SQL for SQL Server](/sql/docs/sqlserver/backup-recovery/backups) \n- [Backups in Filestore](/filestore/docs/backups) \nIn addition to these backup options, consider using [Backup and DR Service](/backup-disaster-recovery) to back up your on-premises data to Google Cloud. Backup and DR lets you set up a disaster recovery environment in Google Cloud for both your VMs and your databases. For more information, see [solutions for backup and disaster recovery](/solutions/backup-dr) .\n**Note:** Although backups and redundancy are best practices for helping to mitigate ransomware attacks, they require a certain level of commitment by your organization to ensure that your disaster recovery plans work. Regularly practice your disaster recovery plans. Keep historical copies of your backups in isolated locations so that you can recover data from a historic backup if a more current backup is compromised.\n### Protect and back up your data encryption keys\nTo help prevent attackers from getting access to your data encryption keys, [rotate your keys regularly](/kms/docs/key-rotation) and [monitor key-related activities](/kms/docs/monitoring) . Implement a key backup strategy that considers the key [location](/kms/docs/locations#choosing) and whether the keys are Google-managed (software or HSM), or whether you supply the keys to Google. If you supply your own keys, configure backups and key rotation using the controls in your external key management system.\nFor more information, see [Manage encryption keys with Cloud Key Management Service](/architecture/security-foundations/operation-best-practices#manage-encryption) .\n## Protect your network and infrastructure\nTo protect your network, you must ensure that attackers can't easily traverse it to get access to your sensitive data. The following sections describe some of the items to consider as you plan and deploy your network.\n### Automate infrastructure provisioning\nAutomation is an important control against ransomware attackers, as automation provides your operations team with a known good state, fast rollback, and troubleshooting capabilities. Automation requires various tools such as Terraform, Jenkins, [Cloud Build](/build/docs/overview) , and others.\nDeploy a secure Google Cloud environment using the [enterprise foundations blueprint](/architecture/security-foundations) . If necessary, build on the security foundations blueprint with additional blueprints or design your own automation.\nFor more information about automation, see [Use a CI/CD pipeline for data-processing workflows](/architecture/cicd-pipeline-for-data-processing) . For more security guidance, see the [Cloud Security Best Practices Center](/security/best-practices#section-2) .\n### Segment your network\nNetwork segments and perimeters help slow down the progress that an attacker can make in your environment.\nTo segment services and data and to help secure your perimeter, Google Cloud offers the following tools:\n- To direct and protect the flow of traffic, use [Cloud Load Balancing](/load-balancing/docs/load-balancing-overview) with [firewall rules](/vpc/docs/firewalls) .\n- To set up perimeters within your organization to segment resources and data, use [VPC Service Controls](/vpc-service-controls/docs/overview) .\n- To set up connections with your other workloads, whether on-premises or in [other cloud environments](/architecture/patterns-for-connecting-other-csps-with-gcp) , use [Cloud VPN](/network-connectivity/docs/vpn/concepts/overview) or [Cloud Interconnect](/network-connectivity/docs/interconnect/concepts/overview) .\n- To restrict access to IP addresses and ports, configure [organization policies](/resource-manager/docs/organization-policy/org-policy-constraints) such as \"Restrict Public IP access on Cloud SQL instances\" and \"Disable VM serial port access.\"\n- To harden the VMs on your network, configure organization policies such as \"Shielded VM.\"\nCustomize network security controls to match your risks for different resources and data.\n## Protect your workloads\nGoogle Cloud includes services that let you build, deploy, and manage code. Use these services to prevent drift and rapidly detect and patch issues such as misconfigurations and vulnerabilities. To protect your workloads, build a gated deployment process that prevents ransomware attackers from getting initial access through unpatched vulnerabilities and misconfigurations. The following sections describe some of the best practices that you can implement to help protect your workloads.\nFor example, to deploy workloads in [GKE Enterprise](/anthos/docs/concepts/overview) , you do the following:\n- Configure [trusted builds](/binary-authorization/docs) and [deployments](/anthos/run/docs) .\n- Isolate applications within a [cluster](/anthos/clusters/docs) .\n- Isolate pods on a node.\nFor more information about GKE Enterprise security, see [Hardening your cluster's security](/anthos/clusters/docs/on-prem/1.8/how-to/hardening-your-cluster) .\n### Use a secure software development lifecycle\nWhen developing your software development lifecycle (SDLC), use industry best practices such as [DevSecOps](https://wikipedia.org/wiki/DevOps#DevSecOps,_Shifting_Security_Left) . The [DevOps Research and Assessment (DORA)](https://dora.dev/) research program describes many of the technical, process, measurement, and cultural capabilities of DevSecOps. DevSecOps can help mitigate ransomware attacks because it helps ensure that security considerations are included at each step of the development lifecycle and lets your organization rapidly deploy fixes.\nFor more information about using an SDLC with Google Kubernetes Engine (GKE), see [Software Delivery Shield overview](/software-supply-chain-security/docs/sds/overview) .\n### Use a secure continuous integration and continuous delivery pipeline\nContinuous integration and continuous delivery (CI/CD) provides a mechanism for getting your latest functionality to your customers quickly. To prevent ransomware attacks against your pipeline, you must perform appropriate code analysis and monitor your pipeline for malicious attacks.\nTo protect your [CI/CD pipeline](/docs/ci-cd) on Google Cloud, use access controls, segregated duties, and cryptographic code verification as the code moves through the CI/CD pipeline. Use [Cloud Build](/build/docs/overview) to track your build steps and [Artifact Registry](/artifact-registry/docs/overview) to complete [vulnerability scanning](/container-analysis/docs/container-analysis) on your container images. Use [Binary Authorization](/binary-authorization/docs/overview) to verify that your images meet your standards.\nWhen you build your pipeline, ensure that you have backups for your application binaries and executable files. Back them up separately from your confidential data.\n### Protect your deployed applications\nAttackers can try to access your network by finding [Layer 7](https://en.wikipedia.org/wiki/OSI_model) vulnerabilities within your deployed applications. To help mitigate against these attacks, complete threat modeling activities to find potential threats. After you minimize your attack surface, configure [Google Cloud Armor](/armor/docs/security-policy-overview) , which is a web-application firewall (WAF) that uses Layer 7 filtering and security policies.\nWAF rules help you protect your applications against numerous OWASP Top 10 issues. For more information, see [OWASP Top 10 mitigation options on Google Cloud](/architecture/owasp-top-ten-mitigation) .\nFor information about deploying Google Cloud Armor with a global external Application Load Balancer to protect your applications across multiple regions, see [Getting to know Google Cloud Armor—defense at scale for internet-facing services](/blog/products/gcp/getting-to-know-cloud-armor-defense-at-scale-for-internet-facing-services) . For information about using Google Cloud Armor with applications that run outside Google Cloud, see [Integrating Google Cloud Armor with other Google products](/armor/docs/integrating-cloud-armor#hybrid) .\n### Patch vulnerabilities quickly\nA key attack vector for ransomware is open-source software vulnerabilities. To mitigate the effects that ransomware might have, you must be able to rapidly deploy fixes across your fleet.\nAccording to the [shared responsibility model](/blog/products/containers-kubernetes/exploring-container-security-the-shared-responsibility-model-in-gke-container-security-shared-responsibility-model-gke) , you're responsible for any software vulnerabilities in your applications, while Google is responsible for maintaining the security of the underlying infrastructure.\nTo view vulnerabilities associated with the operating systems that your VMs are running and to manage the patching process, use [OS patch management](/compute/docs/os-patch-management) in Compute Engine. For GKE and GKE Enterprise, Google automatically [patches vulnerabilities](/kubernetes-engine/docs/resources/security-patching) , though you have some control over [GKE maintenance windows](/kubernetes-engine/docs/concepts/maintenance-windows-and-exclusions) .\nIf you're using Cloud Build, [automate builds](/source-repositories/docs/integrating-with-cloud-build) whenever a developer commits a change to the code source repository. Ensure that your [build configuration file](/build/docs/build-config-file-schema) includes appropriate verification checks such as vulnerability scanning and [integrity checks](/architecture/binary-auth-with-cloud-build-and-gke) .\nFor information about patching Cloud SQL, see [Maintenance on Cloud SQL instances](/sql/docs/mysql/maintenance) .\n## Detect attacks\nYour ability to detect attacks depends on your detection capabilities, your monitoring and alerting system, and the activities that prepare your operations teams to identify attacks when they occur. This section describes some best practices for detecting attacks.\n### Configure monitoring and alerts\nEnable [Security Command Center](/security-command-center/docs/concepts-security-command-center-overview) to get centralized visibility into any security concerns and risks within your Google Cloud environment. Customize the [dashboard](/security-command-center/docs/how-to-use-security-command-center) to ensure that the events that are most important to your organization are most visible.\nUse [Cloud Logging](/logging/docs/overview) to manage and analyze the logs from your services in Google Cloud. For additional analysis, you can choose to [integrate with Chronicle](/security/chronicle) or export the logs to your organization's SIEM.\nIn addition, use [Cloud Monitoring](/monitoring/docs/monitoring-overview) to measure the performance of your service and resources and set up [alerts](/monitoring/alerts) . For example, you can monitor for [sudden changes to the number of VMs running in your environment](/monitoring/alerts/types-of-conditions) , which might be a sign that malware is present in your environment.\nMake all this information available to your security operations center in a centralized way.\n### Build detection capabilities\nBuild detection capabilities in Google Cloud that correspond with your risks and workload needs. These capabilities provide you with more insight into advanced threats, and help you better monitor your compliance requirements.\nIf you have [Security Command Center Premium tier](/security-command-center/pricing) , use [Event Threat Detection](/security-command-center/docs/concepts-event-threat-detection-overview) and [Chronicle](/chronicle/docs/overview) . Event Threat Detection searches your logs for potential security attacks and [logs its findings](/security-command-center/docs/how-to-use-event-threat-detection) in the Security Command Center. Event Threat Detection lets you monitor both Google Cloud and Google Workspace at the same time. It checks for malware based on known bad domains and known bad IP addresses. For more information, see [Using Event Threat Detection](/security-command-center/docs/how-to-use-event-threat-detection) .\nUse Chronicle to store and analyze your security data in one place. Chronicle helps enhance the process of handling threats in Google Cloud by adding investigative abilities into Security Command Center Premium. You can use Chronicle to create detection rules, set up indicators of compromise matching, and perform threat hunting activities. Chronicle has the following features:\n- When you map logs, Chronicle enriches them and links them together into timelines, so that you can see the entire span of an attack.\n- Chronicle constantly re-evaluates log activity against threat intelligence gathered by the [Google Cloud Threat Intelligence for Chronicle team](https://chronicle.security/products/uppercase/) . When the intelligence changes, Chronicle automatically reapplies it against all historical activity.\n- You can write your own [YARA](https://yara.readthedocs.io/en/stable/) rules to improve your threat detection capabilities.\nOptionally, you can use a [Google Cloud partner](https://cloud.google.com/find-a-partner) to further augment your detection capabilities.\n### Plan for a ransomware attack\nTo prepare for a ransomware attack, complete [business continuity ](/solutions/business-continuity) and [disaster recovery plans](/architecture/dr-scenarios-planning-guide) , create a ransomware incident response playbook, and perform tabletop exercises.\nFor your incident response playbook, consider the functionality available for each service. For example, if you're using GKE with [Binary Authorization](/binary-authorization/docs/overview) , you can add [breakglass](/binary-authorization/docs/using-breakglass) processes.\nEnsure that your incident response playbook helps you quickly contain infected resources and accounts and move to healthy secondary sources and backups. If you use a backup service like Backup and DR, regularly practice your restore procedures from Google Cloud to your on-premises environment.\nBuild a [cyber-resiliency program](/solutions/security-and-resilience) and a backup strategy that prepares you to restore core systems or assets affected by a ransomware incident. Cyber resiliency is critical for supporting recovery timelines and lessening the effects of an attack so you can get back to operating your business.\nDepending on the scope of an attack and the regulations that apply to your organization, you might need to report the attack to the appropriate authorities. Ensure that contact information is accurately captured in your incident response playbook.\n## Respond to and recover from attacks\nWhen an attack occurs, you need to follow your incident response plan. Your response likely goes through four phases, which are:\n- Incident identification\n- Incident coordination and investigation\n- Incident resolution\n- Incident closure\nBest practices related to incident response are further described in the following sections.\nFor information on how Google manages incidents, see [Data incident response process](/docs/security/incident-response) .\n### Activate your incident response plan\nWhen you detect a ransomware attack, activate your plan. After you confirm that the incident isn't a false positive and that it affects your Google Cloud services, open a [P1 Google Support ticket](/support/docs/procedures#create_a_support_case) . [Google Support](/support-hub) responds as documented in the [Google Cloud: Technical Support Services Guidelines](/terms/tssg) .\nIf your organization has a [Google technical account manager (TAM)](/tam) or other Google representative, contact them as well.\n### Coordinate your incident investigation\nAfter you activate your plan, gather the team within your organization that needs to be involved in your incident coordination and resolution processes. Ensure that these tools and processes are in place to investigate and resolve the incident.\nContinue to monitor your Google Support ticket and work with your Google representative. Respond to any requests for further information. Keep detailed notes on your activities.\n### Resolve the incident\nAfter you complete your investigation, follow your incident response plan to remove the ransomware and restore your environment to a healthy state. Depending on the severity of the attack and the security controls that you have enabled, your plan can include activities such as the following:\n- Quarantining infected systems.\n- Restoring from healthy backups.\n- Restoring your infrastructure to a previously known good state using your CI/CD pipeline.\n- Verifying that the vulnerability was removed.\n- Patching all systems that might be vulnerable to a similar attack.\n- Implementing the controls that you require to avoid a similar attack.\nAs you progress through the resolution stage, continue to monitor your Google Support ticket. Google Support takes appropriate actions within Google Cloud to contain, eradicate, and (if possible) recover your environment.\nContinue to keep detailed notes on your activities.\n### Close the incident\nYou can close the incident after your environment is restored to a healthy state and you have verified that the ransomware has been eradicated from your environment.\nInform Google Support when your incident is resolved and your environment is restored. If one is scheduled, participate in a joint retrospective with your Google representative.\nEnsure that you capture any lessons learned from the incident, and set in place the controls that you require to avoid a similar attack. Depending on the nature of the attack, you could consider the following actions:\n- Writing detection rules and alerts that would automatically trigger should the attack occur again.\n- Updating your incident response playbook to include any lessons learned.\n- Improving your security posture based on your retrospective findings.## What's next\n- Learn more about the [incident response process](/security/incident-response) at Google.\n- Bookmark [Google Cloud Status Dashboard](https://status.cloud.google.com/summary) to view Google Cloud status.\n- Improve your incident response plan with [Google's SRE book - Incident Response](https://sre.google/workbook/incident-response/) .\n- Read the [Architecture Framework](/architecture/framework) for more best practices for Google Cloud.\n- [Plan your disaster recovery processes](/architecture/dr-scenarios-planning-guide) .\n- [Help secure software supply chains on GKE](/architecture/secure-software-supply-chains-on-google-kubernetes-engine) .\n- Learn how Google [identifies and protects against the largest DDoS attacks](/blog/products/identity-security/identifying-and-protecting-against-the-largest-ddos-attacks) .", "guide": "Cloud Architecture Center"}