{"title": "Cloud Architecture Center - Manage storage pools", "url": "https://cloud.google.com/architecture/reference-patterns/overview", "abstract": "# Cloud Architecture Center - Manage storage pools\nLast reviewed 2023-03-14 UTC\nYou need to create a storage pool before creating a volume of the CVS service type.\nFor more information, see [Storage pools](/architecture/partners/netapp-cloud-volumes/storage-pools) .\n**Important:** If you are using a Shared VPC network, you must first select the host project from the project drop-down menu and then access the **Cloud Volumes** page. You only need to take this action one time for each Shared VPC network.\n", "content": "## Create a storage pool\n- In the Google Cloud console, go to the **Storage pools** page.\n- Click **Create** .\n- In the **Create storage pool** dialog, enter the information indicated in the following table.Required fields are marked with an asterisk ( ).| Field         | Description                                         |\n|:-----------------------------------------|:----------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| Service Type*       | CVS is selected and can't be changed.                                  |\n| Service Level*       | Select the level of availability for the pool.                                |\n| Region*         | Google Cloud region for your pool. For more information about region selection, see Best practices for Compute Engine region selection.          |\n| Enable global access to Active Directory | Required if you are connecting to Active Directory and some of the Domain Controllers are outside of your pool's region. Reduces the maximum number of pools in the region. |\n| Zone*         | Google Cloud zone for your pool.                                   |\n| Zone Redundancy*       | For zone-redundant pools, choose the failover zone.                               |\n| Pool Name*        | Choose a name. The name must be unique within the project.                             |\n| Pool Capacity*       | Initial size of the pool, between 1,024 GiB and 200 TiB.                             |\n| Pool Label        | Add a label to the pool (for example, billing).                                |\n- In the **Network Details** section, specify the following:- **VPC Network Name** : Select the network from which the volume will be accessible.If no VPCs appear, see the Cloud Volumes Service FAQ for [how to view VPCs in the Cloud Volumes Service user interface](/architecture/partners/netapp-cloud-volumes/faqs-netapp#i_cant_see_my_vpcs_in_the_cloud_volumes_service_user_interface_whats_wrong) . **Important:** You can only select a VPC network while creating a pool. You can't change this selection later.\n- If this is the first time that you're setting up VPC network peering for Cloud Volumes Service, you receive the following prompt indicating that you need to set up network peering: Click the **View commands how to set up network peering** button. To configure VPC network peering, follow the steps in the dialog that appears.In the dialog, you can optionally select **Use Custom Address Range** . This option lets you, for example, specify a CIDR range that doesn't overlap with your on-premises CIDR blocks. To allow for future flexibility, choose a larger CIDR block size (prefix range). **Important:** You can only specify a CIDR range before running the commands to set up network peering. You can not customize a CIDR range after [setting up private services access](/architecture/partners/netapp-cloud-volumes/setting-up-private-services-access) .\n- Click **Save** to create the storage pool.Creating the first storage pool in a region can take up to 15 minutes as the resources required for the pool are provisioned. During this time, the storage pool shows that it is in the creating state.\n- The new storage pool appears in the **Storage Pools** list.## Change storage pool settings\nAfter a storage pool is created, some settings can be changed, as described in the following sections.\n### Cross-zone move\nZone-redundant pools provide a synchronous copy of the data in two zones. Although the data is located in two zones, Cloud Volumes Service serves NFS and SMB volumes only from the current zone. The failover zone acts as fallback in case the current zone becomes unavailable. You can use the **Initiate cross-zone move** button to switch the roles of the zones, so the failover zone becomes the current zone, and the current zone becomes the failover zone. After the move is finished, volumes are served from the other zone. The new zone shows immediately on the **Storage Pools** page, but the old zone can show for up to 10 minutes on the **Volumes** page.\n**Important:** A cross-zone move can stall I/O operations for several minutes. SMB connections might drop and need to be re-established. NFS connections resume I/O operations without disruption.\n### Storage pool size\nThe size of a storage pool can be expanded in 1 GiB increments up to 200 TiB. A pool cannot decrease in size.\nVolumes in a pool can increase and decrease in size within the pool and volume limits.\n### Global access to Active Directory\nGlobal access to Active Directory allows volumes in a storage pool to use Active Directory domain controllers outside the pool's region. You can modify this setting after the storage pool is created.\n**Considerations**\n- Changing the setting can cause I/O disruptions of up to several minutes for volumes already using Active Directory.\n- Enabling the setting reduces the number of maximum storage pools per region to 50%. See [Storage pool limits](/architecture/partners/netapp-cloud-volumes/resource-limits-quotas#storage_pool_limits) .\n- Disabling the setting might disrupt access to volumes which require an Active Directory connection. Before disabling, make sure Active Directory domain controllers in the same region as the pool can be reached and domain controllers are configured correctly. Refer to [Manage DC selection using AD sites](/architecture/partners/netapp-cloud-volumes/managing-active-directory-connections#manage_dc_selection_using_ad_sites) .\n### Pool label\nYou can modify the pool label after the storage pool is created.\n## Delete a storage pool\nYou are charged for the capacity that is allocated to your self-managed and managed storage pools. You can delete storage pools to control charges.\n### Delete a self-managed storage pool\nTo delete a self-managed storage pool, all volumes contained in that pool must be deleted.\n- Go to the **Storage Pools** page to see the number of volumes in the storage pool that you want to delete.\n- Go to the **Volumes** page and filter by storage pool to see all of the volumes in the pool.\n- Delete each volume in the storage pool.\n- Go back to the **Storage Pools** page and delete the storage pool.\n### Delete a managed storage pool\nTo delete a managed storage pool, you delete the single volume in the storage pool, which causes the managed storage pool to be deleted automatically.\n- Go to the **Storage Pools** page to see the volume in the managed storage pool.\n- Go to the **Volumes** page and delete the volume in the managed storage pool.## What's next\n- [Set up customer-managed encryption keys](https://cloud.google.com/architecture/partners/netapp-cloud-volumes/customer-managed-keys) .\n- [Manage Active Directory connections](https://cloud.google.com/architecture/partners/netapp-cloud-volumes/managing-active-directory-connections) .\n- [Create and manage NFS volumes](https://cloud.google.com/architecture/partners/netapp-cloud-volumes/creating-nfs-volumes) .\n- [Create and manage SMB volumes](https://cloud.google.com/architecture/partners/netapp-cloud-volumes/creating-smb-volumes) .\n- [Monitor cloud volumes](https://cloud.google.com/architecture/partners/netapp-cloud-volumes/monitoring) .\n- [Create and manage volume snapshots](https://cloud.google.com/architecture/partners/netapp-cloud-volumes/creating-volume-snapshots) .\n- [Revert a volume using a snapshot](https://cloud.google.com/architecture/partners/netapp-cloud-volumes/revert-volume-snapshot) .\n- [Back up and restore a cloud volume](https://cloud.google.com/architecture/partners/netapp-cloud-volumes/back-up) .\n- [FAQs about NetApp Cloud Volumes Service for Google Cloud](https://cloud.google.com/architecture/partners/netapp-cloud-volumes/faqs-netapp) .\n- To explore reference architectures, diagrams, tutorials, and best practices about Google Cloud, see the [Cloud Architecture Center](https://cloud.google.com/architecture/#/?q=cloud_volumes) .", "guide": "Cloud Architecture Center"}