{"title": "Cloud Architecture Center - Reconciling orphaned managed user accounts", "url": "https://cloud.google.com/architecture/reference-patterns/overview", "abstract": "# Cloud Architecture Center - Reconciling orphaned managed user accounts\nLast reviewed 2023-02-27 UTC\nThis document describes how to identify and reconcile orphaned user accounts.\nIf you use an [external identity provider (IdP)](/architecture/identity/reference-architectures#using_an_external_idp) , then the authoritative source for identities is external to [Cloud Identity](/identity) or [Google Workspace](https://gsuite.google.com/) . Each identity in Cloud Identity or Google Workspace should therefore have a counterpart in the [external authoritative source](/architecture/identity/overview-google-authentication#external_authoritative_source) . It's possible that some of the identities in your Cloud Identity or Google Workspace account lack a counterpart in your external authoritative source—if so, these user accounts are considered . Orphaned accounts can occur under the following circumstances:\n- A Cloud Identity or Google Workspace administrator has manually created a user account that has a non-matching identity.\n- You have [migrated a consumer account](/architecture/identity/migrating-consumer-accounts#surfacing_unmanaged_user_accounts) to Cloud Identity or Google Workspace, but the account uses an identity that does not match any existing identity in the external source.", "content": "## Before you begin\nTo reconcile orphaned managed user accounts, you must meet the following prerequisites:\n- You have [identified a suitable onboarding plan](/architecture/identity/assessing-onboarding-plans) and have completed all prerequisites for consolidating your existing user accounts.\n- You have created a [Cloud Identity or Google Workspace account](/architecture/identity/overview-google-authentication#cloud_identity_or_g_suite_account) .## Process\nTo reconcile orphaned user accounts, you must first identify which user accounts are orphaned. For each user account, you then have to decide how to best reconcile that account.\n### Identifying orphaned user accounts\nTo find orphaned user accounts, you must compare the identities of user accounts in Cloud Identity or Google Workspace against the identities that are recognized by your authoritative source.\nTo perform a comparison, you can use the export functionality of a Google Workspace or Cloud Identity account to obtain a list of your current user accounts:\n- In the Admin Console, go to the [Users](https://admin.google.com/ac/users) page.\n- Select **Download users** .\n- Select **All user info columns and currently selected columns** .\n- Click **Download** .After a few minutes, depending on the number of user accounts you have, you see a notification that the user info CSV file is ready to be downloaded.\n- Click **Download CSV** and save the file to your local disk. **Note:** The CSV export might contain personally identifiable information (PII). Make sure that you select a storage location that is protected against unauthorized access.\nIf you use Active Directory or Azure Active Directory (Azure AD) as your authoritative source, follow these steps to compare identities:\n- Sign on to a workstation that has access to Active Directory.\n- Open a PowerShell console.\n- Set a variable to the location of your downloaded file:```\n$GoogleUsersCsv=\"GOOGLE_PATH\"\n```Replace `` with the file path to the CSV file that you downloaded before.\n- Determine the list of user accounts that lack a counterpart in Active Directory:```\n$GoogleUsers = (Import-Csv -Path $GoogleUsersCsv -Header FirstName,LastName,Email | Select-Object -Skip 1)$LdapFilter = \"(|{0})\" -f (($GoogleUsers | Select-Object @{Name=\"Clause\";Expression={\"(userPrincipalName=$($_.Email))\"}} | Select-Object -ExpandProperty Clause) -join \"\")$GoogleUsersWithMatch = Get-ADUser -LdapFilter $LdapFilter `    | Select-Object -ExpandProperty UserPrincipalName$GoogleUsers | Where-Object {$_.Email -NotIn $GoogleUsersWithMatch}\n```The command compares the primary email address of user accounts in Cloud Identity or Google Workspace against the `userPrincipalName` attribute in Active Directory. If you are using a different mapping between Active Directory users and Cloud Identity or Google Workspace user accounts, you might need to adjust the command. **Note:** If the CSV file contains a large number of users, the `Get-ADUser` command might take several minutes to execute and might cause significant load on the associated domain controller.The output is similar to this:```\nFirstName LastName  Email\n--------- --------  ----Alice  Admin  admin@example.org\nOlly  Orphaned  olly@example.org\nMatty  Mismatch  matty@wrongsubdomain.example.org\n```Each item listed in the output represents a user account in Cloud Identity or Google Workspace that lacks a counterpart in Active Directory.An empty result indicates that you don't have any orphaned user accounts in Google Workspace or Cloud Identity.\n- Delete the CSV file from your local disk.\n- In the [Azure Portal](https://portal.azure.com) , go to **Azure Active Directory Users** .\n- Click **Download users** .\n- Enter a filename and click **Start** .Wait until a **Click here to download** link appears.Depending on the number of user accounts you have, it might take a few minutes for the operation to complete.\n- Click **Click here to download** and save the file to your local disk. **Note:** The CSV export might contain personally identifiable information (PII). Make sure that you select a storage location that is protected against unauthorized access.\n- On a workstation that has PowerShell installed, open a PowerShell console.\n- Set two environment variables:```\n$GoogleUsersCsv=\"GOOGLE_PATH\"\n$AzureUsersCsv=\"AZURE_PATH\"\n```Replace `` and `` with the file paths to the CSV files that you previously downloaded.\n- Determine the list of user accounts that lack a counterpart in Active Directory:```\n$GoogleUsers = (Import-Csv -Path $GoogleUsersCsv    -Header FirstName,LastName,Email | Select-Object -Skip 1)$AzureUsers = (Import-Csv -Path $AzureUsersCsv)$GoogleUsers | Where-Object {$_.Email -NotIn ($AzureUsers | Select-Object -ExpandProperty userPrincipalName)}\n```The command compares the primary email address of user accounts in Cloud Identity or Google Workspace against the `userPrincipalName` attribute in Azure AD. If you are using a different mapping between Azure AD users and the Cloud Identity or Google Workspace user accounts, you might need to adjust the command.The output is similar to the following:```\nFirstName LastName Email\n--------- -------- ----Alice  Admin  admin@example.org\nOlly  Orphaned olly@example.org\nMatty  Mismatch matty@wrongsubdomain.example.org\n```Each item listed in the output represents a user account in Cloud Identity or Google Workspace that lacks a counterpart in Active Directory.An empty result indicates that you don't have any orphaned user account in Google Workspace or Cloud Identity.\n- Delete both CSV files from your local disk.\n### Reconciling orphaned user accounts\nTo reconcile orphaned user accounts, you have to analyze each user account to determine why its identity lacks a counterpart in your authoritative source system.\nIf you think a user account is obsolete, check whether any configuration settings or data associated with the account are worth preserving:\n- To keep existing Google Drive data, [transfer the data](https://support.google.com/a/answer/1247799?hl=en) to a different user.\n- If you don't want to keep any existing configuration settings or data, delete the user account.\n- To temporarily retain the user account, suspend the user account and change its primary email address to an address that is unlikely to ever [cause a collision](/architecture/identity/best-practices-for-federating#make_cloud_identity_or_g_suite_identities_a_subset_of_the_identities_in_your_external_idp) . For example, rename`olly.obsolete@example.com`to`obsolete-2019-11-10-olly.obsolete@example.com`.\nFor each user account that is still valid, try to fix the primary email address so that it matches an identity in your authoritative source. This might require the following:\n- Changing the domain of the primary email address.\n- Swapping the primary email address and an alias address.\n- Fixing casing or spelling of the primary email address (for example, adding or removing dots).\n**Note:** Changing the primary email address impacts the owner of the associated user account. Make sure that you notify the owner of the change so that they know which email address to use for subsequent sign-ins.\n## Best practices\nWe recommend the following best practices when you are reconciling managed user accounts:\n- If you migrate consumer accounts to Cloud Identity or Google Workspace, repeat the reconciliation process at least once for every batch of user accounts that you migrate.", "guide": "Cloud Architecture Center"}