{"title": "Cloud Architecture Center - Keycloak single sign-on", "url": "https://cloud.google.com/architecture/reference-patterns/overview", "abstract": "# Cloud Architecture Center - Keycloak single sign-on\nLast reviewed 2023-02-27 UTC\nThis guide shows how to set up single sign-on (SSO) between [Keycloak ](https://www.keycloak.org/) and your Cloud Identity or Google Workspace account by using [SAML federation](https://www.oasis-open.org/standards#samlv2.0) . The document assumes you have installed and are using Keycloak.\n **Note:** Keycloak does not provide built-in integration for automatically provisioning users and groups to Cloud Identity or Google Workspace. To automate user and group provisioning, you must combine Keycloak with a provisioning tool such as [Google Cloud Directory Sync](/architecture/identity/federating-gcp-with-active-directory-synchronizing-user-accounts) , which lets you provision users and groups from an LDAP server.\n **Note:** This article uses [classic organizational SSO profiles](/architecture/identity/single-sign-on#configuration) instead of SAML profiles to set up single sign-on. Organizational SSO profiles let you [choose whether to apply additional authentication challenges](https://support.google.com/a/answer/6002699#ssochallenges) to users, which is not supported for SAML profiles.", "content": "## Objectives\n- Configure your Keycloak server so that it can be used as an identity provider (IdP) by Cloud Identity or Google Workspace.\n- Configure your Cloud Identity or Google Workspace account so that it uses Keycloak for SSO.\n## Before you begin\n- If you don't have a Cloud Identity account, [sign up for an account](https://gsuite.google.com/signup/gcpidentity/welcome?&_ga=2.104797888.-157260409.1512652371) .\n- Make sure your Cloud Identity account has [super-admin](https://support.google.com/cloudidentity/answer/2405986?hl=en) privileges.\n- If your Keycloak server is used to manage more than one realm, decide which realm you want to use for the federation.\n- Ensure that you have admin access to the selected realm.\n## Configuring KeycloakBefore enabling SSO in Cloud Identity or Google Workspace, you must configure your Keycloak server by creating a client.\n### Creating a clientYou start by creating a client in Keycloak:- Log in to Keycloak and open the administration console.\n- Select the realm that you want to use for federation.\n- In the menu, select **Clients** .\n- Click **Create client** .\n- Configure the following settings for the client:\n- **Client type** : **SAML** \n- **Client ID** :`google.com`\n- **Name** :`Google Cloud`\n- **Client ID** :`google.com`\n- **Client Protocol** : **saml** \n- **Client SAML Endpoint** : leave blank\n **Note:** For SAML federation to work, **Client ID** must be `google.com` .\n- Click **Save** .\n- Specify the details for the `google.com` client by configuring the following settings:\nOn the **Settings** tab:- **Valid Redirect URIs** :`https://www.google.com/*`\n- **Name ID Format** : **email** \n- **Force Name ID Format** : **on** \n- **Sign documents** : **off** \n- **Sign Assertions** : **on** \nOn the **Keys** tab:- **Client Signature Required** : **off** \n- **Name** : A name such as`Google Cloud`\n- **Sign Assertions** : **on** \n- **Client Signature Required** : **off** \n- **Force Name ID Format** : **on** \n- **Name ID Format** : **email** \n- **Valid Redirect URIs** :`https://www.google.com/*`\nKeep the default values for all other settings.\n- Click **Save** .\n### Exporting the signing certificateAfter Keycloak authenticates a user, it passes a SAML assertion to Cloud Identity or Google Workspace. To enable Cloud Identity and Google Workspace to verify the integrity and authenticity of that assertion, Keycloak signs the assertion with a special token-signing key and provides a certificate that enables Cloud Identity or Google Workspace to check the signature.\nYou now export the signing certificate from Keycloak:- In the menu, select **Realm settings** .\n- Select the **Keys** tab.\n- Find the row for **Algorithm: RS256** and **Use: SIG** and select **Certificate** .A dialog that contains a base64-encoded certificate appears.\n- Copy the base64-encoded certificate value to the clipboard.\n### Converting the signing certificateBefore you can use the signing certificate, you must convert it into PEM format by adding a header and footer.- Open a text editor such as Notepad or vim.\n- Paste the following header, followed by a newline:```\n-----BEGIN CERTIFICATE----\n```\n- Paste the base64-encoded certificate from the clipboard.\n- Add a newline and paste the following footer:```\n-----END CERTIFICATE----\n```The output is similar to the following:```\n-----BEGIN CERTIFICATE----MIICmzCCAYMCBgF7v8/V1TANBgkq...\n-----END CERTIFICATE----\n```\n- Save the file to a temporary location on your computer.\n## Configuring Cloud IdentityYou now configure single sign-on in Cloud Identity or Google Workspace.- Open the [Admin Console](https://admin.google.com) and log in using a super-admin user.\n- In the menu, click **Show more** and go to **Security > Authentication > SSO with third-party IdP** .\n- Click **Add SSO profile** . **Note:** Don't use the **Add SAML profile** button.\n- Set **Setup SSO with third party identity provider** to **enabled** .\n- Enter the following settings:- **Sign-in page URL:** \n```\nhttps://KEYCLOAK/realms/REALM/protocol/saml\n```\n```\nhttps://KEYCLOAK/auth/realms/REALM/protocol/saml\n```\n- **Sign-out page URL:** \n```\nhttps://KEYCLOAK/realms/REALM/protocol/openid-connect/logout\n```\n```\nhttps://KEYCLOAK/auth/realms/REALM/protocol/openid-connect/logout?redirect_uri=https://KEYCLOAK/auth/realms/REALM/account/\n```\n- **Use a domain specific issuer:** **clear** \n- **Change password URL:** \n```\nhttps://KEYCLOAK/realms/REALM/account\n```\n```\nhttps://KEYCLOAK/auth/realms/REALM/account\n```\nIn all URLs, replace the following:- ``: the fully qualified domain name of your Keycloak server\n- ``: the name of your selected realm\n- Under **Verification certificate** , click **Upload certificate** , and then pick the token signing certificate that you downloaded previously.\n- Click **Save** .\n- Sign out of the Admin Console.\n## Testing single sign-onYou've completed the single sign-on configuration. You can now check whether SSO works as intended.- Choose a Keycloak user that satisfies the following criteria:- The user has an email address.\n- The email address corresponds to the primary email address of an existing user in your Cloud Identity or Google Workspace account.\n- The Cloud Identity user does not have super-admin privileges.User accounts that have super-admin privileges must always sign in by using Google credentials, so they aren't suitable for testing single sign-on.\n- Open a new browser window and go to the [Google Cloud console](https://console.cloud.google.com/) .\n- On the Google sign-in page, enter the email address of the user account, and then click **Next** . You are redirected to Keycloak.\n- Enter your Keycloak credentials, and then click **Log in** .After successful authentication, Keycloak redirects you back to the Google Cloud console. Because this is the first login for this user, you're asked to accept the Google terms of service and privacy policy.\n- If you agree to the terms, click **Accept** .\n- You are redirected to the Google Cloud console, which asks you to confirm preferences and accept the Google Cloud terms of service. If you agree to the terms, click **Yes** , and then click **Agree and Continue** .\n- Click the avatar icon, and then click **Sign out** .You are redirected to Keycloak, logged out, and redirected to `www.google.com` .\nIf you have trouble signing in, keep in mind that user accounts with super-admin privileges can bypass SSO, so you can still use the Admin console to verify or change settings.## What's next\n- Learn more about [Identity and Access Management (IAM)](/iam/docs/overview) .\n- Review the [best practices for managing identity and access](/architecture/framework/security/identity-access) .", "guide": "Cloud Architecture Center"}