{"title": "Cloud Architecture Center - Hub-and-spoke network architecture", "url": "https://cloud.google.com/architecture/reference-patterns/overview", "abstract": "# Cloud Architecture Center - Hub-and-spoke network architecture\nLast reviewed 2023-07-12 UTC\nThis document presents two architectural options for setting up a hub-and-spoke network topology in Google Cloud. One option uses the network peering capability of Virtual Private Cloud (VPC), and the other uses Cloud VPN.\nEnterprises can separate workloads into individual VPC networks for purposes of billing, environment isolation, and other considerations. However, the enterprise might also need to share specific resources across these networks, such as a shared service or a connection to on-premises. In such cases, it can be useful to place the shared resource in a network and to attach the other VPC networks as . The following diagram shows an example of the resulting hub-and-spoke network, sometimes called a .\nIn this example, separate VPC networks are used for the workloads of individual business units within a large enterprise. Each spoke VPC network is connected to a central hub VPC network that contains shared services and can serve as the sole entry point to the cloud from the enterprise's on-premises network.\n", "content": "## Architecture using VPC Network Peering\nThe following diagram shows a hub-and-spoke network using [VPC Network Peering](/vpc/docs/vpc-peering) . VPC Network Peering enables communication using internal IP addresses between resources in separate VPC networks. Traffic stays on Google's internal network and does not traverse the public internet.- In this architecture, the resources that need network-level isolation use separate spoke VPC networks. For example, the architecture shows a Compute Engine VM in the`spoke-1`VPC network. The`spoke-2`VPC network has a Compute Engine VM and a Google Kubernetes Engine (GKE) cluster.\n- Each spoke VPC network in this architecture has a peering relationship with a central hub VPC network.\n- VPC Network Peering does not constrain VM bandwidth. Each VM can send traffic at the [full bandwidth](/compute/docs/network-bandwidth) of that individual VM.\n- Each spoke VPC network has a Cloud NAT gateway for outbound communication with the internet.\n- VPC Network Peering does not provide for transitive route announcements. Unless an additional mechanism is used, the VM in the`spoke-1`network cannot send traffic to the VM in the`spoke-2`network. To work around this non-transitivity constraint, the architecture shows the option of using Cloud VPN to forward routes between the networks. In this example, VPN tunnels between the`spoke-2`VPC network and the hub VPC network enable reachability to the`spoke-2`VPC network from the other spokes. If you need connectivity between only a few specific spokes, you can peer those VPC network pairs directly.## Architecture using Cloud VPN\nThe scalability of a hub-and-spoke topology that uses VPC Network Peering is subject to [VPC Network Peering limits](/vpc/docs/quota#vpc-peering) . And as noted earlier, VPC Network Peering connections don't allow transitive traffic beyond the two VPC networks that are in a peering relationship. The following diagram shows an alternative hub-and-spoke network architecture that uses [Cloud VPN](/network-connectivity/docs/vpn/concepts/overview) to overcome the limitations of VPC Network Peering.- The resources that need network-level isolation use separate spoke VPC networks.\n- IPSec VPN tunnels connect each spoke VPC network to a hub VPC network.\n- A DNS private zone in the hub network and a DNS peering zone and private zone exist in each spoke network.\n- Bandwidth between networks is limited by the total [bandwidths of thetunnels](/network-connectivity/docs/vpn/concepts/overview#network-bandwidth) .\nWhen choosing between the two architectures discussed so far, consider the relative merits of VPC Network Peering and Cloud VPN:\n- VPC Network Peering has the non-transitivity constraint, but it supports the full bandwidth defined by the machine type of the VMs and other factors that determine [network bandwidth](/compute/docs/network-bandwidth) . However, you can add transitive routing by adding VPN tunnels.\n- Cloud VPN allows transitive routing, but the total bandwidth (ingress plus egress) is limited to the bandwidths of the tunnels.## Design alternatives\nConsider the following architectural alternatives for interconnecting resources that are deployed in separate VPC networks in Google Cloud:\n## What's next\n- Deploy a hub-and-spoke network using [VPC Network Peering](https://github.com/GoogleCloudPlatform/cloud-foundation-fabric/tree/master/blueprints/networking/hub-and-spoke-peering) .\n- Deploy a hub-and-spoke network using [Cloud VPN](https://github.com/GoogleCloudPlatform/cloud-foundation-fabric/tree/master/blueprints/networking/hub-and-spoke-vpn) .\n- Use the hub-and-spoke architecture to [deploy centralized networkappliances](/architecture/architecture-centralized-network-appliances-on-google-cloud) .\n- Learn about more design options for [connecting multiple VPCnetworks](/architecture/best-practices-vpc-design#connecting_multiple_networks) .\n- Learn about the [best practices](/architecture/framework) for building a secure and resilient cloud topology that's optimized for cost and performance.", "guide": "Cloud Architecture Center"}