{"title": "Cloud Architecture Center - Back up and restore a cloud volume", "url": "https://cloud.google.com/architecture/reference-patterns/overview", "abstract": "# Cloud Architecture Center - Back up and restore a cloud volume\nLast reviewed 2023-03-14 UTC\nProtecting your data is an important aspect of data management. Cloud Volumes Service has the ability to send volumes of the CVS service type to Google Cloud Object Storage for long-term backup and archive. This data management feature complements volume snapshots, which provide access for development or test use cases that require short-term recovery. For more information, see [Pricing](/architecture/partners/netapp-cloud-volumes/costs) .\nYou can only back up and restore volumes of the CVS service type. The service supports up to 10 concurrent backup or restore operations, and your client I/O may slow down during these operations. For better performance, you can use a larger pool size that supports greater throughput.\nFor examples that demonstrate how to use the API to program the automatic creation of backups, list backups, and restore from a backup, see [Cloud Volumes APIs](/architecture/partners/netapp-cloud-volumes/api) .\n", "content": "## Back up a cloud volume\nUse the following instructions to back up a cloud volume:\n- In the Google Cloud console, go to the **Backups** page. [Go to the Backups page](https://console.cloud.google.com/netapp/cloud-volumes/backups) \n- Click **Create** .\n- On the **Create backup** page, complete the following fields:- **Name** : Enter a unique name that describes the backup.\n- **Region** : Specify the region where the volume you want to back up resides. If this is a CVS service type region, also select the zone.\n- **Volume** : Select the volume that you want to back up.\n- Click **Create** .## Restore a cloud volume from a backup\nUse the following instructions to restore a cloud volume from a backup:\n- In the Google Cloud console, go to the **Backups** page. [Go to the Backups page](https://console.cloud.google.com/netapp/cloud-volumes/backups) \n- Select the volume to restore.\n- Next to the volume that you want to restore, click **More** , and then click **Restore** .After you click **Restore** , you are redirected to the **Create file system** page.\n- Select an existing storage pool or create a new storage pool as a destination for volume restoration. Only pools in the same location are offered for restoration.\n- Verify whether the **Storage pool available capacity** value is large enough to accommodate the volume to restore. If it isn't, increase the size of the storage pool.\n- Enter a name for the volume.\n- In the **Allocated capacity** field, enter the size of the volume to create.The field is prepopulated with the size of the source volume.\n- Choose the **Protocol type** and set volume and protocol-specific options.\n- Click **Save** .\n- Go to the **Volumes** page to see the new volume.## What's next\n- [Use volume replication to protect your data](/architecture/partners/netapp-cloud-volumes/volume-replication) \n- [Cloud Volumes APIs](/architecture/partners/netapp-cloud-volumes/api) \n- [Security considerations](/architecture/partners/netapp-cloud-volumes/security-considerations) \n- [FAQs about NetApp Cloud Volumes Service for Google Cloud](/architecture/partners/netapp-cloud-volumes/faqs-netapp)", "guide": "Cloud Architecture Center"}