{"title": "Cloud Architecture Center - Manage domain controller selection using Active Directory sites", "url": "https://cloud.google.com/architecture/reference-patterns/overview", "abstract": "# Cloud Architecture Center - Manage domain controller selection using Active Directory sites\nLast reviewed 2023-11-19 UTC\nYour Active Directory sites and subnets should represent the actual data center locations, offices, and network topology as closely as possible. In your Cloud Volumes Service (CVS) project, place domain controllers in the same region as your volumes and define an Active Directory site for that region. When Cloud Volumes Service is connected to your domain, the service uses [DNS-based discovery](https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-adts/7fcdce70-5205-44d6-9c3a-260e616a2f04) to find the right domain controllers to communicate with. By specifying a site in the Active Directory settings of Cloud Volumes Service, you tell it to search only domain controllers for that site.\nFor the CVS service type, you must either use Active Directory sites or enable Global Access to Active Directory for storage pools. If you enable Global Access to Active Directory, using Active Directory sites is optional but recommended.\nFor the CVS-Performance service type, using Active Directory sites is optional but recommended.\nWithout site specification, Domain Name System (DNS)-based discovery might identify domain controllers outside of the region. Trying to create a volume can fail due to connection timeouts.\nRecommended actions:\n- Deploy at least one domain controller in the Cloud Volumes Service region and connect the domain controllers to your existing AD.\n- Create an Active Directory site for your Google Cloud region and place the appropriate domain controllers into that site.\n- Use the Active Directory site when setting up Active Directory connections.\nTo verify that your Active Directory site contains only reachable domain controllers, see [How can I identify Active Directory domain controllers used by the CVS and CVS-Performance service types?](/architecture/partners/netapp-cloud-volumes/faqs-netapp#domain-controllers)\nFor more information, see [Active Directory: Design Considerations and Best Practices](https://social.technet.microsoft.com/wiki/contents/articles/52587.active-directory-design-considerations-and-best-practices.aspx) ", "content": ".", "guide": "Cloud Architecture Center"}