{"title": "Cloud Architecture Center - Set up Active Directory for SMB", "url": "https://cloud.google.com/architecture/reference-patterns/overview", "abstract": "# Cloud Architecture Center - Set up Active Directory for SMB\nLast reviewed 2023-05-08 UTC\n- In the Google Cloud console, go to Cloud Volumes. [Go to the Cloud Volumes page](https://console.cloud.google.com/netapp/cloud-volumes) \n- Select **Active Directory connections** , and then click **Create** .\n- In the **Create Active Directory Connection** dialog, enter the information indicated in the following table. **Important:** The settings are not validated when the connection is being created. They are used when the first SMB volume in the specified region is created. After the first SMB volume is created, incorrect settings can cause volume creation failures.Required fields are marked with an asterisk (*). This table only shows fields relevant to SMB.| Field          | Description                                                                                                              | CVS   | CVS-Performance |\n|:--------------------------------------------|:----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|:---------------|------------------:|\n| Username* Password*       | Credentials for the AD account with permissions to create the computer account within the specified organizational unit. For details, see permissions needed to create AD machine accounts.                                                                 | nan   |    nan |\n| Connection type*       | Specifies whether an AD connection can be used for volumes of the CVS service type or volumes of the CVS-Performance service type. You can mark existing AD connections with the AD connection type to avoid problems when creating new volumes or editing parameters of that AD connection. Specifying the wrong connection type for an existing AD connection can cause problems with creating new volumes or editing parameters of that AD connection. | nan   |    nan |\n| Domain*          | Fully qualified domain name for the AD domain.                                                                                                     | nan   |    nan |\n| Site          | Name of an AD site. Limits discovery of AD domain controllers. Use when multiple AD connections in different regions are configured.                                                                               | nan   |    nan |\n| DNS Servers*        | IP addresses for DNS servers (3 maximum) that are used for DNS-based domain controller discovery. The CVS-Performance service type checks all IP addresses listed. The CVS service type uses the first IP address listed.                                                          | nan   |    nan |\n| NetBIOS*         | Name of the created AD machine account. A 5-character random ID is generated automatically–for example, -6f9a).                                                                                    | nan   |    nan |\n| Organizational Unit       | LDAP path for the organizational unit where the computer account is created.                                                                                             | nan   |    nan |\n| Enable AES Encryption for AD authentication | Enables AES-128 and AES-256 encryption for Kerberos-based communication with AD.                                                                                            | Always enabled |    nan |\n| Region*          | Associates the AD connection that you're creating with a single region.                                                                                              | nan   |    nan |\n| Backup Users        | Domain users or groups to receive elevated file/folder privileges. Can be used for data migration, NetApp Global File Cache.                                                                                 | nan   |    nan |\n| Security Privilege Users     | Domain user accounts that require elevated privileges to manage security logs for the AD associated with Cloud Volumes Service. This list is specifically needed for the installation of a SQL server where binaries and system databases are stored on an SMB share. This option isn't required if you use an administrator user during installation.                          | nan   |    nan |\n- Click **Save** ", "content": ".", "guide": "Cloud Architecture Center"}