{"title": "Cloud Architecture Center - Create and manage volume snapshots", "url": "https://cloud.google.com/architecture/reference-patterns/overview", "abstract": "# Cloud Architecture Center - Create and manage volume snapshots\nLast reviewed 2023-02-24 UTC\nProtecting your volumes against unintentional or accidental changes is an important component of data lifecycle management. Cloud Volumes Service provides volume snapshots to ensure that you can recover your data from such a change. Snapshots are local-space efficient. They are image copies of your current volume state. You can use a snapshot to revert a volume to a previous version or to restore to a new volume as a copy of your original volume.\n", "content": "## Considerations\nSnapshots provide short-term protection for a volume. The following considerations apply:\n- Because snapshots are stored locally with the volume data, they persist as long as the volume remains. When a volume is deleted, its snapshots are also deleted. If you require longer-term protection for your volume, use backups. For more information about how to back up and restore a cloud volume, see [Cloud Volumes Service backups](/architecture/partners/netapp-cloud-volumes/back-up) .\n- A snapshot reflects the volume's state at a specific moment in time. Each subsequent snapshot captures the changes to the volume's state from the prior snapshot. These related volume snapshots are called a . Because this snapshot series is a chain of related snapshots, reverting a volume to a prior state using a snapshot other than the most recent snapshot removes any snapshots that existed after the selected snapshot.\n- Snapshots allow access to a prior state of the file system. They allow read access to data that has been deleted. The capacity required to store deleted files referenced by a snapshot is counted against the allocated capacity. See [Snapshot space requirements](/architecture/partners/netapp-cloud-volumes/performance-expectations#snapshot_space_requirements) .\n- Internal snapshots that begin with `snapmirror-` and `cloud-snapshot-` can be used for volume replication and backup but don't support creating volumes.## Create a volume snapshot\nIf you want to schedule volume snapshots regularly, create a volume with a snapshot schedule or edit an existing volume to modify its snapshot schedule.\nYou can also manually create a volume snapshot. Both the general-purpose Cloud Volumes Service and Cloud Volumes Service Performance [service types](/architecture/partners/netapp-cloud-volumes/service-types) support snapshots.\n- In the Google Cloud console, go to the **Snapshots** page.\n- Click **Create** . \n- On the **Create Snapshot** page, complete the following fields: - **Name** : Enter a unique name that describes the snapshot.\n- **Region** : Specify the region where the volume you want to snapshot resides. If this is a CVS-service-type region, also select the zone.\n- **Volume** : Identify the volume you want to snapshot from the list of available volumes.\n- Click **Create** .## Create application-consistent snapshots\nOperating systems and applications can keep data written in their caches for some time before the data is written to storage, so the current state of the data might not be in storage. Snapshots taken when some data in storage might not be current are called . Recovering data from crash-consistent snapshots works well for a majority of applications.\nFor some applications, like databases, it might be important to ensure that the application and the operating system write the current state of the data to storage before a snapshot is taken. Such snapshots are called and provide a clean recovery point for the application.\nTo use Cloud Volumes Service snapshots to create application-consistent snapshots, do the following:\n- Flush all unwritten data from the application caches to storage. Many applications, such as databases, provide built-in mechanisms for this procedure. For details, see your application documentation.An alternative is stopping the application briefly.\n- Take a snapshot of the volume, either manually or using a script.Taking a snapshot takes a few seconds.\n- Return your application to its normal state of operation.\nScripting such a procedure allows you to create consistent snapshots of large application datasets within a few seconds. Such snapshots can also be used to create a consistent [clone](/architecture/partners/netapp-cloud-volumes/restore-volume-snapshot) of the application.\n**Important:** Snapshots are stored within the volume. To create an independent copy for backup and recovery or disaster recovery, use [volume replication](/architecture/partners/netapp-cloud-volumes/volume-replication) to copy the data—which includes the snapshot—to a different location.\n## View snapshots\nIn projects with multiple volumes, hundreds or thousands of snapshots can accumulate in hours or days. Use Cloud Volumes Service filters to view snapshots by region (default is `us-east4` ) and by volume in the region you selected.\n**Important:** You can view snapshots by region and by volume. If you select the view of all regions and/or all volumes, the list of snapshots may fail to generate because the number of snapshots in the list is too large.\n- In the Google Cloud console, go to the **Snapshots** page.\n- Select one or **All Regions** from the **Region** drop-down menu.\n- Select one or **All Volumes** from the **Volume** drop-down menu.\n## Create or modify a snapshot policy\nWhen you use automatic snapshots, older snapshots are removed based on the number that you have specified to keep. If you change an existing schedule, you might need to manually delete snapshots created on the previous schedule.\n- In the Google Cloud console, go to the **Volumes** page.\n- On the volume you want to manage, clickmore_vert **More** , and then select **Edit** .\n- In the **Edit File System** page, click **Show Snapshot Policy** to expand the section. \n- Select **Allow automatic snapshots** .\n- For each snapshot schedule ( **Hourly,** **Daily** , **Weekly** , or **Monthly** ), specify the number of snapshots to keep and the time during each period to take the snapshot.For example, under **Hourly** , enter `5` in the **Minute** field to take a snapshot at 5 minutes past the hour, every hour. Times are expressed as UTC (Coordinated Universal Time).\n- Click **Save** .## Delete a snapshot\n**Important:** When a snapshot is deleted, it cannot be restored. This operation can't be undone.\nIf you no longer need a snapshot, you can delete it. Both the general-purpose CVS and the CVS-Performance [service types](/architecture/partners/netapp-cloud-volumes/service-types) support this functionality.\n- In the Google Cloud console, go to the **Snapshots** page.- To delete individual snapshots, clickmore_vert **More** , and then select **Delete** .\n- To delete multiple snapshots (up to 10), select the checkbox next to each snapshot you want to delete, and then click **Delete** .\nThe **Delete Snapshot** page displays information about the snapshot you are deleting. The page warns you that you cannot recover a snapshot after you delete it. \n- To complete the deletion of the snapshot, type the snapshot name and select **Confirm** . ## What's next\n- [Restore data with snapshots](/architecture/partners/netapp-cloud-volumes/snapshots-restore-data) \n- [Revert a volume using a snapshot](/architecture/partners/netapp-cloud-volumes/revert-volume-snapshot) \n- [Restore a snapshot to a new volume](/architecture/partners/netapp-cloud-volumes/restore-volume-snapshot) \n- [Security considerations](/architecture/partners/netapp-cloud-volumes/security-considerations) \n- [FAQs about NetApp Cloud Volumes Service for Google Cloud](/architecture/partners/netapp-cloud-volumes/faqs-netapp)", "guide": "Cloud Architecture Center"}