{"title": "Cloud Architecture Center - Removing Gmail from consumer accounts", "url": "https://cloud.google.com/architecture/reference-patterns/overview", "abstract": "# Cloud Architecture Center - Removing Gmail from consumer accounts\nLast reviewed 2023-02-27 UTC\nThis document describes how you can remove Gmail from an existing consumer account to enable the user account [to be migrated](/architecture/identity/migrating-consumer-accounts) to Cloud Identity or Google Workspace.\nIf your organization doesn't use [Cloud Identity](/identity) or [Google Workspace](https://workspace.google.com/) , it's possible that some of your employees have been using Gmail accounts to access Google services. Some of these Gmail accounts might use a corporate email address such as `alice@example.com` as an [alternate email address](https://support.google.com/accounts/answer/176347?co=GENIE.Platform%3DAndroid&hl=en) .\nGmail accounts are owned and managed by the individuals who created them. Your organization therefore has no control over the configuration, security, and lifecycle of these accounts, which means they can't be migrated as is. By removing Gmail from affected consumer accounts, you allow the user accounts to be migrated to Cloud Identity or Google Workspace.\nConsider removing Gmail from an existing consumer account if both of the following conditions apply:\n- You want to migrate the user account to [Cloud Identity](/identity) or [Google Workspace](https://gsuite.google.com/) and retain the user's settings and data.\n- You don't use the email functionality provided by Gmail.\n**Note:** Because a Gmail account is owned and managed by the individual who created it, the account's owner must perform the steps to remove Gmail.\nIf you want to retain Gmail functionality, or if you want to avoid engaging the owner of a Gmail account, consider [sanitizing the Gmail account](/architecture/identity/sanitizing-gmail-accounts) instead.\n", "content": "## Before you begin\nTo remove Gmail from a user account, at least one of the alternate email addresses of the Gmail account must correspond to one of the domains that you've added to your Cloud Identity or Google Workspace account. Both primary and secondary domains qualify, but alias domains are not supported.\n**Note:** If you are considering using the [transfer tool for unmanaged users](https://admin.google.com/ac/unmanaged) , keep in mind that the tool doesn't find Gmail users, regardless of the alternate email addresses they use.\nThe following sections walk through the process of removing Gmail from a consumer account. **The steps must be performed by the owner of the Gmailaccount.**\n## Exporting Gmail data\nBefore you remove Gmail from your user account, you must export your existing Gmail data. You won't be able to access that data after you remove Gmail from the account. (Non-Gmail data is not affected.)\nFor information about how to export your Gmail data, see [Download your data](https://support.google.com/accounts/answer/3024190?hl=en) .\n## Removing the Gmail service\n- In the Google Account dashboard, open the **Data & personalization** page. [Go to Data & personalization](https://myaccount.google.com/data-and-personalization) \n- Under **Download or delete your data** , select **Delete a service** .\n- Click **Delete a service** . You might be prompted to enter your password again.\n- Click the icon next to the service you want to delete.\n- In the **How you'll sign in to Google** dialog, select your corporate email address and click **Next** .\n- Carefully read the explanations on the next screen. If you're sure you want to proceed, select **Yes** and click **Delete Gmail** .\nIt might take a few days until your corporate email address becomes the primary email address of the user account and the Gmail data is deleted. Although you won't be able to receive or send email using your `@gmail.com` email address anymore, the address remains associated with your user account and you can continue to use it to sign in.\n## Migrating the user account\nWhen the removal process has completed and the user account has been updated to use your corporate email address as the primary email address, your admin can migrate the user account to Cloud Identity or Google Workspace like other consumer accounts. For more information, see [Migrating consumer accounts](/architecture/identity/migrating-consumer-accounts)\n## Best practices for admins\nWe recommend the following best practices for working with Gmail accounts:\n- Prevent other users from assigning a corporate email address to their Gmail accounts by [proactively provisioning user accounts to Cloud Identity or Google Workspace](/architecture/identity/best-practices-for-federating#prevent_new_consumer_account_sign-ups) .\n- Prevent new Gmail accounts from being granted access to Google Cloud resources by using an organizational policy to [restrict identities by domain](/resource-manager/docs/organization-policy/restricting-domains) .\n- Prevent Gmail accounts from being given access to Google Marketing Platform by using a [policy that restricts sharing by domain](https://support.google.com/looker-studio/answer/9699595) .## What's next\n- Review how to [assess existing user accounts](/architecture/identity/assessing-existing-user-accounts) .\n- Learn how to [sanitize Gmail accounts](/architecture/identity/sanitizing-gmail-accounts) .", "guide": "Cloud Architecture Center"}