{"title": "Cloud Architecture Center - Introduction to NetApp Cloud Volumes Service", "url": "https://cloud.google.com/architecture/reference-patterns/overview", "abstract": "# Cloud Architecture Center - Introduction to NetApp Cloud Volumes Service\nLast reviewed 2023-11-19 UTC\nNetApp and Google Cloud have partnered to offer [Cloud Volumes Service](https://www.netapp.com/us/cloud-marketplace/google-cloud-platform.aspx?ref_source=redir-googlecloud) , a fully managed, cloud-based data storage service that provides advanced data management capabilities and highly scalable performance.\nWhether you are looking to migrate existing enterprise and industry-specific apps to Google Cloud, or to build new machine learning and Kubernetes-based apps that require persistent storage, you can accelerate deployment times while lowering costs by using Cloud Volumes Service.\nSee the video [Introducing Cloud Volumes Service for Google Cloud](https://youtu.be/uIB4iMZW6SI) .\nCloud Volumes Service helps you manage your workloads and apps, letting you migrate your workloads to the cloud without sacrificing the performance or the features you're used to having with on-premises storage. Cloud Volumes Service removes obstacles so you can move more of your file-based apps to Google Cloud, with support for Network File System (NFSv3 and NFSv4.1) and Server Message Block (SMB) volumes. You don't have to re-architect your apps, and you get persistent storage for your apps without complexity.\nKey features:\n- Fully managed service, integrated with the Google Cloud console.\n- Migrate data between on-premises and Google Cloud.\n- Provision volumes from 1 to 100 TiB in seconds.\n- Multiprotocol support (you can create an NFS or SMB volume).\n- Protect data with automated, efficient snapshots.\n- Enable business continuity with asynchronous volume replication across cloud regions.\n- Long-term data protection with integrated backup to Cloud Storage.\n- High availability with zone-redundant volumes with options for in-zone, multi-zone, and multi-region redundancy, backed by the [Service Level Agreement for Cloud Volumes Service for GCP (PDF)](https://www.netapp.com/pdf.html?item=/media/14113-servicelevelagreementcloudvolumesservicesgcp.pdf) .\n- Accelerate app development with rapid cloning.\n- Use cloud services such as analytics, artificial intelligence, and machine learning.\nFor more information about key features, see [Release notes](/architecture/partners/netapp-cloud-volumes/release-notes) .\nCloud Volumes Service is integrated with the Google Cloud console and is available through [Google Cloud Marketplace](https://www.netapp.com/us/cloud-marketplace/google-cloud-platform.aspx?ref_source=redir-googlecloud) .\nThis solution lets you quickly build and deploy both Windows-based and UNIX-based apps. You can schedule snapshots of your Cloud Volumes Service and restore snapshots to help keep your data protected. You can also use snapshots to quickly create copies of your volumes with existing datasets and iterate testing, from development to staging, and then to production", "content": ".", "guide": "Cloud Architecture Center"}