{"title": "Cloud Architecture Center - Define the scope of your migration to Redis Enterprise Cloud", "url": "https://cloud.google.com/architecture/reference-patterns/overview", "abstract": "# Cloud Architecture Center - Define the scope of your migration to Redis Enterprise Cloud\nLast reviewed 2024-01-29 UTC\nThis document describes how you define the scope of your migration to deploy [RIOT Live Migration to migrate to Redis Enterprise Cloud](/architecture/riot-live-migration-redis-enterprise-cloud) in a production environment. Database architects, DevOps and SRE teams, or Network administrators can use this architecture to offer near-zero downtime migrations to their teams. This document assumes that you're familiar with using the Google Cloud CLI and Compute Engine.\nTo define the scope of your migration, you complete the following steps:\n- Assess the source environment.\n- Build an inventory of your source instances.\n- Identify and document the migration scope and affordable downtime.\n- Assess your deployment and administration process.", "content": "## Assess the source environment\nTo assess your source environment, you determine the requirements and dependencies of the resources that you want to migrate from Redis OSS, AWS ElastiCache, and Azure Cache for Redis to a fully-managed Redis Enterprise Cloud instance in Google Cloud.\nThe assessment phase consists of the following tasks:\n- Build a comprehensive inventory of Redis-compatible workloads.\n- Perform data sizing and Redis Cluster sizing:- If you're using AWS ElastiCache, you can extract your database metrics by using the Redis tool [ECstats](https://github.com/Redislabs-Solution-Architects/ecstats2) .\n- If you're using Azure Cache for Redis, you can extract raw usage data for your Redis instances by using the [acrp2acre](https://github.com/Redislabs-Solution-Architects/acrp2acre) tool.\n- Review networking requirements such as [VPC peering](https://docs.redis.com/latest/rc/security/vpc-peering/) or [Private service connect](https://docs.redis.com/latest/rc/security/private-service-connect/) .\n- Calculate the total cost of ownership (TCO) of the target environment by visiting the [Redis Enterprise Cloud Pricing page](https://redis.com/cloud/pricing/) .\n- Decide on the order and priority of the workloads that you want to migrate. Create different [subscriptions](https://docs.redis.com/latest/rc/subscriptions/#flexible-plans) to consolidate databases with similar purposes such as development or test, staging, and production.## Build an inventory of your source instances\nTo define the scope of your migration, you create an inventory of your source instances from Redis OSS, AWS ElastiCache, and Azure Cache for Redis. The goal of this step is to collect information about each database, such as memory limit, IOPS, and durability requirements.\n- Generic properties at the [subscription level](https://docs.redis.com/latest/rc/subscriptions/#flexible-plans) :- The region of your subscription\n- Active-Active geo distribution\n- Auto-tiering (receive lower total cost of ownership if memory limit is over 250GB or more)\n- Configurations for each database:- Memory limit and throughput (operations per second)\n- High availability\n- Durability requirements\n- [Advanced capabilities](https://docs.redis.com/latest/rc/databases/create-database/#flexible-and-annual-module-options) such as search, JSON, time series, and probabilistic for each database\n- Connection information including port, user, and other [security options](https://docs.redis.com/latest/rc/databases/create-database/#security-section) \n- Requirements and constraints:- Recovery point objective (RPO) and recovery time objective (RTO)\n- Service level agreements (SLAs)\n- Regulatory and compliance requirements (see the [Redis Customer Trust Center](https://redis.com/company/compliance-and-privacy/) )\n- Authentication and security requirements\n## Identify and document the migration scope and affordable downtime\nTo have a successful migration, you need to have a migration scope in place. To scope your migration, you document essential information that influences your migration strategy and tooling. By this stage of the assessment, you can answer the following questions:\n- Are your databases larger than 250GB? If so, you will receive a lower total cost of ownership if [auto-tiering](https://docs.redis.com/latest/rs/databases/auto-tiering/) is enabled.\n- Where are the databases located (regions and zones) and what is their proximity to applications?\n- How often does the data change?\nMany components of this effort are already described in the preceding section \"Build an inventory of your source instances.\" However, there are other aspects that you need to consider in this step, like documenting the scalability, durability, and security requirements and constraints that need to be upheld. We recommend that you review the [Redis Trust Center](https://trust.redis.com/) for industry and compliance certifications, and discuss them with your business owners and legal team if necessary.\nYou should also define a thorough migration scope. You can use the output from tools like [ECstats](https://github.com/Redislabs-Solution-Architects/ecstats2) and [acrp2acre](https://github.com/Redislabs-Solution-Architects/acrp2acre) to define the sizing requirements for your Redis Enterprise Cloud instances in Google Cloud. Review the attributes of each database instance, such as scalability, and security requirements. If the database size is greater than 250 GB, we recommend that you use auto-tiering. We also recommend that you group databases with similar characteristics and security profiles into a single [subscription](https://docs.redis.com/latest/rc/subscriptions/#flexible-plans) . Doing so will help ensure that your database migration doesn't affect your existing SLA and business operations.\n## Assess your deployment and administration process\nTo ensure that there aren't any unnecessary interruptions to your production environment, we recommend that you assess the operational and deployment processes of your database. The assessment should help you to determine how your databases need to be adapted to facilitate a successful migration.\n- Assess how you define and enforce [security policies](https://docs.redis.com/latest/rc/databases/create-database/#security-section) for your database instance to control access to your database.\n- Assess your [monitoring and alerting requirements](https://docs.redis.com/latest/rc/databases/create-database/#alerts-section) by defining notification emails sent to your account and the conditions that trigger them.\n- Collect and visualize your Redis Cloud metrics by using the Redis [Prometheus and Grafana integration](https://docs.redis.com/latest/rc/cloud-integrations/prometheus-integration/) .## What's next\n- Read [Google Cloud data migration content](/solutions/database-migration) .\n- For more in-depth documentation and best practices, review [RIOT documentation](https://developer.redis.com/riot/) .\n- For more reference architectures, diagrams, and best practices, explore the [Cloud Architecture Center](/architecture) .## Contributors\nAuthors:\n- [Saurabh Kumar](https://www.linkedin.com/in/saurabh-kumar-48556a19) | ISV Partner Engineer\n- [Gilbert Lau](https://www.linkedin.com/in/gilau) | Principal Cloud Architect, Redis\nOther contributors:\n- [Chris Mague](https://www.linkedin.com/in/chris-mague-35b1624) | Customer Engineer, Data Management\n- [Gabe Weiss](https://www.linkedin.com/in/weissgabriel) | Developer Advocacy Manager\n- [Marco Ferrari](https://www.linkedin.com/in/ferrarimark) | Cloud Solutions Architect", "guide": "Cloud Architecture Center"}