{"title": "Cloud Architecture Center - Restore a snapshot to a new volume", "url": "https://cloud.google.com/architecture/reference-patterns/overview", "abstract": "# Cloud Architecture Center - Restore a snapshot to a new volume\nLast reviewed 2023-03-14 UTC\nYou can restore a snapshot copy of a volume to a new volume.\n- In the Google Cloud console, go to the **Volumes** page. [Go to the Volumes page](https://console.cloud.google.com/netapp/cloud-volumes/volumes) \n- Click **Create** .\n- In the **Create file system** page, choose the appropriate parameters for the service type.- For the **CVS-Performance** service type, specify:- The region that contains the volume snapshots.\n- The service level for the new volume.\n- For the **CVS** service type, specify the storage pool where the volume snapshots are located. The new volume is located in that storage pool. Ensure that the pool has available space.\n- Under **Snapshot to create volume from** , select the snapshot from the list. Some snapshot types, like `snapmirror` and `cloud-snapshot` , are not supported for creating volumes.\n- **Name** : Enter a display name for the volume.\n- **Allocated capacity** : The size of the volume. Use the same size as the source volume.\n- Click **Save** to create the volume from the snapshot.\n- Go to the **Volumes** page to see the new volume.\nSome snapshot operations, including replication and backup, may be blocked until the volume restore is completed. A snapshot created for the CVS service type may take several minutes to be available before you can create a new volume.\n**Important:** If the chosen volume size is too small, volume creation fails and an error message appears indicating that the minimum volume size is required. If the volume size chosen is too big, the volume size can be reduced after volume creation.\nFor more information about creating a volume, see [Create an NFS volume](/architecture/partners/netapp-cloud-volumes/creating-nfs-volumes) .\n", "content": "## Clone a volume\nYou can use a combination of creating a snapshot and then restoring it to a new volume to create fast clones of your data. Both operations take only a few seconds, independent of the volume size. A snapshot created for the CVS service type may take several minutes to be available before you can restore it to a new volume.", "guide": "Cloud Architecture Center"}