{"title": "Cloud Architecture Center - Use Atlas Live Migration to migrate MongoDB to MongoDB Atlas", "url": "https://cloud.google.com/architecture/reference-patterns/overview", "abstract": "# Cloud Architecture Center - Use Atlas Live Migration to migrate MongoDB to MongoDB Atlas\nLast reviewed 2023-05-08 UTC\nThis document describes an architecture to migrate from a self-managed [MongoDB replica set](https://docs.mongodb.com/manual/replication/) that contains databases to a fully managed cluster in [MongoDB Atlas](https://www.mongodb.com/cloud/atlas) by using MongoDB's [Atlas Live Migration Service](https://docs.atlas.mongodb.com/import/live-import/) .\nThis document is intended for database architects, database administrators, and database engineers who are interested in a fully hosted MongoDB service, or who are responsible for migrating MongoDB databases in a MongoDB replica set to a MongoDB Atlas cluster.\n", "content": "## Architecture\nThe following diagram shows the migration architecture:\nIn the diagram, an arrow represents the data migration path from the source MongoDB replica set running on Compute Engine to the target cluster running in MongoDB Atlas on Google Cloud.\nThe deployment architecture contains the following components:\n- **Source database:** a self-managed MongoDB replica set running on three Compute Engine instances.\n- **Target database:** a fully managed MongoDB Atlas cluster.\n- **Migration service:** an Atlas Live Migration configuration to migrate data from the source to the target.\nAlthough this architecture uses a self-managed MongoDB replica set on Compute Engine instances, you can also deploy a source MongoDB replica set in an on-premises data center or another cloud environment.\n## Design alternatives\nThe following sections present potential design alternatives for this architecture.\n### Sharded MongoDB clusters\nThe architecture in this document uses a MongoDB replica set as the source. [Migrating a sharded MongoDB cluster](https://docs.atlas.mongodb.com/import/live-import-sharded/) to MongoDB Atlas isn't included in this architecture. The architectural difference between a MongoDB replica set and a sharded MongoDB cluster is explained in [Stack Exchange: Database Administrators](https://dba.stackexchange.com/questions/52632/difference-between-sharding-and-replication-on-mongodb) .\n### Atlas mongomirror utility\nThe architecture in this document uses [Atlas Live Migration](https://docs.atlas.mongodb.com/import/live-import/) , not the [Atlas mongomirror](https://docs.atlas.mongodb.com/reference/mongomirror/) utility. The `mongomirror` utility requires the installation of an agent on the source MongoDB environment and it operates at a lower level of abstraction.\n### Integration technology\nThe migration setup in this architecture is a [homogeneous migration](/architecture/database-migration-concepts-principles-part-1#heterogeneous_migration_versus_homogeneous_migration) with a copy semantics. Data isn't transformed during the migration, and no database consolidation or data resharding occurs. You can implement functionality beyond copy semantics by using integration technology such as [Striim](https://www.striim.com/) .\n## Design considerations\nThe following guidelines can help you to develop an architecture that meets your organization's requirements for reliability, cost, and performance.\n### Reliability\nThe migration in this architecture is a one-way migration from a source MongoDB replica set to a target MongoDB Atlas cluster. After you complete a cut over from the source MongoDB replica set to the target cluster, the source databases aren't kept up to date with changes to the target cluster. Therefore, if you implement this architecture in a production environment, you can't switch your applications to up-to-date source databases in a fallback. For more information on fallback processes, see [Database migration: Concepts and principles (Part 2)](/architecture/database-migration-concepts-principles-part-2) .\n### Cost optimization\nDeployment of this architecture uses the following billable components of Google Cloud:\n- [Compute Engine](/compute/all-pricing) \nTo deploy this architecture, you can't use the MongoDB Atlas free tier. The available machine types in the free tier don't support Atlas Live Migration. The minimum required machine type (M10 at the time of this writing) has an hourly service cost in MongoDB Atlas. To generate a price estimate, go to [MongoDB Atlas Pricing](https://www.mongodb.com/cloud/atlas/pricing) and review the Google Cloud pricing information. If you implement this migration in production, we recommend that you use the [regular hosted version of MongoDB Atlas](https://console.cloud.google.com/marketplace/details/mongodb/atlas-pro) .\n### Performance\nAtlas Live Migration supports a [zero-downtime database migration approach](/architecture/database-migration-concepts-principles-part-1#migration_downtime_zero_versus_minimal_versus_significant) . During the migration from the source MongoDB replica set, your applications can still access the source databases without impact. After the [initial load](/architecture/database-migration-concepts-principles-part-2#phase_1_initial_load) , Atlas Live Migration migrates changes as they occur after the migration starts.\nAfter the initial dataset is migrated, you perform the cut over from the source database to the target cluster. As part of the cutover process, you suspend write access to the source database. You then wait for Atlas Live Migration to capture the remaining changes and apply them to the target database. After the changes are applied, you can execute the cut over in Atlas Live Migration and stop the source database.\nAfter all data is migrated, Atlas Live Migration notifies you on the progress status line in the user interface. At this point, the data migration is complete and the application systems can begin accessing the target cluster as the new system of record.\n## Deployment\nTo deploy this architecture, see [Deploy Atlas Live Migration to migrate MongoDB to MongoDB Atlas](/architecture/mongodb-atlas-live-migration/deployment) .\n## What's next\n- Check out [Google Cloud data migration content](/db-migration) .\n- For more reference architectures, diagrams, and best practices, explore the [Cloud Architecture Center](/architecture) .", "guide": "Cloud Architecture Center"}