{"title": "Cloud Architecture Center - Microsoft Entra ID (formerly Azure AD) B2B user provisioning and single sign-on", "url": "https://cloud.google.com/architecture/reference-patterns/overview", "abstract": "# Cloud Architecture Center - Microsoft Entra ID (formerly Azure AD) B2B user provisioning and single sign-on\nLast reviewed 2023-02-27 UTC\nThis document shows you how you can extend [Microsoft Entra ID (formerly Azure AD) user provisioning and single sign-on](/architecture/identity/federating-gcp-with-azure-ad-configuring-provisioning-and-single-sign-on#configuring_azure_ad_for_single_sign-on) to enable single sign-on (SSO) for [Microsoft Entra ID B2B collaboration users](https://docs.microsoft.com/en-us/azure/active-directory/external-identities/add-users-administrator) .\nThe document assumes that you use Microsoft Office 365 or Microsoft Entra ID in your organization and that you've already configured [Microsoft Entra ID user provisioning and single sign-on](/architecture/identity/federating-gcp-with-azure-ad-configuring-provisioning-and-single-sign-on#configuring_azure_ad_for_single_sign-on) as in the following diagram.\nIn this diagram, users from external identity providers (IdPs) and from other Microsoft Entra ID tenants sign on to the Microsoft Entra ID tenant through B2B sign-on.\n", "content": "## Objectives\n- Extend the Microsoft Entra ID user provisioning configuration to cover Microsoft Entra B2B guest users.\n- Extend the Microsoft Entra ID SSO configuration to cover Microsoft Entra B2B guest users.\n- Configure Cloud Identity to limit session lengths for guest users.## Before you begin\nMake sure you've set up [Microsoft Entra ID user provisioning and single sign-on](/architecture/identity/federating-gcp-with-azure-ad-configuring-provisioning-and-single-sign-on#configuring_azure_ad_for_single_sign-on) .\n**Note:** This article refers to the [Google Cloud/Google Workspace Connector by Microsoft gallery app from the Microsoft Azure marketplace](https://azuremarketplace.microsoft.com/en-us/marketplace/apps/aad.googleapps) . This app is a Microsoft product and is not maintained or supported by Google.\n## Microsoft Entra B2B guest users\nMicrosoft Entra ID lets you invite external users as guests to your Microsoft Entra ID tenant. When you invite an external user, Microsoft Entra ID creates a guest user account in your tenant. These guest user accounts differ from regular Microsoft Entra ID user accounts in multiple ways:\n- Guest users don't have a password. To sign on, guest users are automatically redirected to their home tenant or to the external identity provider (IdP) that they've been invited from.\n- The user principal name (UPN) of the guest user account uses a prefix derived from the invitee's email address, combined with the tenant's initial domain—for example:`` `#EXT#@` `` `.onmicrosoft.com`.\n- If you invite a user from a different Microsoft Entra ID tenant and the user is later deleted in its home tenant, then the guest user account remains active in your Microsoft Entra ID tenant.\nThese differences affect the way you configure user provisioning and single sign-on:\n- Because `onmicrosoft.com` is a Microsoft-owned DNS domain, you cannot add `` `.onmicrosoft.com` as a secondary domain to your Cloud Identity or Google Workspace account. This caveat means that you cannot use the guest user's UPN as primary email address when provisioning the user to Cloud Identity or Google Workspace.To provision guest users to Cloud Identity or Google Workspace, you must set up a mapping that transforms the guest user's UPN into a domain used by your Cloud Identity or Google Workspace account.In this document, you set up a UPN mapping as indicated in the following table.| Unnamed: 0    | Original UPN in Microsoft Entra ID | Primary email address in Cloud Identity or Google Workspace |\n|:-------------------------|:-------------------------------------|:--------------------------------------------------------------|\n| Regular user    | alice@example.com     | alice@example.com            |\n| Microsoft Entra ID guest | charlie@altostrat.com    | charlie_altostrat.com@example.com        |\n| External guest   | user@hotmail.com      | user_hotmail.com@example.com         | **Note:** The primary email address used for guest users must use the primary domain of your Cloud Identity or Google Workspace account.\n- When a user is deleted in its home tenant, Microsoft Entra ID won't suspend the corresponding user in Cloud Identity or Google Workspace. This poses a security risk: Although any attempts to use single sign-on will fail for such a user, existing browser sessions and refresh tokens (including those used by the Google Cloud CLI) might remain active for days or weeks, allowing the user to continue accessing resources.Using the approach presented in this document, you can mitigate this risk by provisioning guest users to a dedicated organizational unit in Cloud Identity or Google Workspace, and by applying a policy that restricts the session length to 8 hours. The policy ensures that browser sessions and existing refresh tokens are invalidated at most 8 hours after the user has been deleted in its home tenant, effectively revoking all access. The user in Cloud Identity or Google Workspace stays active, however, until you delete the guest user from your Microsoft Entra ID account.## Preparing your Cloud Identity or Google Workspace account\nCreate an organizational unit in your Cloud Identity or Google Workspace account that all guest users will be provisioned to.\n- Open the [Admin Console](https://admin.google.com) and log in using the super-admin user created when you signed up for Cloud Identity or Google Workspace.\n- In the menu, go to **Directory > Organizational units** .\n- Click **Create organizational unit** and provide a name and description for the OU:- **Name of organizational unit** :`guests`\n- **Description** :`Microsoft Entra B2B guest users`\n- Click **Create** .\nApply a policy to the organizational unit that limits the session length to 8 hours. The session length not only applies to browser sessions, but also restricts the lifetime of OAuth refresh tokens.\n- In the Admin Console, go to **Security > Access and data control > Google Cloud session control** .\n- Select the organizational unit **guests** and apply the following settings:- **Reauthentication policy** : **Require reauthentication** \n- **Reauthentication frequency** : **8 hours** .This duration reflects the maximum amount of time a guest user might still be able to access Google Cloud resources after it has been suspended in Microsoft Entra ID.\n- **Reauthentication method** : **Password** .This setting ensures that users have to re-authenticate by using Microsoft Entra ID after a session has expired.\n- Click **Override** .\n**Note:** The configuration change can take up to 24 hours to take effect.\n## Configure Microsoft Entra ID provisioning\nYou are now ready to adjust your existing Microsoft Entra ID configuration to support provisioning of B2B guest users.\n- In the [Azure portal](https://portal.azure.com/) , go to **Microsoft Entra ID > Enterprise applications** .\n- Select the enterprise application **Google Cloud (Provisioning)** , which [you use for user provisioning](/architecture/identity/federating-gcp-with-azure-ad-configuring-provisioning-and-single-sign-on#create_an_enterprise_application) .\n- Click **Manage > Provisioning** .\n- Click **Edit provisioning** .\n- Under **Mappings** , click **Provision Microsoft Entra ID Users** .\n- Select the row **userPrincipalName** .\n- In the **Edit Attribute** dialog, apply the following changes:- **Mapping type** : Change from **Direct** to **Expression** .\n- **Expression** :`Replace([originalUserPrincipalName], \"#EXT#@` `` `\", , , \"@` `` `\", , )`Replace the following:- ``: the`.onmicrosoft.com`domain of your Microsoft Entra ID tenant, such as`` `.onmicrosoft.com`.\n- ``: the primary domain name used by your Cloud Identity or Google Workspace account, such as`example.org`.\n- Click **OK** .\n- Select **Add new mapping** .\n- In the **Edit Attribute** dialog, configure the following settings:- **Mapping type** : **Expression** .\n- **Expression** :`IIF(Instr(` `` `, \"#EXT#\", , )=\"0\", \"/\", \"/guests\")`\n- **Target attribute** : **OrgUnitPath** \n- Click **OK** .\n- Click **Save** .\n- Click **Yes** to confirm that saving changes will result in users and groups being resynchronized.\n- Close the **Attribute Mapping** dialog.## Configuring Microsoft Entra ID for single sign-on\nTo ensure that guest users can authenticate by using single sign-on, you now extend your existing Microsoft Entra ID configuration to enable single sign-on for guests:\n- In the Azure portal, go to **Microsoft Entra ID > Enterprise\napplications** .\n- Select the **Google Cloud** enterprise application, which [you use for single sign-on](/architecture/identity/federating-gcp-with-azure-ad-configuring-provisioning-and-single-sign-on#enterprise-application-sso) .\n- Click **Manage > Single sign-on** .\n- On the ballot screen, click the **SAML** card.\n- On the **User Attributes & Claims** card, click **Edit** .\n- Select the row labeled **Unique User Identifier (Name ID)** .\n- Select **Claim conditions** .\n- Add a conditional claim for external guests:- **User type** : **External guests** \n- **Source** : **Transformation** \n- **Transformation** : **RegexReplace()** \n- **Parameter 1** : **Attribute** \n- **Attribute** : **user.userprincipalname** \n- **Regex pattern** :`(?'username'^.*?)#EXT#@(?i).*\\.onmicrosoft\\.com$`\n- **Replacement pattern** :`{username}@` ``, replacing``with the primary domain name used by your Cloud Identity or Google Workspace account.\n- Click **Add** .\n- Add a conditional claim for Microsoft Entra ID guests from different tenants:- **User type** : **Microsoft Entra guests** \n- **Source** : **Transformation** \n- **Transformation** : **RegexReplace()** \n- **Parameter 1** : **Attribute** \n- **Attribute** : **user.localuserprincipalname** **Note:** Make sure to select **user.localuserprincipalname** instead of **user.userprincipalname** \n- **Regex pattern** : `(?'username'^.*?)#EXT#@(?i).*\\.onmicrosoft\\.com$`\n- **Replacement pattern** : `{username}@` `` , replacing `` with the primary domain name used by your Cloud Identity or Google Workspace account.\n- Click **Add** .\n- Add a conditional claim for regular Microsoft Entra ID users:- **User type** : **Members** \n- **Source** : **Attribute** \n- **Value** : **user.userprincipalname** \n- Click **Save** .## Testing single sign-on\nTo verify that the configuration works correctly, you need three test users in your Microsoft Entra ID tenant:\n- A regular Microsoft Entra ID user.\n- A Microsoft Entra ID guest user. This is a user that has been invited from a different Microsoft Entra ID tenant.\n- An external guest user. This is a user that has been invited using a non–Microsoft Entra ID email address such as a`@hotmail.com`address.\nFor each user, you perform the following test:\n- Open a new incognito browser window and go to the [https://console.cloud.google.com/](https://console.cloud.google.com/) .\n- In the Google Sign-In page that appears, enter the email address of the user as it appears in the **Primary email address in Cloud Identity orGoogle Workspace** column of the [earlier table](#upn_mapping) . Refer to that table to see how the email address in Cloud Identity or Google Workspace derives from the user principal name.You are redirected to Microsoft Entra ID where you see another sign-in prompt.\n- At the sign-in prompt, enter the UPN of the user and follow the instructions to authenticate.After successful authentication, Microsoft Entra ID redirects you back to Google Sign-In. Because this is the first time you've signed in using this user, you are asked to accept the Google Terms of Service and privacy policy.\n- If you agree to the terms, click **Accept** .You are redirected to the Google Cloud console, which asks you to confirm preferences and accept the Google Cloud Terms of Service.\n- If you agree to the terms, choose **Yes** , and then click **Agree andcontinue** .\n- Click the avatar icon, and then click **Sign out** .You are redirected to a Microsoft Entra ID page confirming that you have been successfully signed out.## What's next\n- Learn more about [federating Google Cloud with Microsoft Entra ID](/architecture/identity/federating-gcp-with-azure-active-directory) .\n- Read about [best practices for planning accounts and organizations](/architecture/identity/best-practices-for-planning) and [best practices for federating Google Cloud with an external IdP](/architecture/identity/best-practices-for-federating) .", "guide": "Cloud Architecture Center"}