{"title": "Cloud Architecture Center - Logging and monitoring on-premises resources with BindPlane", "url": "https://cloud.google.com/architecture/reference-patterns/overview", "abstract": "# Cloud Architecture Center - Logging and monitoring on-premises resources with BindPlane\n[Cloud Logging](/logging) and [Cloud Monitoring](/monitoring) provide advanced logging and monitoring services for Google Cloud. Cloud Logging and Cloud Monitoring support logging and monitoring for Google Cloud and Amazon Web Services (AWS) natively, and support logging and monitoring for hybrid and on-premises resources with [BindPlane by observIQ](https://observiq.com/solutions/bindplane-comparison/) . This solution describes the considerations and design patterns for using Logging, Monitoring, and BindPlane to provide logging and monitoring services for on-premises resources.\nThis series is intended for people in DevOps who are interested in logging or monitoring their hybrid or on-premises resources.\nUsing Logging, Monitoring, and Blue Medora can provide a powerful way to consolidate your logging and monitoring either as a part of a transition to Google Cloud or as part of a strategy to centralize logging and monitoring for your apps and infrastructure. For example, you might want to use a single tool for your logging and monitoring needs to simplify work for your DevOps and SRE teams, to reduce costs, or to standardize tooling. Or, you might want to monitor your on-premises resources through Logging and Monitoring if you've deployed Google Cloud apps and infrastructure and need to monitor both your Google Cloud and your remaining on-premises apps and infrastructure.\nThis series consists of the following two parts:\n- [Cloud Logging](/architecture/logging-on-premises-resources-with-bindplane) : Read about how Cloud Logging supports logging from on-premises resources.\n- [Cloud Monitoring](/architecture/monitoring-on-premises-resources-with-bindplane) : Read about how Cloud Monitoring supports monitoring on-premises resources", "content": ".", "guide": "Cloud Architecture Center"}