{"title": "Cloud Architecture Center - Mitigating ransomware attacks using Google Cloud", "url": "https://cloud.google.com/architecture/reference-patterns/overview", "abstract": "# Cloud Architecture Center - Mitigating ransomware attacks using Google Cloud\nLast reviewed 2021-11-15 UTC\nCode created by a third party to infiltrate your systems to hijack, encrypt, and steal data is referred to as . To help you mitigate ransomware attacks, Google Cloud provides you with controls for identifying, protecting, detecting, responding, and recovering from attacks. These controls help you accomplish the following:\n- Assess your risk.\n- Protect your business from threats.\n- Maintain continuous operations.\n- Enable rapid response and recovery.\nThis document is part of a series that is intended for security architects and administrators. It describes how Google Cloud can help your organization mitigate the effects of ransomware attacks. It also describes the ransomware attack sequence and the built-in security controls in Google products that help you to prevent ransomware attacks.\nThe series has the following parts:\n- Mitigating ransomware attacks using Google Cloud (this document)\n- [Best practices for mitigating ransomware attacks using Google Cloud](/architecture/bps-for-mitigating-ransomware-attacks) ", "content": "## Ransomware attack sequence\nRansomware attacks can start as mass campaigns looking for potential vulnerabilities or as directed campaigns. A directed campaign starts with identification and reconnaissance, where an attacker determines which organizations are vulnerable and what attack vector to use.\nThere are many ransomware attack vectors. The most common are phishing emails with malicious URLs or exploiting an exposed software vulnerability. This software vulnerability can be in the software that your organization uses, or a vulnerability that exists in your software supply chain. Ransomware attackers target organizations, their supply chain, and their customers.\nWhen the initial attack is successful, the ransomware installs itself and contacts the command and control server to retrieve the encryption keys. As ransomware spreads throughout the network, it can infect resources, encrypt data using the keys that it retrieved, and exfiltrate data. Attackers demand a ransom, typically in cryptocoins, from the organization so that they can get the decryption key.\nThe following diagram summarizes the typical ransomware attack sequence explained in the previous paragraphs, from identification and reconnaissance to data exfiltration and ransom demand.\nRansomware is often difficult to detect. According to [Sophos](https://www.sophos.com/) , it takes [about 11 days](https://news.sophos.com/en-us/2021/05/18/the-active-adversary-playbook-2021/) for an organization to discover a ransomware attack, while [FireEye](https://www.fireeye.com/) reports an [average time of 24 days](https://content.fireeye.com/m-trends/rpt-m-trends-2021) . It's critical, therefore, that you put in place prevention, monitoring, and detection capabilities, and that your organization is ready to respond swiftly when someone discovers an attack.\n## Security and resiliency controls in Google Cloud\nGoogle Cloud includes built-in security and resiliency controls to help protect customers against ransomware attacks. These controls include the following:\n- Global infrastructure designed with security throughout the information-processing lifecycle.\n- Built-in security features for Google Cloud products and services, such as monitoring, threat detection, data loss prevention, and access controls.\n- High availability with regional clusters and global load balancers.\n- Built-in backup, with easily scalable services.\n- Automation capabilities using Infrastructure as Code and configuration guardrails.\n[Google Cloud Threat Intelligence for Chronicle](https://chronicle.security/products/uppercase/) and [VirusTotal](https://support.virustotal.com/hc/en-us/categories/360000162878-Documentation) track and respond to many types of malware, including ransomware, across Google infrastructure and products. Google Cloud Threat Intelligence for Chronicle is a team of threat researchers that develop threat intelligence for [Chronicle](/chronicle/docs/overview) . VirusTotal is a malware database and visualization solution that provides you with a better understanding of how malware operates within your enterprise.\nFor more information about built-in security controls, see the [Google security paper](/security/overview/whitepaper) and [Google Infrastructure Security Design Overview](/security/infrastructure/design) .\n## Security and resiliency controls in Google Workspace, Chrome browser, and Chromebooks\nIn addition to the controls within Google Cloud, other Google products like Google Workspace, Google Chrome browser, and [Chromebooks](https://www.google.com/chromebook/dr/shop/) include security controls that can help protect your organization against ransomware attacks. For example, Google products provide security controls that allow remote workers to access resources from anywhere, based on their identity and context (such as location or IP address).\nAs described in the [Ransomware attack sequence](#ransomware-attack-sequence) section, email is a key vector for many ransomware attacks. It can be exploited to phish credentials for fraudulent network access and to distribute ransomware binaries directly. [Advanced phishing and malware protection](https://support.google.com/a/answer/9157861) in Gmail provides controls to quarantine emails, defends against dangerous attachment types, and helps protect users from inbound spoofing emails. [Security Sandbox](https://support.google.com/a/answer/7676854?ref_topic=9974692) is designed to detect the presence of previously unknown malware in attachments.\nChrome browser includes [Google Safe Browsing](https://safebrowsing.google.com/) , which is designed to provide warnings to users when they attempt to access an infected or malicious site. [Sandboxes](https://privacysandbox.com/) and [site isolation](http://www.chromium.org/Home/chromium-security/site-isolation) help protect against the spread of malicious code within different processes on the same tab. [Password protection](https://support.google.com/chrome/answer/10311524#zippy=%2Chow-password-protection-works) is designed to provide alerts when a corporate password is being used on a personal account, and checks whether any of the user's saved passwords have been compromised in an online breach. In this scenario, the browser prompts the user to change their password.\nThe following [Chromebook features](http://chromeenterprise.google/security) help to protect against phishing and ransomware attacks:\n- Read-only operating system ( [Chrome OS](https://chromeenterprise.google/intl/en_ca/os/security/) ). This system is designed to update constantly and invisibly. Chrome OS helps protect against the most recent vulnerabilities and includes controls that ensure that applications and extensions can't modify it.\n- [Sandboxing](https://support.google.com/chromebook/answer/3438631) . Each application runs in an isolated environment, so one harmful application can't easily infect other applications.\n- Verified boot. While the Chromebook is booting, it is designed to check that the system hasn't been modified.\n- [Safe Browsing](https://www.google.com/chrome/privacy/whitepaper.html#malware) . Chrome periodically downloads the most recent Safe Browsing list of unsafe sites. It is designed to check the URLs of each site that a user visits and checks each file that a user downloads against this list.\n- [Titan C security chips](https://chromeenterprise.google/intl/en_ca/os/security/) . These chips help protect users from phishing attacks by enabling two-factor authentication and they protect the operating system from malicious tampering.\nTo help reduce your organization's attack surface, consider Chromebooks for users who work primarily in a browser.\n## What's next\n- Implement [best practices for mitigating ransomware attacks](/architecture/bps-for-mitigating-ransomware-attacks) (next document).\n- See [5 pillars of protection to prevent ransomware attacks](/blog/products/identity-security/5-pillars-of-protection-to-prevent-ransomware-attacks) for prevention and response techniques to ransomware attacks.\n- Read more about zero trust solutions in [Devices and zero trust](/blog/topics/developers-practitioners/devices-and-zero-trust) .\n- Help ensure continuity and protect your business against adverse cyber events using the [Security and resilience framework](/solutions/security-and-resilience) .", "guide": "Cloud Architecture Center"}