{"title": "Cloud Architecture Center - Private services access", "url": "https://cloud.google.com/architecture/reference-patterns/overview", "abstract": "# Cloud Architecture Center - Private services access\nLast reviewed 2023-06-08 UTC\nCloud Volumes Service uses [private services access](/vpc/docs/private-services-access) to create a high-throughput and low-latency data path connection. You need to perform the following steps once for each project. However, if you are using a shared VPC, you only need to perform these steps on the host project. You can only peer VPC networks that use [RFC 1918](https://tools.ietf.org/html/rfc1918) address ranges as [internal addresses](/vpc/docs/ip-addresses#internal-ip-address) .\nYou need to perform the following steps based on the service type—CVS or CVS-Performance—that you deploy for your project. For example, if you deploy a volume that uses the CVS service type, use the commands for the CVS service type to perform the steps. If, later, you deploy a volume that uses the CVS-Performance service type, you need to perform the steps again and use commands for the CVS-Performance service type.\nThe steps and examples in this section assume that you are deploying a volume of each service type and that you use a separate VPC network for each service type.\nWhen you create a volume with a VPC network that hasn't yet been peered, a dialog appears with a message stating, **View commands how to set up network peering** , indicating that you need to set up network peering. The example commands that are shown when you click the button in that dialog give the minimum CIDR block size, but you might need to increase it to allow for growth in usage.\nIf you plan to peer your consumer project with other producer organizations in addition to NetApp, you must use a different IP address allocation for each of those producers. This precaution is necessary because Cloud Volumes Service uses dynamic routes with your consumer project, but Google Cloud does not check whether your dynamic route allocations overlap. Because these routes are not visible to the other participating producers, multiple producers could inadvertently use an allocation from the same range, causing IP collisions and routing issues.\n**Important:** If you plan to use CVS or CVS-Performance volumes from on-premises networks through a VPN or Cloud Interconnect, choose a CIDR range that doesn't overlap with the CIDR ranges used in your on-premises network. Failing to take this precaution can cause IP address collisions and routing issues. If you use the **Use Custom Address Range** control to specify a custom CIDR range, you must do so before running the `gcloud compute addresses create` command; using this control after running the command has no effect.\n", "content": "## Set up private service access\n- Create an allocated IP address range within your VPC network for the Cloud Volumes Service mount points.You can't modify the IP address range after you establish it and allocate it to a volume, so we recommend allocating a range that is large enough to accommodate future usage. However, if the IP address range allocation is too small, you can [add additional CIDR ranges](#adding_cidr_ranges) .- For the CVS-Performance service type, the minimum CIDR range you can use is `/24` , which allows you to provision up to 16 region-service project combinations when each range is `/28` . If you require more regions, service projects, or both, choose a CIDR that can accommodate more `/28` subnets.\n- The CVS service type ( `Standard-SW` ) needs a minimum CIDR block of `/25` (128 addresses). This supports up to 100 storage pools with up to 50 volumes each per region in your project. A larger block can support more region and project pairs. Cross-region access isn't supported.\n- [Shared VPC](/vpc/docs/shared-vpc) is supported for the CVS and CVS-Performance service types. For shared VPC networks, peering is done from the host project only. Each service project in an additional region uses an additional CIDR block ( `/28` for the CVS-Performance service type and `/25` for the CVS service type) from the VPC range.\nThe following example assumes deployment of volumes of the CVS-Performance service type:| CIDR range | Number of region and project pairs supported | Example region to project pairs                                                             |\n|:-------------|-----------------------------------------------:|:--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| /28   |            1 | Region1:Project1                                                                |\n| /27   |            2 | Region1:Project1 Region2:Project1                                                            |\n| /26   |            4 | Region1:Project1 Region2:Project1 Region3:Project1 Region1:Project2                                                    |\n| /25   |            8 | Region1:Project1 Region2:Project1 Region1:Project2 Region2:Project2 Region1:Project3 Region2:Project3 Region1:Project4 Region2:Project4                                   |\n| /24   |            16 | Region1:Project1 Region1:Project2 Region1:Project3 Region1:Project4 Region2:Project1 Region2:Project2 Region2:Project3 Region2:Project4 Region3:Project1 Region3:Project2 Region3:Project3 Region3:Project4 Region4:Project1 Region4:Project2 Region4:Project3 Region4:Project4 |The following example assumes that a VPC network already exists in the project:```\ngcloud \\    --project=my-cvs-prj compute addresses create netapp-addresses-production-vpc1 \\    --global \\    --purpose=VPC_PEERING \\    --prefix-length=20 \\    --network=production-vpc1 \\    --no-user-output-enabled\n```When you use this command, Google Cloud picks an RFC 1918 CIDR base for you. If you need to control the CIDR base, use the following syntax:```\ngcloud \\  --project=my-cvs-prj compute addresses create netapp-addresses-production-vpc1 \\  --global \\  --addresses 192.168.0.0 \\  --purpose=VPC_PEERING \\  --prefix-length=20 \\  --network=production-vpc1 \\  --no-user-output-enabled\n```If you specify non-RFC 1918 addresses, follow the instructions in [Use non-RFC 1918 IP addresses](#using_non-rfc_1918_ip_addresses) .\n- Create a private service connection to the Cloud Volumes Service endpoint.CVS service type example:```\ngcloud \\    --project=my-cvs-prj services vpc-peerings connect \\    --service=cloudvolumesgcp-sds-api-network.netapp.com \\    --ranges=netapp-addresses-production-vpc1 \\    --network=production-vpc1\n```CVS-Performance service type example:```\ngcloud \\    --project=my-cvs-prj services vpc-peerings connect \\    --service=cloudvolumesgcp-api-network.netapp.com \\    --ranges=netapp-addresses-production-vpc1 \\    --network=production-vpc1\n``` **Important:** If peering fails and you receive the error `\"Constraint constraints/compute.restrictVpcPeering violated for project…\"` , then your Google Cloud organization policies restrict peering. Work with your organization administrators to get an exception.\n- Enable custom route propagation:CVS service type example:```\ngcloud \\    --project=my-cvs-prj compute networks peerings update netapp-sds-nw-customer-peer \\    --network=production-vpc1 \\    --import-custom-routes \\    --export-custom-routes\n```CVS-Performance service type example:```\ngcloud \\    --project=my-cvs-prj compute networks peerings update netapp-cv-nw-customer-peer \\    --network=production-vpc1 \\    --import-custom-routes \\    --export-custom-routes\n```\n- Check that the connection is established:```\ngcloud \\    --project=my-cvs-prj services vpc-peerings list \\    --network=production-vpc1\n```## Add CIDR ranges\nIf the initial CIDR range is too small and you run out of `/28` (CVS-Performance) or `/25` (CVS) blocks, you can add CIDR ranges to the allocation.\nWith the additional address blocks, you can use Cloud Volumes Service in additional regions or service projects.\nBefore you add a CIDR range, review the steps in [Setting up private service access](#setting_up_private_service_access) . Make sure that the additional CIDR range is large enough to accommodate future increased usage.\n- Create an additional IP allocation range.- The following example assumes that a VPC network already exists in the project:```\ngcloud \\  --project=my-cvs-prj compute addresses create netapp-addresses-production-vpc1-2 \\  --global \\  --purpose=VPC_PEERING \\  --prefix-length=20 \\  --network=production-vpc1 \\  --no-user-output-enabled\n```\nIf you need to control which CIDR base is used, add the `--addresses` `` parameter.\n- Add the new IP address allocation to the existing peering connection:- CVS service type example:```\ngcloud \\  --project=my-cvs-prj services vpc-peerings update \\  --service=cloudvolumesgcp-sds-api-network.netapp.com \\  --ranges=netapp-addresses-production-vpc1,netapp-addresses-production-vpc1-2 \\  --network=production-vpc1\n```\n- CVS-Performance service type example:```\ngcloud \\  --project=my-cvs-prj services vpc-peerings update \\  --service=cloudvolumesgcp-api-network.netapp.com \\  --ranges=netapp-addresses-production-vpc1,netapp-addresses-production-vpc1-2 \\  --network=production-vpc1\n```\n## Use non-RFC 1918 IP addresses\nYou can bring non-RFC 1918 IP addresses (non-private addresses) into the NetApp network for the CVS-Performance service type. You can create a new subnet with a new VPC network or add a new subnet to an existing VPC network. You can use non-RFC 1918 IP addresses for clients of the CVS-Performance service type, but not for the storage IP addresses.\n### Create a new subnet with a new VPC network\n- [Create a new VPC network](/vpc/docs/create-modify-vpc-networks#creating_networks) and a new subnet with the non-RFC 1918 IP address range.\n- In Cloud Volumes Service, create a volume in the new VPC network. Select the newly created VPC network name in which the volume is accessible.\n- To set up a peer network to create the volume, click the **View commands how to set up network peering** button, and run the given commands.\n- Enable the peer on your platform to accept incoming and outgoing public routes:```\ngcloud \\    --project=cloud-heroes compute networks peerings update netapp-cv-nw-customer-peer \\    --network=nonrfcdemovpc \\    --import-subnet-routes-with-public-ip \\    --export-subnet-routes-with-public-ip\n```\n- Set the export policy in the volume details with the VM instance's IP address range.You can then export the volume to the VM and run your workloads on the volume.\n### Add a new subnet in an existing VPC network\n- [Create a new subnet](/vpc/docs/create-modify-vpc-networks#add-subnets) with the non-RFC 1918 IP address range in an existing VPC network.\n- [Create a support case with NetApp](/architecture/partners/netapp-cloud-volumes/support) to enable the non-RFC 1918 IP address range.## Access Cloud Volumes from different regions or external networks\nYour project can access a volume of the CVS or CVS-Performance service type from any zone within the region in which a volume is provisioned. Furthermore, if your VPC has enabled [global dynamic routing](/network-connectivity/docs/router/concepts/overview#dynamic-routing-mode) , your project can access a CVS-Performance volume from any other Google Cloud regions.\n**Note:** Inter-region traffic adds latency (reduced performance) and cost (inter-region traffic charges).\nIf you want to access volumes of the CVS-Performance service type from an external network, like an on-premises network through a VPN or Cloud Interconnect, you need to configure a static route on the on-premises router to the CIDR range that you selected in step 1 when you [set up private service access for Cloud Volumes Service](/architecture/partners/netapp-cloud-volumes/setting-up-private-services-access#setting_up_private_service_access) . A volume of the CVS service type is only accessible from within its region.\n## What's next\n- [Manage storage pools](/architecture/partners/netapp-cloud-volumes/managing-storage-pools) (CVS service type only)\n- [Set up customer-managed encryption keys](/architecture/partners/netapp-cloud-volumes/customer-managed-keys) \n- [Create and manage NFS volumes](/architecture/partners/netapp-cloud-volumes/creating-nfs-volumes) \n- [Create and manage SMB volumes](/architecture/partners/netapp-cloud-volumes/creating-smb-volumes) \n- [Monitor cloud volumes](/architecture/partners/netapp-cloud-volumes/monitoring) \n- [Create and manage volume snapshots](/architecture/partners/netapp-cloud-volumes/creating-volume-snapshots) \n- [Revert a volume using a snapshot](/architecture/partners/netapp-cloud-volumes/revert-volume-snapshot) \n- [Back up and restore a cloud volume](/architecture/partners/netapp-cloud-volumes/back-up) \n- [FAQs about NetApp Cloud Volumes Service for Google Cloud](/architecture/partners/netapp-cloud-volumes/faqs-netapp) \n- Explore reference architectures, diagrams, and best practices about Google Cloud. Take a look at our [Cloud Architecture Center](/architecture) .", "guide": "Cloud Architecture Center"}