{"title": "Cloud Architecture Center - Manage Cloud Volumes Service for Google Cloud with Terraform", "url": "https://cloud.google.com/architecture/reference-patterns/overview", "abstract": "# Cloud Architecture Center - Manage Cloud Volumes Service for Google Cloud with Terraform\nLast reviewed 2023-02-24 UTC\n[Terraform](https://www.terraform.io/intro/index.html) is an open source tool for building, changing, and versioning infrastructure. You can use Terraform to automate the management of Cloud Volumes Service for Google Cloud.\n", "content": "## Use cases\nUsing Terraform with Cloud Volumes Service for Google Cloud provides the following benefits:\n- Manage cloud volume resources like infrastructure as code (IaC). Terraform can efficiently build and version infrastructure changes for your cloud volume resources.\n- View execution plans to assist resource planning. Terraform includes a planning step called the. The execution plan shows what Terraform does when you execute the call. This capability helps you reduce unexpected outcomes in managing resources.\n- View resource graphs. Terraform builds a graph of all your cloud volume resources. It creates and modifies non-dependent resources in parallel. This capability lets you effectively manage resources. It also gives you insight into resource dependencies.\n- Minimize manual intervention and human errors by automating changes.## Use Terraform with Cloud Volumes Service\nFor information about deploying the Terraform provider for Cloud Volumes Service for Google Cloud, see the documentation on the [Terraform NetApp registry page](https://registry.terraform.io/providers/NetApp/netapp-gcp/latest/docs) .\nYou can also get the Terraform provider source for Cloud Volumes Service for Google Cloud from the [NetApp GitHub repository](https://github.com/NetApp/terraform-provider-netapp-gcp) . This repository contains many [source code examples](https://github.com/NetApp/terraform-provider-netapp-gcp/tree/master/examples/gcp) .", "guide": "Cloud Architecture Center"}