{"title": "Cloud Architecture Center - Create and manage SMB volumes", "url": "https://cloud.google.com/architecture/reference-patterns/overview", "abstract": "# Cloud Architecture Center - Create and manage SMB volumes\nLast reviewed 2023-04-05 UTC\nBefore you can create and manage SMB volumes, you must review [security considerations regarding SMB access](/architecture/partners/netapp-cloud-volumes/security-considerations) . You must also add an Active Directory (AD) connection. Cloud Volumes Service supports one AD connection for each service type in a Google Cloud region. For more information, see [Manage Active Directory connections](/architecture/partners/netapp-cloud-volumes/managing-active-directory-connections) .\nThe following diagram shows how Cloud Volumes Service works with Windows applications on Google Cloud:\nFor more information about SMB services provided by Cloud Volumes Service for Google Cloud, see [SMB performance FAQs](/architecture/partners/netapp-cloud-volumes/faqs-netapp#smb_performance_faqs) .\n", "content": "## Create an SMB volume\nBefore you create an SMB volume, you must complete the steps to [enable billing and APIs](/architecture/partners/netapp-cloud-volumes/before-you-begin-cloud-volumes) and create a Private Service Connection. Otherwise, the volume creation process fails.\n- In the Google Cloud console, go to the **Volumes** page. [Go to the Volumes page](https://console.cloud.google.com/netapp/cloud-volumes/volumes) \n- Click **Create** .\n- On the **Create File System** page, specify the name and options for your volume as indicated in the following table.Required fields are marked with an asterisk (*).| Field           | Description                                          | CVS | CVS-Performance |\n|:------------------------------------------------|:-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|------:|------------------:|\n| Name*           | Name displayed for the volume.                                      | nan |    nan |\n| Billing Label         | Adds a label to the volume for billing reports and queries.                              | nan |    nan |\n| Service Type*         | CVS or CVS-Performance service type. Each service type offers different service levels, and the service levels are offered in different regions. For details, see Service types. | nan |    nan |\n| Replication          | Select to create volume as a destination target for volume replication. These volumes are read-only and aren't intended for active workloads.          | nan |    nan |\n| Region*           | Google Cloud region for your volume. For more information, see Best practices for Compute Engine region selection.                | nan |    nan |\n| Zone*           | Google Cloud zone for your volume.                                     | nan |    nan |\n| Volume Path*         | The system automatically generates a recommended volume path. The name must be unique across all of your cloud volumes.               | nan |    nan |\n| Service Level*         | For the CVS service type, select the level of availability for the volume. For the CVS-Performance service type, select the level of performance for the volume.     | nan |    nan |\n| Snapshot          | Allows you to create a volume based on a snapshot.                                 | nan |    nan |\n| Allocated Capacity*        | Size of the cloud volume. The minimum size is 1,024 GiB (1 TiB).                             | nan |    nan |\n| Protocol Type*         | Select SMB.                                          | nan |    nan |\n| Make snapshot directory (~snapshot) visible  | Makes your snapshot directory visible to the client as a hidden ~snapshot directory in the root of the mapped share. Enables Previous Versions access in Windows Explorer.  | nan |    nan |\n| Enable SMB encryption       | Enables SMB encryption for in-flight SMB3 data. SMB clients using data without encryption can't access a volume that has this option enabled.         | nan |    nan |\n| Enable CA share support for SQL Server, FSLogix | Enables continuously available (CA) share support for SQL Server and FSLogix. This option is only supported for these workloads.             | nan |    nan |\n| Hide SMB Share         | Enhances security by preventing your volume and data from being viewable by untrusted sources. Makes the SMB share non-browsable.             | nan |    nan |\n| Enable access-based enumeration (ABE)   | Provides additional security so that users see only the files and folders to which they have access permissions.                 | nan |    nan |\n- In the **Network Details** section, specify the following:- **Shared VPC Configuration** : The VPC network can be part of a host project in a shared VPC network, or it can be a standalone project. If you have a host project and shared VPC topology, select **Shared VPC configuration** . For standalone projects, leave the box cleared.\n- **VPC Network Name** : Select the network from which the volume is accessible.If no VPCs appear, see the [Cloud Volumes Service FAQ for how to view VPCs in the Cloud Volumes Service user interface](/architecture/partners/netapp-cloud-volumes/faqs-netapp#i_cant_see_my_vpcs_in_the_cloud_volumes_service_user_interface_whats_wrong) . **Important:** You can only select a VPC network while creating a volume. You can't change this selection later.\n- If this is the first time that you're setting up the VPC network peering for Cloud Volumes Service, you receive the following prompt indicating that you need to set up network peering: Click the **View commands how to set up network peering** button. To configure VPC network peering, follow the steps in the dialog that appears.In the dialog, you can optionally select **Use Custom Address Range** . This option lets you, for example, specify a CIDR range that doesn’t overlap with your on-premises CIDR blocks. To allow for future flexibility, choose a larger CIDR block size (prefix range). **Important:** You can only specify a CIDR range before running the commands to set up network peering. You can not customize a CIDR range after you [set up private services access](/architecture/partners/netapp-cloud-volumes/setting-up-private-services-access) .\n- To manage the snapshot policy for the volume, select the following settings:- Expand **Show snapshot policy** .\n- Select **Allow automatic snapshots** .\n- Specify the snapshot schedules.\n- specify the number of snapshots to keep.\nFor details, see [Create or modify a snapshot policy](/architecture/partners/netapp-cloud-volumes/creating-volume-snapshots#create_or_modify_a_snapshot_policy) . \n- Click **Save** to create the volume. **Note:** Creating the first volume in a project can take up to five minutes because the resources required for volume are being provisioned for the first time. During this time, the volume shows in the creating state.The new volume appears in the **Volumes** list.## Map SMB shares from Compute Engine instances\nUse the following instructions to map SMB shares from Compute Engine instances:\n- In the Google Cloud console, go to the **Volumes** page. [Go to the Volumes page](https://console.cloud.google.com/netapp/cloud-volumes/volumes) \n- Click the SMB volume for which you want to map an SMB share.\n- Click **More** . , and then click **Mount Instructions** .\n- Follow the instructions in the **Mount Instructions for SMB** window that appears. \nIf you need help resolving the server name in the share path (UNC path) to an IP address, see [Why can't my client resolve the SMB NetBIOS name](/architecture/partners/netapp-cloud-volumes/faqs-netapp#why_cant_my_client_resolve_the_smb_netbios_name) .\n**Note:** Although you can mount SMB volumes on a Linux client, the support for troubleshooting issues for this setup is on a best-effort basis.\n## What's next\n- [Monitor cloud volumes](/architecture/partners/netapp-cloud-volumes/monitoring) \n- [Create and manage volume snapshots](/architecture/partners/netapp-cloud-volumes/creating-volume-snapshots) \n- [Revert a volume using a snapshot](/architecture/partners/netapp-cloud-volumes/revert-volume-snapshot) \n- [Back up and restore a cloud volume](/architecture/partners/netapp-cloud-volumes/back-up) \n- [Security considerations](/architecture/partners/netapp-cloud-volumes/security-considerations) \n- [FAQs about NetApp Cloud Volumes Service for Google Cloud](/architecture/partners/netapp-cloud-volumes/faqs-netapp) \n- [Resource limits and quotas](/architecture/partners/netapp-cloud-volumes/resource-limits-quotas)", "guide": "Cloud Architecture Center"}