{"title": "Cloud Architecture Center - Microsoft My Apps portal integration", "url": "https://cloud.google.com/architecture/reference-patterns/overview", "abstract": "# Cloud Architecture Center - Microsoft My Apps portal integration\nLast reviewed 2023-02-27 UTC\nRefresh_date: 2023-03-01\nThis document shows how to add Google services and Identity-Aware Proxy (IAP) web-secured web applications to the Microsoft My Apps portal and how to enable automatic sign-on for these applications.\nThe document assumes that you have federated your Cloud Identity or Google Workspace account with Microsoft Entra ID by [configuring Microsoft Entra ID for single sign-on](/architecture/identity/federating-gcp-with-azure-ad-configuring-provisioning-and-single-sign-on#configuring_azure_ad_for_single_sign-on) .\n", "content": "## Before you begin\nMake sure you've completed the steps to [federate your Cloud Identity or Google Workspace account with Microsoft Entra ID](/architecture/identity/federating-gcp-with-azure-ad-configuring-provisioning-and-single-sign-on#configuring_azure_ad_for_single_sign-on) .\n## Initiating single sign-on from a portal\nTo support authenticating with an external identity provider (IdP) like Azure AD, Cloud Identity and Google Workspace rely on service provider–initiated sign-on. With this type of sign-on, authentication starts at the service provider, which then redirects you to the IdP—for example:\n- You access a Google service such as the [Google Cloud console](https://console.cloud.google.com/) or [Looker Studio](https://lookerstudio.google.com) by opening a URL or bookmark. Google and its services take the role as the service provider in this scenario.\n- The Google Sign-in screen appears, prompting you to enter the email address of your Google identity.\n- You're redirected to Microsoft Entra ID, which serves as the IdP.\n- You sign in to Microsoft Entra ID.\n- Microsoft Entra ID redirects you back to the Google service that you originally attempted to access.\nA benefit of service provider–initiated sign-on is that users can directly access Google services by opening a link or using a bookmark. If your organization uses Microsoft Entra ID, then you can use the Microsoft My Apps portal for this purpose. Not being forced to open applications through a portal is convenient for power users who bookmark specific sites or might memorize certain URLs. For other users, it can still be valuable to surface the links to relevant applications in a portal.\nHowever, adding a link such as [https://lookerstudio.google.com](https://lookerstudio.google.com) to the Microsoft My Apps portal reveals a shortcoming of the service provider–initiated sign-on process. Although a user that clicks the link in the portal has a valid Microsoft Entra ID session, they might still see the Google Sign-in screen and are prompted to enter their email address. This seemingly redundant sign-in prompt is a result of Google Sign-In not being made aware of the existing Microsoft Entra ID session.\nYou can avoid the additional Google Sign-in prompt by using special URLs when configuring the Microsoft My Apps portal. These URLs embed a hint about which Cloud Identity or Google Workspace account users are expected to use. The extra information enables authentication to be performed silently, resulting in an improved user experience.\n## Adding links to the Microsoft My Apps portal\nThe following table lists common Google services, the corresponding name in Microsoft Entra ID, and the link that you can use to implement SSO as outlined in the previous section.\n| Google service | URL                     | Logo |\n|:-----------------|:--------------------------------------------------------------------------------------|-------:|\n| Google Docs  | https://docs.google.com/a/DOMAIN              | nan |\n| Google Sheets | https://www.google.com/a/DOMAIN/ServiceLogin?continue=https://sheets.google.com  | nan |\n| Google Sites  | https://www.google.com/a/DOMAIN/ServiceLogin?continue=https://slides.google.com  | nan |\n| Google Drive  | https://drive.google.com/a/DOMAIN              | nan |\n| Gmail   | https://mail.google.com/a/DOMAIN              | nan |\n| Google Groups | https://www.google.com/a/DOMAIN/ServiceLogin?continue=https://groups.google.com  | nan |\n| Google Keep  | https://www.google.com/a/DOMAIN/ServiceLogin?continue=https://keep.google.com   | nan |\n| Looker Studio | https://www.google.com/a/DOMAIN/ServiceLogin?continue=https://lookerstudio.google.com | nan |\nFor each Google service that you want to add to the Microsoft My Apps portal, create a new enterprise application:\n- In the [Azure portal](https://portal.azure.com/) , go to **Microsoft Entra ID** > **Enterprise applications** .\n- Click **New application** .\n- Click **Create your own application** and enter the following:- **What's the name of your app** : Enter the name of the Google service as indicated in the preceding table.\n- **What are you looking to do with your application** : Select **Integrate any other application you don't find in the gallery (Non-gallery)** .\n- Click **Create** .\n- Select **Properties** .\n- Change the logo to the file linked in the table.\n- Click **Save** .\n- In the menu on the left, select **Single sign-on** .\n- Select **Linked** .\n- Enter the URL listed in the table—for example, `http://docs.google.com/a/` `` .Replace `` with the primary domain name of your Cloud Identity or Google Workspace account such as `example.com` .\n- Click **Save** .\nNotice that you don't have to configure SAML-based SSO in the application. All single sign-on operations continue to be handled by [the application that you previously created for single sign-on.](/architecture/identity/federating-gcp-with-azure-ad-configuring-provisioning-and-single-sign-on#configuring_azure_ad_for_single_sign-on)\nTo assign the application to users, do the following:\n- In the menu on the left, select **Properties** .\n- Set **User assignment required** to **Yes** .\n- Click **Save** .\n- In the menu on the left, click **Manage > Users and groups** .\n- Click **Add user** .\n- Select **Users** .\n- Select the users or groups that you want to provision. If you select a group, all members of the group are provisioned.\n- Click **Select** .\n- Click **Assign** .\nIt might take several minutes for a link to show up in the My Apps portal.\n### Controlling access\nAssigning users and groups to individual applications in Microsoft Entra ID controls the visibility of the link, but it doesn't control access to a service. A service that isn't visible on a user's My Apps portal might still be accessible if the user opens the right URL. To control which users and groups are allowed to access a service, you must also [turn the service on or off](https://support.google.com/a/answer/182442?hl=en) in the Google [Admin Console](http://admin.google.com/) .\nYou can simplify the process of controlling visibility and access by using groups:\n- For each Google service, create a security group in Microsoft Entra ID—for example,`Looker Studio users`and`Google Drive users`.\n- Assign the groups to the appropriate Microsoft Entra ID enterprise application as outlined in the previous section. For example, assign`Looker Studio users`to the **Looker Studio** application and`Google Drive users`to the **Google Drive** application.\n- [Configure the groups to be provisioned](/architecture/identity/federating-gcp-with-azure-ad-configuring-provisioning-and-single-sign-on#configure_group_provisioning) to your Cloud Identity or Google Workspace account.\n- In the [Admin Console](http://admin.google.com/) , [turn on the respective service for each group](https://support.google.com/a/answer/9050643#top&step4&step5&step6) . For example, turn on **Looker Studio** for the`Looker Studio users`group and **Google Drive** for the`Google Drive users`group. Turn the service off for everybody else.\nBy adding and removing members to these groups, you now control both access and visibility in a single step.\n## IAP-protected web applications\nIf you're using [Identity-Aware Proxy (IAP)](/iap) to protect your web applications, you can add links to these applications to the Microsoft My Apps portal and enable a single sign-on experience for them.\n### Adding links to the Microsoft My Apps portal\nThe process for adding a link to the Microsoft My Apps portal is the same as for [Google services](#adding_links) , but you must use the URL of your IAP-protected web application.\nAs you can with Google services, you can prevent users from seeing a Google sign-in screen after following a link to a IAP-protected web application in the portal, but the process is different. Instead of using a special URL, you configure IAP to [always use a specific Cloud Identity or Google Workspace account for authentication](/iap/docs/customizing#authenticating_using_a_domain) :\n- In the Google Cloud console, activate Cloud Shell. [Activate Cloud Shell](https://console.cloud.google.com/?cloudshell=true) \n- Initialize an environment variable:`PRIMARY_DOMAIN=` ``Replace `` with the [primary domain](https://support.google.com/a/answer/182080?hl=en) of your Cloud Identity or Google Workspace account—for example, `example.com` .\n- Create a temporary settings file that instructs IAP to always use the primary domain of your Cloud Identity or Google Workspace account for authentication:```\ncat << EOF > iap-settings.yaml\naccessSettings:\n oauthSettings:\n loginHint: \"$PRIMARY_DOMAIN\"\nEOF\n```\n- Apply the setting to all IAP web resources in the project:```\ngcloud iap settings set iap-settings.yaml --resource-type=iap_web\n```\n- Remove the temporary settings file:```\nrm iap-settings.yaml\n```\n**Note:** Configuring IAP to always use the primary domain of your Cloud Identity or Google Workspace account for authentication might prevent users from other Cloud Identity or Google Workspace accounts from being able to access the application.\n### Controlling access\nAssigning users and groups to individual applications in Microsoft Entra ID controls the visibility of the link to your IAP-protected web application, but does not control access to the application. To control access, you also have to [customize the IAM policy](/iap/docs/managing-access#managing_access_console) of the IAP-protected web application.\nAs with Google services, you can simplify the process of controlling visibility and access by using groups:\n- For each application, create a security group in Microsoft Entra ID—for example,`Payroll application users`.\n- Assign the group to the respective Microsoft Entra ID enterprise application.\n- [Configure the group to be provisioned](/architecture/identity/federating-gcp-with-azure-ad-configuring-provisioning-and-single-sign-on#configure_group_provisioning) to your Cloud Identity or Google Workspace account.\n- [Update the IAM policy](/iap/docs/managing-access#managing_access_console) of the IAP-protected web application to grant the **IAP-Secured Web App User** role to the`Payroll application users`group while disallowing access for other users\nBy adding and removing members to the `Payroll application users` group, you control both access and visibility in a single step.\n## What's next\n- Learn more about [federating Google Cloud with Microsoft Entra ID](/architecture/identity/federating-gcp-with-azure-active-directory) .\n- Read about [best practices for planning accounts and organizations](/architecture/identity/best-practices-for-planning) and [best practices for federating Google Cloud with an external IdP](/architecture/identity/best-practices-for-federating) .\n- Read more about [Identity-Aware Proxy](/iap/docs) .", "guide": "Cloud Architecture Center"}