{"title": "Cloud Architecture Center - Example announcement", "url": "https://cloud.google.com/architecture/reference-patterns/overview", "abstract": "# Cloud Architecture Center - Example announcement\nLast reviewed 2023-02-27 UTC\nThis document contains an example email that you can customize and use to send an announcement to users whose consumer accounts [you plan to migrate to managed accounts](/architecture/identity/assessing-existing-user-accounts) .\nMigrating consumer accounts to managed accounts requires the consent of affected users. A migration might also affect these users personally if they have previously used these accounts for private purposes.\nTo make sure that users have time to prepare for a migration and are well-informed about the reasons behind a migration, it's important to announce the migration to them in advance.\n", "content": "## Example announcement email\n**Subject:** Upcoming transfer of your Google user account\nAt Example Organization, we use a number of Google services to operate our business, including Google Cloud, Google Marketing Platform, and others. We have noticed that you currently access these services using Google user accounts that you have signed up for by yourself.\nStarting on **March 1** , Example Organization IT will centralize the management of all Google user accounts that use `example.org` email addresses.\n**What you need to know**\n- This migration only affects your`` `@example.com`user account. Other Google user accounts, including any private Gmail accounts that you might use, are not affected.\n- When the migration is complete, your`example.com`user account will be managed by Example Organization IT and will be subject to the Example Organization [``].\n- The email address of your Google user account will stay the same and all your data and settings will be retained.\n- After your user account has been migrated, you must use your corporate credentials for future sign-ins.\n**How to prepare for the migration**\nIf you have been using your `example.com` Google user account for private purposes, do the following:\n- Go to [Google TakeOut](https://takeout.google.com/settings/takeout) .\n- Verify that you're signed in with your`example.com`user account. If you're signed in with a different user account, [switch to your example.com user account](https://support.google.com/docs/answer/2405894) .\n- Follow the instructions on the Google TakeOut page to download your personal data.You must perform this download **before March 1** .\n**What will happen after March 1**\n- You will receive an email requesting you to transfer your user account to ExampleOrganization IT: \n- When you receive the email, click **Transfer account** . This link opens a browser window.\n- In the browser window, click **Sign in and transfer account** . The website guides you through the migration process, which takes only a few minutes to complete.\nPlease help us to perform the user transition quickly by taking action immediately when you receive the email.\nIf you think that your user account should not be transferred, contact it-support@example.org before you decline the transfer request. Declining or delaying the user account transfer will slow down the migration, and we might have to revoke your access to Google services.\nYour ExampleOrganization team.", "guide": "Cloud Architecture Center"}