{"title": "Cloud Architecture Center - Connect to Managed Microsoft AD", "url": "https://cloud.google.com/architecture/reference-patterns/overview", "abstract": "# Cloud Architecture Center - Connect to Managed Microsoft AD\nLast reviewed 2023-03-14 UTC\nManaged Microsoft Active Directory (AD) support is available in preview. During this preview, connecting Cloud Volumes Service and Managed AD is a manual, multi-step process.\nBoth Cloud Volumes Service and Managed AD are peered to your user VPC network. Because Google Cloud VPC networks don't allow transitive routing, Cloud Volumes Service can't access Managed AD through your user VPC network.\n", "content": "## Managed AD deployment architecture\nThe following diagram shows the architecture for the required three-way peering:- Peering from Managed AD to your VPC network occurs when you set up Managed AD.\n- Peering from Cloud Volumes Service to your VPC network occurs during the Cloud Volumes Service onboarding process.\n- Connecting Cloud Volumes Service with Managed AD isn't automated through the web-based user interface. You can connect Cloud Volumes Service with Managed AD by using API calls to Managed AD and Cloud Volumes Service. NetApp can assist you with this process.\nPlace resources like the Cloud Volumes Services SMB server in the correct organizational unit (OU) when configuring an AD connection. Managed AD organizes resources under the organizational unit `OU=Cloud` by default.\nUsing AD sites, as described in [Manage DC selection using AD sites](/architecture/partners/netapp-cloud-volumes/managing-active-directory-connections#manage_dc_selection_using_ad_sites) , is recommended for all service types. You must provision Managed AD to the respective regions and place the region's domain controllers into a region-specific AD site.\nTo complete three-way peering by connecting Cloud Volumes Service with Managed AD, you must contact Cloud Customer Care. For more information, see [Obtain support for NetApp Cloud Volumes Service](/architecture/partners/netapp-cloud-volumes/support) .", "guide": "Cloud Architecture Center"}