{"title": "Cloud Architecture Center - Assessing existing user accounts", "url": "https://cloud.google.com/architecture/reference-patterns/overview", "abstract": "# Cloud Architecture Center - Assessing existing user accounts\nLast reviewed 2023-02-27 UTC\nGoogle supports two types of user accounts, [managed user accounts](/architecture/identity/overview-google-authentication#managed_user_account) and [consumer user accounts](/architecture/identity/overview-google-authentication#consumer_account) . Managed user accounts are under the full control of a [Cloud Identity](/identity) or [Google Workspace](https://workspace.google.com/) administrator. In contrast, consumer accounts are fully owned and managed by the people who created them.\nA core tenet of identity management is to have a single place to manage identities across your organization:\n- If you [use Google as your identity provider (IdP)](/architecture/identity/reference-architectures#using_google_as_idp) , then Cloud Identity or Google Workspace should be the single place to manage identities. Employees should rely exclusively on user accounts that you manage in Cloud Identity or Google Workspace.\n- If you [use an external IdP](/architecture/identity/reference-architectures#using_an_external_idp) , then that provider should be the single place to manage identities. The external IdP needs to provision and manage user accounts in Cloud Identity or Google Workspace, and employees should rely exclusively on these managed user accounts when they use Google services.\nIf employees use consumer user accounts, then the premise of having a single place to manage identities is compromised: consumer accounts aren't managed by Cloud Identity, Google Workspace, or your external IdP. Therefore, you must identify the consumer user accounts that you want to convert to managed accounts, as explained in the [authentication overview](/architecture/identity/overview-google-authentication#managed_user_account) .\nTo convert consumer accounts to managed accounts using the transfer tool, described later in this document, you must have a Cloud Identity or Google Workspace identity with a Super Admin role.\nThis document helps you to understand and assess the following:\n- Which existing user accounts that your organization's employees might be using and how to identify those accounts.\n- Which risks might be associated with these existing user accounts.", "content": "## Example scenario\nTo illustrate the different sets of user accounts that employees might be using, this document uses an example scenario for a company named . Example Organization has six employees and former employees who have all been using Google services such as Google Google Docs and Google Ads. Example Organization now intends to consolidate their identity management and establish their external IdP as the single place to manage identities. Each employee has an identity in the external IdP, and that identity matches the employee's email address.\nThere are two consumer user accounts, Carol and Chuck, that use an `example.com` email address:\n- Carol created a consumer account using her corporate email address (`carol@example.com`).\n- Chuck, a former employee, created a consumer account using his corporate email address (`chuck@example.com`).\nTwo employees, Glen and Grace, decided to use Gmail accounts:\n- Glen signed up for a Gmail account (`glen@gmail.com)`, which he uses to access private and corporate documents and other Google services.\n- Grace also uses a Gmail account (`grace@gmail.com`), but she added her corporate email address,`grace@example.com`, as an alternate email address.\nFinally, two employees, Mary and Mike, are already using Cloud Identity:\n- Mary has a Cloud Identity user account (`mary@example.com`).\n- Mike is the administrator of the Cloud Identity account and created a user (`admin@example.com`) for himself.\nThe following diagram illustrates the different sets of user accounts:\nTo establish the external IdP as the single place to manage identities, you must link the identities of the existing Google user accounts to the identities in the external IdP. The following diagram therefore adds an account set that depicts the identities in the external IdP.\nRecall that if employees want to establish an external IdP as the single place to manage identities, they must rely exclusively on managed user accounts, and that the external IdP must control those user accounts.\nCurrently, only Mary meets these requirements. She uses a Cloud Identity user, which is a managed user account, and her user account's identity matches her identity in the external IdP. All other employees either use consumer accounts, or the identity of their accounts doesn't match their identity in the external IdP. The risks and implications of not meeting the requirements are different for each of these users. Each user represents a different set of user accounts that might require further investigation.\n## User account sets to investigate\nThe following sections examine potentially problematic sets of user accounts.\n### Consumer accounts\nThis set of user accounts consists of accounts for which either of the following is true:\n- They were created by employees using the **Sign up** feature offered by many Google services.\n- They use a corporate email address as their identity.\nIn the example scenario, this description fits Carol and Chuck.\nA consumer account that's used for business purposes and that uses a corporate email address can pose a risk to your business, such as the following:\n- You cannot control the lifecycle of the consumer account. An employee who leaves the company might continue to use the user account to access corporate resources or to generate corporate expenses.Even if you revoke access to all resources, the account might still pose a social engineering risk. Because the user account uses a seemingly trustworthy identity like `chuck@example.com` , the former employee might be able to convince current employees or business partners to grant access to resources again.Similarly, a former employee might use the user account to perform activities that aren't in line with your organization's policies, which could put your company's reputation at risk.\n- You cannot enforce security policies like MFA verification or password complexity rules on the account.\n- You cannot restrict which [geographic location Docs and Drive](https://support.google.com/a/answer/7630496?hl=en) data is stored in, which might be a compliance risk.\n- You cannot restrict which Google services can be accessed by using this user account.\nIf ExampleOrganization decides to [use Google as their IdP](/architecture/identity/reference-architectures#using_google_as_idp) , then the best way for them to deal with consumer accounts is to either [migrate them to Cloud Identity or Google Workspace](/architecture/identity/migrating-consumer-accounts) or to [evict them](/architecture/identity/evicting-consumer-accounts) by forcing the owners to rename the user account.\nIf ExampleOrganization decides to [use an external IdP](/architecture/identity/reference-architectures#using_an_external_idp) , they need to further distinguish between the following:\n- Consumer accounts that have a matching identity in the external IdP.\n- Consumer accounts that don't have a matching identity in the external IdP.\nThe following two sections look at these two subclasses in detail.\nThis set of user accounts consists of accounts that match all of the following:\n- They were created by employees.\n- They use a corporate email address as the primary email address.\n- Their identity matches an identity in the external IdP.\nIn the example scenario, this description fits Carol.\nThe fact that these consumer accounts have a matching identity in your external IdP suggests that these user accounts belong to current employees and should be retained. You should therefore consider [migrating these accounts to Cloud Identity or Google Workspace](/architecture/identity/migrating-consumer-accounts) .\nYou can identify consumer accounts that have matching identity in the external IdP as follows:\n- [Add all domains](https://support.google.com/a/answer/7502379?hl=en) to Cloud Identity or Google Workspace that you suspect might have been used for consumer account signups. In particular, the list of domains in Cloud Identity or Google Workspace should include all domains that your email system supports.\n- Use the [transfer tool for unmanaged users](https://admin.google.com/ac/unmanaged) to identify consumer accounts that use an email address that matches one of the domains you've added to Cloud Identity or Google Workspace. The tool also lets you [export the list of affected users as a CSV file](https://support.google.com/a/answer/6178640?hl=en#zippy=%2Cstep-download-the-list-of-unmanaged-users) .\n- Compare the list of consumer accounts with the identities in your external IdP, and find consumer accounts that have a counterpart.This set of user accounts consists of accounts that match all of the following:\n- They were created by employees.\n- They use a corporate email address as their identity.\n- Their identity doesmatch any identity in the external IdP.\nIn the example scenario, this description fits Chuck.\nThere can be several causes for consumer accounts without a matching identity in the external IdP, including the following:\n- The employee who created the account might have left the company, so the corresponding identity no longer exists in the external IdP.\n- There might be a mismatch between the email address used for the consumer account sign-up and the identity known in the external IdP. Mismatches like these can occur if your email system allows variations in email addresses such as the following:- Using alternate domains. For example,`johndoe@example.org`and`johndoe@example.com`might be aliases for the same mailbox, but the user might only be known as`johndoe@example.com`in your IdP.\n- Using alternate handles. For example`johndoe@example.com`and`john.doe@example.com`might also refer to the same mailbox, but your IdP might recognize only one spelling.\n- Using different casing. For example, the variants`johndoe@example.com`and`JohnDoe@example.com`might not be recognized as the same user.You can handle consumer accounts that don't have a matching identity in the external IdP in the following ways:\n- You can [migrate the consumer account to Cloud Identity or Google Workspace](/architecture/identity/migrating-consumer-accounts) and then [reconcile](/architecture/identity/reconciling-orphaned-managed-user-accounts) any mismatches caused by alternate domains, handles, or casing.\n- If you think the user account is illegitimate or shouldn't be used anymore, you can [evict the consumer account](/architecture/identity/evicting-consumer-accounts) by forcing the owner to rename it.\nYou can identify consumer accounts without a matching identity in the external IdP as follows:\n- [Add all domains](https://support.google.com/a/answer/7502379?hl=en) to Cloud Identity or Google Workspace that you suspect might have been used for consumer account signups. In particular, the list of domains in Cloud Identity or Google Workspace should include all domains that your email system supports as aliases.\n- Use the [transfer tool for unmanaged users](https://admin.google.com/ac/unmanaged) to identify consumer accounts that use an email address that matches one of the domains you've added to Cloud Identity or Google Workspace. The tool also lets you [export the list of affected users as a CSV file](https://support.google.com/a/answer/6178640?hl=en#zippy=%2Cstep-download-the-list-of-unmanaged-users) .\n- Compare the list of consumer accounts with the identities in your external IdP and find consumer accounts that lack a counterpart.\n### Managed accounts without a matching identity in the external IdP\nThis set of user accounts consists of accounts that match all of the following:\n- They were manually created by a Cloud Identity or Google Workspace administrator.\n- Their identity doesn't match any identity in the external IdP.\nIn the example scenario, this description fits Mike, who used the identity `admin@example.com` for his managed account.\nThe potential causes for managed accounts without a matching identity in the external IdP are similar to those for consumer accounts without a matching identity in the external IdP:\n- The employee for whom the account was created might have left the company, so the corresponding identity no longer exists in the external IdP.\n- The corporate email address that matches the identity in the external IdP might have been [set as an alternate email address](https://support.google.com/accounts/answer/176347/) or alias rather than as the primary email address.\n- The email address that's used for the user account in Cloud Identity or Google Workspace might not match the identity known in the external IdP. Neither Cloud Identity nor Google Workspace verifies that the email address used as the identity exists. A mismatch can therefore not only occur because of alternate domains, alternate handles, or different casing, but also because of a typo or other human error.\nRegardless of their cause, managed accounts without a matching identity in the external IdP are a risk because they can become subject to [inadvertent reuse and name squatting](/architecture/identity/best-practices-for-federating#make_cloud_identity_or_g_suite_identities_a_subset_of_the_identities) . We recommend that you [reconcile these accounts](/architecture/identity/reconciling-orphaned-managed-user-accounts) .\nYou can identify consumer accounts without a matching identity in the external IdP as follows:\n- Using the [Admin Console](https://workspace.google.com/dashboard) or the [Directory API](https://developers.google.com/admin-sdk/directory/v1/reference/users/list) , export the list of user accounts in Cloud Identity or Google Workspace.\n- Compare the list of accounts with the identities in your external IdP and find accounts that lack a counterpart.\n### Gmail accounts used for corporate purposes\nThis set of user accounts consists of accounts that match the following:\n- They were created by employees.\n- They use a`gmail.com`email address as their identity.\n- Their identities don't match any identity in the external IdP.\nIn the example scenario, this description fits Grace and Glen.\nGmail accounts that are used for corporate purposes are subject to similar risks as [consumer accounts without matching identity in external IdP](#consumer_accounts_with_a_matching_identity_in_the_external_idp) :\n- You cannot control the lifecycle of the consumer account. An employee who leaves the company might continue to use the user account to access corporate resources or to generate corporate expenses.\n- You cannot enforce security policies like MFA verification or password complexity rules on the account.\nThe best way to deal with Gmail accounts is therefore to revoke access for those user accounts to all corporate resources and provide affected employees with new managed user accounts as replacements.\nBecause Gmail accounts use `gmail.com` as their domain, there is no clear affiliation with your organization. The lack of a clear affiliation implies that there is no systematic way—other than scrubbing existing access control policies—to identify Gmail accounts that have been used for corporate purposes.\n### Gmail accounts with a corporate email address as alternate email\nThis set of user accounts consists of accounts that match all of the following:\n- They were created by employees.\n- They use a`gmail.com`email address as their identity.\n- They use a corporate email address [as an alternate email address](https://support.google.com/accounts/answer/176347/) .\n- Their identities don't match any identity in the external IdP.\nIn the example scenario, this description fits Grace.\nFrom a risk perspective, Gmail accounts that use a corporate email address as an alternate email address are equivalent to [consumer accounts without a matching identity in the external IdP](#consumer_accounts_without_a_matching_identity_in_the_external_idp) . Because these accounts use a seemingly trustworthy corporate email address as their second identity, they are subject to the risk of social engineering.\nIf you want to maintain the access rights and some of the data associated with the Gmail account, you can ask the owner [to remove Gmail from the user account](/architecture/identity/removing-gmail-from-consumer-accounts) so that you can then [migrate them to Cloud Identity or Google Workspace](/architecture/identity/migrating-consumer-accounts) .\nThe best way to handle Gmail accounts that use a corporate email address as an alternate email address is to [sanitize them](/architecture/identity/sanitizing-gmail-accounts) . When you sanitize an account, you force the owner to give up the corporate email address by creating a managed user account with that same corporate email address. Additionally, we recommend that you revoke access to all corporate resources and provide the affected employees with the new managed user accounts as replacements.\n## What's next\n- Learn more about [the different types of user accounts on Google Cloud](/architecture/identity/overview-google-authentication) .\n- Find out how the [migration process for consumer accounts](/solutions/migrating-consumer-accounts-to-cloud-identity-or-g-suite) works.\n- Review [best practices for federating Google Cloud with an external identity provider](/architecture/identity/best-practices-for-federating) .", "guide": "Cloud Architecture Center"}