{"title": "Cloud Architecture Center - Service levels", "url": "https://cloud.google.com/architecture/reference-patterns/overview", "abstract": "# Cloud Architecture Center - Service levels\nLast reviewed 2023-04-05 UTC\nService levels determine how much availability and throughput your volume can deliver to your applications.\nFor details about the options and intended workloads for each service type, see [Service types](/architecture/partners/netapp-cloud-volumes/service-types) .\nFor more information on service availability, see the [Service level agreement for Cloud Volumes Service](https://www.netapp.com/pdf.html?item=/media/14113-servicelevelagreementcloudvolumesservicesgcp.pdf) .\n", "content": "## Service levels for the CVS service type\nThe CVS service type offers two service levels:\n- **Standard-SW** offers enhanced availability of a volume in a single zone.\n- **Zone Redundant Standard-SW** provides multi-zonal high availability by storing copies of your data in different compute zones, enabling you to continue to read and write data even if the data in one of the zones is unavailable or unrecoverable. Zone Redundant Standard-SW is best suited for applications for which regional availability is critical and downtime is not acceptable.\nThe performance of volumes of the CVS service type scales with the size of the storage pool hosting the volume. All volumes within the storage pool share the performance capability of the pool.\n| Service type | Service level    | Availability     | Throughput per TiB allocated to the storage pool hosting the volume | Workload types                      |\n|:---------------|:---------------------------|:------------------------------|:----------------------------------------------------------------------|:-----------------------------------------------------------------------------------------------------|\n| CVS   | Standard-SW    | Single-zone high availability | 128 MiB/s                | General purpose, file shares, email, web, databases, and applications.        |\n| CVS   | Zone Redundant Standard-SW | Multi-zone high availability | 128 MiB/s                | Highly available, zone-resilient general-purpose file shares, email, web, databases and applications |\n**Note:** These throughput values are for access from the same region where the volumes are provisioned.\n## Service levels for the CVS-Performance service type\nThe CVS-Performance service type offers three service levels which you can change at any time—Standard, Premium, and Extreme. Cloud Volumes Service delivers the right performance fit for your workload that you can adjust as the nature of your application changes. The performance of the volume scales with the amount of allocated capacity, which means that your performance isn't limited when your dataset and throughput needs expand. You can also increase or decrease the allocated capacity as needed without having to worry about adding or deleting underlying nodes.\n| Service type | Service level | Throughput per TiB of allocated volume size | Workload types        |\n|:----------------|:----------------|:----------------------------------------------|:---------------------------------------------|\n| CVS-Performance | Standard  | 16 MiB/s          | General purpose, file shares, email, and web |\n| CVS-Performance | Premium   | 64 MiB/s          | Databases and applications     |\n| CVS-Performance | Extreme   | 128 MiB/s          | High-performance applications    |\n**Note:** These throughput values are for access from the same region where the volumes are provisioned.\n## What’s next\nFor information about service-level performance of CVS-Performance volumes, see the following:\n- [Performance expectations](/architecture/partners/netapp-cloud-volumes/performance-expectations) \n- [Select the appropriate service level and allocated capacity for NetApp Cloud Volumes Service](/architecture/partners/netapp-cloud-volumes/selecting-the-appropriate-service-level-and-allocated-capacity-for-netapp-cloud-volumes-service)", "guide": "Cloud Architecture Center"}