{"title": "Compute Engine - Troubleshooting image import and export", "url": "https://cloud.google.com/compute/docs/instances", "abstract": "# Compute Engine - Troubleshooting image import and export\n", "content": "## Diagnose image import and export issues\nDiagnose the cause of image import or export issues by reviewing the Cloud Build logs and the serial port output of the temporary VMs (or worker VMs).\n### Review Cloud Build logs\nThe image import tool uses the Cloud Build API to import and export images. Review the Cloud Build logs to get the status of the running process.\nTo view Cloud Build logs, do one of the following:\n- If you import or export images by using Google Cloud console, view logs on the **Images** page in the Google Cloud console, in the **Image import history** or **Image export history** tab. Click the Cloud Build ID to view the logs. [Go to Images](https://console.cloud.google.com/compute/images) \n- If you import or export images by using Google Cloud CLI, you can view the Cloud Build log location at the standard output after running the process.\n### Review serial port output\nReviewing the serial port output of the worker VMs that are created during the image import or export process might be useful to troubleshoot issues with system-level entities. For more information about these logs, see [Viewing serial port output](/compute/docs/troubleshooting/viewing-serial-port-output) .\n## Common errors\nThe following are examples of common errors you might encounter when you import or export images.\n### ExportFailed error when exporting images larger than 2 TB\nThe maximum size for images in `vmdk` , `vpc` , and `vhd` formats is limited to 2 TB. Therefore, when you export images larger than 2 TB in these formats, you might see an error message similar to the following in the log:\n**Error message** :\n```\n[image -export]: 2022 - 01 - 27T16: 08: 24Z Error running workflow: step\n\"image-export-export-disk\" run error: step \"wait-for-inst-image-export-export-disk\"\nrun error: WaitForInstancesSignal FailureMatch found for\n\"WORKER_VM_NAME--SUFFIX\":\n\"ExportFailed: Failed to export disk source to DESTINATION_URI\"\n```\n**Resolution** :\nTo resolve this issue, specify the image format as `vdi` , `vhdx` , or `qcow2` and set the `--timeout` value as `24h` when you run the [gcloud compute images export command](/sdk/gcloud/reference/compute/images/export) .\nIf the issue persists, contact [Google Cloud Support](/support) for assistance.", "guide": "Compute Engine"}