{"title": "Compute Engine - Committed use discounts (CUDs) for Compute Engine", "url": "https://cloud.google.com/compute/docs/instances", "abstract": "# Compute Engine - Committed use discounts (CUDs) for Compute Engine\nGoogle Cloud offers committed use discounts (CUDs) in return for purchasing committed use contracts (also known as commitments). When you purchase a commitment, you commit either to a minimum amount of resource usage or to a minimum spend amount for a specified term of one or three years.\nFor Compute Engine, you receive deeply discounted prices for your VM instances in return for your 1-year or 3-year commitments. Depending on your resource usage requirements, you can purchase commitments and receive CUDs for Compute Engine resources in either of the following ways:\n- **Resource-based committed use discounts (or resource-based CUDs)** are ideal for predictable and steady state resource usage. You receive these CUDs when you purchase a resource-based commitment and commit to use a minimum level of Compute Engine resources in a particular region. For more information, see [Resource-based CUDs](#resource_based) .\n- **Compute Engine flexible committed use discounts (orflexible CUDs)** are spend-based CUDs that are ideal for scenarios where you have more predictable Google Cloud spend needs. You receive when you purchase a for Compute Engine and commit to a minimum amount of hourly spend. For more information, see [Flexible CUDs](#spend_based) .\nYou can purchase both resource-based and flexible commitments to cover Compute Engine resources for projects in your Cloud Billing account. You can use your resource-based commitments to cover your predictable, stable, and region-specific resource usage. You can use the flexible commitments to cover any resource usage that isn't specific to any one machine type or region.\n", "content": "## Resource-based CUDs\nResource-based commitments provide a discount in exchange for your commitment to use a minimum level of Compute Engine resources in a particular region. Resource-based commitments are ideal for predictable and steady state usage. These commitments are available for vCPUs, memory, GPUs, local SSDs, sole-tenant nodes, and software licenses.\nWith a resource-based commitment, you purchase a specific amount of Compute Engine resources at a discounted price and commit to paying for those resources for a term of either 1 year or 3 years. You can purchase the following categories of resource-based commitments:\n- **Hardware commitments:** You can purchase hardware commitments for resources like vCPUs, memory, GPUs, local SSDs, and sole-tenant nodes. You get a discount of **up to 70%** for memory-optimized machine types and a discount of **up to 57%** for all other machine types. For more information, see [Purchase commitments without attached reservations](/compute/docs/instances/signing-up-committed-use-discounts#purchasecommitment) and [Purchase commitments with attached reservations](/compute/docs/instances/signing-up-committed-use-discounts#purchasecommitmentgpuslocalssd) .\n- **Software license commitments:** You can purchase license commitments for applicable premium operating system (OS) licenses. You get the following discounts in return:- **Up to 79%** for SUSE Linux Enterprise Server (SLES) images\n- **Up to 63%** for SLES for SAP images\n- **Up to 24%** for Red Hat Enterprise Linux (RHEL) and RHEL for SAP images\nFor more information, see [Purchase commitments for licenses](/compute/docs/instances/signing-up-committed-use-discounts#purchaselicensecommitment) .\nResource-based commitments for hardware resources are separate from the ones for licenses. You can purchase both categories of commitments for the same VM instance, but you cannot purchase a single resource-based commitment that covers both hardware resources and licenses.\nWhen you purchase a resource-based commitment, the commitment becomes active on the following day at 12 AM US and Canadian Pacific Time (UTC-8, or UTC-7 during daylight saving time). You are billed monthly for your committed resources until the end of your commitment term, regardless of whether or not you use those resources. You can't cancel a commitment after its purchase.\nFor more information about resource-based CUDs for Compute Engine and how to purchase them, see [Resource-based committed use discounts](/compute/docs/instances/signing-up-committed-use-discounts)\nFor information about pricing that includes the resource-based CUDs for different machine types, see [VM instances pricing](/compute/vm-instance-pricing#general-purpose_machine_type_family) .\n## Flexible CUDs\nFlexible CUDs add flexibility to your spending capabilities by eliminating the need to restrict your commitments to a single project, region, or machine series. You purchase flexible commitments for your Cloud Billing account. In return, you can receive CUDs for your vCPU and memory usage in any of the projects within that Cloud Billing account, across any region, and belonging to any eligible general-purpose or compute-optimized machine types.\nWhen you purchase a flexible commitment for your Cloud Billing account, you commit to a minimum amount of hourly spend on Compute Engine vCPUs, memory, or both for a 1-year or 3-year term. You do this by committing to spend on resources that are worth a specified minimum amount of on-demand price, every hour, throughout the commitment term. In return for committing to an hourly spend amount, you receive the following discounts:\n- A **28% discount** over your committed hourly spend amount for a 1-year commitment\n- A **46% discount** over your committed hourly spend amount for a 3-year commitment\nThe commitment that you purchase becomes active within the first hour of its purchase. The discounted hourly spend amount becomes your commitment fee and you are billed this fee monthly. Your commitment fee remains your minimum hourly expenditure throughout the commitment term and you have to pay it even if you don't use resources whose on-demand prices total up to your committed hourly spend.\nCompute Engine supports Flexible CUDs only for memory and vCPU resources. You can purchase flexible commitments for any of these resources for the following machine types:\n- **General purpose:** All N1, N2, N2D, E2, C3, and C3D machine types\n- **Compute-optimized:** All C2 and C2D machine types\nTo view the full list of Compute Engine SKUs that are eligible for flexible CUDs, see [Compute Engine flexible CUDs eligible SKUs](/skus/sku-groups/compute-engine-flexible-cud-eligible-skus) .\nIf you use any additional resources that take your hourly spend amount beyond your committed hourly spend amount, then the overage usage is not covered by flexible CUDs. The overage usage is charged at the on-demand rate and is eligible for any applicable sustained use discounts (SUDs). Compute Engine automatically applies SUDs to your eligible usage. For more information about SUDs, see the [sustained use discounts documentation](/compute/docs/sustained-use-discounts) .\nYour commitment fee remains the same even if the on-demand prices for your resources change during your commitment term.\n**Example:** Consider a scenario where your Cloud Billing account has multiple projects with VM instances belonging to N2, E2, and C2 machine series, and located in the `us-central1` and `us-east1` regions. Suppose you purchase a Compute Engine flexible commitment for this Cloud Billing account and commit to spend on resources whose on-demand prices are worth US$100, every hour, for a 3-year term. The following points explain how this example flexible commitment works:\n- You commit to spend a minimum hourly amount on Compute Engine vCPUs, memory, or both whose on-demand prices are worth US$100. The US$100 amount becomes your hourly committed spend amount for the commitment term.\n- When you use vCPUs, memory, or both from any N2, E2, and C2 machine types across`us-central1`and`us-east1`regions, regardless of the project, the cost of those resources, up to US$100, counts towards this minimum spend, provided they aren't already covered by another commitment.\n- You receive a 46% CUD on the US$100 and are charged an hourly commitment fee of US$54. This discount lets you use up to US$100 worth of Compute Engine vCPUs, memory, or both for US$54, every hour, throughout your commitment term.\n- If you purchase this flexible commitment but use hourly resources whose on-demand prices are worth only US$50, then your commitment covers these US$50 worth of resources, but you must still continue to pay the hourly commitment fee of US$54.\n- If you purchase this flexible commitment but use hourly resources whose on-demand prices are worth US$150, then the commitment covers US$100 worth of resources and you pay US$54 per hour for these US$100 worth of resources. You pay the full US$50 per hour for the remaining US$50 worth of resources. These remaining US$50 worth of resources are eligible for SUDs.\n- Consider the scenario where you purchase this flexible commitment and use hourly resources whose on-demand prices are worth only US$50. During your commitment period, if the on-demand cost for your purchased resources changes from US$50 to US$150, your hourly commitment fee still remains US$54 and your flexible commitment continues to cover US$100 of your spend. However, you must pay the remaining US$50 per hour of on-demand price in full. You receive any applicable SUDs on this additional US$50 on-demand cost.\nYou can purchase Compute Engine flexible commitments only at a Cloud Billing account level. For more information about how to purchase a flexible commitment and get Compute Engine flexible CUDs, see [Purchasing spend-based commitments](/docs/cuds-spend-based#purchasing) .\n## Order of discount application\nThe discount types that Google Cloud offers on your Compute Engine resources are mutually exclusive and can't be combined. At any given point, a resource is eligible for only one kind of discount. If you're receiving a specific type of discount for a portion of your resource usage, then that portion of usage doesn't qualify for any other type of discount.\nIf you purchase both resource-based commitments and flexible commitments for your Compute Engine resources, then Google Cloud optimizes the use of your commitments, on an hourly basis, in the following way:\n- Google Cloud first utilizes your resource-based commitments and applies all the resulting resource-based CUDs to any eligible hourly usage.\n- Google Cloud then utilizes your spend-based commitments and applies all the resulting flexible CUDs to any remaining eligible on-demand usage.\nAfter utilizing all of your commitments, Google Cloud uses the on-demand rates to charge any additional hourly usage. This overage hourly usage is eligible for any applicable SUDs.\n## Limitations\n- Resource-based and flexible CUDs are available only for resources that are deployed using Compute Engine SKUs, which include VMs that are used by Compute Engine, Google Kubernetes Engine, Dataproc, or Cloud Composer 1.\n- You can purchase Compute Engine flexible commitments only at a Cloud Billing account level.\n- You can purchase Compute Engine flexible commitments only for your Compute Engine vCPUs, memory, or both. You can't purchase these commitments for GPUs or local SSDs.\n- You can't use your Compute Engine flexible commitments for [Spot VMs](/compute/docs/instances/spot) or [preemptible VMs](/compute/docs/instances/preemptible) .## What's next\n- Learn more about [Compute Engine resource-based commitments](/compute/docs/instances/signing-up-committed-use-discounts) .\n- Browse the [pricing tables for Compute Engine machine families](/compute/vm-instance-pricing) for information about their on-demand prices, resource-based commitment prices, and flexible CUD consumption rates.\n- Learn how to [purchase Compute Engine flexible commitments](/docs/cuds-spend-based#purchasing) .\n- Learn about [CUD analysis reports](/billing/docs/how-to/cud-analysis) .\n- Learn how to [analyze the effectiveness of Compute Engine resource-based CUDs](/billing/docs/how-to/cud-analysis-resource-based) .\n- Learn how to [analyze the effectiveness of Compute Engine flexible CUDs](/billing/docs/how-to/cud-analysis-flexible) .\n- Learn more about [CUDs for Google Cloud](/docs/cuds) .", "guide": "Compute Engine"}