{"title": "Compute Engine - Troubleshooting VM suspension", "url": "https://cloud.google.com/compute/docs/instances", "abstract": "# Compute Engine - Troubleshooting VM suspension\nThis document describes common issues or errors when suspending or resuming a virtual machine (VM) instance.\nYou can suspend a VM temporarily so that its memory moves to storage, and the instance is preserved until you come back and resume it at a later time. Learn more about [suspending and resuming a VM](/compute/docs/instances/suspend-resume-instance) .\n", "content": "## Excessive suspension time\nIn some cases, it might take a while for the VM to become suspended once you have made the suspend request. Because the guest operating system's memory is saved on a persistent disk, it might take several minutes for a VM to transition to `SUSPENDED` state.\nFor VMs that are suspended with `--discard-local-ssd=False` flag, suspension could take significantly longer as the SSD contents have to be copied to persistent disk. For more information, see the [Local SSD documentation](/compute/docs/disks/local-ssd#stop_instance_restrictions) .\n## VM suspension errors\nIf you could not suspend a VM, it could be due to one of the following reasons.\n### Invalid VM state\nYou can only suspend a VM in `RUNNING` state. If you attempt to suspend a VM in another state, the system returns an error.\n**Error messages** :\n```\nUNSUPPORTED_OPERATION\n```\n```\nYou cannot suspend an instance that is stopped or terminated.\n```\n```\nYou cannot suspend an instance that is being repaired.\n```\n```\nYou cannot suspend an already suspended instance.\n```\n**Resolution** :\nOnly a VM in the `RUNNING` state can be suspended. Please wait and try again later if the instance is being repaired, or start the VM if it is currently stopped.\n### Invalid VM configurations\nYou cannot suspend a [Confidential VM](/confidential-computing/confidential-vm/docs/about-cvm) .\n**Error messages** :\n```\nUNSUPPORTED_OPERATION\n```\n**Resolution**\nYou can recreate the VM as a regular VM or, alternatively, [stop and start](/compute/docs/instances/stop-start-instance) the VM instead.\nYou cannot suspend VMs with more than 208GB of memory.\n**Error messages** :\n```\nUNSUPPORTED_OPERATION\n```\n```\nSuspend is not supported on Instances with more than 208GB memory.\n```\n**Resolution** :\nYou can [change the machine type of the VM](/compute/docs/instances/changing-machine-type-of-stopped-instance) to reduce its memory or, alternatively, [stop and start](/compute/docs/instances/stop-start-instance) the VM instead.\n**Error messages** :\n```\nINVALID_USAGE\n```\n```\nSuspend with Local SSD feature is not available for this project.\n```\n**Resolution**\nTo suspend a VM with more than 16 local SSD attached, you must discard the local SSD contents while suspending the VM with the `--discard-local-ssd` flag.\n**Error messages** :\n```\nUNSUPPORTED_OPERATION\n```\n```\nSuspend is not supported on GPU Instances. You may delete and recreate the instances without GPU.\n```\n**Resolution** :\nRecreate the VM without a GPU or [stop and start](/compute/docs/instances/stop-start-instance) the VM instance.\nA Windows VM that has power policy set to high performance and display timeout set to a value greater than 0 may turn off the display after the timeout.\nWhen you send suspend requests to VMs where the display has turned off, the suspend request restarts the display instead of suspending the VM.\n**Resolution** :\nTo resolve this issue, do the following:\n- Disable the display timeout using the following command:```\npowercfg /change monitor-timeout-ac 0\n```\n- Enable the sleep button using the following command:```\npowercfg -setacvalueindex SCHEME_CURRENT 4f971e89-eebd-4455-a8de-9e59040e7347 96996bc0-ad50-47ec-923b-6f41874dd9eb 1\n```\n### There was a guest timeout\nThis error occurs when the guest operating system does not respond to the ACPI S3 signal within 3 minutes. The OS must be able to handle the ACPI S3 signal to initiate a suspend of the VM. Some operating systems do not support this functionality.\n**Error messages** :\n```\nUNSUPPORTED_OPERATION\n```\n```\nInstance suspend failed due to guest timeout.\n```\n**Resolution** :\nReview the [OS compatibility](/compute/docs/instances/suspend-resume-instance#os_compatibility) table to determine whether an OS supports suspend and resume. Alternatively, you can [stop and start the instance](/compute/docs/instances/stop-start-instance) instead, although the instance will lose guest OS memory, device state, and application state when stopped.\n### There is not enough persistent disk quota\n**Error messages** :\n```\nQUOTA_EXCEEDED\n```\n```\nQuota 'DISKS_TOTAL_GB' exceeded. Limit: NUMBER_OF_DISKS in region REGION.\n```\n**Resolution** :\nMake sure your project and region in which you're suspending the instance has enough persistent disk quota. See [Resource quotas](/compute/quotas) for more information.\n### The VM was preempted\nThe VM was preempted before you could suspend it.\n**Error messages** :\n```\nFAILED_WITH_INSTANCE_PREEMPTED\n```\n```\nYou cannot suspend an instance that is preempted.\n```\n**Resolution** :\nNo action is necessary if you do not want to suspend this VM. If you do, you can restart the VM and immediately suspend it.\n### The VM could not be suspended for unknown reasons\n**Error messages** :\n```\nFAILED_WITH_INSTANCE_RUNNING\n```\n```\nFAILED_WITH_INSTANCE_RUNNING\n```\n```\nSuspend failed with instance in state RUNNING.\n```\n**Resolution** :\nPlease try to suspend the VM again at a later time.", "guide": "Compute Engine"}