{"title": "Compute Engine - Idle VM recommendations", "url": "https://cloud.google.com/compute/docs/instances", "abstract": "# Compute Engine - Idle VM recommendations\nCompute Engine provides idle VM recommendations to help you identify virtual machine (VM) instances that have not been used over the previous 1 to 14 days. You can use idle VM recommendations to find and stop idle VM instances to reduce wasting resources and reduce your compute bill.\nCompute Engine generates recommendations automatically based on system metrics gathered by the Cloud Monitoring service. You can configure idle VM recommendations to receive more or fewer recommendations.\nThis page provides conceptual information on how Compute Engine generates idle VM recommendations and on the parameters you can use to configure them.\n- For more information on how to identify idle VMs and take action, see [View and apply idle VM recommendations](/compute/docs/instances/viewing-and-applying-idle-vm-recommendations) .\n- For more information on how to configure idle VM recommendations, see [Configure idle VM recommendations](/compute/docs/instances/configuring-idle-vm-recommendations) .", "content": "## Pricing\nIdle VM recommendations are available free of charge. Using recommendations to reduce your resource usage can result in cost savings.\n## Limitations\nFor standalone VMs, idle VM recommendations are not available in following cases:\n- Instances with local SSDs\n- Instances with GPU/TPUs\n- App Engine flex resources\n- Dataflow resources\n- Google Kubernetes Engine resources## How detection of idle VM instances works\nCompute Engine generates recommendations about idle VM instances based on historical usage metrics. By default, the historical observation period is 14 days, or, for new VMs, starting one day after VM creation. By changing the default observation period, you can customize the recommendations that you receive.\nTo generate recommendations, the algorithm considers the CPU and network usage in the last observation period. If CPU and network usage are below predefined thresholds, the Recommender classifies the VM as idle.\n**Note:** Google designs the default thresholds so that if monitoring agents generate the majority of CPU and network usage, then your VM is classified as idle. The default threshold values that are currently used to classify a VM as idle might change in the future.\n### Frequency of recommendations\nAfter a VM is created and running for at least one day during the observation period, Compute Engine begins generating idle VM recommendations for it. New recommendations are generated once per day.\n### Relation with machine type sizing recommendations\n[Machine type sizing recommendations](/compute/docs/instances/apply-sizing-recommendations-for-instances) recommend the optimal size for a VM. You might receive a machine type recommendation to downsize an idle VM.\nIf you must keep an idle VM running despite its low utilization, you can use machine type recommendations to help you choose the optimal size for underutilized VMs.\n## Customize recommendations\n**    Preview     ** This product or feature is subject to the \"Pre-GA Offerings Terms\" in the General Service Terms section   of the [Service Specific Terms](/terms/service-terms#1) .     Pre-GA products and features are available \"as is\" and might have limited support.    For more information, see the [launch stage descriptions](/products#product-launch-stages) .\nCompute Engine lets you customize the recommendations you receive for your project by changing the configuration used by the recommendation algorithm. In particular, by changing the default observation period, you can receive recommendations that better fit your workloads, applications, and infrastructure needs.\nTo learn how to modify the configuration for your project, see [Configure idle VM recommendations](/compute/docs/instances/configuring-idle-vm-recommendations) .\n## Choose the right configuration\nThis section describes the values that you can set for the configuration. Changing these values affects the recommendations that you receive.\n### The observation period\nSet the observation period to modify the duration of the window used to calculate the recommendations.\nYou can set the observation period to a value between 1 day and 14 days, using a string with the total number of seconds, followed by the letter `s` .\n- For an observation period of 1 day, use`\"86400s\"`.\n- For an observation period of 14 days, use`\"1209600s\"`.\nBy default, the observation period is 14 days.\n- Use a shorter observation period if you want to receive recommendations based on short-term changes in your workload.\n- Use a longer observation period if you want to receive recommendations that are not affected by short-term fluctuations in your workload.## What's next\n- Learn how to [view and apply idle VM recommendations](/compute/docs/instances/viewing-and-applying-idle-vm-recommendations) .\n- Learn how to [configure idle VM recommendations](/compute/docs/instances/configuring-idle-vm-recommendations) .", "guide": "Compute Engine"}