{"title": "Compute Engine - Troubleshooting RDP", "url": "https://cloud.google.com/compute/docs/instances", "abstract": "# Compute Engine - Troubleshooting RDP\nIn some situations, you might not be able to connect to your Compute Engine Windows virtual machine (VM) instance with RDP. This might be due to configuration errors, network errors, or the boot process might not have completed.\nThis document describes a number of tips and approaches to troubleshoot and resolve common RDP issues.\n**Note:** As of Windows 7, you can use RDP over UDP. For more information, see [Remote Desktop Protocol (RDP) 8.0 update for Windows 7 and Windows Server 2008R2](https://support.microsoft.com/help/2592687/remote-desktop-protocol-rdp-8-0-update-for-windows-7-and-windows-serve) .\n", "content": "## Ensure the VM is online and ready\nAfter the VM has finished booting, which may take a few minutes, confirm its state using one of the following methods:\nSerial port 1 is used to log system and application activity. View its output to determine that your VM has finished booting and if services have started correctly.- In the Google Cloud console, go to the **VM instances** page. [Go to VM instances](https://console.cloud.google.com/compute/instances) \n- Click the name of the VM you want to view logs for. The VM instance details page opens.\n- Under **logs** , select **Serial port 1** .\n- Review serial port 1 output and look for output similar to the following:```\nBdsDxe: loading Boot0003 \"Windows Boot Manager\" from HD(2,GPT,DD3FB000-7000-4000-8000-3977378A7000,0x0000,0x00000)/\\EFI\\Microsoft\\Boot\\bootmgfw.efi\nBdsDxe: starting Boot0003 \"Windows Boot Manager\" from HD(2,GPT,DD3FB000-7000-4000-8000-3977378A7000,0x0000,0x00000)/\\EFI\\Microsoft\\Boot\\bootmgfw.efi\nUEFI: Attempting to start image.\nDescription: Windows Boot Manager\nFilePath: HD(2,GPT,DD3FB000-7000-4000-8000-3977378A7000,0x0000,0x00000)/\\EFI\\Microsoft\\Boot\\bootmgfw.efi\nOptionNumber: 3.\n2021/04/13 10:50:22 GCEGuestAgent: GCE Agent Started (version 20210128.00)\n2021-04-13T10:50:23.4621Z OSConfigAgent Info: OSConfig Agent (version 20210217.00.0+win@1) started.\n2021/04/13 10:50:42 GCEMetadataScripts: Starting startup scripts (version 20200129.00).\n2021/04/13 10:50:42 GCEMetadataScripts: No startup scripts to run.\n```\nOutput containing `GCEGuestAgent` or `GCEMetadataScripts` confirms that Windows has started successfully. Try reconnecting to your VM using RDP.\nSerial port 2 provides an interactive connection to the VM and also shows the output of the [Special Administrative Console(SAC)](https://technet.microsoft.com/en-us/library/cc787940) . You can use serial console 2 to determine if system services have started successfully.- In the Google Cloud console, go to the **VM instances** page. [Go to VM instances](https://console.cloud.google.com/compute/instances) \n- Click the name of the VM you want to view logs for. The VM instance details page opens.\n- Under **logs** , expand **More** , then click **Serial port 2 (console)** .\n- Review the serial port 2 output and look for output similar to the following:```\nBdsDxe: loading Boot0003 \"Windows Boot Manager\" from HD(2,GPT,DD3FB000-7000-4000-8000-3977378A7000,0x0000,0x00000)/\\EFI\\Microsoft\\Boot\\bootmgfw.efi\nBdsDxe: starting Boot0003 \"Windows Boot Manager\" from HD(2,GPT,DD3FB000-7000-4000-8000-3977378A7000,0x0000,0x00000)/\\EFI\\Microsoft\\Boot\\bootmgfw.efi\nUEFI: Attempting to start image.\nDescription: Windows Boot Manager\nFilePath: HD(2,GPT,DD3FB000-7000-4000-8000-3977378A7000,0x0000,0x00000)/\\EFI\\Microsoft\\Boot\\bootmgfw.efi\nOptionNumber: 3.\n<machine-info>\n<name>WINDOWS</name>\n<guid>b7ab5000-4000-e000-e000-bc5a738da000</guid>\n<processor-architecture>AMD64</processor-architecture>\n<os-version>10.0</os-version>\n<os-build-number>17763</os-build-number>\n<os-product>Windows Server 2019 Datacenter</os-product>\n<os-service-pack>None</os-service-pack>\n</machine-info>\nComputer is booting, SAC started and initialized.\nUse the \"ch -?\" command for information about using channels.\nEVENT: The CMD command is now available.\nSAC>\n```\nOutput containing `SAC started and initialized` or `CMD command is now available` confirms that Windows has started successfully. Try reconnecting to your VM using RDP.\nVM screenshots provide a visual representation of a VM's state, similar to a computer monitor.- Before you can capture a screenshot of your VM, you must enable the VM's virtual display. If you haven't already enabled the virtual display, see [Enabling virtual displays](/compute/docs/instances/enable-instance-virtual-display) .\n- Capture a screenshot. For more information, see [Capturing a screenshotfrom a VM](/compute/docs/instances/capturing-vm-screenshots#capturing_a_screenshot_from_a_vm) .\n- Review the screenshot to see that the instance is ready.\nCompare your screenshot to the following to determine the current state:- A [Windows loginscreen](/compute/docs/instances/capturing-vm-screenshots#login-screen) confirms the OS has started successfully, you can now attempt to connect via RDP.\n- The [Windows Update progressscreen](/compute/docs/instances/capturing-vm-screenshots#windows-updates) indicates the VM is not yet ready, allow more time it to complete the updates.\n- A [services loadingscreen](/compute/docs/instances/capturing-vm-screenshots#loading-services) indicates the VM is not yet ready, allow more time for the VM to start necessary services.\n- A [UEFI loadingscreen](/compute/docs/instances/capturing-vm-screenshots#uefi-loading) may indicate a missing boot file/record or corrupt boot sector/manager.\n- A [Windows blue screenerror](/compute/docs/instances/capturing-vm-screenshots#windows-bsod) may be temporary or require further troubleshooting.\n**Note:** Avoid forcing the VM to restart if it is loading or updating. Force restarting can disrupt the progress, add additional recovery time, or potentially corrupt your operating system.\nIf Windows has not started successfully after a few minutes, review the [Troubleshooting Windows](/compute/docs/troubleshooting/troubleshooting-windows) guide.\n## Check connectivity between your workstation and the VM instance\nIf you run into issues when you connect your Windows VM, it is a good practice to identify whether the problem is with the workstation that you are using to connect, or the VM that you are connecting to. Check connectivity between your workstation and the VM by running the following command from your Linux, macOS, or Windows workstation:\n```\ncurl -v telnet://DESTINATION_IP_ADDRESS:PORT\n```\nReplace the following:\n- ``: the IP address of your Windows VM\n- ``: the port configured for connecting through RDP on your Windows VM\nYou can also use [Connectivity Tests](/network-intelligence-center/docs/connectivity-tests/how-to/running-connectivity-tests) for further verification of connectivity between the VM instance and other Google Cloud products and services. Additionally, it might also be useful to set up a bastion host on the same subnetwork for isolating RDP connectivity issues on the VM instance.\n## Check your Windows instance password\nEach Compute Engine Windows instance must have a local password set if it is not already on a domain or custom image. Confirm you have the correct password set by connecting to the VM through the `Google Cloud CLI` command-line tool or Google Cloud console. For more information, see [Connect to Windows VMs using the SAC](/compute/docs/instances/connecting-to-sac) .\nIf you have problems connecting, try creating or resetting the password. For more information, see [Creating passwords for WindowsVMs](/compute/docs/instances/windows/creating-passwords-for-windows-instances) .\n## Check if you're using Windows Server Core\nWhen connecting using RDP, if you receive a Command Prompt window on a blank background this likely indicates you are using [Windows ServerCore](https://docs.microsoft.com/en-us/windows-server/administration/server-core/what-is-server-core) . To confirm that you are run the command below:\n```\nreg query \"HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\" /v InstallationType\n```\n`Server Core` in your output confirms that you are using Windows Core edition.\n```\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\n InstallationType REG_SZ Server Core\n```\nIf you require a graphical user interface for your workload, look at [creating aWindows instance](/compute/docs/instances/windows/creating-managing-windows-instances#start_instance) that contains Desktop Experience instead of Server Core. Alternatively, you may review the Microsoft documentation for [managing Windows Coreserver](https://docs.microsoft.com/en-us/windows-server/administration/server-core/server-core-manage) .\n## Check your VPC firewall rules\nCompute Engine automatically provisions new projects with a firewall rule that allows RDP traffic. If you have an existing project, or have modified the configurations, the default firewall rule that permits RDP might not exist. Confirm that a rule allows RDP traffic to connect to the network that your affected instance is on.\nTo check if the [default-allow-rdp](/vpc/docs/firewalls#default_firewall_rules) firewall rule exists on your project, check the [Firewall rules page](https://console.cloud.google.com/networking/firewalls) , or run the following gcloud CLI command:\n```\ngcloud compute firewall-rules list\n```\nTo create a new rule if one does not exist, create a rule with the following command:\n```\ngcloud compute firewall-rules create allow-rdp --allow tcp:3389\n```\n**Note:** The default port number for Windows RDP is 3389, however you can reconfigure this number. If you do, change the port number after `tcp:` in the \"create rule\" command to match.\n## Verify the external IP address\nEnsure that you're connecting to the correct external IP address for the instance. View the IP for the instance from the [VM instance page](https://console.cloud.google.com/compute/instances) or by using the following gcloud CLI command:\n```\ngcloud compute instances list\n```\n## Use of Windows Remote Desktop Services (RDS)\nIf you have Windows Remote Desktop Services (formerly known as Terminal Services) installed on your instance, then the conditions of the Client Access Licenses (CALs) are enforced. With these CALs, RDP connections will fail under any of the following conditions:\n- You have used all your available licenses\n- Your license is installed, but not configured or activated correctly\n- Your RDS trial period of 180 days has expired\nSymptoms that you may not have enough valid licenses include messages such as:\n- This remote session was disconnected because there are no Remote Desktop License Servers available to provide a license.\n- The remote session was disconnected because of an error related to licensing in terminal server.\n- The remote session was disconnected because there are no Remote Desktop client access licenses available for this computer.\nIf your RDP connections fail, you can use the admin switch to connect to the instance for administrative purposes. This can be done on a Windows machine by using the native Remote Desktop Connection client.\n**Note:** Using the admin switch on a VM that has exhausted the available connection licences, can forcibly disconnect a user from the VM.\n```\n%systemroot%/system32/mstsc.exe /admin\n```\nTwo concurrent remote desktop sessions for administration are included with the on-demand Windows Server and SQL Server image.\nTo resolve issues with RDP connections, purchase new RDS licenses for your instance. For more details about CALs, review the [Microsoft documentation](https://docs.microsoft.com/en-us/windows-server/remote/remote-desktop-services/rds-client-access-license) . Alternatively, if Remote Desktop Services are not required, uninstall the service and use regular RDP connections.\n## Validate OS level configuration and resources\nIf the guest environment and configurations for the instance are correct, the operating system on the instance might be misconfigured. Additionally, without adequate resources it's possible that an RDP connection might fail to be established. To validate OS level configuration, [connect to the Windows SAC](/compute/docs/instances/connecting-to-sac) :\n- [Ensure the VM has adequate resources](#adequate_resources) \n- [Check the OS configuration](#os_configuration) \n### Ensure the VM has adequate resources\nVerify the CPU, memory, disk usage, and available disk space are not reaching their limits. This data can be inspected by viewing the [observability metrics](/compute/docs/instances/observe-monitor-vms) in the Google Cloud console. Some metrics are available only for VMs that have the [Ops Agent](/stackdriver/docs/solutions/agents/ops-agent) installed. Alternatively, if the Ops Agent is not installed, use the following commands when connected to SAC:\nCPU usage, memory usage, disk usage and disk capacity\n- CPU usage:```\ntypeperf \"\\Processor(_Total)\\% Processor Time\" -sc 5\n```\n- Memory usage:```\ntypeperf \"\\Memory\\% Committed Bytes In Use\" -sc 5\n```\n- Disk Usage:```\ntypeperf \"\\LogicalDisk(*)\\% Idle Time\" -sc 5\n```\n- Disk Capacity:```\nfsutil volume diskfree C:\n```\nThe following are the recommended resource usages for an RDP connection, however these are just estimates, and might vary between instances.\n- CPU: <80%\n- Memory: <80%\n- Disk space: >20%\n- Disk idle: >50%\nIf any of the suggested estimates are reaching their limits, you can modify that resource for the VM instance. To edit VM properties, see how to [edit the machine type of a VM instance](/compute/docs/instances/changing-machine-type-of-stopped-instance) and [increase the size of a persistent disk](/compute/docs/disks/resize-persistent-disk) .\n### Check the OS configuration\nConnect to the instance through SAC and run the following commands to ensure that the instance is accepting connections:\n- Check to see that the ethernet adapter is enabled:- **Command:** ```\nnetsh interface show interface\n```\n- **Pass:** Admin state is set toon Interface Name labeled\n- **Fail:** Admin state is set toon Interface Name labeled\n- **Solution:** Enable the ethernet adapter:```\nnetsh interface set interface Ethernet admin=enabled\n```\n- Check to see that the instance has a valid IP configuration:- **Command:** ```\nipconfig /all\n```\n- **Pass:** Ethernet Adapterwill show an IPv4 Address of the subnet the instance is assigned to.\n- **Fail:** No IPv4 address, or an address that doesn't match what is shown in Google Cloud console.\n- **Solution:** Proceed to the next step.\n **Note:** If an address is assigned and not \"(Preferred)\" this means that the IP address was assigned as static on the guest OS level. This should be set to DHCP to allow the metadata server to assign the correct IP address.\n- Check to see that DHCP is enabled on the instance:- **Command:** ```\nnetsh interface ipv4 show addresses\n```\n- **Pass:** Output undercontains.\n- **Fail:** Output undercontains.\n- **Solution:** Enable DHCP on the ethernet adapter:```\nnetsh interface ipv4 set address Ethernet dhcp\n```\n **Note:** Virtual network adapters on Google Cloud VM instances are set to \"Ethernet\" by default, but can be changed or have a number appended in the case of multi-nic instances. In these cases, substitute the interface name appropriately.\n- Check to see that the 'Remote Desktop Service' is running:- **Command:** ```\nnet start | find \"Remote Desktop Services\"\n```\n- **Pass:** Remote Desktop Service\n- **Fail:** (Remote Desktop Service missing from output)\n- **Solution:** Start the Remote Desktop Services:```\nnet start \"Remote Desktop Services\"\n```\n- Check that Remote Connections are enabled:- **Command** :```\nreg query \"HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\Terminal Server\" /v fDenyTSConnections\n```\n- **Pass** : fDenyTSConnections REG_DWORD 0x0\n- **Fail** : fDenyTSConnections REG_DWORD 0x1\n- **Solution** : Enable remote desktop connections in the registry:```\nreg add \"HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\Terminal Server\" /f /v fDenyTSConnections /t REG_DWORD /d 0\n```\n- Ensure that the Windows firewall has Remote Desktop Connections enabled:- **Command** :```\nnetsh advfirewall firewall show rule name=\"Remote Desktop -User Mode (TCP-In)\"\n```\n- **Pass** : Enabled:Yes, Direction: In, Profiles: Public, Grouping: Remote Desktop, LocalIP: Any, RemoteIP: Any, Protocol:TCP, LocalPort: 3389, RemotePort: Any, Edge traversal: No, Action: Allow **Note:** This is the default configuration, so your requirements might  be different.\n- **Fail** : (unexpected results, such as enabled = No)\n- **Solution** : Enable the default \"Remote Desktop\" firewall rule within Windows Firewall:```\nnetsh advfirewall firewall set rule group=\"remote desktop\" new enable=Yes\n```\n- Check to see what port number is configured for RDP connections on the remote instance:- **Command** :```\nreg query \"HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\Terminal Server\\WinStations\\RDP-Tcp\" /v PortNumber\n```\n- **Pass** : PortNumber REG_DWORD [PORT NUMBER]\n- **Fail** : (unexpected port number)\n- **Solution** : Configure the port number in the registry required for RDP:```\nreg add \"HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\Terminal Server\\WinStations\\RDP-Tcp\" /f /v PortNumber /t REG_DWORD /d [PORT NUMBER]\n``` **Note:** Number is in hexadecimal, 0xd3d = 3389 (default port is 3389).\n- Verify that another application is not trying to use the same port:- **Command** :```\nnetstat -ano | find \"3389\"\n```\n- **Pass** : Look for an entry for the assigned RDP port with a status of. The matching service can be found using the process identifier (PID) by using the following command:```\ntasklist /svc | find \"\"\n```where PID is the identifier from the previous command. The output should only havebeing returned.\n- **Fail** : Anything but theis using the assigned port.\n- **Solution** : Configure the application/service to use another port number.\n- Ensure that connected user account has permissions for remote connections:- **Command** :```\nnet localgroup \"Remote Desktop Users\"\n```\n- **Pass** : (target local/domain username in resulting list)\n- **Fail** : (target local/domain username missing)\n- **Solution** : Add the \"Remote Desktop Users\" rule to a user in the domain:```\nnet localgroup \"Remote Desktop Users\" /add [DOMAIN\\USERNAME]\n```The domain is required only for user accounts on a system joined to a different domain. For local accounts, specify only the username.\n- Verify the client/server security negotiation is set to its [default value](https://docs.microsoft.com/en-us/windows-hardware/customize/desktop/unattend/microsoft-windows-terminalservices-rdp-winstationextensions-securitylayer) :- **Command** :```\nreg query \"HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\Terminal Server\\WinStations\\RDP-Tcp\" /v SecurityLayer\n```\n- **Pass** : SecurityLayer REG_DWORD 0x1\n- **Fail** : SecurityLayer REG_DWORD 0x0 (or 0x2)\n- **Solution** : Set the security negotiation value in the registry:```\nreg add \"HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\Terminal Server\\WinStations\\RDP-Tcp\" /v SecurityLayer /t REG_DWORD /d 1 /f\n```\n- In situations where your instance is connected to an Active Directory domain, but the connection could not be established you may receive the following error when trying to access your instance:```\nThe remote computer that you are trying to connect to requires Network Level Authentication (NLA), but your Windows domain controller cannot be contacted to perform NLA.\n```Verify the user Network Level Authentication (NLA) is set to its [default value](https://docs.microsoft.com/en-us/windows-hardware/customize/desktop/unattend/microsoft-windows-terminalservices-rdp-winstationextensions-userauthentication) :- **Command** :```\nreg query \"HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\Terminal Server\\WinStations\\RDP-Tcp\" /v UserAuthentication\n```\n- **Pass** : UserAuthentication REG_DWORD 0x0\n- **Fail** : UserAuthentication REG_DWORD 0x1\n- **Solution** : Set the Network Level Authentication value in the registry:```\nreg add \"HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\Terminal Server\\WinStations\\RDP-Tcp\" /v UserAuthentication /t REG_DWORD /d 0 /f\n```\n- Verify that your MTU size is no greater than the MTU of the network:- **Command** :```\nnetsh interface ipv4 show subinterfaces\n```\n- **Pass** : When the number after the MTU matches the MTU of the VPC network.\n- **Fail** : When the number after MTU is larger than the MTU of the VPC network.\n- **Solution** : Set the MTU of the interface to the MTU of the VPC network:```\nnetsh interface ipv4 set subinterface Ethernet mtu=MTU_OF_VPC_NETWORK\n``` **Note:** VPC networks have a default [maximum transmission unit (MTU)](https://www.wikipedia.org/wiki/Maximum_transmission_unit) of`1460`bytes. However, the network MTU can be set to the standard Ethernet MTU of`1500`bytes, up to`8896`bytes for jumbo frames, or as low as`1300`. For more information about network MTUs, see the [maximum transmission unit overview](/vpc/docs/mtu) .For more information about MTU size incompatibilities, see our [packet fragmentation](/compute/docs/troubleshooting/general-tips#packetfragmentation) documentation.\n- If you try to connect to the VM by using RDP and the VM displays the keyboard layout screen, you need to select a language by connecting to Windows SAC. To select a language, complete the following steps:- Connect to SAC.\n- Open Powershell by typing`powershell`.\n- Get the correct language string.```\nGet-WinUserLanguageList\n```\n- Set the desired layout. Replace `` with the language layout you want (for example, `en-US` ).```\nSet-WinUserLanguageList -LanguageList LANGUAGE_TAG -force\n```\n- Reboot your instance.```\nshutdown -r -t 0\n```\n- For RDP errors on the logon screen mentioning `you need the right to sign in through Remote Desktop Services` or `you must be granted the Allow log on through Terminal Services right` , the Remote Desktop Users or Administrators group was removed from Local Computer Policy setting found in [Allow log on through Remote Desktop Services](https://learn.microsoft.com/en-us/windows/security/threat-protection/security-policy-settings/allow-log-on-through-remote-desktop-services) or . **Note:** If you encounter this issue, contact Google Cloud Support.\n- Verify there are no missing permissions blocking certificates authentication:- **Command** :```\nicacls.exe \"C:\\ProgramData\\Microsoft\\Crypto\\RSA\\MachineKeys\"\n```\n- **Pass** : Output resembles\n- **Fail** : Output doesn't match\n **Note:** If you encounter this issue, contact Google Cloud Support.\n- Ensure that your antivirus/endpoint protection client settings allow for the configured port number and services. **Note:** This process will vary between products, and might not have a command line solution.## Verify session timeout limits\nIf you are able to establish an RDP connection but you are disconnected after some time with a message mentioning that your verify the following values are as expected:\nRegistry Path: `HKEY_LOCAL_MACHINE\\SOFTWARE\\Policies\\Microsoft\\Windows NT\\Terminal Services`\nRegistry Keys:\n- `MaxDisconnectionTime`\n- `MaxIdleTime`\n- `MaxConnectionTime`\n- `MaxDisconnectionTime`\n- `RemoteAppLogoffTimeLimit`\nThese values are set in milliseconds. If these keys are missing from your registry then there are no session limits on your VM instance. If these keys are present in your registry but their values are set to `0` , then your session will never expire.\n## Troubleshoot Windows startup\nIf the above troubleshooting steps have not resolved your RDP connection issue, your Windows instance may not be booting or running correctly. In this case, review our guide for [troubleshootingWindows](/compute/docs/troubleshooting/troubleshooting-windows) .\n## What's next\n- Learn more about [troubleshooting the Windows operatingsystem](/compute/docs/troubleshooting/troubleshooting-windows) .\n- Learn how to [collect diagnostic information from aVM](/compute/docs/instances/collecting-diagnostic-information) .\n- Learn about [troubleshooting using the serialconsole](/compute/docs/troubleshooting/troubleshooting-using-serial-console) .\n- Learn how to [capture screenshots fromVMs](/compute/docs/instances/capturing-vm-screenshots) .", "guide": "Compute Engine"}