{"title": "Compute Engine - Modify, cancel, or delete future reservation requests", "url": "https://cloud.google.com/compute/docs/instances", "abstract": "# Compute Engine - Modify, cancel, or delete future reservation requests\n**    Preview     ** This product or feature is subject to the \"Pre-GA Offerings Terms\" in the General Service Terms section   of the [Service Specific Terms](/terms/service-terms#1) .     Pre-GA products and features are available \"as is\" and might have limited support.    For more information, see the [launch stage descriptions](/products#product-launch-stages) .\nThis document explains how to manage future reservation requests. Specifically:\n- Modify a draft or submitted future reservation request to change one or more of its properties.\n- Cancel a future reservation request to stop Google Cloud from reviewing it or stop an approved future reservation from entering its lock time.\n- Delete a future reservation before it enters its required lock time or after the end of its reservation period.\nIf you want to manage the auto-created reservations for a fulfilled future reservation [after the end of its reservation period](/compute/docs/instances/future-reservations-overview#auto-created-reservations) , see instead the following:\n- [Modify reservations](/compute/docs/instances/reservations-modify) .\n- [Delete reservations](/compute/docs/instances/reservations-delete) .", "content": "## Before you begin\n- If you haven't already, set up authentication. [Authentication](/compute/docs/authentication) is the process by which your identity is verified for access to Google Cloud services and APIs. To run code or samples from a local development environment, you can authenticate to Compute Engine as follows.Select the tab for how you plan to use the samples on this page:\nWhen you use the Google Cloud console to access Google Cloud services and   APIs, you don't need to set up authentication.- [Install](/sdk/docs/install) the Google Cloud CLI, then [initialize](/sdk/docs/initializing) it by running the following command:```\ngcloud init\n``` **Note:** If you installed the gcloud CLI  previously, make sure you have the latest version by running`gcloud components  update`.\n- [ Set a default region and zone](/compute/docs/gcloud-compute#set_default_zone_and_region_in_your_local_client) .\nTo use the REST API samples on this page in a local development environment, you use the credentials you provide to the gcloud CLI.- [Install](/sdk/docs/install) the Google Cloud CLI, then [initialize](/sdk/docs/initializing) it by running the following command:\n- ```\ngcloud init\n```\n### Required roles\nTo get the permissions that you need to modify, cancel, or delete your future reservation requests,   ask your administrator to grant you the [Compute Future Reservation Admin ](https://cloud.google.com/iam/docs/understanding-roles#compute.futureReservationAdmin) ( `roles/compute.futureReservationAdmin` ) IAM role on the project.    For more information about granting roles, see [Manage access](/iam/docs/granting-changing-revoking-access) .\nThis predefined role contains     the permissions required to modify, cancel, or delete your future reservation requests. To see the exact permissions that are   required, expand the **Required permissions** section:\nYou might also be able to get   these permissions  with [custom roles](/iam/docs/creating-custom-roles) or  other [predefined roles](/iam/docs/understanding-roles) .\n## Restrictions\nIn addition to the general [restrictions](/compute/docs/instances/future-reservations-overview#restrictions) for future reservations, when you modify, cancel, or delete a future reservation requests, the following restrictions apply:\n- You can only modify, cancel, or delete a future reservation request from within the project where the future reservation request was created. This lets you share a future reservation request with other projects, but users with permissions for only other projects can't modify that future reservation request.\n- You can only modify, cancel, or delete a future reservation request if its procurement status allows it. For details, see the following table:| Procurement status        | Cancel | Delete | Modify |\n|:-------------------------------------------------|---------:|:---------|---------:|\n| Drafting (DRAFTING)        |  nan | nan  |  nan |\n| Pending approval (PENDING_APPROVAL)    |  nan | nan  |  nan |\n| Approved (APPROVED)        |  nan | nan  |  nan |\n| Declined (DECLINED)        |  nan | nan  |  nan |\n| Canceled (CANCELED)        |  nan | nan  |  nan |\n| Procuring (PROCURING)       |  nan | nan  |  nan |\n| Provisioning (PROVISIONING)      |  nan | nan  |  nan |\n| Fulfilled (FULFILLED)       |  nan | *  |  nan |\n| Partially fulfilled (FAILED_PARTIALLY_FULFILLED) |  nan | *  |  nan |\n| Failed (FAILED)         |  nan | *  |  nan | You can delete a fulfilled, partially fulfilled, or failed future reservation only after its end time.## Modify future reservation requests\nYou can modify a future reservation request before it reaches a procurement status of Provisioning ( `PROVISIONING` ) as long as it isn't canceled or pending approval. When modifying a future reservation request, you can't change the following properties:\n- For any future reservation:- The name of the future reservation.\n- The project where the future reservation request was created.\n- The zone where the future reservation is located.\n- For future reservation requests created by specifying an instance template:- You can't override the VM properties specified in the instance template.\n- You can't replace the instance template used to create a future reservation request with another template.To modify any of these properties, you must [create a new future reservation request](#change-other-properties) with your desired updates.\nIf you want to modify other properties, select one of the following methods:\n- [Modify a draft or declined future reservation request](#modify-draft-future-reservation) .This section explains how to modify a future reservation request with a procurement status set to Drafting ( `DRAFTING` ) or Declined ( `DECLINED` ).\n- [Modify an approved or procuring future reservation](#modify-submitted-future-reservation) .This section explains how to modify a future reservation with a procurement status set to Approved ( `APPROVED` ) or Procuring ( `PROCURING` ). If you want to modify the auto-delete option, description, or name prefix of a future reservation, you can modify them without review. Otherwise, if you want to modify other properties, you need the approval of Google Cloud.\n### Modify a draft or declined future reservation request\nIf you modify a draft future reservation request, you can save your changes or submit the updated future reservation request to Google Cloud for review. If you modify a declined future reservation request instead, you must submit the request for review.\nTo modify the properties of a draft or declined future reservation request, select one of the following methods:\n- [Modify a draft or declined future reservation request created by specifying an instance template](#modify-draft-future-reservation-instance-template) .This section explains how to modify one or more properties in a draft or declined future reservation request created by specifying an instance template. You can't modify the VM properties of a future future reservation request. Instead, you must [create a new future reservation](#change-other-properties) .\n- [Modify a draft or declined future reservation request created by specifying properties directly](#modify-draft-future-reservation-direct) .This section explains how to modify one or more properties in a draft or declined future reservation request that was created by specifying properties directly.For a future reservation request created by specifying an instance template with a procurement status of Drafting ( `DRAFTING` ) or Declined ( `DECLINED` ), you can modify the following properties:\n- Auto-delete\n- Description\n- Name prefix\n- Share settings\n- Start and end time of the reservation period\n- Total count (Number of VMs)\n**Caution:** An instance template contains project-specific settings, so you can only access and use an instance template within the same project. If you create a shared future reservation request by specifying an instance template, you can't use the same template to create VMs that can consume the auto-created reservations for the future reservation outside of the project that created the shared future reservation.\nYou can modify a draft or declined future reservation request that was created by specifying an instance template using the Google Cloud console, gcloud CLI, and REST.\nTo request Google Cloud to modify a draft or declined future reservation request created by specifying an instance template, follow these steps:- In the Google Cloud console, go to the **Reservations** page. [Go to Reservations](https://console.cloud.google.com/compute/reservations) \n- Click the **Future reservations** tab.\n- In the **Name** column, click the name of the future reservation request that you want to modify.The details page of the selected future reservation request opens.\n- To modify the future reservation request, click edit **Edit** or edit **Edit draft** .The page to edit the selected future reservation request opens.\n- Do one or more of the following:- In the **Prefix** field, enter a new name prefix.\n- In the **Description** field, enter a new description.\n- Modify the **Start time** or **End time** for your future reservation request. Make sure of the following:- The start time can't be later than 1 year from the date and time at which you submit a future reservation request for review.\n- Specify a [recommended value for the start time](/compute/docs/instances/future-reservations-overview#recommended-start-time) to ensure that you have sufficient time before your future reservation enters its lock time.\n- Specify a [recommended minimum reservation period](/compute/docs/instances/future-reservations-overview#recommended-minimum-reservation-period) to increase the likelihood that Google Cloud approves your request after submitting it for review.\n- In the **Share type** section, you can select either **Local** or **Shared** . If you select **Shared** , you can add or remove projects to share the future reservation request with.You can select up to 100 projects. These projects must be in the same organization as the project where the future reservation request was created (the owner project). Don't specify the owner project. By default, it is already allowed to consume the shared auto-created reservations for this future reservation request.\n- In the **Number of VM instances** enter the total count of VMs that you want reserved for the period, VM configuration, and project(s) specified in this future reservation request.When calculating the number of reservations to create for an approved future reservation, Compute Engine first checks for existing reservations. If there are existing reservations that match the approved future reservation, the number of existing reservations is subtracted from the requested total number of reservations in the request to determine the number of new reservations that Compute Engine creates. For more information, see how Compute Engine [counts and provisions reserved resources](/compute/docs/instances/future-reservations-overview#count-reserved-resources) . **Caution** : Make sure to have sufficient quota for the resources that you're requesting to reserve. Otherwise, Google Cloud declines your future reservation request.\n- In the **Auto-generated reservations auto-delete** section, you can enable or disable the automatic deletion of auto-created reservations for your future reservation request. **Caution:** If the auto-delete option is enabled, all the auto-created reservations are deleted at the specified deletion time regardless if they're fully consumed or not.Optional. If you enable the auto-delete option, you can specify the date and time when Compute Engine deletes the auto-created reservations. The date and time must be after the end time of the reservation period. If you leave this field empty, the auto-created reservations are deleted within 2 hours after the end time of the reservation period.\n- Depending on the procurement status of the future reservation request that you're modifying, do one of the following:- For a draft future reservation request, select one of the following options:- To save your changes, click **Save draft** .\n- To submit the draft future reservation request to Google Cloud for review, click **Submit** .\n- For a declined future reservation request, you can only submit it for review by clicking **Submit** .If you submit a request, the **Reservations** page opens. Otherwise, the details page of the future reservation request opens.\nTo request Google Cloud to modify a draft or declined future reservation request created by specifying an instance template, use the [gcloud beta compute future-reservations update command](/sdk/gcloud/reference/beta/compute/future-reservations/update) .\n```\ngcloud beta compute future-reservations update FUTURE_RESERVATION_NAME \\\n --description=\"DESCRIPTION\" \\\n --name-prefix=NAME_PREFIX \\\n --planning-status=PLANNING_STATUS \\\n --project=PROJECT_ID \\\n --share-setting=SHARE_SETTING \\\n --share-with=CONSUMER_PROJECT_IDS \\\n --start-time=START_TIME \\\n --end-time=END_TIME \\\n --total-count=TOTAL_COUNT \\\n --zone=ZONE\n```\nReplace the following:- ``: the name of an existing draft or declined future reservation request.\n- ``: Optional. A new description for the future reservation request.\n- ``: Optional. A new name prefix for the future reservation request. The name of each auto-created reservation for this future reservation request starts with the name prefix. To help you identify the auto-created reservations for this future reservation request, specifying an unique name prefix is recommended.\n- `` : the planning status of the future reservation request. You can only specify `SUBMITTED` , which submits the future reservation request to Google Cloud for review. **Note** : If you're modifying a draft future reservation request and want to save your changes instead of submitting your request to Google Cloud for review, omit the`--planning-status`flag.\n- ``: Optional. The ID of the project where the future reservation request was created. If you modify a single-project future reservation request into a shared future reservation request, this project becomes the owner project of the future reservation request. If you omit the`--project`flag, the value is set to the ID of the current project.\n- `` : Optional. To change the type of this future reservation request, specify one of the following values:- To change a single-project future reservation request into a shared future reservation request, specify `projects` . Make sure to specify at least one consumer project using the `--share-with` flag. Otherwise, modifying the future reservation fails.\n- Otherwise, specify `local` . **Important:** If you specify `local` , make sure to omit the `--share-with` flag. Otherwise, modifying the future reservation request fails.\n- `` : Optional. A comma-separated list of the [project IDs](/resource-manager/docs/creating-managing-projects#identifying_projects) of projects that this future reservation request can be shared with. For example, specify `project-1,project-2` . You can specify up to 100 projects. These projects must be in the same organization as the project where this future reservation request was created (the owner project). Don't specify the owner project. By default, it is already allowed to consume the shared auto-created reservations for this future reservation request.\n- `` : Optional. The new start time of the reservation period formatted as an [RFC 3339 timestamp](https://tools.ietf.org/html/rfc3339) , which must be as follows:```\nYYYY-MM-DDTHH:MM:SSOFFSET\n```Replace the following:- `` : a data formatted as a 4-digit year, 2-digit month, and a 2-digit day of the month, separated by hyphens ( `-` ).\n- `` : a time formatted as a 2-digit hour using a 24-hour time, 2-digit minutes, and 2-digit seconds, separated by colons ( `:` ).\n- `` : the time zone formatted as an offset of [Coordinated Universal Time (UTC)](https://en.wikipedia.org/wiki/Coordinated_Universal_Time) . For example, to use the Pacific Standard Time (PST), specify `-08:00` . Alternatively, to use no offset, specify `Z` .\nThe start time can't be later than 1 year from the date and time at which you submit a future reservation request for review. To have sufficient time to optionally cancel, delete, or modify a future reservation after it's approved or before it enters its lock time, make sure to specify a [recommended start time](/compute/docs/instances/future-reservations-overview#recommended-start-time) .\n- `` : Optional. The new end time of the reservation period formatted as an RFC 3339 timestamp. The reservation period must last at least 24 hours. Alternatively, you can replace the `--end-time` flag with the `--duration=` `` flag where `` is the duration of the reservation period in seconds. For example, specify `1209600` for 1,209,600 seconds (14 days).To increase the likelihood that Google Cloud approves a future reservation request after you submit it for review, make sure to specify one of the [recommended values for your reservation period](/compute/docs/instances/future-reservations-overview#recommended-minimum-reservation-period) . **Important:** Make sure that your reservation period doesn't overlap with the reservation period of another existing future reservation request with matching VM properties and zone, and that was created in or is shared with your current project. Otherwise, modifying the future reservation request [fails](/compute/docs/troubleshooting/troubleshoot-future-reservations#overlapping-reservation-periods) .\n- `` : Optional. The new total number of VMs that you want reserved for the period, VM configuration, and project(s) specified in this future reservation request.When calculating the number of reservations to create for an approved future reservation, Compute Engine first checks for existing reservations. If there are existing reservations that match the approved future reservation, the number of existing reservations is subtracted from the requested total number of reservations in the request to determine the number of new reservations that Compute Engine creates. For more information, see how Compute Engine [counts and provisions reserved resources](/compute/docs/instances/future-reservations-overview#count-reserved-resources) . **Caution:** Make sure that you have sufficient quota for the resources that you're requesting to reserve. Otherwise, Google Cloud declines your future reservation request.Caution: Make sure to have sufficient quota for the resources that you're requesting to reserve. Otherwise, Google Cloud declines your future reservation request.\n- ``: the zone where the future reservation request is located.\nOptionally, you can also change if and when Compute Engine automatically deletes the auto-created reservations for a future reservation request by doing one of the following:- To enable Compute Engine to automatically delete the auto-created reservations after the end time of the reservation period, select one of the following methods: **Caution:** If you enable the auto-delete option, all the auto-created reservations are deleted at the specified deletion time regardless if they're fully consumed or not.- To delete the reservations within 2 hours after the end time (default), specify the `--auto-delete-auto-created-reservations` flag.```\ngcloud beta compute future-reservations update example-future-reservation \\\n --auto-delete-auto-created-reservations\n```\n- To delete the auto-created reservations at a specific time after the end time of the reservation period, specify the `--auto-delete-auto-created-reservations` and `--auto-created-reservations-delete-time` flags.```\ngcloud beta compute future-reservations update example-future-reservation \\\n --auto-delete-auto-created-reservations \\\n --auto-created-reservations-delete-time=AUTO_CREATED_RESERVATIONS_DELETE_TIME\n```Replace `` with a date and time formatted as an RFC 3339 timestamp.\n- To delete the auto-created reservations after a specific duration after the end time of the reservation period, specify the `--auto-delete-auto-created-reservations` and `--auto-created-reservations-duration` flags.```\ngcloud beta compute future-reservations update example-future-reservation \\\n --auto-delete-auto-created-reservations \\\n --auto-created-reservations-duration=DURATION_BEFORE_DELETE\n```Replace `` with a duration in days, hours, minutes or seconds. For example, specify `30m` for 30 minutes, or `1d2h3m4s` for 1 day, 2 hours, 3 minutes, and 4 seconds.\n- To disable Compute Engine from automatically deleting the auto-created reservations, specify the `--no-auto-delete-auto-created-reservations` flag.```\ngcloud beta compute future-reservations update example-future-reservation \\\n --no-auto-delete-auto-created-reservations\n```\nFor example, consider a draft shared future reservation request named `fr-03` and located in zone `us-central1-a` . Suppose that you want to modify this shared future reservation request by making the following changes:- Convert it into a single-project future reservation request.\n- Disable the auto-delete option.\n- Reserve 100 VMs.\n- Submit the future reservation request to Google Cloud for approval.\nTo modify `fr-03` , run the following command:\n```\ngcloud beta compute future-reservations update fr-03 \\\n --clear-share-settings \\\n --no-auto-delete-auto-created-reservations \\\n --planning-status=SUBMITTED \\\n --project=example-project \\\n --total-count=100 \\\n --zone=us-central1-a\n```\nTo request Google Cloud to modify a draft or declined future reservation request created by specifying an instance template, make a `PATCH` request to the [beta.futureReservations.update method](/compute/docs/reference/rest/beta/futureReservations/update) . In the `updateMask` query parameter, specify each field that you want to update. If you need to delete an optional field from your reservation, then include that field in the `updateMask` query parameter and omit that field from the request body.\n```\nPATCH https://compute.googleapis.com/compute/beta/projects/PROJECT_ID/zones/ZONE/futureReservations/FUTURE_RESERVATION_NAME?updateMask=UPDATE_FIELDS{  \"autoDeleteAutoCreatedReservations\": \"AUTO_DELETE_AUTO_CREATED_RESERVATIONS\",  \"description\": \"DESCRIPTION\",  \"name\": \"FUTURE_RESERVATION_NAME\",  \"namePrefix\": \"NAME_PREFIX\",  \"planningStatus\": \"PLANNING_STATUS\",  \"shareSettings\": {    \"projects\": [      \"CONSUMER_PROJECT_ID_1\",      \"CONSUMER_PROJECT_ID_2\"    ],    \"shareType\": \"SHARE_TYPE\"  },  \"specificSkuProperties\": {     \"totalCount\": \"TOTAL_COUNT\"  },  \"timeWindow\": {    \"endTime\": \"END_TIME\",    \"startTime\": \"START_TIME\"  }}\n```\nReplace the following:- `` : the ID of the project where the future reservation request is located.\n- `` : the zone where the future reservation request is located.\n- `` : the name of an existing draft or declined future reservation request. You can't modify the name of a future reservation request.\n- `` : a comma-separated list of fields to update in this `PATCH` request. You must encode each comma as `%2C` . For example, if you want to update the `autoDeleteAutoCreatedReservations` , `totalCount` , and `endTime` fields in your future reservation request, specify the following:```\nautoDeleteAutoCreatedReservations%2CspecificSkuProperties.totalCount%2CtimeWindow.endTime\n```\n- `` : Optional. If you set this field to `true` , Compute Engine automatically deletes the auto-created reservations for this future reservation reservation request. By default, the deletion time is within 2 hours after the end time of the reservation period. To change this, do one of the following: **Caution:** If you enable the auto-delete option, all the auto-created reservations are deleted at the specified deletion time regardless if they're fully consumed or not.- To delete the auto-created reservations at a specific time after the end time of your reservation period, set the `autoDeleteAutoCreatedReservations` to `true` and specify the `autoCreatedReservationsDeleteTime` field.```\nPATCH https://compute.googleapis.com/compute/beta/projects/example-project/zones/us-central1-a/futureReservations/example-future-reservation?updateMask=autoDeleteAutoCreatedReservations%2CautoCreatedReservationsDeleteTime{  \"autoDeleteAutoCreatedReservations\": \"true\",  \"autoCreatedReservationsDeleteTime\": \"DELETE_TIME\"}\n```Replace `` with a date and time when Compute Engine deletes reservations. The date and time must be formatted as an [RFC 3339 timestamp](https://tools.ietf.org/html/rfc3339) , which must be as follows:```\nYYYY-MM-DDTHH:MM:SSOFFSET\n```Replace the following:- `` : a data formatted as a 4-digit year, 2-digit month, and a 2-digit day of the month, separated by hyphens ( `-` ).\n- `` : a time formatted as a 2-digit hour using a 24-hour time, 2-digit minutes, and 2-digit seconds, separated by colons ( `:` ).\n- `` : the time zone formatted as an offset of [Coordinated Universal Time (UTC)](https://en.wikipedia.org/wiki/Coordinated_Universal_Time) . For example, to use the Pacific Standard Time (PST), specify `-08:00` . Alternatively, to use no offset, specify `Z` .\n- To delete the auto-created reservations after a specific duration from the start time of the reservation period, set the `autoDeleteAutoCreatedReservations` to `true` and specify the `autoCreatedReservationsDuration` field.```\nPATCH https://compute.googleapis.com/compute/beta/projects/example-project/zones/us-central1-a/futureReservations/example-future-reservation?updateMask=autoDeleteAutoCreatedReservations%2CautoCreatedReservationsDuration{  \"autoDeleteAutoCreatedReservations\": \"true\",  \"autoCreatedReservationsDuration\": {    \"seconds\": \"DURATION_BEFORE_DELETE\"  }}\n```Replace `` with a duration in seconds. For example, specify `604800` for 604,800 seconds (7 days).\n- `` : Optional. To update the description for this future reservation request, do one of the following:- To add or update a description, specify a description.\n- To remove the description, delete the `description` field from the request body and specify it in `` .\n- `` : Optional. A new name prefix for the future reservation request. The name of each auto-created reservation for this future reservation request starts with the name prefix. To help you identify the auto-created reservations for this future reservation, specifying an unique name prefix is recommended.\n- `` : the planning status of the future reservation request. You can only specify `SUBMITTED` , which submits the future reservation request to Google Cloud for review. **Note** : If you're modifying a draft future reservation request and want to save your changes instead of submitting your request to Google Cloud for review, omit the`planningStatus`field.\n- `` : Optional. To change the share type of this future reservation request, specify one of the following values:- To change a single-project future reservation request into a shared future reservation request, specify `SPECIFIC_PROJECTS` . Additionally, you must specify at least one consumer project in the `projects` field. Otherwise, modifying the future reservation request fails.\n- Otherwise, specify `LOCAL` . Additionally, you must delete the `projects` field from the request body and specify it in `` . Otherwise, modifying the future reservation request fails.\n- `` and `` : Optional. The [project IDs](/resource-manager/docs/creating-managing-projects#identifying_projects) of projects that a shared future reservation request can be shared with. You can specify up to 100 projects. These projects must be in the same organization as the project where the future reservation request was created (the owner project). Don't specify the owner project. By default, it is already allowed to consume the shared auto-created reservations for this future reservation request.\n- `` : Optional. The new total number of VMs that you want reserved for the period, VM configuration, and project(s) specified in this future reservation request.When calculating the number of reservations to create for an approved future reservation, Compute Engine first checks for existing reservations. If there are existing reservations that match the approved future reservation, the number of existing reservations is subtracted from the requested total number of reservations in the request to determine the number of new reservations that Compute Engine creates. For more information, see how Compute Engine [counts and provisions reserved resources](/compute/docs/instances/future-reservations-overview#count-reserved-resources) . **Caution:** Make sure to have sufficient quota for the resources that you're requesting to reserve. Otherwise, Google Cloud declines your future reservation request.\n- `` : Optional. The new start time of the reservation period formatted as an RFC 3339 timestamp. The start time can't be later than 1 year from the date and time at which you submit a future reservation request for review. Additionally, make sure to specify a [recommended start time](/compute/docs/instances/future-reservations-overview#recommended-start-time) to ensure that you have sufficient time before a future reservation enters its lock time.\n- `` : Optional. The new end time of the reservation period formatted as an RFC 3339 timestamp. The reservation period must last at least 24 hours. Alternatively, you can replace the `endTime` field with the `duration` field to specify a specific duration from the start time of the reservation period:```\n\"duration\": {  \"seconds\": \"END_DURATION\"}\n```Replace `` with a duration in seconds. For example, specify `1209600` for 1,209,600 seconds (14 days).To increase the likelihood that Google Cloud approves a future reservation request after you submit it for review, make sure to specify one of the [recommended values for your reservation period](/compute/docs/instances/future-reservations-overview#recommended-minimum-reservation-period) . **Important:** Make sure that your reservation period doesn't overlap with the reservation period of another existing future reservation request with matching VM properties and zone, and that was created in or is shared with your current project. Otherwise, modifying the future reservation request [fails](/compute/docs/troubleshooting/troubleshoot-future-reservations#overlapping-reservation-periods) .\nFor example, consider a draft shared future reservation request named `fr-03` and located in zone `us-central1-a` . Suppose that you want to modify this shared future reservation request by making the following changes:- Convert it into a single-project future reservation request.\n- Disable the auto-delete option.\n- Reserve 100 VMs.\n- Submit the future reservation request to Google Cloud for approval.\nTo modify `fr-03` , make the following `PATCH` request:\n```\nPATCH https://compute.googleapis.com/compute/beta/projects/example-project/zones/us-central1-a/futureReservations/fr-03?updateMask=autoDeleteAutoCreatedReservations%2CplanningStatus%2CshareSettings.shareType%2CspecificSkuProperties.totalCount{  \"autoDeleteAutoCreatedReservations\": \"false\",  \"name\": \"fr-03\",  \"planningStatus\": \"SUBMITTED\",  \"shareSettings\": {    \"shareType\": \"LOCAL\"  },  \"specificSkuProperties\": {    \"totalCount\": \"100\"  }}\n```\nAfter you submit a future reservation request to Google Cloud for review, [view its details](/compute/docs/instances/view-future-reservations#view-details-future-reservation) to monitor its procurement status.\nFor a future reservation request created by properties directly with a procurement status set to Drafting ( `DRAFTING` ) or Declined ( `DECLINED` ), you can modify the following properties:\n- Auto-delete\n- Description\n- Name prefix\n- GPUs\n- Local SSDs and the disk interface type\n- Machine series and machine type\n- Minimum CPU platform\n- Share settings\n- Start and end time of the reservation period\n- Total count (Number of VMs)\nYou can modify a draft or declined future reservation request that was created by specifying properties directly using the Google Cloud console, gcloud CLI, and REST.\nTo request Google Cloud to modify a draft or declined future reservation request created by specifying properties directly, follow these steps:- In the Google Cloud console, go to the **Reservations** page. [Go to Reservations](https://console.cloud.google.com/compute/reservations) \n- Click the **Future reservations** tab.\n- In the **Name** column, click the name of the future reservation request that you want to modify.The details page of the selected future reservation request opens.\n- To modify the future reservation request, click edit **Edit** or edit **Edit draft** .The page to edit the selected future reservation request opens.\n- Do one or more of the following:- In the **Prefix** field, enter a new name prefix.\n- In the **Description** field, enter a new description.\n- Modify the **Start time** or **End time** for your future reservation request. Make sure of the following:- The start time can't be later than 1 year from the date and time at which you submit a future reservation request for review.\n- Specify a [recommended value for the start time](/compute/docs/instances/future-reservations-overview#recommended-start-time) to ensure that you have sufficient time before your future reservation enters its lock time.\n- Specify a [recommended minimum reservation period](/compute/docs/instances/future-reservations-overview#recommended-minimum-reservation-period) to increase the likelihood that Google Cloud approves your request after submitting it for review.\n- In the **Share type** section, you can select either **Local** or **Shared** . If you select **Shared** , you can add or remove projects to share the future reservation request with.You can select up to 100 projects. These projects must be in the same organization as the project where the future reservation request was created (the owner project). Don't specify the owner project. By default, it is already allowed to consume the shared auto-created reservations for this future reservation request.\n- In the **Number of VM instances** enter the total count of VMs that you want reserved for the period, VM configuration, and project(s) specified in this future reservation request.When calculating the number of reservations to create for an approved future reservation, Compute Engine first checks for existing reservations. If there are existing reservations that match the approved future reservation, the number of existing reservations is subtracted from the requested total number of reservations in the request to determine the number of new reservations that Compute Engine creates. For more information, see how Compute Engine [counts and provisions reserved resources](/compute/docs/instances/future-reservations-overview#count-reserved-resources) . **Caution** : Make sure to have sufficient quota for the resources that you're requesting to reserve. Otherwise, Google Cloud declines your future reservation request.\n- In the **Machine configuration** section, you can change the following:- The machine series and machine type used in the reserved VMs.\n- The GPUs to attach to the reserved VMs.\n- The Local SSDs and the disk interface type of the reserved VMs.\n- Depending on the procurement status of the future reservation request that you're modifying, do one of the following:- For a draft future reservation request, select one of the following options:- To save your changes, click **Save draft** .\n- To submit the draft future reservation request to Google Cloud for review, click **Submit** .\n- For a declined future reservation request, you can only submit it for review by clicking **Submit** .If you submit a request, the **Reservations** page opens. Otherwise, the details page of the future reservation request opens.\nTo request Google Cloud to modify a draft or declined future reservation request created by specifying properties directly, use the [gcloud beta compute future-reservations update command](/sdk/gcloud/reference/beta/compute/future-reservations/update) .\n```\ngcloud beta compute future-reservations update FUTURE_RESERVATION_NAME \\\n --accelerator=count=NUMBER_OF_ACCELERATORS,type=ACCELERATOR_TYPE \\\n --description=\"DESCRIPTION\" \\\n --local-ssd=size=375,interface=INTERFACE_1 \\\n --local-ssd=size=375,interface=INTERFACE_2 \\\n --machine-type=MACHINE_TYPE \\\n --min-cpu-platform=MIN_CPU_PLATFORM \\\n --name-prefix=NAME_PREFIX \\\n --planning-status=PLANNING_STATUS \\\n --project=PROJECT_ID \\\n --share-setting=SHARE_SETTING \\\n --share-with=CONSUMER_PROJECT_IDS \\\n --start-time=START_TIME \\\n --end-time=END_TIME \\\n --total-count=TOTAL_COUNT \\\n --zone=ZONE\n```\nReplace the following:- ``: the name of an existing draft or declined future reservation request.\n- Optional. Do one of the following:- To add [graphics processing units (GPUs)](/compute/docs/gpus) to each reserved VM, specify the following:- `` : the number of GPUs to add per reserved VM.\n- `` : the type of GPU to add to the reserved VMs.\nMake sure that the machine type you specify in the future reservation request supports the types of GPUs you specify and that [the GPU is available in the zone](/compute/docs/gpus/gpu-regions-zones) where you want to reserve resources. Otherwise, you encounter errors.\n- To remove all GPUs from this future reservation request, replace the `--accelerator` flag with the `--clear-accelerator` flag.- ``: Optional. A new description for the future reservation request.\n- Optional. Do one of the following:- To add or edit the type of interface you want the [local SSDs](/compute/docs/disks#localssds) for each VM to use, replace the `` and `` . The value must be one of the following:- If your boot disk image [has optimized NVMe drivers](/compute/docs/disks/local-ssd#choose_an_interface) , specify `nvme` .\n- Otherwise, specify `scsi` .\nEach local SSD is 375 GB. Repeat the `--local-ssd` flag for each local SSD that you want to add. You can specify a maximum of 24 local SSDs.\n- To remove all local SSDs from this future request reservation, remove all `--local-ssd` flags and specify the `--clear-local-ssd` flag.\n- `` : Optional. A predefined or custom [machine type](/compute/docs/machine-types) to use for each VM. Before specifying a custom machine type, review the [limitations](/compute/docs/instances/creating-instance-with-custom-machine-type#limitations) for VMs with custom machine types. **Note:** If you specify a different machine series than the one you previously specified, make sure to specify a [recommended minimum reservation period](/compute/docs/instances/future-reservations-overview#recommended-minimum-reservation-period) for the machine series you're specifying. Otherwise, Google Cloud is less likely to approve your request.\n- `` : Optional. The [minimum CPU platform](/compute/docs/instances/specify-min-cpu-platform) to use for each VM. If you omit the `--min-cpu-platform` flag, its value is set to the zone's [default CPU platform](/compute/docs/instances/specify-min-cpu-platform#availablezones) .\n- ``: Optional. A new name prefix for the future reservation request. The name of each auto-created reservation for this future reservation request starts with the name prefix. To help you identify the auto-created reservations for this future reservation request, specifying an unique name prefix is recommended.\n- `` : the planning status of the future reservation request. You can only specify `SUBMITTED` , which submits the future reservation request to Google Cloud for review. **Note** : If you're modifying a draft future reservation request and want to save your changes instead of submitting your request to Google Cloud for review, omit the`--planning-status`flag.\n- ``: Optional. The ID of the project where the future reservation request was created. If you modify a single-project future reservation request into a shared future reservation request, this project becomes the owner project of the future reservation request. If you omit the`--project`flag, the value is set to the ID of the current project.\n- `` : Optional. To change the type of this future reservation request, specify one of the following values:- To change a single-project future reservation request into a shared future reservation request, specify `projects` . Make sure to specify at least one consumer project using the `--share-with` flag. Otherwise, modifying the future reservation fails.\n- Otherwise, specify `local` . **Important:** If you specify `local` , make sure to omit the `--share-with` flag. Otherwise, modifying the future reservation request fails.\n- `` : Optional. A comma-separated list of the [project IDs](/resource-manager/docs/creating-managing-projects#identifying_projects) of projects that this future reservation request can be shared with. For example, specify `project-1,project-2` . You can specify up to 100 projects. These projects must be in the same organization as the project where this future reservation request was created (the owner project). Don't specify the owner project. By default, it is already allowed to consume the shared auto-created reservations for this future reservation request.\n- `` : Optional. The new start time of the reservation period formatted as an [RFC 3339 timestamp](https://tools.ietf.org/html/rfc3339) , which must be as follows:```\nYYYY-MM-DDTHH:MM:SSOFFSET\n```Replace the following:- `` : a data formatted as a 4-digit year, 2-digit month, and a 2-digit day of the month, separated by hyphens ( `-` ).\n- `` : a time formatted as a 2-digit hour using a 24-hour time, 2-digit minutes, and 2-digit seconds, separated by colons ( `:` ).\n- `` : the time zone formatted as an offset of [Coordinated Universal Time (UTC)](https://en.wikipedia.org/wiki/Coordinated_Universal_Time) . For example, to use the Pacific Standard Time (PST), specify `-08:00` . Alternatively, to use no offset, specify `Z` .\nThe start time can't be later than 1 year from the date and time at which you submit a future reservation request for review. To have sufficient time to optionally cancel, delete, or modify a future reservation after it's approved or before it enters its lock time, make sure to specify a [recommended start time](/compute/docs/instances/future-reservations-overview#recommended-start-time) .\n- `` : Optional. The new end time of the reservation period formatted as an RFC 3339 timestamp. The reservation period must last at least 24 hours. Alternatively, you can replace the `--end-time` flag with the `--duration=` `` flag where `` is the duration of the reservation period in seconds. For example, specify `1209600` for 1,209,600 seconds (14 days).To increase the likelihood that Google Cloud approves a future reservation request after you submit it for review, make sure to specify one of the [recommended values for your reservation period](/compute/docs/instances/future-reservations-overview#recommended-minimum-reservation-period) . **Important:** Make sure that your reservation period doesn't overlap with the reservation period of another existing future reservation request with matching VM properties and zone, and that was created in or is shared with your current project. Otherwise, modifying the future reservation request [fails](/compute/docs/troubleshooting/troubleshoot-future-reservations#overlapping-reservation-periods) .\n- `` : Optional. The new total number of VMs that you want reserved for the period, VM configuration, and project(s) specified in this future reservation request.When calculating the number of reservations to create for an approved future reservation, Compute Engine first checks for existing reservations. If there are existing reservations that match the approved future reservation, the number of existing reservations is subtracted from the requested total number of reservations in the request to determine the number of new reservations that Compute Engine creates. For more information, see how Compute Engine [counts and provisions reserved resources](/compute/docs/instances/future-reservations-overview#count-reserved-resources) . **Caution:** Make sure that you have sufficient quota for the resources that you're requesting to reserve. Otherwise, Google Cloud declines your future reservation request.Caution: Make sure to have sufficient quota for the resources that you're requesting to reserve. Otherwise, Google Cloud declines your future reservation request.\n- ``: the zone where the future reservation request is located.\nOptionally, you can also change if and when Compute Engine automatically deletes the auto-created reservations for a future reservation request by doing one of the following:- To enable Compute Engine to automatically delete the auto-created reservations after the end time of the reservation period, select one of the following methods: **Caution:** If you enable the auto-delete option, all the auto-created reservations are deleted at the specified deletion time regardless if they're fully consumed or not.- To delete the reservations within 2 hours after the end time (default), specify the `--auto-delete-auto-created-reservations` flag.```\ngcloud beta compute future-reservations update example-future-reservation \\\n --auto-delete-auto-created-reservations\n```\n- To delete the auto-created reservations at a specific time after the end time of the reservation period, specify the `--auto-delete-auto-created-reservations` and `--auto-created-reservations-delete-time` flags.```\ngcloud beta compute future-reservations update example-future-reservation \\\n --auto-delete-auto-created-reservations \\\n --auto-created-reservations-delete-time=AUTO_CREATED_RESERVATIONS_DELETE_TIME\n```Replace `` with a date and time formatted as an RFC 3339 timestamp.\n- To delete the auto-created reservations after a specific duration after the end time of the reservation period, specify the `--auto-delete-auto-created-reservations` and `--auto-created-reservations-duration` flags.```\ngcloud beta compute future-reservations update example-future-reservation \\\n --auto-delete-auto-created-reservations \\\n --auto-created-reservations-duration=DURATION_BEFORE_DELETE\n```Replace `` with a duration in days, hours, minutes or seconds. For example, specify `30m` for 30 minutes, or `1d2h3m4s` for 1 day, 2 hours, 3 minutes, and 4 seconds.\n- To disable Compute Engine from automatically deleting the auto-created reservations, specify the `--no-auto-delete-auto-created-reservations` flag.```\ngcloud beta compute future-reservations update example-future-reservation \\\n --no-auto-delete-auto-created-reservations\n```\nFor example, consider a draft shared future reservation request named `fr-03` and located in zone `us-central1-a` . Suppose that you want to modify this shared future reservation request by making the following changes:- Convert it into a single-project future reservation request.\n- Disable the auto-delete option.\n- Reserve 100 VMs.\n- Submit the future reservation request to Google Cloud for approval.\nTo modify `fr-03` , run the following command:\n```\ngcloud beta compute future-reservations update fr-03 \\\n --clear-share-settings \\\n --no-auto-delete-auto-created-reservations \\\n --planning-status=SUBMITTED \\\n --project=example-project \\\n --total-count=100 \\\n --zone=us-central1-a\n```\nTo request Google Cloud to modify a draft or declined future reservation request created by specifying properties directly, make a `PATCH` request to the [beta.futureReservations.update method](/compute/docs/reference/rest/beta/futureReservations/update) . In the `updateMask` query parameter, specify each field that you want to update. If you need to delete an optional field from your reservation, then include that field in the `updateMask` query parameter and omit that field from the request body.\n```\nPATCH https://compute.googleapis.com/compute/beta/projects/PROJECT_ID/zones/ZONE/futureReservations/FUTURE_RESERVATION_NAME?updateMask=UPDATE_FIELDS{  \"autoDeleteAutoCreatedReservations\": \"AUTO_DELETE_AUTO_CREATED_RESERVATIONS\",  \"description\": \"DESCRIPTION\",  \"name\": \"FUTURE_RESERVATION_NAME\",  \"namePrefix\": \"NAME_PREFIX\",  \"planningStatus\": \"PLANNING_STATUS\",  \"shareSettings\": {    \"projects\": [      \"CONSUMER_PROJECT_ID_1\",      \"CONSUMER_PROJECT_ID_2\"    ],    \"shareType\": \"SHARE_TYPE\"  },  \"specificSkuProperties\": {     \"instanceProperties\": {      \"guestAccelerators\": [        {          \"acceleratorCount\": NUMBER_OF_ACCELERATORS,          \"acceleratorType\": \"ACCELERATOR_TYPE\"        }      ],      \"localSsds\": [        {          \"diskSizeGb\": \"375\",          \"interface\": \"INTERFACE_1\"        },        {          \"diskSizeGb\": \"375\",          \"interface\": \"INTERFACE_2\"        }      ],      \"machineType\": \"MACHINE_TYPE\",      \"minCpuPlatform\": \"MINIMUM_CPU_PLATFORM\"    },    \"totalCount\": \"TOTAL_COUNT\"  },  \"timeWindow\": {    \"endTime\": \"END_TIME\",    \"startTime\": \"START_TIME\"  }}\n```\nReplace the following:- `` : the ID of the project where the future reservation request is located.\n- `` : the zone where the future reservation request is located.\n- `` : the name of an existing draft or declined future reservation request. You can't modify the name of a future reservation request.\n- `` : a comma-separated list of fields to update in this `PATCH` request. You must encode each comma as `%2C` . For example, if you want to update the `autoDeleteAutoCreatedReservations` , `totalCount` , and `endTime` fields in your future reservation request, specify the following:```\nautoDeleteAutoCreatedReservations%2CspecificSkuProperties.totalCount%2CtimeWindow.endTime\n```\n- `` : Optional. If you set this field to `true` , Compute Engine automatically deletes the auto-created reservations for this future reservation reservation request. By default, the deletion time is within 2 hours after the end time of the reservation period. To change this, do one of the following: **Caution:** If you enable the auto-delete option, all the auto-created reservations are deleted at the specified deletion time regardless if they're fully consumed or not.- To delete the auto-created reservations at a specific time after the end time of your reservation period, set the `autoDeleteAutoCreatedReservations` to `true` and specify the `autoCreatedReservationsDeleteTime` field.```\nPATCH https://compute.googleapis.com/compute/beta/projects/example-project/zones/us-central1-a/futureReservations/example-future-reservation?updateMask=autoDeleteAutoCreatedReservations%2CautoCreatedReservationsDeleteTime{  \"autoDeleteAutoCreatedReservations\": \"true\",  \"autoCreatedReservationsDeleteTime\": \"DELETE_TIME\"}\n```Replace `` with a date and time when Compute Engine deletes reservations. The date and time must be formatted as an [RFC 3339 timestamp](https://tools.ietf.org/html/rfc3339) , which must be as follows:```\nYYYY-MM-DDTHH:MM:SSOFFSET\n```Replace the following:- `` : a data formatted as a 4-digit year, 2-digit month, and a 2-digit day of the month, separated by hyphens ( `-` ).\n- `` : a time formatted as a 2-digit hour using a 24-hour time, 2-digit minutes, and 2-digit seconds, separated by colons ( `:` ).\n- `` : the time zone formatted as an offset of [Coordinated Universal Time (UTC)](https://en.wikipedia.org/wiki/Coordinated_Universal_Time) . For example, to use the Pacific Standard Time (PST), specify `-08:00` . Alternatively, to use no offset, specify `Z` .\n- To delete the auto-created reservations after a specific duration from the start time of the reservation period, set the `autoDeleteAutoCreatedReservations` to `true` and specify the `autoCreatedReservationsDuration` field.```\nPATCH https://compute.googleapis.com/compute/beta/projects/example-project/zones/us-central1-a/futureReservations/example-future-reservation?updateMask=autoDeleteAutoCreatedReservations%2CautoCreatedReservationsDuration{  \"autoDeleteAutoCreatedReservations\": \"true\",  \"autoCreatedReservationsDuration\": {    \"seconds\": \"DURATION_BEFORE_DELETE\"  }}\n```Replace `` with a duration in seconds. For example, specify `604800` for 604,800 seconds (7 days).\n- `` : Optional. To update the description for this future reservation request, do one of the following:- To add or update a description, specify a description.\n- To remove the description, delete the `description` field from the request body and specify it in `` .\n- `` : Optional. A new name prefix for the future reservation request. The name of each auto-created reservation for this future reservation request starts with the name prefix. To help you identify the auto-created reservations for this future reservation, specifying an unique name prefix is recommended.\n- `` : the planning status of the future reservation request. You can only specify `SUBMITTED` , which submits the future reservation request to Google Cloud for review. **Note** : If you're modifying a draft future reservation request and want to save your changes instead of submitting your request to Google Cloud for review, omit the`planningStatus`field.\n- `` : Optional. To change the share type of this future reservation request, specify one of the following values:- To change a single-project future reservation request into a shared future reservation request, specify `SPECIFIC_PROJECTS` . Additionally, you must specify at least one consumer project in the `projects` field. Otherwise, modifying the future reservation request fails.\n- Otherwise, specify `LOCAL` . Additionally, you must delete the `projects` field from the request body and specify it in `` . Otherwise, modifying the future reservation request fails.\n- `` and `` : Optional. The [project IDs](/resource-manager/docs/creating-managing-projects#identifying_projects) of projects that a shared future reservation request can be shared with. You can specify up to 100 projects. These projects must be in the same organization as the project where the future reservation request was created (the owner project). Don't specify the owner project. By default, it is already allowed to consume the shared auto-created reservations for this future reservation request.\n- Optional. To update the [graphics processing units (GPUs)](/compute/docs/gpus) attached to each reserved VM, do one of the following:- To add or modify GPUs, specify the following:- `` : the number of GPUs to add per reserved VM.\n- `` : the type of GPU to add to the reserved VMs.\nMake sure that the machine type you specify in the future reservation request supports the types of GPUs you specify and that [the GPU is available in the zone](/compute/docs/gpus/gpu-regions-zones) where you want to reserve resources. Otherwise, you encounter errors.\n- To remove all GPUs from this future reservation request, omit the `guestAccelerators` field in the request body and specify it in `` .\n- Optional. To update the local SSDs attached to each reserved VM, do one of the following:- To add or edit the type of interface you want the [local SSDs](/compute/docs/disks#localssds) for each VM to use, replace the `` and `` . The value must be one of the following:- If your boot disk image [has optimized NVMe drivers](/compute/docs/disks/local-ssd#choose_an_interface) , specify `NVME` .\n- Otherwise, specify `SCSI` .\nRepeat the `diskSizeGb` and `interface` fields for each local SSD that you want to add or update. You can specify a maximum of 24 local SSDs.\n- To remove all local SSDs from this future request reservation, delete the `localSsds` field from the request body and specify it in `` .\n- `` : Optional. A predefined or custom [machine type](/compute/docs/machine-types) to use for each VM. Before specifying a custom machine type, review the [limitations](/compute/docs/instances/creating-instance-with-custom-machine-type#limitations) for VMs with custom machine types. **Note:** If you specify a different machine series than the one you previously specified, make sure to specify a [recommended minimum reservation period](/compute/docs/instances/future-reservations-overview#recommended-minimum-reservation-period) for the machine series you're specifying. Otherwise, Google Cloud is less likely to approve your request.\n- `` : Optional. To update the [minimum CPU platform](/compute/docs/instances/specify-min-cpu-platform) to use for each VM, do one of the following:- To add or update the minimum CPU platform, specify a minimum CPU platform.\n- To revert back to the zone's [default CPU platform](/compute/docs/instances/specify-min-cpu-platform#availablezones) , delete the `minCpuPlatform` field from the request body and specify it in `` .- `` : Optional. The new total number of VMs that you want reserved for the period, VM configuration, and project(s) specified in this future reservation request.When calculating the number of reservations to create for an approved future reservation, Compute Engine first checks for existing reservations. If there are existing reservations that match the approved future reservation, the number of existing reservations is subtracted from the requested total number of reservations in the request to determine the number of new reservations that Compute Engine creates. For more information, see how Compute Engine [counts and provisions reserved resources](/compute/docs/instances/future-reservations-overview#count-reserved-resources) . **Caution:** Make sure to have sufficient quota for the resources that you're requesting to reserve. Otherwise, Google Cloud declines your future reservation request.\n- `` : Optional. The new start time of the reservation period formatted as an RFC 3339 timestamp. The start time can't be later than 1 year from the date and time at which you submit a future reservation request for review. Additionally, make sure to specify a [recommended start time](/compute/docs/instances/future-reservations-overview#recommended-start-time) to ensure that you have sufficient time before a future reservation enters its lock time.\n- `` : Optional. The new end time of the reservation period formatted as an RFC 3339 timestamp. The reservation period must last at least 24 hours. Alternatively, you can replace the `endTime` field with the `duration` field to specify a specific duration from the start time of the reservation period:```\n\"duration\": {  \"seconds\": \"END_DURATION\"}\n```Replace `` with a duration in seconds. For example, specify `1209600` for 1,209,600 seconds (14 days).To increase the likelihood that Google Cloud approves a future reservation request after you submit it for review, make sure to specify one of the [recommended values for your reservation period](/compute/docs/instances/future-reservations-overview#recommended-minimum-reservation-period) . **Important:** Make sure that your reservation period doesn't overlap with the reservation period of another existing future reservation request with matching VM properties and zone, and that was created in or is shared with your current project. Otherwise, modifying the future reservation request [fails](/compute/docs/troubleshooting/troubleshoot-future-reservations#overlapping-reservation-periods) .\nFor example, consider a draft shared future reservation request named `fr-03` and located in zone `us-central1-a` . Suppose that you want to modify this shared future reservation request by making the following changes:- Convert it into a single-project future reservation request.\n- Disable the auto-delete option.\n- Reserve 100 VMs.\n- Submit the future reservation request to Google Cloud for approval.\nTo modify `fr-03` , make the following `PATCH` request:\n```\nPATCH https://compute.googleapis.com/compute/beta/projects/example-project/zones/us-central1-a/futureReservations/fr-03?updateMask=autoDeleteAutoCreatedReservations%2CplanningStatus%2CshareSettings.shareType%2CspecificSkuProperties.totalCount{  \"autoDeleteAutoCreatedReservations\": \"false\",  \"name\": \"fr-03\",  \"planningStatus\": \"SUBMITTED\",  \"shareSettings\": {    \"shareType\": \"LOCAL\"  },  \"specificSkuProperties\": {    \"totalCount\": \"100\"  }}\n```\nAfter you submit a future reservation request to Google Cloud for review, [view its details](/compute/docs/instances/view-future-reservations#view-details-future-reservation) to monitor its procurement status.\n### Modify an approved or procuring future reservation\nTo modify the properties of an approved or procuring future reservation, select one of the following methods:\n- [Modify an approved or procuring future reservation without review](#modify-without-submission) .This section explains how to modify the auto-delete option, description, and name prefix in an approved or procuring future reservation without review. Modifying these properties is immediate, and there are no limits to the number of times you can change them until Google Cloud starts creating the reservations.\n- [Request to modify an approved or procuring future reservation](#modify-with-submission) .This section explains how to request Google Cloud to modify one or more properties in an approved or procuring future reservation. You can only submit a request to modify a future reservation with a procurement status of Procuring ( `PROCURING` ).For a future reservation with a procurement status set to Approved ( `APPROVED` ) or Procuring ( `PROCURING` ), you can modify the following fields without approval from Google Cloud:\n- Auto-delete\n- Description\n- Name prefix\nModifying these properties is immediate. Until the start time of a future reservation's reservation period, there are no limits to the number of times you can modify these properties.\nYou can modify an approved or procuring future reservation without review using the Google Cloud console, gcloud CLI, and REST.\nTo modify an approved or procuring future reservation without review, follow these steps:- In the Google Cloud console, go to the **Reservations** page. [Go to Reservations](https://console.cloud.google.com/compute/reservations) \n- Click the **Future reservations** tab.\n- In the **Name** column, click the name of the future reservation that you want to modify.The details page of the selected future reservation opens.\n- If you want to modify the auto-delete option and description of a future reservation, do one or more of the following:- In the **Auto-created reservations auto-delete time** row, click edit **Edit** , and then follow these steps:- Do one of the following:- To enable Compute Engine to automatically delete the auto-created reservations for your future reservation request, do the following: **Caution:** If the auto-delete option is enabled, all the auto-created reservations are deleted at the specified deletion time regardless if they're fully consumed or not.- Click the **Enable auto-delete** toggle to the on position.\n- Optional: In the **Auto-delete time** field, enter a new date and time when to delete the auto-created reservations. The date and time must be after the end time of the reservation period. If you leave this field empty, the auto-created reservations are deleted within 2 hours after the end time of the reservation period.\n- Otherwise, click the **Enable auto-delete** toggle to the off position.\n- Click **Submit** .\n- In the **Prefix** row, click edit **Edit** , and then do the following:- In the **Prefix** field, enter a new name prefix.\n- Click **Submit** .\n- In the **Description** row, click edit **Edit** , and then do the following:- In the **Description** field, enter a new description.\n- Click **Submit** .\nTo modify an approved or procuring future reservation without review, use the [gcloud beta compute future-reservations update command](/sdk/gcloud/reference/beta/compute/future-reservations/update) .\n```\ngcloud beta compute future-reservations update FUTURE_RESERVATION_NAME \\\n --description=\"DESCRIPTION\" \\\n --name-prefix=NAME_PREFIX \\\n --project=PROJECT_ID \\\n --zone=ZONE\n```\nReplace the following:- ``: the name of an existing approved or procuring future reservation.\n- ``: Optional. A new description for the future reservation.\n- ``: Optional. A new name prefix for the future reservation. The name of each auto-created reservation for this future reservation starts with the name prefix. To help you identify the auto-created reservations for this future reservation, specifying an unique name prefix is recommended.\n- ``: Optional. The ID of the project where the future reservation was created.\n- ``: the zone where the future reservation is located.\nOptionally, you can also change if and when Compute Engine automatically deletes the auto-created reservations for a future reservation by doing one of the following:- To enable Compute Engine to automatically delete the auto-created reservations after the end time of the reservation period, select one of the following methods: **Caution:** If you enable the auto-delete option, all the auto-created reservations are deleted at the specified deletion time regardless if they're fully consumed or not.- To delete the reservations within 2 hours after the end time (default), specify the `--auto-delete-auto-created-reservations` flag.```\ngcloud beta compute future-reservations update example-future-reservation \\\n --auto-delete-auto-created-reservations\n```\n- To delete the auto-created reservations at a specific time after the end time of the reservation period, specify the `--auto-delete-auto-created-reservations` and `--auto-created-reservations-delete-time` flags.```\ngcloud beta compute future-reservations update example-future-reservation \\\n --auto-delete-auto-created-reservations \\\n --auto-created-reservations-delete-time=AUTO_CREATED_RESERVATIONS_DELETE_TIME\n```Replace `` with a date and time formatted as an RFC 3339 timestamp.\n- To delete the auto-created reservations after a specific duration after the end time of the reservation period, specify the `--auto-delete-auto-created-reservations` and `--auto-created-reservations-duration` flags.```\ngcloud beta compute future-reservations update example-future-reservation \\\n --auto-delete-auto-created-reservations \\\n --auto-created-reservations-duration=DURATION_BEFORE_DELETE\n```Replace `` with a duration in days, hours, minutes or seconds. For example, specify `30m` for 30 minutes, or `1d2h3m4s` for 1 day, 2 hours, 3 minutes, and 4 seconds.\n- To disable Compute Engine from automatically deleting the auto-created reservations, specify the `--no-auto-delete-auto-created-reservations` flag.```\ngcloud beta compute future-reservations update example-future-reservation \\\n --no-auto-delete-auto-created-reservations\n```\nFor example, consider an approved future reservation named `fr-04` and located in zone `us-central1-a` . Suppose that you want to modify this future reservation by making the following changes:- Enable the auto-delete option.\n- Automatically delete the auto-created reservations after 864,000 seconds (10 days).\n- Specify a new name prefix.\nTo modify `fr-04` , run the following command:\n```\ngcloud beta compute future-reservations update fr-04 \\\n --auto-delete-auto-created-reservations \\\n --auto-created-reservations-duration=864000 \\\n --name-prefix=new-prefix \\\n --project=example-project \\\n --zone=us-central1-a\n```\nTo modify an approved or procuring future reservation without review, make a `PATCH` request to the [beta.futureReservations.update method](/compute/docs/reference/rest/beta/futureReservations/update) . In the `updateMask` query parameter, specify each field that you want to update. If you need to delete an optional field from your reservation, then include that field in the `updateMask` query parameter and omit that field from the request body.\n```\nPATCH https://compute.googleapis.com/compute/beta/projects/PROJECT_ID/zones/ZONE/futureReservations/FUTURE_RESERVATION_NAME?updateMask=UPDATE_FIELDS{  \"autoDeleteAutoCreatedReservations\": \"AUTO_DELETE_AUTO_CREATED_RESERVATIONS\",  \"description\": \"DESCRIPTION\",  \"name\": \"FUTURE_RESERVATION_NAME\",  \"namePrefix\": \"NAME_PREFIX\"}\n```\nReplace the following:- `` : the ID of the project where the future reservation is located.\n- `` : the zone where the future reservation is located.\n- `` : the name of an existing approved or procuring future reservation. You can't modify the name of a future reservation.\n- `` : a comma-separated list of fields to update in this `PATCH` request. You must encode each comma as `%2C` . For example, if you want to update the `description` and `namePrefix` fields in your future reservation, specify the following:```\ndescription%2CnamePrefix\n```\n- `` : Optional. If you set this field to `true` , Compute Engine automatically deletes the auto-created reservations for this future reservation reservation. By default, the deletion time is within 2 hours after the end time of the reservation period. To change this, do one of the following: **Caution:** If you enable the auto-delete option, all the auto-created reservations are deleted at the specified deletion time regardless if they're fully consumed or not.- To delete the auto-created reservations at a specific time after the end time of your reservation period, set the `autoDeleteAutoCreatedReservations` to `true` and specify the `autoCreatedReservationsDeleteTime` field.```\nPATCH https://compute.googleapis.com/compute/beta/projects/example-project/zones/us-central1-a/futureReservations/example-future-reservation?updateMask=autoDeleteAutoCreatedReservations%2CautoCreatedReservationsDeleteTime{  \"autoDeleteAutoCreatedReservations\": \"true\",  \"autoCreatedReservationsDeleteTime\": \"DELETE_TIME\"}\n```Replace `` with a date and time when Compute Engine deletes reservations. The date and time must be formatted as an [RFC 3339 timestamp](https://tools.ietf.org/html/rfc3339) , which must be as follows:```\nYYYY-MM-DDTHH:MM:SSOFFSET\n```Replace the following:- `` : a data formatted as a 4-digit year, 2-digit month, and a 2-digit day of the month, separated by hyphens ( `-` ).\n- `` : a time formatted as a 2-digit hour using a 24-hour time, 2-digit minutes, and 2-digit seconds, separated by colons ( `:` ).\n- `` : the time zone formatted as an offset of [Coordinated Universal Time (UTC)](https://en.wikipedia.org/wiki/Coordinated_Universal_Time) . For example, to use the Pacific Standard Time (PST), specify `-08:00` . Alternatively, to use no offset, specify `Z` .\n- To delete the auto-created reservations after a specific duration from the start time of the reservation period, set the `autoDeleteAutoCreatedReservations` to `true` and specify the `autoCreatedReservationsDuration` field.```\nPATCH https://compute.googleapis.com/compute/beta/projects/example-project/zones/us-central1-a/futureReservations/example-future-reservation?updateMask=autoDeleteAutoCreatedReservations%2CautoCreatedReservationsDuration{  \"autoDeleteAutoCreatedReservations\": \"true\",  \"autoCreatedReservationsDuration\": {    \"seconds\": \"DURATION_BEFORE_DELETE\"  }}\n```Replace `` with a duration in seconds. For example, specify `604800` for 604,800 seconds (7 days).\n- `` : Optional. To update the description for this future reservation, do one of the following:- To add or update a description, specify a description.\n- To remove the description, delete the `description` field from the request body and specify it in `` .\n- `` : Optional. A new name prefix for the future reservation. The name of each auto-created reservation for this future reservation starts with the name prefix. To help you identify the auto-created reservations for this future reservation, specifying an unique name prefix is recommended.\nFor example, consider an approved future reservation named `fr-04` and located in zone `us-central1-a` . Suppose that you want to modify this future reservation by making the following changes:- Enable the auto-delete option.\n- Automatically delete the auto-created reservations after 864,000 seconds (10 days).\n- Specify a new name prefix.\nTo modify `fr-04` , make the following `PATCH` request:\n```\nPATCH https://compute.googleapis.com/compute/beta/projects/example-project/zones/us-central1-a/futureReservations/fr-04?updateMask=autoDeleteAutoCreatedReservations%2CautoCreatedReservationsDuration%2CnamePrefix{  \"autoDeleteAutoCreatedReservations\": \"true\",  \"autoCreatedReservationsDuration\": {    \"seconds\": \"864000\"  },  \"name\": \"fr-04\",  \"namePrefix\": \"new-prefix\"}\n```\nYou can request Google Cloud to modify a future reservation with a procurement status set to Approved ( `APPROVED` ) or Procuring ( `PROCURING` ) as follows:\n- If you request to modify an approved future reservation, then Google Cloud does one of the following:- **Approves the request** and sets the procurement status to Approved ( `APPROVED` ). If the start time of the reservation period is within 56 days (8 weeks), Compute Engine sets the procurement status to Procuring ( `PROCURING` ) within a few minutes.\n- **Declines the request** and sets the procurement status to Declined ( `DECLINED` ). If you want to modify the future reservation again, see [Modify a draft or declined future reservation](/compute/docs/instances/manage-future-reservations#modify-draft-future-reservation) in this document.\n- If you request to modify a procuring future reservation, Compute Engine creates the [update status](/compute/docs/instances/future-reservations-overview#future-reservations-update-status) in the future reservation, and sets it to Update pending approval ( `AMENDMENT_PENDING_APPROVAL` ). Then, Google Cloud reviews your request and does one of the following:- **Approves the request** and sets the update status to Update approved ( `AMENDMENT_APPROVED` ).\n- **Declines the request** , sets the update status to Update declined ( `AMENDMENT_DECLINED` ), and keeps using the previously-approved properties for the auto-created reservations.\nDuring the time Google Cloud reviews your request to modify a procuring future reservation, you can't modify property—including the properties you can normally [modify without approval](#modify-without-submission) —until Google Cloud approves or declines your request.\nTo request Google Cloud to modify the properties of an approved or procuring future reservation, select one of the following methods:\n- [Request to modify a future reservation created by specifying an instance template](#modify-submitted-from-instance-template) .This section explains how to request Google Cloud to modify one or more properties in an approved and submitted future reservation created by specifying an instance template. You can't replace the instance template used to create the future reservation or override its VM properties.\n- [Request to modify a future reservation created by specifying properties directly](#modify-submitted-properties-directly) .This section explains how to request Google Cloud to modify one or more properties in a submitted and approved future reservation created by specifying properties directly.For a future reservation created by specifying an instance template with a procurement status of Approved ( `APPROVED` ) or Procuring ( `PROCURING` ), you can request to modify the following properties:\n- Auto-delete\n- Description\n- Name prefix\n- Share settings\n- Start and end time of the reservation period\n- Total count (Number of VMs) \nIf you request to largely increase or decrease the total count within 14 days from the future reservation's start time, then Google Cloud is likely to decline your request.\nYou can request Google Cloud to modify a future reservation created by specifying an instance template using the gcloud CLI and REST.\nTo request Google Cloud to modify an approved or procuring future reservation created by specifying an instance template, follow these steps:- In the Google Cloud console, go to the **Reservations** page. [Go to Reservations](https://console.cloud.google.com/compute/reservations) \n- Click the **Future reservations** tab.\n- In the **Name** column, click the name of the future reservation that you want to modify.The details page of the selected future reservation opens.\n- If you want to modify the auto-delete option and description of a future reservation, do one or more of the following:- In the **Auto-created reservations auto-delete time** row, click edit **Edit** , and then follow these steps:- Do one of the following:- To enable Compute Engine to automatically delete the auto-created reservations for your future reservation request, do the following: **Caution:** If the auto-delete option is enabled, all the auto-created reservations are deleted at the specified deletion time regardless if they're fully consumed or not.- Click the **Enable auto-delete** toggle to the on position.\n- Optional: In the **Auto-delete time** field, enter a new date and time when to delete the auto-created reservations. The date and time must be after the end time of the reservation period. If you leave this field empty, the auto-created reservations are deleted within 2 hours after the end time of the reservation period.\n- Otherwise, click the **Enable auto-delete** toggle to the off position.\n- Click **Submit** .\n- In the **Prefix** row, click edit **Edit** , and then do the following:- In the **Prefix** field, enter a new name prefix.\n- Click **Submit** .\n- In the **Description** row, click edit **Edit** , and then do the following:- In the **Description** field, enter a new description.\n- Click **Submit** .\n- Click edit **Edit** .The page to edit the selected future reservation opens.\n- If you want to modify other properties, do one or more of the following:- Modify the **Start time** or **End time** for your future reservation. Make sure of the following:- The start time can't be later than 1 year from the date and time at which you submit a future reservation for review.\n- Specify a [recommended value for the start time](/compute/docs/instances/future-reservations-overview#recommended-start-time) to ensure that you have sufficient time before your future reservation enters its lock time.\n- Specify a [recommended minimum reservation period](/compute/docs/instances/future-reservations-overview#recommended-minimum-reservation-period) to increase the likelihood that Google Cloud approves your request after submitting it for review.\n- In the **Share type** section, you can select either **Local** or **Shared** . If you select **Shared** , you can add or remove projects to share the future reservation with.You can select up to 100 projects. These projects must be in the same organization as the project where the future reservation was created (the owner project). Don't specify the owner project. By default, it is already allowed to consume the shared auto-created reservations for this future reservation.\n- In the **Number of VM instances** enter the total count of VMs that you want reserved for the period, VM configuration, and project(s) specified in this future reservation.When calculating the number of reservations to create for an approved future reservation, Compute Engine first checks for existing reservations. If there are existing reservations that match the approved future reservation, the number of existing reservations is subtracted from the requested total number of reservations in the request to determine the number of new reservations that Compute Engine creates. For more information, see how Compute Engine [counts and provisions reserved resources](/compute/docs/instances/future-reservations-overview#count-reserved-resources) . **Caution** : If you want to increase the number of VMs to reserve, make sure that you have sufficient quota for the additional resources that you're requesting to reserve. Otherwise, Google Cloud declines your modification request.\n- To submit a modification request to Google Cloud for review, click **Submit** .If you submit a request, the **Reservations** page opens. Otherwise, the details page of the future reservation opens.\nTo request Google Cloud to modify an approved or procuring future reservation created by specifying an instance template, use the [gcloud beta compute future-reservations update command](/sdk/gcloud/reference/beta/compute/future-reservations/update) .\n```\ngcloud beta compute future-reservations update FUTURE_RESERVATION_NAME \\\n --description=\"DESCRIPTION\" \\\n --name-prefix=NAME_PREFIX \\\n --planning-status=PLANNING_STATUS \\\n --project=PROJECT_ID \\\n --share-setting=SHARE_SETTING \\\n --share-with=CONSUMER_PROJECT_IDS \\\n --start-time=START_TIME \\\n --end-time=END_TIME \\\n --total-count=TOTAL_COUNT \\\n --zone=ZONE\n```\nReplace the following:- ``: the name of an existing approved or procuring future reservation.\n- ``: Optional. A new description for the future reservation.\n- ``: Optional. A new name prefix for the future reservation. The name of each auto-created reservation for this future reservation starts with the name prefix. To help you identify the auto-created reservations for this future reservation, specifying an unique name prefix is recommended.\n- `` : the planning status of the future reservation. You can only specify `SUBMITTED` , which submits the future reservation to Google Cloud for review.\n- ``: Optional. The ID of the project where the future reservation was created. If you modify a single-project future reservation into a shared future reservation, this project becomes the owner project of the future reservation. If you omit the`--project`flag, the value is set to the ID of the current project.\n- `` : Optional. To change the type of this future reservation, specify one of the following values:- To change a single-project future reservation into a shared future reservation, specify `projects` . Make sure to specify at least one consumer project using the `--share-with` flag. Otherwise, modifying the future reservation request fails.\n- Otherwise, specify `local` . **Important:** If you specify `local` , make sure to omit the `--share-with` flag. Otherwise, modifying the future reservation fails.\n- `` : Optional. A comma-separated list of the [project IDs](/resource-manager/docs/creating-managing-projects#identifying_projects) of projects that this future reservation can be shared with. For example, specify `project-1,project-2` . You can specify up to 100 projects. These projects must be in the same organization as the project where this future reservation was created (the owner project). Don't specify the owner project. By default, it is already allowed to consume the shared auto-created reservations for this future reservation.\n- `` : Optional. The new start time of the reservation period formatted as an [RFC 3339 timestamp](https://tools.ietf.org/html/rfc3339) , which must be as follows:```\nYYYY-MM-DDTHH:MM:SSOFFSET\n```Replace the following:- `` : a data formatted as a 4-digit year, 2-digit month, and a 2-digit day of the month, separated by hyphens ( `-` ).\n- `` : a time formatted as a 2-digit hour using a 24-hour time, 2-digit minutes, and 2-digit seconds, separated by colons ( `:` ).\n- `` : the time zone formatted as an offset of [Coordinated Universal Time (UTC)](https://en.wikipedia.org/wiki/Coordinated_Universal_Time) . For example, to use the Pacific Standard Time (PST), specify `-08:00` . Alternatively, to use no offset, specify `Z` .\nThe start time can't be later than 1 year from the date and time at which you submit a future reservation for review. To have sufficient time to optionally cancel, delete, or modify a future reservation after it's approved or before it enters its lock time, make sure to specify a [recommended start time](/compute/docs/instances/future-reservations-overview#recommended-start-time) .\n- `` : Optional. The new end time of the reservation period formatted as an RFC 3339 timestamp. The reservation period must last at least 24 hours. Alternatively, you can replace the `--end-time` flag with the `--duration=` `` flag where `` is the duration of the reservation period in seconds. For example, specify `1209600` for 1,209,600 seconds (14 days).To increase the likelihood that Google Cloud approves a future reservation request after you submit it for review, make sure to specify one of the [recommended values for your reservation period](/compute/docs/instances/future-reservations-overview#recommended-minimum-reservation-period) . **Important:** Make sure that your reservation period doesn't overlap with the reservation period of another existing future reservation request with matching VM properties and zone, and that was created in or is shared with your current project. Otherwise, modifying the future reservation request [fails](/compute/docs/troubleshooting/troubleshoot-future-reservations#overlapping-reservation-periods) .\n- `` : Optional. The new total number of VMs that you want reserved for the period, VM configuration, and project(s) specified in this future reservation request.When calculating the number of reservations to create for an approved future reservation, Compute Engine first checks for existing reservations. If there are existing reservations that match the approved future reservation, the number of existing reservations is subtracted from the requested total number of reservations in the request to determine the number of new reservations that Compute Engine creates. For more information, see how Compute Engine [counts and provisions reserved resources](/compute/docs/instances/future-reservations-overview#count-reserved-resources) . **Caution:** Make sure that you have sufficient quota for the resources that you're requesting to reserve. Otherwise, Google Cloud declines your future reservation request.Caution: If you want to increase the number of VMs to reserve, make sure to have sufficient quota for the additional resources that you're requesting to reserve. Otherwise, Google Cloud declines your modification request.\n- ``: the zone where the future reservation is located.\nOptionally, you can also change if and when Compute Engine automatically deletes the auto-created reservations for a future reservation by doing one of the following:- To enable Compute Engine to automatically delete the auto-created reservations after the end time of the reservation period, select one of the following methods: **Caution:** If you enable the auto-delete option, all the auto-created reservations are deleted at the specified deletion time regardless if they're fully consumed or not.- To delete the reservations within 2 hours after the end time (default), specify the `--auto-delete-auto-created-reservations` flag.```\ngcloud beta compute future-reservations update example-future-reservation \\\n --auto-delete-auto-created-reservations\n```\n- To delete the auto-created reservations at a specific time after the end time of the reservation period, specify the `--auto-delete-auto-created-reservations` and `--auto-created-reservations-delete-time` flags.```\ngcloud beta compute future-reservations update example-future-reservation \\\n --auto-delete-auto-created-reservations \\\n --auto-created-reservations-delete-time=AUTO_CREATED_RESERVATIONS_DELETE_TIME\n```Replace `` with a date and time formatted as an RFC 3339 timestamp.\n- To delete the auto-created reservations after a specific duration after the end time of the reservation period, specify the `--auto-delete-auto-created-reservations` and `--auto-created-reservations-duration` flags.```\ngcloud beta compute future-reservations update example-future-reservation \\\n --auto-delete-auto-created-reservations \\\n --auto-created-reservations-duration=DURATION_BEFORE_DELETE\n```Replace `` with a duration in days, hours, minutes or seconds. For example, specify `30m` for 30 minutes, or `1d2h3m4s` for 1 day, 2 hours, 3 minutes, and 4 seconds.\n- To disable Compute Engine from automatically deleting the auto-created reservations, specify the `--no-auto-delete-auto-created-reservations` flag.```\ngcloud beta compute future-reservations update example-future-reservation \\\n --no-auto-delete-auto-created-reservations\n```\nFor example, consider an approved future reservation named `fr-05` and located in zone `us-central1-a` . Suppose that you want to to request Google Cloud to modify this future reservation by making the following changes:- Change the end time of its reservation period to midnight of December 31, 2023 UTC.\n- Reserve 10 VMs.\n- Specify a new name prefix.\nTo request Google Cloud to modify `fr-05` , run the following command:\n```\ngcloud beta compute future-reservations update fr-05 \\\n --end-time=2024-12-31T00:00:00Z \\\n --name-prefix=new-prefix \\\n --planning-status=SUBMITTED \\\n --project=example-project \\\n --total-count=10 \\\n --zone=us-central1-a\n```\nTo request Google Cloud to modify an approved or procuring future reservation created by specifying an instance template, make a `PATCH` request to the [beta.futureReservations.update method](/compute/docs/reference/rest/beta/futureReservations/update) . In the `updateMask` query parameter, specify each field that you want to update. If you need to delete an optional field from your reservation, then include that field in the `updateMask` query parameter and omit that field from the request body.\n```\nPATCH https://compute.googleapis.com/compute/beta/projects/PROJECT_ID/zones/ZONE/futureReservations/FUTURE_RESERVATION_NAME?updateMask=UPDATE_FIELDS{  \"autoDeleteAutoCreatedReservations\": \"AUTO_DELETE_AUTO_CREATED_RESERVATIONS\",  \"description\": \"DESCRIPTION\",  \"name\": \"FUTURE_RESERVATION_NAME\",  \"namePrefix\": \"NAME_PREFIX\",  \"planningStatus\": \"PLANNING_STATUS\",  \"shareSettings\": {    \"projects\": [      \"CONSUMER_PROJECT_ID_1\",      \"CONSUMER_PROJECT_ID_2\"    ],    \"shareType\": \"SHARE_TYPE\"  },  \"specificSkuProperties\": {     \"totalCount\": \"TOTAL_COUNT\"  },  \"timeWindow\": {    \"endTime\": \"END_TIME\",    \"startTime\": \"START_TIME\"  }}\n```\nReplace the following:- `` : the ID of the project where the future reservation is located.\n- `` : the zone where the future reservation is located.\n- `` : the name of an existing approved or procuring future reservation. You can't modify the name of a future reservation.\n- `` : a comma-separated list of fields to update in this `PATCH` request. You must encode each comma as `%2C` . For example, if you want to update the `autoDeleteAutoCreatedReservations` , `totalCount` , and `endTime` fields in your future reservation, specify the following:```\nautoDeleteAutoCreatedReservations%2CspecificSkuProperties.totalCount%2CtimeWindow.endTime\n```\n- `` : Optional. If you set this field to `true` , Compute Engine automatically deletes the auto-created reservations for this future reservation reservation. By default, the deletion time is within 2 hours after the end time of the reservation period. To change this, do one of the following: **Caution:** If you enable the auto-delete option, all the auto-created reservations are deleted at the specified deletion time regardless if they're fully consumed or not.- To delete the auto-created reservations at a specific time after the end time of your reservation period, set the `autoDeleteAutoCreatedReservations` to `true` and specify the `autoCreatedReservationsDeleteTime` field.```\nPATCH https://compute.googleapis.com/compute/beta/projects/example-project/zones/us-central1-a/futureReservations/example-future-reservation?updateMask=autoDeleteAutoCreatedReservations%2CautoCreatedReservationsDeleteTime{  \"autoDeleteAutoCreatedReservations\": \"true\",  \"autoCreatedReservationsDeleteTime\": \"DELETE_TIME\"}\n```Replace `` with a date and time when Compute Engine deletes reservations. The date and time must be formatted as an [RFC 3339 timestamp](https://tools.ietf.org/html/rfc3339) , which must be as follows:```\nYYYY-MM-DDTHH:MM:SSOFFSET\n```Replace the following:- `` : a data formatted as a 4-digit year, 2-digit month, and a 2-digit day of the month, separated by hyphens ( `-` ).\n- `` : a time formatted as a 2-digit hour using a 24-hour time, 2-digit minutes, and 2-digit seconds, separated by colons ( `:` ).\n- `` : the time zone formatted as an offset of [Coordinated Universal Time (UTC)](https://en.wikipedia.org/wiki/Coordinated_Universal_Time) . For example, to use the Pacific Standard Time (PST), specify `-08:00` . Alternatively, to use no offset, specify `Z` .\n- To delete the auto-created reservations after a specific duration from the start time of the reservation period, set the `autoDeleteAutoCreatedReservations` to `true` and specify the `autoCreatedReservationsDuration` field.```\nPATCH https://compute.googleapis.com/compute/beta/projects/example-project/zones/us-central1-a/futureReservations/example-future-reservation?updateMask=autoDeleteAutoCreatedReservations%2CautoCreatedReservationsDuration{  \"autoDeleteAutoCreatedReservations\": \"true\",  \"autoCreatedReservationsDuration\": {    \"seconds\": \"DURATION_BEFORE_DELETE\"  }}\n```Replace `` with a duration in seconds. For example, specify `604800` for 604,800 seconds (7 days).\n- `` : Optional. To update the description for this future reservation, do one of the following:- To add or update a description, specify a description.\n- To remove the description, delete the `description` field from the request body and specify it in `` .\n- `` : Optional. A new name prefix for the future reservation. The name of each auto-created reservation for this future reservation starts with the name prefix. To help you identify the auto-created reservations for this future reservation, specifying an unique name prefix is recommended.\n- `` : the planning status of the future reservation. You can only specify `SUBMITTED` , which submits the future reservation to Google Cloud for review.\n- `` : Optional. To change the share type of this future reservation, specify one of the following values:- To change a single-project future reservation into a shared future reservation, specify `SPECIFIC_PROJECTS` . Additionally, you must specify at least one consumer project in the `projects` field. Otherwise, modifying the future reservation fails.\n- Otherwise, specify `LOCAL` . Additionally, you must delete the `projects` field from the request body and specify it in `` . Otherwise, modifying the future reservation fails.\n- `` and `` : Optional. The [project IDs](/resource-manager/docs/creating-managing-projects#identifying_projects) of projects that a shared future reservation can be shared with. You can specify up to 100 projects. These projects must be in the same organization as the project where the future reservation was created (the owner project). Don't specify the owner project. By default, it is already allowed to consume the shared auto-created reservations for this future reservation.\n- `` : Optional. The new total number of VMs that you want reserved for the period, VM configuration, and project(s) specified in this future reservation request.When calculating the number of reservations to create for an approved future reservation, Compute Engine first checks for existing reservations. If there are existing reservations that match the approved future reservation, the number of existing reservations is subtracted from the requested total number of reservations in the request to determine the number of new reservations that Compute Engine creates. For more information, see how Compute Engine [counts and provisions reserved resources](/compute/docs/instances/future-reservations-overview#count-reserved-resources) . **Caution:** If you want to increase the number of VMs to reserve, make sure to have sufficient quota for the additional resources that you're requesting to reserve. Otherwise, Google Cloud declines your modification request.\n- `` : Optional. The new start time of the reservation period formatted as an RFC 3339 timestamp. The start time can't be later than 1 year from the date and time at which you submit a future reservation for review. Additionally, make sure to specify a [recommended start time](/compute/docs/instances/future-reservations-overview#recommended-start-time) to ensure that you have sufficient time before a future reservation enters its lock time.\n- `` : Optional. The new end time of the reservation period formatted as an RFC 3339 timestamp. The reservation period must last at least 24 hours. Alternatively, you can replace the `endTime` field with the `duration` field to specify a specific duration from the start time of the reservation period:```\n\"duration\": {  \"seconds\": \"END_DURATION\"}\n```Replace `` with a duration in seconds. For example, specify `1209600` for 1,209,600 seconds (14 days).To increase the likelihood that Google Cloud approves a future reservation request after you submit it for review, make sure to specify one of the [recommended values for your reservation period](/compute/docs/instances/future-reservations-overview#recommended-minimum-reservation-period) . **Important:** Make sure that your reservation period doesn't overlap with the reservation period of another existing future reservation request with matching VM properties and zone, and that was created in or is shared with your current project. Otherwise, modifying the future reservation request [fails](/compute/docs/troubleshooting/troubleshoot-future-reservations#overlapping-reservation-periods) .\nFor example, consider an approved future reservation named `fr-05` and located in zone `us-central1-a` . Suppose that you want to to request Google Cloud to modify this future reservation by making the following changes:- Change the end time of its reservation period to midnight of December 31, 2023 UTC.\n- Reserve 10 VMs.\n- Specify a new name prefix.\nTo request Google Cloud to modify `fr-05` , make the following `PATCH` request:\n```\nPATCH https://compute.googleapis.com/compute/beta/projects/example-project/zones/us-central1-a/futureReservations/fr-05?updateMask=namePrefix%2CspecificSkuProperties.totalCount%2CtimeWindow.endTime{  \"name\": \"fr-05\",  \"namePrefix\": \"new-prefix\",  \"planningStatus\": \"SUBMITTED\",  \"specificSkuProperties\": {    \"totalCount\": \"10\"  },  \"timeWindow\": {    \"endTime\": \"2023-12-31T00:00:00Z\"  }}\n```\nAfter you submit a request to modify a future reservation to Google Cloud, you can monitor the status of the request by [viewing the details of the future reservation](/compute/docs/instances/view-future-reservations#view-details-future-reservation) .\nFor a future reservation created by specifying properties directly with a procurement status of Approved ( `APPROVED` ) or Procuring ( `Procuring` ), you can request to modify the following properties:\n- Auto-delete\n- Description\n- Name prefix\n- GPUs \n- Local SSDs and the disk interface type \n- Machine series and machine type \n- Minimum CPU platform \n- Share settings\n- Start and end time of the reservation period\n- Total count (Number of VMs) \nIf you request to change any [VM properties](/compute/docs/instances/future-reservations-overview#vm-properties) , or largely increase or decrease the total count, within 14 days from the future reservation's start time, then Google Cloud is likely to decline your request.\nYou can request Google Cloud to modify a future reservation created by specifying properties directly using the Google Cloud console, gcloud CLI, and REST.\nTo request Google Cloud to modify an approved or procuring future reservation created by specifying properties directly, follow these steps:- In the Google Cloud console, go to the **Reservations** page. [Go to Reservations](https://console.cloud.google.com/compute/reservations) \n- Click the **Future reservations** tab.\n- In the **Name** column, click the name of the future reservation that you want to modify.The details page of the selected future reservation opens.\n- If you want to modify the auto-delete option and description of a future reservation, do one or more of the following:- In the **Auto-created reservations auto-delete time** row, click edit **Edit** , and then follow these steps:- Do one of the following:- To enable Compute Engine to automatically delete the auto-created reservations for your future reservation request, do the following: **Caution:** If the auto-delete option is enabled, all the auto-created reservations are deleted at the specified deletion time regardless if they're fully consumed or not.- Click the **Enable auto-delete** toggle to the on position.\n- Optional: In the **Auto-delete time** field, enter a new date and time when to delete the auto-created reservations. The date and time must be after the end time of the reservation period. If you leave this field empty, the auto-created reservations are deleted within 2 hours after the end time of the reservation period.\n- Otherwise, click the **Enable auto-delete** toggle to the off position.\n- Click **Submit** .\n- In the **Prefix** row, click edit **Edit** , and then do the following:- In the **Prefix** field, enter a new name prefix.\n- Click **Submit** .\n- In the **Description** row, click edit **Edit** , and then do the following:- In the **Description** field, enter a new description.\n- Click **Submit** .\n- Click edit **Edit** .The page to edit the selected future reservation opens.\n- If you want to modify other properties, do one or more of the following:- Modify the **Start time** or **End time** for your future reservation. Make sure of the following:- The start time can't be later than 1 year from the date and time at which you submit a future reservation for review.\n- Specify a [recommended value for the start time](/compute/docs/instances/future-reservations-overview#recommended-start-time) to ensure that you have sufficient time before your future reservation enters its lock time.\n- Specify a [recommended minimum reservation period](/compute/docs/instances/future-reservations-overview#recommended-minimum-reservation-period) to increase the likelihood that Google Cloud approves your request after submitting it for review.\n- In the **Share type** section, you can select either **Local** or **Shared** . If you select **Shared** , you can add or remove projects to share the future reservation with.You can select up to 100 projects. These projects must be in the same organization as the project where the future reservation was created (the owner project). Don't specify the owner project. By default, it is already allowed to consume the shared auto-created reservations for this future reservation.\n- In the **Number of VM instances** enter the total count of VMs that you want reserved for the period, VM configuration, and project(s) specified in this future reservation.When calculating the number of reservations to create for an approved future reservation, Compute Engine first checks for existing reservations. If there are existing reservations that match the approved future reservation, the number of existing reservations is subtracted from the requested total number of reservations in the request to determine the number of new reservations that Compute Engine creates. For more information, see how Compute Engine [counts and provisions reserved resources](/compute/docs/instances/future-reservations-overview#count-reserved-resources) . **Caution** : If you want to increase the number of VMs to reserve, make sure that you have sufficient quota for the additional resources that you're requesting to reserve. Otherwise, Google Cloud declines your modification request.\n- In the **Machine configuration** section, you can change the following:- The machine series and machine type used in the reserved VMs.\n- The GPUs to attach to the reserved VMs.\n- The Local SSDs and the disk interface type of the reserved VMs.\n- To submit a modification request to Google Cloud for review, click **Submit** .If you submit a request, the **Reservations** page opens. Otherwise, the details page of the future reservation opens.\nTo request Google Cloud to modify an approved or procuring future reservation created by specifying properties directly, use the [gcloud beta compute future-reservations update command](/sdk/gcloud/reference/beta/compute/future-reservations/update) .\n```\ngcloud beta compute future-reservations update FUTURE_RESERVATION_NAME \\\n --accelerator=count=NUMBER_OF_ACCELERATORS,type=ACCELERATOR_TYPE \\\n --description=\"DESCRIPTION\" \\\n --local-ssd=size=375,interface=INTERFACE_1 \\\n --local-ssd=size=375,interface=INTERFACE_2 \\\n --machine-type=MACHINE_TYPE \\\n --min-cpu-platform=MIN_CPU_PLATFORM \\\n --name-prefix=NAME_PREFIX \\\n --planning-status=PLANNING_STATUS \\\n --project=PROJECT_ID \\\n --share-setting=SHARE_SETTING \\\n --share-with=CONSUMER_PROJECT_IDS \\\n --start-time=START_TIME \\\n --end-time=END_TIME \\\n --total-count=TOTAL_COUNT \\\n --zone=ZONE\n```\nReplace the following:- ``: the name of an existing approved or procuring future reservation.\n- Optional. Do one of the following:- To add [graphics processing units (GPUs)](/compute/docs/gpus) to each reserved VM, specify the following:- `` : the number of GPUs to add per reserved VM.\n- `` : the type of GPU to add to the reserved VMs.\nMake sure that the machine type you specify in the future reservation supports the types of GPUs you specify and that [the GPU is available in the zone](/compute/docs/gpus/gpu-regions-zones) where you want to reserve resources. Otherwise, you encounter errors.\n- To remove all GPUs from this futurerequest, replace the `--accelerator` flag with the `--clear-accelerator` flag.- ``: Optional. A new description for the future reservation.\n- Optional. Do one of the following:- To add or edit the type of interface you want the [local SSDs](/compute/docs/disks#localssds) for each VM to use, replace the `` and `` . The value must be one of the following:- If your boot disk image [has optimized NVMe drivers](/compute/docs/disks/local-ssd#choose_an_interface) , specify `nvme` .\n- Otherwise, specify `scsi` .\nEach local SSD is 375 GB. Repeat the `--local-ssd` flag for each local SSD that you want to add. You can specify a maximum of 24 local SSDs.\n- To remove all local SSDs from this future reservation, remove all `--local-ssd` flags and specify the `--clear-local-ssd` flag.\n- `` : Optional. A predefined or custom [machine type](/compute/docs/machine-types) to use for each VM. Before specifying a custom machine type, review the [limitations](/compute/docs/instances/creating-instance-with-custom-machine-type#limitations) for VMs with custom machine types. **Note:** If you specify a different machine series than the one you previously specified, make sure to specify a [recommended minimum reservation period](/compute/docs/instances/future-reservations-overview#recommended-minimum-reservation-period) for the machine series you're specifying. Otherwise, Google Cloud is less likely to approve your request.\n- `` : Optional. The [minimum CPU platform](/compute/docs/instances/specify-min-cpu-platform) to use for each VM. If you omit the `--min-cpu-platform` flag, its value is set to the zone's [default CPU platform](/compute/docs/instances/specify-min-cpu-platform#availablezones) .\n- ``: Optional. A new name prefix for the future reservation. The name of each auto-created reservation for this future reservation starts with the name prefix. To help you identify the auto-created reservations for this future reservation, specifying an unique name prefix is recommended.\n- `` : the planning status of the future reservation. You can only specify `SUBMITTED` , which submits the future reservation to Google Cloud for review.\n- ``: Optional. The ID of the project where the future reservation was created. If you modify a single-project future reservation into a shared future reservation, this project becomes the owner project of the future reservation. If you omit the`--project`flag, the value is set to the ID of the current project.\n- `` : Optional. To change the type of this future reservation, specify one of the following values:- To change a single-project future reservation into a shared future reservation, specify `projects` . Make sure to specify at least one consumer project using the `--share-with` flag. Otherwise, modifying the future reservation request fails.\n- Otherwise, specify `local` . **Important:** If you specify `local` , make sure to omit the `--share-with` flag. Otherwise, modifying the future reservation fails.\n- `` : Optional. A comma-separated list of the [project IDs](/resource-manager/docs/creating-managing-projects#identifying_projects) of projects that this future reservation can be shared with. For example, specify `project-1,project-2` . You can specify up to 100 projects. These projects must be in the same organization as the project where this future reservation was created (the owner project). Don't specify the owner project. By default, it is already allowed to consume the shared auto-created reservations for this future reservation.\n- `` : Optional. The new start time of the reservation period formatted as an [RFC 3339 timestamp](https://tools.ietf.org/html/rfc3339) , which must be as follows:```\nYYYY-MM-DDTHH:MM:SSOFFSET\n```Replace the following:- `` : a data formatted as a 4-digit year, 2-digit month, and a 2-digit day of the month, separated by hyphens ( `-` ).\n- `` : a time formatted as a 2-digit hour using a 24-hour time, 2-digit minutes, and 2-digit seconds, separated by colons ( `:` ).\n- `` : the time zone formatted as an offset of [Coordinated Universal Time (UTC)](https://en.wikipedia.org/wiki/Coordinated_Universal_Time) . For example, to use the Pacific Standard Time (PST), specify `-08:00` . Alternatively, to use no offset, specify `Z` .\nThe start time can't be later than 1 year from the date and time at which you submit a future reservation for review. To have sufficient time to optionally cancel, delete, or modify a future reservation after it's approved or before it enters its lock time, make sure to specify a [recommended start time](/compute/docs/instances/future-reservations-overview#recommended-start-time) .\n- `` : Optional. The new end time of the reservation period formatted as an RFC 3339 timestamp. The reservation period must last at least 24 hours. Alternatively, you can replace the `--end-time` flag with the `--duration=` `` flag where `` is the duration of the reservation period in seconds. For example, specify `1209600` for 1,209,600 seconds (14 days).To increase the likelihood that Google Cloud approves a future reservation request after you submit it for review, make sure to specify one of the [recommended values for your reservation period](/compute/docs/instances/future-reservations-overview#recommended-minimum-reservation-period) . **Important:** Make sure that your reservation period doesn't overlap with the reservation period of another existing future reservation request with matching VM properties and zone, and that was created in or is shared with your current project. Otherwise, modifying the future reservation request [fails](/compute/docs/troubleshooting/troubleshoot-future-reservations#overlapping-reservation-periods) .\n- `` : Optional. The new total number of VMs that you want reserved for the period, VM configuration, and project(s) specified in this future reservation request.When calculating the number of reservations to create for an approved future reservation, Compute Engine first checks for existing reservations. If there are existing reservations that match the approved future reservation, the number of existing reservations is subtracted from the requested total number of reservations in the request to determine the number of new reservations that Compute Engine creates. For more information, see how Compute Engine [counts and provisions reserved resources](/compute/docs/instances/future-reservations-overview#count-reserved-resources) . **Caution:** Make sure that you have sufficient quota for the resources that you're requesting to reserve. Otherwise, Google Cloud declines your future reservation request.Caution: If you want to increase the number of VMs to reserve, make sure to have sufficient quota for the additional resources that you're requesting to reserve. Otherwise, Google Cloud declines your modification request.\n- ``: the zone where the future reservation is located.\nOptionally, you can also change if and when Compute Engine automatically deletes the auto-created reservations for a future reservation by doing one of the following:- To enable Compute Engine to automatically delete the auto-created reservations after the end time of the reservation period, select one of the following methods: **Caution:** If you enable the auto-delete option, all the auto-created reservations are deleted at the specified deletion time regardless if they're fully consumed or not.- To delete the reservations within 2 hours after the end time (default), specify the `--auto-delete-auto-created-reservations` flag.```\ngcloud beta compute future-reservations update example-future-reservation \\\n --auto-delete-auto-created-reservations\n```\n- To delete the auto-created reservations at a specific time after the end time of the reservation period, specify the `--auto-delete-auto-created-reservations` and `--auto-created-reservations-delete-time` flags.```\ngcloud beta compute future-reservations update example-future-reservation \\\n --auto-delete-auto-created-reservations \\\n --auto-created-reservations-delete-time=AUTO_CREATED_RESERVATIONS_DELETE_TIME\n```Replace `` with a date and time formatted as an RFC 3339 timestamp.\n- To delete the auto-created reservations after a specific duration after the end time of the reservation period, specify the `--auto-delete-auto-created-reservations` and `--auto-created-reservations-duration` flags.```\ngcloud beta compute future-reservations update example-future-reservation \\\n --auto-delete-auto-created-reservations \\\n --auto-created-reservations-duration=DURATION_BEFORE_DELETE\n```Replace `` with a duration in days, hours, minutes or seconds. For example, specify `30m` for 30 minutes, or `1d2h3m4s` for 1 day, 2 hours, 3 minutes, and 4 seconds.\n- To disable Compute Engine from automatically deleting the auto-created reservations, specify the `--no-auto-delete-auto-created-reservations` flag.```\ngcloud beta compute future-reservations update example-future-reservation \\\n --no-auto-delete-auto-created-reservations\n```\nFor example, consider an approved future reservation named `fr-05` and located in zone `us-central1-a` . Suppose that you want to to request Google Cloud to modify this future reservation by making the following changes:- Change the end time of its reservation period to midnight of December 31, 2023 UTC.\n- Reserve 10 VMs.\n- Specify a new name prefix.\nTo request Google Cloud to modify `fr-05` , run the following command:\n```\ngcloud beta compute future-reservations update fr-05 \\\n --end-time=2024-12-31T00:00:00Z \\\n --name-prefix=new-prefix \\\n --planning-status=SUBMITTED \\\n --project=example-project \\\n --total-count=10 \\\n --zone=us-central1-a\n```\nTo request Google Cloud to modify an approved or procuring future reservation created by specifying properties directly, make a `PATCH` request to the [beta.futureReservations.update method](/compute/docs/reference/rest/beta/futureReservations/update) . In the `updateMask` query parameter, specify each field that you want to update. If you need to delete an optional field from your reservation, then include that field in the `updateMask` query parameter and omit that field from the request body.\n```\nPATCH https://compute.googleapis.com/compute/beta/projects/PROJECT_ID/zones/ZONE/futureReservations/FUTURE_RESERVATION_NAME?updateMask=UPDATE_FIELDS{  \"autoDeleteAutoCreatedReservations\": \"AUTO_DELETE_AUTO_CREATED_RESERVATIONS\",  \"description\": \"DESCRIPTION\",  \"name\": \"FUTURE_RESERVATION_NAME\",  \"namePrefix\": \"NAME_PREFIX\",  \"planningStatus\": \"PLANNING_STATUS\",  \"shareSettings\": {    \"projects\": [      \"CONSUMER_PROJECT_ID_1\",      \"CONSUMER_PROJECT_ID_2\"    ],    \"shareType\": \"SHARE_TYPE\"  },  \"specificSkuProperties\": {     \"instanceProperties\": {      \"guestAccelerators\": [        {          \"acceleratorCount\": NUMBER_OF_ACCELERATORS,          \"acceleratorType\": \"ACCELERATOR_TYPE\"        }      ],      \"localSsds\": [        {          \"diskSizeGb\": \"375\",          \"interface\": \"INTERFACE_1\"        },        {          \"diskSizeGb\": \"375\",          \"interface\": \"INTERFACE_2\"        }      ],      \"machineType\": \"MACHINE_TYPE\",      \"minCpuPlatform\": \"MINIMUM_CPU_PLATFORM\"    },    \"totalCount\": \"TOTAL_COUNT\"  },  \"timeWindow\": {    \"endTime\": \"END_TIME\",    \"startTime\": \"START_TIME\"  }}\n```\nReplace the following:- `` : the ID of the project where the future reservation is located.\n- `` : the zone where the future reservation is located.\n- `` : the name of an existing approved or procuring future reservation. You can't modify the name of a future reservation.\n- `` : a comma-separated list of fields to update in this `PATCH` request. You must encode each comma as `%2C` . For example, if you want to update the `autoDeleteAutoCreatedReservations` , `totalCount` , and `endTime` fields in your future reservation, specify the following:```\nautoDeleteAutoCreatedReservations%2CspecificSkuProperties.totalCount%2CtimeWindow.endTime\n```\n- `` : Optional. If you set this field to `true` , Compute Engine automatically deletes the auto-created reservations for this future reservation reservation. By default, the deletion time is within 2 hours after the end time of the reservation period. To change this, do one of the following: **Caution:** If you enable the auto-delete option, all the auto-created reservations are deleted at the specified deletion time regardless if they're fully consumed or not.- To delete the auto-created reservations at a specific time after the end time of your reservation period, set the `autoDeleteAutoCreatedReservations` to `true` and specify the `autoCreatedReservationsDeleteTime` field.```\nPATCH https://compute.googleapis.com/compute/beta/projects/example-project/zones/us-central1-a/futureReservations/example-future-reservation?updateMask=autoDeleteAutoCreatedReservations%2CautoCreatedReservationsDeleteTime{  \"autoDeleteAutoCreatedReservations\": \"true\",  \"autoCreatedReservationsDeleteTime\": \"DELETE_TIME\"}\n```Replace `` with a date and time when Compute Engine deletes reservations. The date and time must be formatted as an [RFC 3339 timestamp](https://tools.ietf.org/html/rfc3339) , which must be as follows:```\nYYYY-MM-DDTHH:MM:SSOFFSET\n```Replace the following:- `` : a data formatted as a 4-digit year, 2-digit month, and a 2-digit day of the month, separated by hyphens ( `-` ).\n- `` : a time formatted as a 2-digit hour using a 24-hour time, 2-digit minutes, and 2-digit seconds, separated by colons ( `:` ).\n- `` : the time zone formatted as an offset of [Coordinated Universal Time (UTC)](https://en.wikipedia.org/wiki/Coordinated_Universal_Time) . For example, to use the Pacific Standard Time (PST), specify `-08:00` . Alternatively, to use no offset, specify `Z` .\n- To delete the auto-created reservations after a specific duration from the start time of the reservation period, set the `autoDeleteAutoCreatedReservations` to `true` and specify the `autoCreatedReservationsDuration` field.```\nPATCH https://compute.googleapis.com/compute/beta/projects/example-project/zones/us-central1-a/futureReservations/example-future-reservation?updateMask=autoDeleteAutoCreatedReservations%2CautoCreatedReservationsDuration{  \"autoDeleteAutoCreatedReservations\": \"true\",  \"autoCreatedReservationsDuration\": {    \"seconds\": \"DURATION_BEFORE_DELETE\"  }}\n```Replace `` with a duration in seconds. For example, specify `604800` for 604,800 seconds (7 days).\n- `` : Optional. To update the description for this future reservation, do one of the following:- To add or update a description, specify a description.\n- To remove the description, delete the `description` field from the request body and specify it in `` .\n- `` : Optional. A new name prefix for the future reservation. The name of each auto-created reservation for this future reservation starts with the name prefix. To help you identify the auto-created reservations for this future reservation, specifying an unique name prefix is recommended.\n- `` : the planning status of the future reservation. You can only specify `SUBMITTED` , which submits the future reservation to Google Cloud for review.\n- `` : Optional. To change the share type of this future reservation, specify one of the following values:- To change a single-project future reservation into a shared future reservation, specify `SPECIFIC_PROJECTS` . Additionally, you must specify at least one consumer project in the `projects` field. Otherwise, modifying the future reservation fails.\n- Otherwise, specify `LOCAL` . Additionally, you must delete the `projects` field from the request body and specify it in `` . Otherwise, modifying the future reservation fails.\n- `` and `` : Optional. The [project IDs](/resource-manager/docs/creating-managing-projects#identifying_projects) of projects that a shared future reservation can be shared with. You can specify up to 100 projects. These projects must be in the same organization as the project where the future reservation was created (the owner project). Don't specify the owner project. By default, it is already allowed to consume the shared auto-created reservations for this future reservation.\n- Optional. To update the [graphics processing units (GPUs)](/compute/docs/gpus) attached to each reserved VM, do one of the following:- To add or modify GPUs, specify the following:- `` : the number of GPUs to add per reserved VM.\n- `` : the type of GPU to add to the reserved VMs.\nMake sure that the machine type you specify in the future reservation supports the types of GPUs you specify and that [the GPU is available in the zone](/compute/docs/gpus/gpu-regions-zones) where you want to reserve resources. Otherwise, you encounter errors.\n- To remove all GPUs from this futurerequest, omit the `guestAccelerators` field in the request body and specify it in `` .\n- Optional. To update the local SSDs attached to each reserved VM, do one of the following:- To add or edit the type of interface you want the [local SSDs](/compute/docs/disks#localssds) for each VM to use, replace the `` and `` . The value must be one of the following:- If your boot disk image [has optimized NVMe drivers](/compute/docs/disks/local-ssd#choose_an_interface) , specify `NVME` .\n- Otherwise, specify `SCSI` .\nRepeat the `diskSizeGb` and `interface` fields for each local SSD that you want to add or update. You can specify a maximum of 24 local SSDs.\n- To remove all local SSDs from this future reservation, delete the `localSsds` field from the request body and specify it in `` .\n- `` : Optional. A predefined or custom [machine type](/compute/docs/machine-types) to use for each VM. Before specifying a custom machine type, review the [limitations](/compute/docs/instances/creating-instance-with-custom-machine-type#limitations) for VMs with custom machine types. **Note:** If you specify a different machine series than the one you previously specified, make sure to specify a [recommended minimum reservation period](/compute/docs/instances/future-reservations-overview#recommended-minimum-reservation-period) for the machine series you're specifying. Otherwise, Google Cloud is less likely to approve your request.\n- `` : Optional. To update the [minimum CPU platform](/compute/docs/instances/specify-min-cpu-platform) to use for each VM, do one of the following:- To add or update the minimum CPU platform, specify a minimum CPU platform.\n- To revert back to the zone's [default CPU platform](/compute/docs/instances/specify-min-cpu-platform#availablezones) , delete the `minCpuPlatform` field from the request body and specify it in `` .- `` : Optional. The new total number of VMs that you want reserved for the period, VM configuration, and project(s) specified in this future reservation request.When calculating the number of reservations to create for an approved future reservation, Compute Engine first checks for existing reservations. If there are existing reservations that match the approved future reservation, the number of existing reservations is subtracted from the requested total number of reservations in the request to determine the number of new reservations that Compute Engine creates. For more information, see how Compute Engine [counts and provisions reserved resources](/compute/docs/instances/future-reservations-overview#count-reserved-resources) . **Caution:** If you want to increase the number of VMs to reserve, make sure to have sufficient quota for the additional resources that you're requesting to reserve. Otherwise, Google Cloud declines your modification request.\n- `` : Optional. The new start time of the reservation period formatted as an RFC 3339 timestamp. The start time can't be later than 1 year from the date and time at which you submit a future reservation for review. Additionally, make sure to specify a [recommended start time](/compute/docs/instances/future-reservations-overview#recommended-start-time) to ensure that you have sufficient time before a future reservation enters its lock time.\n- `` : Optional. The new end time of the reservation period formatted as an RFC 3339 timestamp. The reservation period must last at least 24 hours. Alternatively, you can replace the `endTime` field with the `duration` field to specify a specific duration from the start time of the reservation period:```\n\"duration\": {  \"seconds\": \"END_DURATION\"}\n```Replace `` with a duration in seconds. For example, specify `1209600` for 1,209,600 seconds (14 days).To increase the likelihood that Google Cloud approves a future reservation request after you submit it for review, make sure to specify one of the [recommended values for your reservation period](/compute/docs/instances/future-reservations-overview#recommended-minimum-reservation-period) . **Important:** Make sure that your reservation period doesn't overlap with the reservation period of another existing future reservation request with matching VM properties and zone, and that was created in or is shared with your current project. Otherwise, modifying the future reservation request [fails](/compute/docs/troubleshooting/troubleshoot-future-reservations#overlapping-reservation-periods) .\nFor example, consider an approved future reservation named `fr-05` and located in zone `us-central1-a` . Suppose that you want to to request Google Cloud to modify this future reservation by making the following changes:- Change the end time of its reservation period to midnight of December 31, 2023 UTC.\n- Reserve 10 VMs.\n- Specify a new name prefix.\nTo request Google Cloud to modify `fr-05` , make the following `PATCH` request:\n```\nPATCH https://compute.googleapis.com/compute/beta/projects/example-project/zones/us-central1-a/futureReservations/fr-05?updateMask=namePrefix%2CspecificSkuProperties.totalCount%2CtimeWindow.endTime{  \"name\": \"fr-05\",  \"namePrefix\": \"new-prefix\",  \"planningStatus\": \"SUBMITTED\",  \"specificSkuProperties\": {    \"totalCount\": \"10\"  },  \"timeWindow\": {    \"endTime\": \"2023-12-31T00:00:00Z\"  }}\n```\nAfter you submit a request to modify a future reservation to Google Cloud, you can monitor the status of the request by [viewing the details of the future reservation](/compute/docs/instances/view-future-reservations#view-details-future-reservation) .\n### Change any other properties in a future reservation request\nIf you want to change any other properties in a future reservation request before it reaches a procurement status of Procuring ( `PROCURING` ), follow these steps:\n- Do one or more of the following:- To stop Google Cloud from reviewing the future reservation request, [cancel the future reservation request](#cancel-future-reservation) .\n- To stop the future reservation request from restricting the type of future reservation requests that you can create in your current project—or in the projects the future reservation request is shared with— [delete the future reservation request](#delete-future-reservation) .\n- Create a new [single-project](/compute/docs/instances/create-single-project-future-reservations) or [shared future reservation request](/compute/docs/instances/create-shared-future-reservations) with your desired updates.\n### Troubleshoot\nIf you run into errors when modifying a future reservation request, see how to [troubleshoot future reservation requests](/compute/docs/troubleshooting/troubleshoot-future-reservations) .\nIf you still encounter issues after troubleshooting, contact your account representative or [Google Cloud Support](/contact) .\n## Cancel future reservation requests\nYou can cancel an approved, declined, or pending approval future reservation request to stop Google Cloud from provisioning the requested capacity. After you cancel a future reservation request, you can only [view its details](/compute/docs/instances/view-future-reservations#view-details-future-reservation) or [delete it](#delete-future-reservation) .\nYou can cancel a future reservation request using the gcloud CLI and REST.\nTo cancel a future reservation request, use the [gcloud beta compute future-reservations cancel command](/sdk/gcloud/reference/beta/compute/future-reservations/cancel) .\n```\ngcloud beta compute future-reservations cancel FUTURE_RESERVATION_NAME \\\n --project=PROJECT_ID \\\n --zone=ZONE\n```\nReplace the following:- `` : the name of an existing future reservation request.\n- `` : Optional. The ID of the project where the future reservation request is located. If you omit the `--project` flag, the ID of the current project is used.\n- `` : the zone where the future reservation request is located.\nTo cancel a future reservation request, make a `POST` request to the [beta.futureReservations.cancel method](/compute/docs/reference/rest/beta/futureReservations/cancel) .\n```\nPOST https://compute.googleapis.com/compute/beta/projects/PROJECT_ID/zones/ZONE/futureReservations/FUTURE_RESERVATION_NAME/cancel\n```\nReplace the following:- `` : the ID of the project where the future reservation request is located.\n- `` : the zone where the future reservation request is located.\n- `` : the name of an existing future reservation request.## Delete future reservation requests\nYou can delete a future reservation request only in one of the following cases:\n- The future reservation request was canceled.\n- Before the future reservation has reached the start time of its reservation period.\n- After the future reservation has reached the end time of its reservation period.\nDeleting a future reservation doesn't delete the auto-created reservations for the future reservation. If you want to delete an auto-created reservation after the end of the reservation period, see [Delete reservations](/compute/docs/instances/reservations-delete#deleting_a_reservation) instead.\nYou can delete a future reservation request using the Google Cloud console, gcloud CLI, and REST.\nTo delete a future reservation request, follow these steps:- In the Google Cloud console, go to the **Reservations** page. [Go to Reservations](https://console.cloud.google.com/compute/reservations) \n- Click the **Future reservations** tab.\n- Select the checkbox next to each future reservation request that you want to delete.\n- Click delete **Delete reservation** .\n- To confirm, click **Delete** .Deleting a future reservation request can take up to a minute to complete.\nTo delete a future reservation request, use the [gcloud beta compute future-reservations delete command](/sdk/gcloud/reference/beta/compute/future-reservations/delete) .\n```\ngcloud beta compute future-reservations delete FUTURE_RESERVATION_NAME \\\n --project=PROJECT_ID \\\n --zone=ZONE\n```\nReplace the following:- `` : the name of an existing future reservation request.\n- `` : Optional. The ID of the project where the future reservation request is located. If you omit the `--project` flag, the ID of the current project is used.\n- `` : the zone where the future reservation request is located.\nTo delete a future reservation request, make a `DELETE` request to the [beta.futureReservations.delete method](/compute/docs/reference/rest/beta/futureReservations/delete) .\n```\nDELETE https://compute.googleapis.com/compute/beta/projects/PROJECT_ID/zones/ZONE/futureReservations/FUTURE_RESERVATION_NAME\n```\nReplace the following:- `` : the ID of the project where the future reservation request is located.\n- `` : the zone where the future reservation request is located.\n- `` : the name of an existing future reservation request.## What's next\n- Learn how to [view future reservation requests](/compute/docs/instances/view-future-reservations) .\n- After you reach the start time of your reservation period, learn how to [consume the auto-created reservations](/compute/docs/instances/reservations-consume#consuming_instances_from_any_matching_reservation) .\n- After the end time of your reservation period, learn how to do the following:- [Modify the auto-created reservations](/compute/docs/instances/reservations-modify) .\n- [Delete the auto-created reservations](/compute/docs/instances/reservations-delete) .", "guide": "Compute Engine"}