{"title": "Compute Engine - Troubleshooting VM start up", "url": "https://cloud.google.com/compute/docs/instances", "abstract": "# Compute Engine - Troubleshooting VM start up\n[quota errors](#quota_errors)\n[boot disks](#persistent_book_disks)\n", "content": "## Quota errors\nIf you receive a [quota error](/docs/quota#quota_errors) when you try to start an instance, you must request additional CPU quota. For more information, see the [VM instances](/compute/resource-usage#vm_instance_quota) section of the Resource quotas documentation.\n## Boot disks\nIf your instance does not start and you are unable to connect to it or log in through the interactive serial console, identify the reason why the boot disk is not completing the boot and startup process.\n### Identify the reason why the boot disk isn't booting\n- **Verify that your boot disk is not full.** If your boot disk is completely full and your operating system does not support automatic resizing, you won't be able to connect to your instance. You must create a new instance and recreate the boot disk. For more information, see [RecoveringVMs or full boot disks](/compute/docs/disks/recover-vm) .\n- **Examine your virtual machine instance's serial port output.** An instance's BIOS, bootloader, and kernel prints their debug messages into the instance's serial port output, providing valuable information about any errors or issues that the instance experienced. If you [enable serial portoutput logging](/compute/docs/troubleshooting/viewing-serial-port-output) to Cloud Logging, you can access this information even when your instance is not running.\n- **Enable interactive access to the serial console.** You can enable interactive access to an instance's serial console, so you can log in and debug boot issues from within the instance without requiring your instance to be fully booted. For more information, see [Troubleshootingusing the serial console](/compute/docs/troubleshooting/troubleshooting-using-serial-console) .\n- **Verify that your disk has a valid file system.** If your file system is corrupted or otherwise invalid, you won't be able to launch your instance. Validate your disk's file system:- Detach the disk in question from any instance it is attached to, if applicable:```\ngcloud compute instances delete old-instance --keep-disks boot\n```\n- Start a new instance with the latest Google-provided image:```\ngcloud compute instances create debug-instance\n```\n- Attach your disk as a non-boot disk, but don't mount it. Replace `DISK` with the name of the disk that won't boot. Note the device name that identifies the disk on the instance:```\ngcloud compute instances attach-disk debug-instance \\\n --disk DISK \\\n --device-name debug-disk\n```\n- Connect to the instance:```\ngcloud compute ssh debug-instance\n```\n- Look up the root partition of the disk, which is identified with the `part1` notation. In this case, the root partition of the disk is at `/dev/sdb1` :```\nls -l /dev/disk/by-id\ntotal 0\nlrwxrwxrwx 1 root root 9 Jan 22 17:09 google-debug-disk -> ../../sdb\nlrwxrwxrwx 1 root root 10 Jan 22 17:09 google-debug-disk-part1 -> ../../sdb1\nlrwxrwxrwx 1 root root 9 Jan 22 17:02 google-persistent-disk-0 -> ../../sda\nlrwxrwxrwx 1 root root 10 Jan 22 17:02 google-persistent-disk-0-part1 -> ../../sda1\nlrwxrwxrwx 1 root root 9 Jan 22 17:09 scsi-0Google_PersistentDisk_debug-disk -> ../../sdb\nlrwxrwxrwx 1 root root 10 Jan 22 17:09 scsi-0Google_PersistentDisk_debug-disk-part1 -> ../../sdb1\nlrwxrwxrwx 1 root root 9 Jan 22 17:02 scsi-0Google_PersistentDisk_persistent-disk-0 -> ../../sda\nlrwxrwxrwx 1 root root 10 Jan 22 17:02 scsi-0Google_PersistentDisk_persistent-disk-0-part1 -> ../../sda1\n```\n- Run a file system check on the root partition:```\nsudo fsck /dev/sdb1\nfsck from util-linux 2.20.1\ne2fsck 1.42.5 (29-Jul-2012)\n/dev/sdb1: clean, 19829/655360 files, 208111/2621184 blocks\n```\n- Mount your file system:```\n sudo mkdir /mydisk\n``````\n sudo mount /dev/sdb1 /mydisk\n```\n- Check that the disk has kernel files:```\n ls /mydisk/boot/vmlinuz-*\n /mydisk/boot/vmlinuz-3.2.0-4-amd64\n \n```\n- **Verify that the disk has a valid master boot record (MBR).** Run the following command on the debug instance that has the attached persistent boot disk, such as `/dev/sdb` :```\nsudo parted /dev/sdb print\n```If your MBR is valid, it lists information about the file system:```\nDisk /dev/sdb: 10.7GB\nSector size (logical/physical): 512B/4096B\nPartition Table: msdos\nDisk Flags:\nNumber Start End  Size Type  File system Flags\n 1  2097kB 10.7GB 10.7GB primary ext4   boot\n```\n### Correct the boot issue\nAfter you identify where the boot and startup process is failing, you can correct the issue by completing one of the following actions:\n- Use your imported image to [create a standalone boot disk](#creating_a_standalone_boot_disk) \n- Start over and [import the boot disk image](/compute/docs/import/import-existing-image#overview) againMount your imported image on a secondary disk that is attached to a temporary VM instance. Use the Google Cloud console or the gcloud CLI to create a standalone disk from the image that you uploaded and create a temporary VM with the standalone disk attached. You can use this instance to modify files on the standalone disk and fix issues that cause that image to fail to start.\nCreate a standalone disk from the boot disk image that you imported. Alternatively, you can detach a boot disk from an instance and create the instance using that detached boot disk instead.\n- In the Google Cloud console, go to the **Disks** page. [Go to Disks](https://console.cloud.google.com/compute/disks) \n- Click **Create disk** .\n- On the **Create a disk** page,   specify the following attributes:- **Zone** :`Select a zone near you. You must use this same zone when you create your temporary instance.`\n- **Disk source type** : **Image** \n- **Source image** :      Specify the name of the boot disk image that you imported.\n- To create the disk, click **Create** .Create a temporary instance where you can attach the standalone disk and configure the bootloader to function in a Google Cloud console environment.- In the Google Cloud console, go to the **VM instances** page. [Go to Instances](https://console.cloud.google.com/compute/instances) \n- Click the **Create instance** button.\n- On the **Create an instance** page, specify an instance name and a zone in which to locate the instance. The zone must be the same zone where you created your standalone disk.\n- Expand the **Management, security, disks, networking, sole tenancy** section.\n- Under the **Disks** tab in the **Additional disks** section, click **Attach existing disk** . A new section appears.\n- Under the **Disk** section, select the standalone disk that you created from the drop-down list. This attaches the standalone disk to the instance so you can mount it and modify the disk contents later.\n- Click **Done** to finish attaching the disk.\n- Click the **Create** button to create the instance.\nCreate a standalone disk from the boot disk image that you imported. Alternatively, you can detach a boot disk from an instance and create the instance by using that detached boot disk instead.\n```\ngcloud compute disks create DISK_NAME \\\n --zone=ZONE \\\n --image=IMAGE_NAME\n```\nReplace the following:- `` : the name for the new standalone disk.\n- ```` : a zone near you. You must use this same zone when you create the temporary instance.\n- `` : the name of the boot disk image that you imported.\nCreate a temporary instance where you can attach the standalone disk and configure the bootloader to function in a Google Cloud console environment.\n```\ngcloud compute instances create INSTANCE_NAME \\\n --zone=ZONE \\\n --disk name=DISK_NAME\n```\nReplace the following:- `` : a unique name for your instance\n- `` : the zone where you created the standalone disk\n- `` : the name of the standalone disk that you created from the imported boot disk image\nAfter you create the instance with the attached standalone disk, you have a virtual environment where you can modify the bootloader from your original boot disk image.\nConnect to the instance, mount the standalone disk, and configure the bootloader so that it boots properly on Compute Engine.\n- [Connect to the temporary instance](/compute/docs/connect/standard-ssh) by using SSH-in-browser or the [gcloud compute ssh command](/sdk/gcloud/reference/compute/ssh) .\n- Use the `blkid` command to identify the disk that you want to modify and the partitions that you need to mount. In this example, `/dev/sdb` is the disk that you imported.```\nlsblk\n``````\nNAME MAJ:MIN RM SIZE RO TYPE MOUNTPOINT\nsda  8:0 0 10G 0 disk\n└─sda1 8:1 0 10G 0 part /\nsdb  8:16 0 100G 0 disk\n├─sdb1 8:17 0 96G 0 part\n├─sdb2 8:18 0 1K 0 part\n└─sdb5 8:21 0 4G 0 part\n```\n- Mount the root partition from the standalone disk to the `/tmp` directory. In this example `/dev/sdb1` is the root partition and the other partitions do not require any modifications. Your partition scheme might require you to mount multiple partitions before you can access all of the files that you need to change.```\nsudo mount /dev/sdb1 /tmp\n```\n- Edit files that might cause the disk to fail the boot process. For more information, see the [bootloader configuration instructions](/compute/docs/import/import-existing-image#configure_bootloader) .\n- Unmount the boot disk from the temporary instance.```\nsudo umount /tmp\n```When you have finished configuring this disk, detach it, and use it as the boot disk for new instance.\nDetach the standalone disk from the temporary instance.- In the Google Cloud console, go to the **VM instances** page. [Go to Instances](https://console.cloud.google.com/compute/instances) \n- On the list of instances, click the name of the temporary instance where you modified the standalone boot disk. The instance details page opens.\n- At the top of the instance details page, click **Edit** .\n- Under **Additional disks** , click the **X** next to the standalone disk to indicate that you want to detach it from the temporary instance.\n- Click **Save** to save your changes.\nUse the detached standalone disk to create an instance.- In the Google Cloud console, go to the **VM instances** page. [Go to Instances](https://console.cloud.google.com/compute/instances) \n- Click the **Create instance** button.\n- On the **Create an instance** page, specify an instance name and a zone in which to locate the instance. The zone must be the same zone where you created your standalone disk.\n- Under **Boot disk** , click **Change** to begin configuring your boot disk.\n- In the **Existing disks** tab, choose the standalone boot disk to use as the boot disk for this new instance.\n- Click the **Create** button to create the instance.\nDetach the standalone disk from the temporary instance.\n```\ngcloud compute instances detach-disk INSTANCE_NAME \\\n --disk name=DISK_NAME\n```\nReplace the following:- ``: A unique name for your instance.\n- ``: The name for the new standalone disk.\nUse the detached standalone disk to create an instance.\n```\ngcloud compute instances create INSTANCE_NAME \\\n --zone ZONE \\\n --disk name=DISK_NAME,boot=yes\n```\nReplace the following:- ``: a unique name for your instance\n- ``: the zone where the standalone disk is located\n- ``: the name of the standalone disk that you created from the imported boot disk image\nTest the instance that you created using the modified boot disk. If you are still unable to connect to the instance, [view the serial port output](/compute/docs/troubleshooting/viewing-serial-port-output) again to identify where the boot process is failing. Repeat the troubleshooting process until you correct the issues with the boot disk image.", "guide": "Compute Engine"}