{"title": "Compute Engine - Troubleshooting instant snapshots", "url": "https://cloud.google.com/compute/docs/instances", "abstract": "# Compute Engine - Troubleshooting instant snapshots\n**    Preview     ** This product or feature is subject to the \"Pre-GA Offerings Terms\" in the General Service Terms section   of the [Service Specific Terms](/terms/service-terms#1) .     Pre-GA products and features are available \"as is\" and might have limited support.    For more information, see the [launch stage descriptions](/products#product-launch-stages) .\nThis page shows you how to resolve issues with [instant snapshots](/compute/docs/disks/instant-snapshots) .\n[](None)\n", "content": "## Disk deletion errors\nThis section describes errors you might encounter when you move or delete a disk that has instant snapshots.\n### Deleting or moving a disk that has instant snapshots\nThe following error might occur when you try to delete or move a disk:\n```\nDisks with instant snapshots can't be moved or deleted. To move or delete\nthis disk, delete the instant snapshots of the disk.\n```\nThis error occurs because you still have instant snapshots of the disk.\nTo resolve this issue, [delete all instant snapshots](/compute/docs/disks/create-instant-snapshots#delete_an_instant_snapshot) of the disk.\n## Instant snapshot creation errors\nThis section describes errors that might occur when you try to create an instant snapshot.\n### Exceeding the number of instant snapshots for a single disk\nThe following error might occur when you create an instant snapshot of a disk:\n```\nA disk can't have more than 32 instant snapshots. To create an instant snapshot\nof the disk, delete one first.\n```\nThis error occurs because you can't create more than 32 instant snapshots of a single disk.\nTo resolve the error, [delete any instant snapshots](/compute/docs/disks/create-instant-snapshots#delete_an_instant_snapshot) that you no longer need.\n### Exceeding minimum interval between subsequent snapshots\nThis error occurs when you attempt to create a new instant snapshot of a disk within 30 seconds of creating a instant snapshot:\n```\nThe previous instant snapshot is too recent. To create an instant snapshot,\nwait at least 30 seconds and try again.\n```\nTo resolve this error, create a new instant snapshot at most once every 30 seconds.\n### Exceeding the maximum interval between any two snapshots\nThe following error occurs if you try to create a new instant snapshot more than 21 days after any existing instant snapshot of the same disk was created.\n```\nThere can't be more than 21 days between the creation time of any\ntwo instant snapshots of a disk. To create a new instant snapshot, delete the instant snapshots\ncreated more than 21 days ago.\n```\nTo resolve this issue, consider if you still need the older instant snapshots. If not, [delete them](/compute/docs/disks/create-instant-snapshots#delete_an_instant_snapshot) and try again.", "guide": "Compute Engine"}