{"title": "Compute Engine - Monitoring GPU performance on Linux VMs", "url": "https://cloud.google.com/compute/docs/instances", "abstract": "# Compute Engine - Monitoring GPU performance on Linux VMs\nYou can track metrics such as GPU utilization and GPU memory from your virtual machine (VM) instances by using the [Ops Agent](/stackdriver/docs/solutions/agents/ops-agent) , which is Google's recommended telemetry collection solution for Compute Engine. By using the Ops Agent, you can manage your GPU VMs as follows:\n- Visualize the health of your NVIDIA GPU fleet with our pre-configured dashboards.\n- Optimize costs by identifying underutilized GPUs and consolidating workloads.\n- Plan scaling by looking at trends to decide when to expand GPU capacity or upgrade existing GPUs.\n- Use NVIDIA Data Center GPU Manager (DCGM) profiling metrics to identify bottlenecks and performance issues within your GPUs.\n- Set up [managed instance groups (MIGs)](/compute/docs/instance-groups#managed_instance_groups) to autoscale resources.\n- Get alerts on metrics from your NVIDIA GPUs.\nThis document covers the procedures for monitoring GPUs on Linux VMs by using the Ops Agent. Alternatively, a reporting script is available on GitHub that can also be setup for monitoring GPU usage on Linux VMs, see [compute-gpu-monitoring monitoring script](https://github.com/GoogleCloudPlatform/compute-gpu-monitoring/tree/main/linux) . This script is not actively maintained.\nFor monitoring GPUs on Windows VMs, see [Monitoring GPU performance (Windows)](/compute/docs/gpus/monitor-gpus-windows) .\n", "content": "## Overview\nThe Ops Agent, version 2.38.0 or later, can automatically track GPU utilization and GPU memory usage rates on your Linux VMs that have the agent installed. These metrics, obtained from the NVIDIA Management Library (NVML), are tracked per GPU and per process for any process that uses GPUs. To view the metrics that are monitored by the Ops Agent, see [Agent metrics: gpu](/monitoring/api/metrics_opsagent#agent-gpu) .\nYou can also set up the NVIDIA Data Center GPU Manager (DCGM) integration with the Ops Agent. This integration allows the Ops Agent to track metrics using the hardware counters on the GPU. DCGM provides access to the GPU device-level metrics. These include Streaming Multiprocessor (SM) block utilization, SM occupancy, SM pipe utilization, PCIe traffic rate, and NVLink traffic rate. To view the metrics monitored by the Ops Agent, see [Third-party application metrics: NVIDIA Data Center GPU Manager (DCGM)](/monitoring/api/metrics_opsagent#opsagent-dcgm) .\nTo review GPU metrics by using the Ops Agent, complete the following steps:\n- On each VM, check that you have met [the requirements](#requirements) .\n- On each VM, [install the Ops Agent](#install-ops-agent) .\n- Optional: On each VM, set up the [NVIDIA Data Center GPU Manager (DCGM) integration](#dcgm) .\n- Review [metrics in Cloud Monitoring](#review-metrics-dashboard) .## Limitations\n- The Ops Agent doesn't track GPU utilization on VMs that use Container-Optimized OS.## Requirements\nOn each of your VMs, check that you meet the following requirements:\n- Each VM must have [GPUs attached](/compute/docs/gpus/create-vm-with-gpus) .\n- Each VM must have a [GPU driver installed](/compute/docs/gpus/install-drivers-gpu#verify-driver-install) .\n- The Linux operating system and version for each of your VM must support the Ops Agent. See the list of [Linux operating systems](/stackdriver/docs/solutions/agents/ops-agent#linux_operating_systems) that support the Ops Agent.\n- Ensure you have`sudo`access to each VM.## Install the Ops Agent\nTo install the Ops Agent, complete the following steps:\n- If you were previously using the [compute-gpu-monitoring monitoring script](https://github.com/GoogleCloudPlatform/compute-gpu-monitoring/tree/main/linux) to track GPU utilization, disable the service before installing the Ops Agent. To disable the monitoring script, run the following command:```\nsudo systemctl --no-reload --now disable google_gpu_monitoring_agent\n```\n- Install the latest version of the Ops Agent. For detailed instructions, see [Installing the Ops Agent](/stackdriver/docs/solutions/agents/ops-agent/install-index) .\n- After you have installed the Ops agent, if you need to install or upgrade your GPU drivers by using the [installation scripts provided by Compute Engine](/compute/docs/gpus/install-drivers-gpu#installation_scripts) , review the section.## Optional: Set up NVIDIA Data Center GPU Manager (DCGM) integration\nThe Ops Agent also provides integration for NVIDIA Data Center GPU Manager (DCGM) to collect key advanced GPU metrics such as Streaming Multiprocessor (SM) block utilization, SM occupancy, SM pipe utilization, PCIe traffic rate, and NVLink traffic rate.\nThese advanced GPU metrics are not collected from NVIDIA K80, P100, and P4 models.\nFor detailed instructions on how to setup and use this integration on each VM, see [NVIDIA Data Center GPU Manager (DCGM)](/stackdriver/docs/solutions/agents/ops-agent/third-party-nvidia) .\n## Review metrics in Cloud Monitoring\n- In the Google Cloud console, go to the **Monitoring > Dashboards** page. [Go to Monitoring](https://console.cloud.google.com/monitoring/dashboards) \n- Select the **Sample Library** tab.\n- In the filter_list **Filter** field, type **NVIDIA** . The **NVIDIA GPU Monitoring Overview (GCE and GKE)** dashboard displays.If you have set up the NVIDIA Data Center GPU Manager (DCGM) integration, the **NVIDIA GPU Monitoring Advanced DCGM Metrics (GCE Only)** dashboard also displays. \n- For the required dashboard, click **Preview** . The **Sample dashboard preview** page displays.\n- From the **Sample dashboard preview** page, click **Import sample dashboard** .- The **NVIDIA GPU Monitoring Overview (GCE and GKE)** dashboard displays the GPU metrics such as GPU utilization, NIC traffic rate, and GPU memory usage.Your GPU utilization display is similar to the following output: \n- The **NVIDIA GPU Monitoring Advanced DCGM Metrics (GCE Only)** dashboard displays key advanced metrics such as SM utilization, SM occupancy, SM pipe utilization, PCIe traffic rate, and NVLink traffic rate.Your Advanced DCGM Metric display is similar to the following output: \n## What's next?\n- To handle GPU host maintenance, see [Handling GPU host maintenance events](/compute/docs/gpus/gpu-host-maintenance) .\n- To improve network performance, see [Use higher network bandwidth](/compute/docs/gpus/optimize-gpus) .", "guide": "Compute Engine"}