{"title": "Compute Engine - Troubleshooting default service accounts", "url": "https://cloud.google.com/compute/docs/instances", "abstract": "# Compute Engine - Troubleshooting default service accounts\nTo access Google Cloud resources, Compute Engine virtual machine (VM) instances use [service accounts](/iam/docs/service-account-overview) . If you accidentally delete the [Compute Engine default service account](/compute/docs/access/service-accounts#default_service_account) , applications that run on your VMs might not be able to make calls to Google Cloud APIs.\nThis document explains how to recover the Compute Engine default service account after it is deleted.\n", "content": "## Recover the Compute Engine default service account\nWhen you delete a service account, Identity and Access Management (IAM) permanently removes the service account after 30 days. If you accidentally delete the Compute Engine default service account, Google Cloud cannot recover the service account after it is permanently removed and then the VMs will no longer have access to resources in the project. In such cases, if you want to assign a Compute Engine default service account for the VM, create a service account and set it as the default service account.\nTo get the permissions that you need to perform this task,   ask your administrator to grant you the  following IAM roles on project:\n- [Compute Admin ](https://cloud.google.com/iam/docs/understanding-roles#compute.admin) (`roles/compute.admin`)\n- [Logs Viewer ](https://cloud.google.com/iam/docs/understanding-roles#logging.viewer) (`roles/logging.viewer`)\nFor more information about granting roles, see [Manage access](/iam/docs/granting-changing-revoking-access) .\nYou might also be able to get  the required permissions through [custom  roles](/iam/docs/creating-custom-roles) or other [predefined  roles](/iam/docs/understanding-roles) .\nTo recover a deleted Compute Engine default service account, do the following:\n- In the Google Cloud console, go to the **Logs Explorer** page. [Go to Logs Explorer](https://console.cloud.google.com/logs/query) Use the following query to validate when the Compute Engine default service account was deleted:```\nresource.type=\"service_account\"\nprotoPayload.methodName=\"google.iam.admin.v1.DeleteServiceAccount\"\n\"PROJECT_NUMBER-compute@developer.gserviceaccount.com\"\n```Replace `` with the project number of your project. **If the default service account was deleted less than 30 days ago** :Use the `undelete` command to recover the service account. For more information, see [Undelete a serviceaccount](/iam/docs/service-accounts-delete-undelete#undeleting) . **If the default service account was deleted more than 30 days ago** :- [Create a service account](/iam/docs/service-accounts-create#creating) or select an existing service account to set as the new Compute Engine default service account.\n- If you want VMs to use the newly created default service account, [follow these steps](/compute/docs/instances/change-service-account#changeserviceaccountandscopes) :- Go to the **VM instances** page. [Go to VM instances](https://console.cloud.google.com/compute/instances) \n- Click the VM instance name for which you want to use the service account.\n- If the instance is not stopped, click **Stop** . Wait for the instance to be stopped.\n- Next, click **Edit** .\n- Scroll down to the **Service Account** section.\n- From the drop-down list, select the service account to assign to the instance.", "guide": "Compute Engine"}