{"title": "Compute Engine - Troubleshoot full disks and disk resizing", "url": "https://cloud.google.com/compute/docs/instances", "abstract": "# Compute Engine - Troubleshoot full disks and disk resizing\nThis page describes common issues that you might run into when resizing a persistent disk or when your persistent disk is full, and how to fix each of them.\n", "content": "## Before you begin\n- Always [create a snapshot of your disk](/compute/docs/disks/create-snapshots) before performing any troubleshooting steps to ensure that your data is backed up.\n- If you haven't already, set up authentication. [Authentication](/compute/docs/authentication) is the process by which your identity is verified for access to Google Cloud services and APIs. To run code or samples from a local development environment, you can authenticate to Compute Engine as follows.Select the tab for how you plan to use the samples on this page:\nWhen you use the Google Cloud console to access Google Cloud services and   APIs, you don't need to set up authentication.- [Install](/sdk/docs/install) the Google Cloud CLI, then [initialize](/sdk/docs/initializing) it by running the following command:```\ngcloud init\n``` **Note:** If you installed the gcloud CLI  previously, make sure you have the latest version by running`gcloud components  update`.\n- [ Set a default region and zone](/compute/docs/gcloud-compute#set_default_zone_and_region_in_your_local_client) .\nTo use the REST API samples on this page in a local development environment, you use the credentials you provide to the gcloud CLI.- [Install](/sdk/docs/install) the Google Cloud CLI, then [initialize](/sdk/docs/initializing) it by running the following command:\n- ```\ngcloud init\n```## Rate limited error when modifying a disk\nThe following are common errors you might encounter when you attempt to modify your Extreme Persistent Disk or Google Cloud Hyperdisk. You might see these errors appear in a number of places, such as in your serial console output or in application logs.\n- ```\nDisk cannot be resized due to being rate limited.\n```\n- ```\nCannot update provisioned iops due to being rate limited.\n```\n- ```\nCannot update provisioned throughput due to being rate limited.\n```\nReview the following time limits for modifying disks:\n- You can resize an Extreme Persistent Disk or Hyperdisk Throughput volume only once in a 6 hour period.\n- You can resize a Hyperdisk Extreme volume only once in a 4 hour period.\n- You can change the provisioned IOPS or throughput for a Hyperdisk volume only once in a 4 hour period.\nTo resolve these errors, wait the required amount of time since your last modification before attempting to modify the disks again.\n## Disk capacity errors\n### Full disks\nThe following are common errors you might encounter when your persistent disk reaches full capacity. You might see these errors appear in a number of places, such as in your serial console output or in application logs.\n- ```\nNo space left on device\n```\n- ```\nNot enough storage is available to process this command\n```\nTo resolve this issue, do the following:\n- [Create a snapshot](/compute/docs/disks/create-snapshots#creating_snapshots) of the disk.\n- Delete files that you don't need on the disk to free up space.\n- If your disk requires more space after this, [resize the disk](/compute/docs/disks/resize-persistent-disk) .\n### Inaccessible VM due to full boot disk\nYour VM might become inaccessible if its boot disk is full. This scenario can be difficult to identify; it's not always obvious when the VM connectivity issue is due to a full boot disk. The following are examples of common errors you might encounter if you cannot access your VM from the Google Cloud CLI because the boot disk is full:\n- ```\n Network error: Software caused connection abort\n \n```\n- ```\n ERROR: (gcloud.compute.ssh) Could not SSH into the instance. It is possible\n that your SSH key has not propagated to the instance yet. Try running this\n command again. If you still cannot connect, verify that the firewall and\n instance are set to accept ssh traffic.\n \n```\n- ```\n You cannot connect to the VM instance because of an unexpected error. Wait a\n few moments and then try again.\n \n```\n- ```\n No space left on device\n \n```\n- ```\n ERROR Exception calling the response handler. [Errno 2] No usable temporary\n directory found in ['/tmp', '/var/tmp', '/usr/tmp', '/']...\n \n```\nTo resolve the above issues, do the following:\n- Confirm that the VM's SSH failure is due to a full boot disk:```\ngcloud compute instances tail-serial-port-output VM_NAME\n```If the boot disk is full, the resulting output will contain the message `No space left on device` .\n- If you have not already done so, [create a snapshot](/compute/docs/disks/create-snapshots#creating_snapshots) of the VM's boot disk.\n- Try to [restart the VM](/compute/docs/instances/stop-start-instance#stopping_a_vm) .\n- If you still can't access the VM, do the following:- Stop the VM:```\ngcloud compute instances stop VM_NAME\n```Replace `` with the name of your VM.\n- Increase the size of the boot disk:```\ngcloud compute disks resize BOOT_DISK_NAME --size DISK_SIZE\n```Replace the following:- ``: the name of your VM's boot disk\n- ``: the new larger size, in gigabytes, for the boot disk\nFor example, to resize a disk named `example-disk-1` to 6GB, run the following command:```\ngcloud compute disks resize example-disk-1 --size=6GB\n```\n- Start the VM:```\ngcloud compute instances start VM_NAME\n```\n- Reattempt to [SSH to the VM](/compute/docs/instances/connecting-to-instance) . If you still can't access the VM, do one of the following:- Create a new disk from a snapshot. For more information, see [Recovering an inaccessible VM or a full boot disk](/compute/docs/disks/recover-vm#inaccessible_instance) .\n- Boot the VM temporarily in rescue mode, using open source [GCE Rescue tool](https://github.com/googlecloudplatform/gce-rescue) and perform the steps available in [File system issues](#filesystem) .\n## File system issues\n### File system resize\nAfter you resize a VM boot disk, most VMs resize the root file system and restart the VM. However, for some VM images types, you might have to resize the file system manually. If your VM does not support automatic root file system resizing, or if you've resized a data (non-boot) persistent disk, you must manually [resize the file system and partitions](/compute/docs/disks/resize-persistent-disk) .\nTo check if your root file system expanded automatically after you resized your VM boot disk, do the following:\n- Check if your VM resized the boot disk using one of the following methods:- [Inspect your serial port output](/compute/docs/instances/viewing-serial-port-output) . Look for a line that indicates the root partition was resized.For example, on VMs with Debian images, if the automatic resize was successful then the console logs include the line `... expand-root.sh[..]: Resizing ext4 filesystem on /dev/sda1` .\n- If you can connect to a Linux VM using SSH, run the command `df -h` to check if there is free disk space.For example, this output shows that the root file system is 92% full:```\nFilesystem         Size Used Avail Use% Mounted on\nudev           63G  0 63G 0% /dev\ntmpfs           13G 1.4M 13G 1% /run\n/dev/sda1          339G 315G 24G 92% /\n```\n- If your VM didn't resize the root file system, manually [resize the filesystem and partitions](/compute/docs/disks/resize-persistent-disk) .", "guide": "Compute Engine"}