{"title": "Compute Engine - Troubleshooting reservation monitoring", "url": "https://cloud.google.com/compute/docs/instances", "abstract": "# Compute Engine - Troubleshooting reservation monitoring\n[reservations](/compute/docs/instances/reservations-overview)\n", "content": "## Fail to access Cloud Monitoring\n**Issue:** This error occurs when you can't access Monitoring.\n**Resolution:** Make sure that you [grant access to Cloud Monitoring](/monitoring/access-control#grant-monitoring-access) to the current project, or the organization where the current project is located grants access to it.\n## Fail to view the time series of a reservation\n**Issue:** This error occurs when you can't access and view the time series of a reservation.\n**Resolution:** After creating a reservation, its time series becomes available within 30 minutes. If you can't access and view the time series of a reservation after this timeframe, try one of the following:\n- To make sure that a reservation exists, [view the details of the reservation](/compute/docs/instances/reservations-view#describe-reservations) .\n- If you can't view the details of a reservation:- Make sure that you're in the same project where the reservation was created. You can only access and view the time series of a reservation created in the current project.\n- Deleting a reservation also deletes its time series. The time series can't be recovered.\n## MQL query misses an operation\n**Issue:** This error occurs when you attempt to run a MQL query without specifying a `| condition` or `| absent_for` operation.\n**Resolution:** When creating an MQL-based alert condition, make sure to specify one of the following operations at the end of your query:\n- For threshold alerts, specify [condition](/monitoring/mql/reference#condition-tabop) .\n- For absence alerts, specify [absent_for](/monitoring/mql/reference#absent_for-tabop) .\nFor more information, see [Alerting policies with MQL](/monitoring/mql/alerts) .", "guide": "Compute Engine"}