{"title": "Compute Engine - Combine reservations with committed use discounts", "url": "https://cloud.google.com/compute/docs/instances", "abstract": "# Compute Engine - Combine reservations with committed use discounts\n[Committed use discounts (CUDs)](/compute/docs/instances/committed-use-discounts-overview) provide deeply discounted prices for your Compute Engine resources in exchange for 1-year or 3-year committed-use contracts (also known as commitments). You commit to a minimum amount of resource usage or a minimum amount of spend and receive CUDs on your resource usage costs in return. However, commitments don't reserve zonal capacity for your committed resources. To get zonal resources at discounted prices and also ensure that capacity is reserved for them, you must both purchase commitments and create reservations for those zonal resources.\nThis document explains how you can receive CUDs for your reserved resources and how to attach reservations to [resource-based commitments](/compute/docs/instances/signing-up-committed-use-discounts) .\n", "content": "## Before you begin\n- Review the basics of reservations along with their requirements and restrictions. For more information, see [Reservations of Compute Engine zonal resources](/compute/docs/instances/reservations-overview) .\n- If you haven't already, set up authentication. [Authentication](/compute/docs/authentication) is the process by which your identity is verified for access to Google Cloud services and APIs. To run code or samples from a local development environment, you can authenticate to Compute Engine as follows.Select the tab for how you plan to use the samples on this page:\nWhen you use the Google Cloud console to access Google Cloud services and   APIs, you don't need to set up authentication.- [Install](/sdk/docs/install) the Google Cloud CLI, then [initialize](/sdk/docs/initializing) it by running the following command:```\ngcloud init\n``` **Note:** If you installed the gcloud CLI  previously, make sure you have the latest version by running`gcloud components  update`.\n- [ Set a default region and zone](/compute/docs/gcloud-compute#set_default_zone_and_region_in_your_local_client) .\nTo use the REST API samples on this page in a local development environment, you use the credentials you provide to the gcloud CLI.- [Install](/sdk/docs/install) the Google Cloud CLI, then [initialize](/sdk/docs/initializing) it by running the following command:\n- ```\ngcloud init\n```## CUDs for your reserved resources\nYou receive CUDs from active commitments for any [eligible resource usage](/compute/docs/instances/committed-use-discounts-overview#order_of_discount_application) in your projects. If you also have any reservations to hold capacity for resources in that project, CUDs from active commitments can also apply to those reserved resources. For any reserved resources to become eligible to receive CUDs, the following requirements apply:\n- You aren't receiving any other form of discount for your resource usage.\n- Your VMs must be consuming the reservations while the commitments are active.\n- At a minimum, the following properties must match between your active commitments and the reservations that your VMs consume:- Project and region where they apply\n- Machine family seriesDepending on the resource type, you can receive CUDs for your reserved resources in one of the following ways:\n- **vCPUs and memory** : To receive CUDs for either or both of these resource types, you can purchase resource-based or spend-based commitments that include the required resource types. When VMs in your project consume any reservations whose properties match such active commitments, you automatically receive the applicable CUDs for these types of reserved resources. If you reserved more resources than you committed to, then you don't receive CUDs for those additional resources.\n- **GPUs and Local SSD disks** : To receive CUDs for either or both of these resource types, you must do the following:- Purchase resource-based commitments that include the required resource types.\n- Create reservations for all the committed resources with properties that match your commitment, and attach those reservations to the commitment.\nWhen VMs in your project consume these attached reservations, you start to receive the applicable CUDs for these types of reserved resources.## Attach reservations to resource-based commitments\nYou can attach reservations to any resource-based commitment and ensure that capacity is held in specific zones for the committed resources that you plan to use. You can attach multiple reservations to a single commitment; however, a reservation can only be attached to a single commitment. When you purchase a commitment, you can attach reservations to that commitment in one of the following ways:\n- Using existing reservations whose properties match with the commitment\n- Creating new matching reservations while purchasing your commitment\nAfter you purchase a commitment with attached reservations, the reservations remain active as long as the commitment is active. When your commitment expires, Compute Engine automatically deletes any attached reservations. Deleting these reservations has no effect on any running VMs that were consuming those reservations. The running VMs continue to run and you are still charged for those VMs.\n**Important:** For the duration of your commitment's term, you cannot delete or resize any attached reservations that specify GPUs, Local SSD disks, or both. However, you can replace the commitment's existing attached reservations with new ones. For more information on what can and cannot be changed for your attached reservations, see [Allowed changes](#modifying_attached_reservations_allowed_operations) in this document.\n### Committed resources that don't require attached reservations\nCommitted vCPUs and memory don't require you to attach matching reservations to your commitments. Nevertheless, when you purchase a commitment that includes vCPUs, memory, or both, you can still choose to attach reservations that specify those resources. To learn how to purchase commitments solely for vCPUs, memory, or both, without attaching reservations, see [Purchasing commitments without attached reservations](/compute/docs/instances/signing-up-committed-use-discounts#purchasecommitment) .\n### Committed resources that require attached reservations\nCommitted GPUs and Local SSD disks require you to attach matching reservations to your commitments. When you purchase a commitment that includes any GPUs, Local SSD disks, or both, you must also reserve those resources and attach those reservations to your commitment. You can do this using a single reservation or a combination of reservations. When you purchase such a commitment, you can also include vCPUs, memory, or both. However, you don't need to reserve those vCPUs or memory. To learn how to purchase commitments that include either or both GPUs and Local SSD disks, see [Purchase commitments with attached reservations](#purchasing_a_commitment_with_a_reservation) in this document.\nTo view the complete list of machine series that support CUDs for GPUs and Local SSD disks, see the [Commitment types](/compute/docs/instances/signing-up-committed-use-discounts#commitment_types) section in the resource-based CUDs documentation.\n### Quantities of resources allowed in attached reservations\nFor , you can have attached reservations specifying more or less amounts of resources than you are committing to. If you commit to more vCPUs or memory than you reserve, then Compute Engine reserves capacity only for these reserved resources. However, you can still use your additional committed resources depending on their availability in your region. If you reserve more vCPUs or memory than you commit to, then you don't receive CUDs for those additional resources that you reserve.\nFor example, when you purchase a commitment for 4 vCPUs and 30 GB memory, you can choose to do either of the following:\n- Not attach any reservations at all.\n- Attach reservations specifying any combination of these resources types; for example, the following:- 4 vCPUs and 30 GB memory\n- 2 vCPUs and 50 GB memory\n- 10 vCPUs and 10 GB memoryHowever, if your commitment contains , you must reserve and attach all those resources. Your attached reservations must specify the exact numbers and types of the GPUs and Local SSD disks that you are committing to. Consequently, you also cannot have any additional number or types of GPUs or Local SSD disks in your attached reservations. For example, suppose you purchase a commitment for 30 GB memory and 4 NVIDIA P100 GPUs. The attached reservation (or combination of attached reservations) can specify any amount of vCPUs or memory, but it must have exactly 4 GPUs that are of NVIDIA P100 type. In this example, you can't attach reservations specifying any of the following combination of resources:\n- 6 NVIDIA P100 GPUs\n- 2 NVIDIA P100 GPUs\n- 4 NVIDIA P100 GPUs and 2 NVIDIA V100 GPUs\n- 4 NVIDIA P100 GPUs and 4 Local SSD disks## Purchase commitments with attached reservations\nWhen you purchase a new commitment, you can attach reservations to your commitment in either of the following ways:\n- [Using existing reservations whose properties match with the commitment](#purchase-cuds-attach-existing-reservations) \n- [Creating new matching reservations while purchasing of your commitment](#purchase-cuds-attach-new-reservations) \nAfter you purchase a commitment, your commitment becomes active on the following day at 12 AM US and Canadian Pacific Time (UTC-8, or UTC-7 during daylight saving time). Between the time of your commitment purchase and its activation time, the status of your commitment remains as `NOT_YET_ACTIVE` (or as `PENDING` on the Google Cloud console). After activation, the status of your commitment changes to `ACTIVE` . For example, suppose you purchase your commitment on January 20th at 10:00 PM US and Canadian Pacific Time (UTC-8 or UTC-7). Compute Engine creates your commitment immediately with its status as `NOT_YET_ACTIVE` . However, your commitment becomes `ACTIVE` only on January 21st at 12:00 AM US and Canadian Pacific Time (UTC-8 or UTC-7).\n### Requirements\nBefore you purchase a commitment with attached reservations, review these requirements and make sure that your commitment and reservations meet the following criteria:\n- You must purchase the commitment and create the attached reservations in the same project and region.\n- You must purchase the commitment and create the attached reservations for resources from the same machine family series.\n- You must disable the [auto-delete option](/compute/docs/instances/reservations-overview#auto-delete) on the attached reservations.\n- If your commitment has GPUs, then the GPU type specified in the reservation and the commitment must match.\n- For GPUs and Local SSD disks, the number of reserved resources of each resource type must exactly match with the number of committed resources for that resource type. For example, if you want to purchase a commitment for 4 V100 GPUs, then your commitment's attached reservations must specify a total of 4 V100 GPUs. However, the amount of vCPU and memory that you reserve can be more or less than what you commit to.\n- For GPUs, purchase commitments for the specific GPU types that you intend to use. For example, you can purchase commitments for either NVIDIA P100s or NVIDIA V100s, but you cannot use a commitment that was purchased for NVIDIA P100 GPUs to cover NVIDIA V100 GPUs.\n- If your attached reservation is a shared reservation and you want to receive the applicable CUDs when you consume that reservation outside your commitment's project, then you must do both the following:- Share your reservations only between projects that belong to the same Cloud Billing account as the commitment.\n- [Enable CUD sharing](/compute/docs/instances/signing-up-committed-use-discounts#turning_on_committed_use_discount_sharing) for that Cloud Billing account.\n### Attach existing reservations\nYou can attach existing reservations while purchasing your commitment by using the Google Cloud console, the Google Cloud CLI, or REST.\nBefore you purchase a commitment using the Google Cloud console, select the project that you want to use to purchase the commitment. If [CUD sharing](/compute/docs/instances/signing-up-committed-use-discounts#share-committed-use-discounts-across-projects) is enabled for a Cloud Billing account, you can purchase the commitment using any project from that Cloud Billing account. After you select the project, do the following:- In the Google Cloud console, go to the **Committed use discounts** page. [Go to Committed use discounts](https://console.cloud.google.com/compute/commitments) \n- To purchase a commitment, click add_box **Purchase commitment** . The **Purchase a committed use discount** page opens and displays the **Hardware** tab.\n- In the **Name** field, enter a name for your commitment.\n- In the **Region** field, select the region where you want to commit to Compute Engine resources.\n- In the **Commitment type** field, select the machine family series for your committed resources.\n- In the **Duration** field, select your commitment's term duration.\n- In the **Cores** field, enter the number of vCPUs that you want to commit to.\n- In the **Memory** field, enter the amount, in GB, of memory that you want to commit to.\n- To commit to GPUs, in the **GPUs** section, click add **Add GPU** and then do the following:- In the **GPU type** field, select the type of GPU.\n- In the **Number of GPUs** field, enter the number of GPUs.\n- Optional: If your GPU model supports [NVIDIA RTX Virtual Workstations (vWS) for graphics workloads](/compute/docs/gpus#gpu-virtual-workstations) , and you plan to run graphics-intensive workloads, select the **Enable Virtual Workstation (NVIDIA GRID)** checkbox.\n- To commit to Local SSD disks, in the **Local SSDs** section, click add **Add SSD** and then, in the **Number of SSDs** field, specify the number of disks.\n- To attach one or more existing reservations to the commitment, in the **Reservations** field, select **Attach existing reservations** .The Google Cloud console displays a list of all the reservations in your project whose region, machine type, and GPU type match with the commitment. Then, do the following:- Optional. To view reservations with specific properties, in the **Filter** menu, add or remove filters for the properties that you want.\n- Select all the reservations that you want to attach to the commitment.\n **Important:** The types and total number of GPUs and local SSD disks specified across all your attached reservations must match with what you specified in your commitment. Otherwise, you won't be able to purchase the commitment.\n- To finish purchasing your commitment with the attached reservations, do the following:- Click **Purchase** .\n- In the **Purchase a committed use discount** dialog, if you agree with the [service specific terms](/terms/service-terms) , click **Purchase** again.\nTo purchase a commitment by attaching existing reservations, run the [gcloud compute commitments create command](/sdk/gcloud/reference/compute/commitments/create) . In your command, include the `--existing-reservation` flag to specify an existing reservation that you want to attach to your commitment. Include a new instance of this flag for every existing reservation that you want to attach. You can attach any number of existing reservations to your commitment.\nFor example, to purchase a commitment by attaching two reservations to it, run the following command:\n```\ngcloud compute commitments create COMMITMENT_NAME \\\n --region=REGION \\\n --project=PROJECT_ID \\\n --resources=vcpu=COMMITTED_VCPUS,memory=COMMITTED_MEMORY,local-ssd=COMMITTED_LOCAL_SSD \\\n --resources-accelerator=count=COMMITTED_ACCELERATOR_COUNT,type=COMMITTED_ACCELERATOR_TYPE \\\n --plan=DURATION \\\n --type=COMMITMENT_TYPE \\\n --existing-reservation=name='RESERVATION_NAME_1',zone='RESERVATION_ZONE_1' \\\n --existing-reservation=name='RESERVATION_NAME_2',zone='RESERVATION_ZONE_2'\n```\nReplace the following:- ``: the name of the commitment.\n- ``: the region where the commitment is located.\n- ``: the ID of the project where you want to purchase the commitment with the attached reservations.\n- ``: the term duration of the commitment, either`12-month`or`36-month`.\n- `` : the commitment type. The following commitment types provide options for GPUs, Local SSD disks, or both:- `accelerator-optimized`for machine type resources\n- `compute-optimized`for C2 machine type resources\n- `compute-optimized-c2d`for C2D machine type resources\n- `compute-optimized-c3`for C3 machine type resources\n- `compute-optimized-c3d`for C3D machine type resources\n- `general-purpose`for N1 machine type resources\n- `general-purpose-e2`for E2 machine type resources\n- `general-purpose-n2`for N2 machine type resources\n- `general-purpose-n2d`for N2D machine resources\n- `general-purpose-t2d`for Tau T2D machine type resources\n- `graphics-optimized`for G2 machine type resources\n- `memory-optimized`for M1 or M2 machine type resources\n- `memory-optimized-m3`for memory-optimized M3 machine type\n- `` : the number of vCPUs that you want in your commitment. The number must be a positive integer.\n- `` : the amount, in MB or GB, of memory that you want in your commitment. For example, `10240MB` or `10GB` . If you don't specify a unit, Compute Engine uses GB as the unit. You can purchase memory in increments of 0.25 GB.\n- `` : the amount, in GB, of Local SSD space that you want in your commitment. Each Local SSD disk is 375 GB.\n- `` : the number of GPUs that you want in your commitment.\n- `` : the GPU type that you want in your commitment.\n- `` and `` : The names of the existing reservations that you want to attach to the commitment.\n- `` and `` : The zones of the existing reservations that you want to attach to the commitment.\nSuppose you have two reservations `res-01` and `res-02` in the `us-central1-a` and `us-central1-b` zones of the project `myproject` . Suppose that these reservations hold a combined capacity for 4 NVIDIA P100 GPUs and 4 Local SSD disks. To purchase a new commitment in the `us-central1` region of this project for these GPUs and Local SSD disks, and use these existing reservations as attached reservations, run the following command. Note that the example commitment also contains vCPUs and memory.\n```\ngcloud compute commitments create commitment-01 \\\n --region=us-central1 \\\n --project=myproject \\\n --resources=vcpu=96,memory=624GB \\\n --resources-accelerator=type=nvidia-tesla-v100,count=4 \\\n --plan 12-month \\\n --existing-reservation=name=res-01,zone=us-central1-a \\\n --existing-reservation=name=res-02,zone=us-central1-b\n \n```\nTo purchase a commitment by attaching existing reservations, make a `POST` request to the [regionCommitments.insert method](/compute/docs/reference/rest/v1/regionCommitments/insert) . In your request, include the `existingReservations` field to specify a comma-separated list of all the existing reservations that you want to attach to your commitment. You can attach any number of existing reservations to your commitment.\n```\nPOST https://compute.googleapis.com/compute/v1/projects/PROJECT_ID/regions/REGION/commitments\n{\n \"name\": \"COMMITMENT_NAME\",\n \"plan\": \"DURATION\",\n \"type\": COMMITMENT_TYPE,\n \"resources\":\n [ {\n  \"amount\": \"COMMITTED_VCPUS\",\n  \"type\": \"VCPU\"\n },\n {\n  \"amount\": \"COMMITTED_MEMORY\",\n  \"type\": \"MEMORY\"\n },\n {\n  \"acceleratorType\": \"COMMITTED_ACCELERATOR_TYPE\",\n  \"amount\": \"COMMITTED_ACCELERATOR_COUNT\",\n  \"type\": \"ACCELERATOR\"\n }\n {\n  \"amount\": \"COMMITTED_LOCAL_SSD\",\n  \"type\": \"LOCAL_SSD\"\n }\n ],\n \"existingReservations\": \"RESERVATION_URLs\"\n}\n```\nReplace the following:- ``: the name of the commitment.\n- ``: the region where the commitment is located.\n- ``: the ID of the project where you want to purchase the commitment with the attached reservations.\n- ``: the term duration of the commitment, either`TWELVE_MONTH`or`THIRTY_SIX_MONTH`.\n- `` : the commitment type. The following commitment types provide options for GPUs, Local SSD disks, or both:- `GENERAL_PURPOSE_E2`for E2 machine type resources\n- `GENERAL_PURPOSE_N2`for N2 machine type resources\n- `GENERAL_PURPOSE_N2D`for N2D machine resources\n- `COMPUTE_OPTIMIZED_C3`for C3 machine type resources\n- `GENERAL_PURPOSE_C3D`for C3D machine type resources\n- `GENERAL_PURPOSE_T2D`for Tau T2D machine type resources\n- `GENERAL_PURPOSE`for N1 machine type resources\n- `COMPUTE_OPTIMIZED`for C2 machine type resources\n- `COMPUTE_OPTIMIZED_C2D`for C2D machine type resources\n- `MEMORY_OPTIMIZED`for M1 or M2 machine type resources\n- `MEMORY_OPTIMIZED_M3`for memory-optimized M3 machine type\n- `ACCELERATOR_OPTIMIZED`for machine type resources\n- `GRAPHICS_OPTIMIZED`for G2 machine type resources\n- `` : the number of vCPUs that you want in your commitment. The number must be a positive integer.\n- `` : the amount, in MB, of memory that you want in your commitment. For example, `10240MB` . You can purchase memory in increments of 256 MB.\n- `` : the amount, in GB, of Local SSD storage that you want in your commitment. Each Local SSD disks is 375 GB.\n- `` : the number of GPUs that you want in your commitment.\n- `` : the GPU type that you want in your commitment.\n- `` : a comma-separated list of URLs of the existing reservations that you want to attach to the commitment. For example, to attach two reservations, `res-1` and `res-2` , specify the following:```\n\"https://www.googleapis.com/compute/v1/projects/my-project/zones/us-central1-a/reservations/example-res-1\",\n\"https://www.googleapis.com/compute/v1/projects/my-project/zones/us-central1-c/reservations/example-res-2\"\n```\nSuppose you have two reservations `res-01` and `res-02` in the `us-central1-a` and `us-central1-b` zones of the project `myproject` . Suppose that these reservations hold a combined capacity for 4 NVIDIA P100 GPUs and 4 Local SSD disks. To purchase a new commitment in the `us-central1` region of this project for these GPUs and Local SSD disks and to use these existing reservations as attached reservations, make the following `POST` request. Note that the example commitment also contains vCPUs and memory.\n```\nPOST https://compute.googleapis.com/compute/v1/projects/my-project/regions/us-central1/commitments\n{\n \"name\": \"commitment-01\",\n \"plan\": \"TWELVE_MONTH\",\n \"type\": \"GENERAL_PURPOSE\"\n \"resources\":\n [ {\n  \"amount\": \"96\",\n  \"type\": \"VCPU\"\n },\n {\n  \"amount\": \"638976\",\n  \"type\": \"MEMORY\"\n },\n {\n  \"acceleratorType\": \"nvidia-tesla-v100\",\n  \"amount\": \"4\",\n  \"type\": \"ACCELERATOR\"\n },\n {\n  \"amount\": \"1536000\",\n  \"type\": \"LOCAL_SSD\"\n }\n ],\n \"existingReservations\":\n [ \"https://www.googleapis.com/compute/v1/projects/my-project/zone/us-central1-a/reservations/res-01\",\n \"https://www.googleapis.com/compute/v1/projects/my-project/zone/us-central1-b/reservations/res-02\"\n ]\n}\n```\n### Create new reservations to attach\nYou can create your attached reservations while purchasing your commitment by using the Google Cloud console, the Google Cloud CLI, or REST.\nBefore you purchase a commitment using the Google Cloud console, select the project that you want to use to purchase the commitment. If [CUD sharing](/compute/docs/instances/signing-up-committed-use-discounts#share-committed-use-discounts-across-projects) is enabled for a Cloud Billing account, you can purchase the commitment using any project from that Cloud Billing account. After you select the project, do the following:- In the Google Cloud console, go to the **Committed use discounts** page. [Go to Committed use discounts](https://console.cloud.google.com/compute/commitments) \n- To purchase a commitment, click add_box **Purchase commitment** . The **Purchase a committed use discount** page opens and displays the **Hardware** tab.\n- In the **Name** field, enter a name for your commitment.\n- In the **Region** field, select the region where you want to commit to Compute Engine resources.\n- In the **Commitment type** field, select the machine family series for your committed resources.\n- In the **Duration** field, select your commitment's term duration.\n- In the **Cores** field, enter the number of vCPUs that you want to commit to.\n- In the **Memory** field, enter the amount, in GB, of memory that you want to commit to.\n- To commit to GPUs, in the **GPUs** section, click add **Add GPU** and then do the following:- In the **GPU type** field, select the type of GPU.\n- In the **Number of GPUs** field, enter the number of GPUs.\n- Optional: If your GPU model supports [NVIDIA RTX Virtual Workstations (vWS) for graphics workloads](/compute/docs/gpus#gpu-virtual-workstations) , and you plan to run graphics-intensive workloads, select the **Enable Virtual Workstation (NVIDIA GRID)** checkbox.\n- To commit to Local SSD disks, in the **Local SSDs** section, click add **Add SSD** and then, in the **Number of SSDs** field, specify the number of disks.\n- To create a new reservation and attach it to the commitment, in the **Reservations** field, select **Create reservations** and then do the following. Repeat this step for every new reservation that you want to create and attach.- Click **Add a reservation** . The **New reservation** section appears.\n- In the **Name** field, enter a name for your attached reservation.\n- In the **Region** field, select the same region as your commitment.\n- In the **Zone** field, select the zone where you want to reserve your resources.\n- In the **Share type** section, specify how you want to share this reservation in one of the following ways:- To create a single-project reservation, select **Local** .\n- To create a reservation that is shared with multiple projects, select **Shared** . Then, to specify the projects to share the this reservation with, clickadd **Add projects** , and then select the projects that you want from the current project's organization.\n- In the **Use with VM instance** field, select how you want VMs to consume your reservation in one of the following ways:- To allow VMs with matching properties to automatically consume this reservation, click **Use reservation automatically** (default).\n- To consume this reservation's resources only when creating VMs with matching properties that specifically target this reservation by name, click select **Select specific reservation** .\n- In the **Resource details** section, do the following:- In the **Number of VM instances** field, enter the number of VM instances that you want to reserve.\n- In the **Machine configuration** section, specify the properties of your reserved VMs in one of the following ways:- To specify your the properties of your VMs using an existing [instance template](/compute/docs/instance-templates/create-instance-templates) , select **Use instance template** .In the **Instance template** field, select an instance template that specifies the same machine family series as your commitment. If you select a regional instance template, the region of that instance template must also match with the region specified in your commitment.\n- To manually specify the properties of your VMs, select **Select machine type** and then do the following:- Select the machine family that applies to the machine series that you specified for the commitment:- **General purpose** for general-purpose machine series\n- **Compute optimized** for compute-optimized machine series\n- **Memory optimized** for memory-optimized machine series\n- **GPUs** for accelerator-optimized machine series\n- In the table that has **Series** column, select the same machine series that you specified for the commitment.\n- In the **Machine type** field, specify a predefined or custom machine type in one of the following ways:- To choose a predefined machine type, select **Preset** and then select the machine type that you want.\n- To choose a custom machine type, select **Custom** and then specify **Cores** and **Memory** that you want.\n- To specify a minimum CPU platform, GPUs, or both, expand the expand_more **CPU Platform and GPU** menu and do the following:- Optional: To specify a minimum CPU platform, in the **CPU Plaform** list, select an option.\n- Optional: To reserve GPUs, click add **Add GPU** . Then, in the **GPU type** and **Number of GPUs** fields, select the type and number of GPUs for each VM. **Important:** The types and total number of GPUs specified across all your attached reservations must match with what you specified in your commitment. Otherwise, you won't be able to purchase the commitment.\n- To reserve local SSD disks, do the following:- In the **Number of disks** field, select the number of local SSD disks that you want for each VM.\n- In the **Interface type** field, select the interface for the local SSD disks.\n **Important:** The total number of local SSD disks specified across all your attached reservations must must match with what you specified in your commitment. Otherwise, you won't be able to purchase the commitment.\n- To finish specifying the properties for this reservation, click **Done** .\n- To finish purchasing your commitment with the attached reservations, do the following:- Click **Purchase** .\n- In the **Purchase a committed use discount** dialog, if you agree with the [service specific terms](/terms/service-terms) , click **Purchase** again.\nTo create your attached reservations while purchasing your commitment, run the [gcloud compute commitments create command](/sdk/gcloud/reference/compute/commitments/create) .\n **Note:** You can't use the Google Cloud CLI to create your attached reservations using instance templates. Instead, you must manually specify the VM properties for your reservations.\nDepending on whether you want to attach a single reservation or multiple reservations, run the command in one of the following ways:- To create and attach a single reservation to your commitment, define the properties of the attached reservation by running the following command:```\ngcloud compute commitments create COMMITMENT_NAME \\\n --region=REGION \\\n --project=PROJECT_ID \\\n --plan DURATION \\\n --type COMMITMENT_TYPE\n --resources=vcpu=COMMITTED_VCPUS,memory=COMMITTED_MEMORY,local-ssd=COMMITTED_LOCAL_SSD \\\n --resources-accelerator=count=COMMITTED_ACCELERATOR_COUNT,type=COMMITTED_ACCELERATOR_TYPE \\\n --reservation=RESERVATION_NAME \\\n --reservation-zone=RESERVATION_ZONE \\\n --machine-type=RESERVED_MACHINE_TYPE \\\n --require-specific-reservation=REQUIRE_SPECIFIC_RESERVATION_VALUE \\\n --vm-count=NUMBER_OF_RESERVED_VMs \\\n --accelerator=type=RESERVED_ACCELERATOR_TYPE,count=RESERVED_ACCELERATOR_COUNT \\\n --local-ssd=interface=INTERFACE_1,size=375 \\\n --local-ssd=interface=INTERFACE_2,size=375 \\\n --minimum-cpu-platform=MINIMUM_CPU_PLATFORM \\\n --share-setting=SHARE_SETTING \\\n --share-with=CONSUMER_PROJECT_ID_1,CONSUMER_PROJECT_ID_2\n```\n- To create and attach multiple reservations to your commitment, define the reservation's properties using a YAML file and then specify that YAML file in the command that you use to purchase your commitment. Optionally, you can also use this YAML file approach to create and attach a single reservation to your commitment. To create your attached reservations using this approach, do the following:- Create the YAML file in the current directory and specify the configuration that you want for each attached reservation. For example, to specify the configuration of a shared reservation shared with two projects that specifies GPUs, two Local SSD disks, and a minimum CPU platform, include the following text in your YAML file:```\n- reservation: RESERVATION_NAME  reservation_zone: RESERVATION_ZONE  require_specific_reservation: REQUIRE_SPECIFIC_RESERVATION_VALUE  vm_count: NUMBER_OF_RESERVED_VMs  machine_type: RESERVED_MACHINE_TYPE  accelerator:  - count: RESERVED_ACCELERATOR_COUNT    type: RESERVED_ACCELERATOR_TYPE  localssd:  - interface: INTERFACE_1    size: 375  - interface: INTERFACE_2    size: 375  project: OWNER_PROJECT_ID  minimum-cpu-platform: MINIMUM_CPU_PLATFORM  share-setting: SHARE_SETTING  share-with:  - CONSUMER_PROJECT_ID_1  - CONSUMER_PROJECT_ID_2\n```To specify the configuration for multiple reservations, repeat these properties for each reservation that you want to create. You can attach any number of existing reservations that you want to your commitment.\n- Run the `gcloud compute commitments create` command and include the `--reservation-from-file` flag.```\ngcloud compute commitments create COMMITMENT_NAME \\\n --region REGION \\\n --project PROJECT_ID \\\n --plan DURATION \\\n --type COMMITMENT_TYPE \\\n --resources=vcpu=COMMITTED_VCPUS,memory=COMMITTED_MEMORY,local-ssd=COMMITTED_LOCAL_SSD \\\n --resources-accelerator=count=COMMITTED_ACCELERATOR_COUNT,type=COMMITTED_ACCELERATOR_TYPE \\\n --reservations-from-file=YAML_FILE\n```\nReplace the following with the corresponding properties of the commitment and the attached reservations:\n- ``: the name of the commitment.\n- ``: the region where the commitment is located.\n- ``: the ID of the project where you want to purchase the commitment with the attached reservations.\n- ``: the term duration of the commitment, either`12-month`or`36-month`.\n- `` : the commitment type. The following commitment types provide options for GPUs, Local SSD disks, or both:- `general-purpose-e2`for E2 machine type resources\n- `general-purpose-n2`for N2 machine type resources\n- `general-purpose-n2d`for N2D machine resources\n- `compute-optimized-c3`for C3 machine type resources\n- `general-purpose-c3d`for C3D machine type resources\n- `general-purpose-t2d`for Tau T2D machine type resources\n- `general-purpose`for N1 machine type resources\n- `compute-optimized`for C2 machine type resources\n- `compute-optimized-c2d`for C2D machine type resources\n- `memory-optimized`for M1 or M2 machine type resources\n- `memory-optimized-m3`for memory-optimized M3 machine type\n- `accelerator-optimized`for machine type resources\n- `graphics-optimized`for G2 machine type resources\n- `` : the number of vCPUs that you want in your commitment. The number must be a positive integer.\n- `` : the amount, in MB or GB, of memory that you want in your commitment. For example, `10GB` or `10240MB` . If you don't specify a unit, Compute Engine uses GB as the unit. You can purchase memory in increments of 0.25 GB.\n- `` : the amount, in GB, of Local SSD storage that you want in your commitment. Each Local SSD disk is 375 GB.\n- `` : the number of GPUs that you want in your commitment.\n- `` : the GPU type that you want in your commitment.\n- `` : The path to the YAML file that contains the configuration of the attached reservations.\n- ``: the name of the attached reservation.\n- ``: the zone of the attached reservation.\n- ``: specifies if the attached reservation is a specifically targeted reservation; either`true`or`false`. For more information about specifically targeted reservations, see [How reservations work](/compute/docs/instances/reservations-overview#how-reservations-work) .\n- ``: the number of VMs that you want to reserve in the attached reservation.\n- `` : the [machine type](/compute/docs/machine-types) that you want for the VMs in your attached reservation.- For **predefined** machine types, use the format`` `-standard-` ``; for example,`n2-standard-4`.\n- For **custom** machine types, use the format `` `-custom-` `` `-` `` ; for example `n2-custom-4-5120` . For a full list of restrictions, read the [specifications](/compute/docs/instances/creating-instance-with-custom-machine-type#specifications) for custom machine types.Replace the following:- ``: the family of machine types; for example, specify`n2`for N2 VMs.\n- ``: the number of [vCPUs](/compute/docs/cpu-platforms) .\n- ``: the total memory for a reserved VM. Memory must be a multiple of 256 MB and must be supplied in MB; for example, to create an N2 VM with 4 vCPUs and 5 GB of memory, which is 5120 MB, use`n2-custom-4-5120`.\n- `` : the number of GPUs you want to add, per VM, in the attached reservation.\n- `` : the [type of accelerator](/compute/docs/gpus) you want to add in the attached reservation.\n- `` and `` : the type of interface you want the [Local SSD disks](/compute/docs/disks#localssds) for each reserved VM to use. Valid options are: `scsi` and `nvme` . Each Local SSD disk is 375 GB. Repeat the `local_ssd` parameter for each Local SSD disk that you want to add. You can specify up to 24 Local SSD disks.\n- `` : the ID of the project where you want to purchase the commitment with the attached reservation. Specify this field if you want to share your attached reservation across multiple consumer projects.\n- `` : the minimum CPU platform that you want to specify for the attached reservation.\n- `` : the type of sharing for the attached reservation. Specify this field with the value as `projects` if you want to share your attached reservation across multiple consumer projects. Exclude this field if you want create a single-project reservation.\n- `` and `` : the [project IDs](/resource-manager/docs/creating-managing-projects#identifying_projects) of the projects that can share this reservation, for example `project-1` and `project-2` . You can include up to 100 consumer projects. These projects must be in the same organization as the owner project. Don't include the ID of the project where you create this reservation, as that project is allowed to consume this reservation by default. Exclude these fields if you want to create a single-project reservation.\nCompute Engine creates the commitment and the attached reservations only if there are enough resources of the specified machine type in the target zone, and sufficient quota, at the time of your request. If your purchase was successful, you see a success message similar to the following:\n```\nCreated[https://www.googleapis.com/compute/v1/projects/your-project/regions/your-region/commitments/your-commitment-name]\n```\n### Examples for purchasing commitments by creating new reservations to attachThe following example scenarios and commands show how you can purchase a commitment for GPUs, Local SSD disks, or both by creating new reservations to attach to that commitment.Suppose you want to purchase a commitment `commitment-01` in the `us-central1` region that includes 4 NVIDIA V100 GPUs. You want to create a new reservation `reservation-01` as the attached reservation for those GPUs. Suppose you also want to specify Compute Engine to use those reserved GPUs across 2 `n1-standard-32` VMs in the `us-central1-a` zone. To purchase this example commitment with its attached reservation, run the following command:\n```\ngcloud compute commitments create commitment-01 \\\n --region=us-central1 \\\n --project=myproject \\\n --resources=vcpu=96,memory=624GB \\\n --resources-accelerator=type=nvidia-tesla-v100,count=4 \\\n --plan 12-month \\\n --reservation=reservation-01 \\\n --reservation-zone=us-central1-a \\\n --machine-type=n1-standard-32 \\\n --accelerator=type=nvidia-tesla-v100,count=2 \\\n --vm-count=2\n```To commit to and reserve GPUs and Local SSD disks without committing to vCPUs or memory, specify `0` as the value for vCPU and memory quantities. For example, suppose you want to purchase a commitment `commitment-02` for a single NVIDIA P4 GPU in the `us-west2` region. You also want to create a new reservation as the attached reservation and specify Compute Engine to use the reserved GPU on an `n1-standard-2` VM in the `us-west2-b` zone. To purchase this example commitment with its attached reservation, run the following command:\n```\ngcloud compute commitments create commitment-02 \\\n --region=us-west2 \\\n --project=myproject \\\n --resources=vcpu=0,memory=0 \\\n --resources-accelerator=type=nvidia-tesla-p4,count=1 \\\n --plan 12-month \\\n --reservation=reservation-01 \\\n --reservation-zone=us-west2-b \\\n --machine-type=n1-standard-2 \\\n --accelerator=type=nvidia-tesla-p4,count=1 \\\n --vm-count=1\n```Suppose you want to purchase a commitment `commitment-03` for 1 NVIDIA V 100 GPU and 2 Local SSD disks in the `us-central1` region. You also want to create and attach two reservations in the `us-central1-a` zone. In the first reservation, `res-01` , you want to reserve 1 `n1-standard-2` VM with 1 GPU. You want to make `res-01` a targeted reservation, which means that you must specifically target that reservation by name to use its reserved VMs. In the second reservation, `res-02` , you want to reserve 1 `n1-standard-8` VM with 2 types of attached Local SSD disks.\nTo purchase this example commitment with the attached reservations, first create the YAML file with the properties of both reservations.\n```\n- reservation: res-01\n reservation_zone: us-central1-a\n require_specific_reservation: true\n vm_count: 1\n machine_type: n1-standard-2\n accelerator:\n - count: 1\n type: nvidia-tesla-v100\n- reservation: res-02\n reservation_zone: us-central1-a\n vm_count: 1\n machine_type: n1-standard-8\n local_ssd:\n - interface: scsi\n size: 375\n - interface: nvme\n size: 375\n```\nAfter you create the YAML file, to finish purchasing the commitment with its attached reservations, run the following command. Note that the example commitment also contains vCPU and memory resources.\n```\ngcloud compute commitments create commitment-03 \\\n --region=us-central1 \\\n --project=myproject \\\n --resources=vcpu=96,memory=624,local-ssd=750 \\\n --resources-accelerator=type=nvidia-tesla-v100,count=1 \\\n --plan 12-month \\\n --reservations-from-file=YAML_FILE\n```\nTo create your attached reservations while purchasing your commitment, make a `POST` request to the [regionCommitments.insert method](/compute/docs/reference/rest/v1/regionCommitments/insert) . In your request, include the `reservations` field to define a list of all the new reservations that you want to create and attach. You can attach any number of existing reservations that you want to your commitment.- To create your new reservation by manually specifying all the VM properties, include the `instanceProperties` field and exclude the `sourceInstanceTemplate` field.For example, to manually specify the configuration of a shared reservation shared with two projects that specifies GPUs, two Local SSD disks, and a minimum CPU platform, make the following request:```\nPOST https://compute.googleapis.com/compute/v1/projects/PROJECT_ID/regions/REGION/commitments\n{\n\"name\": \"COMMITMENT_NAME\",\n\"plan\": \"DURATION\",\n\"type\": COMMITMENT_TYPE,\n\"resources\":\n[ {\n \"amount\": \"COMMITTED_VCPUS\",\n \"type\": \"VCPU\"\n },\n {\n \"amount\": \"COMMITTED_MEMORY\",\n \"type\": \"MEMORY\"\n },\n {\n \"acceleratorType\": \"COMMITTED_ACCELERATOR_TYPE\",\n \"amount\": \"COMMITTED_ACCELERATOR_COUNT\",\n \"type\": \"ACCELERATOR\"\n }\n {\n \"amount\": \"COMMITTED_LOCAL_SSD\",\n \"type\": \"LOCAL_SSD\"\n }\n],\n\"reservations\":\n[ {\n \"name\": \"RESERVATION_NAME\",\n \"specificReservation\":\n {\n  \"count\": \"NUMBER_OF_RESERVED_VMS\",\n  \"instanceProperties\":\n  {\n  \"guestAccelerators\":\n  [   {\n   \"acceleratorCount\": \"RESERVED_ACCELERATOR_COUNT\",\n   \"acceleratorType\": \"RESERVED_ACCELERATOR_TYPE\"\n   }\n  ],\n  \"localSsds\":\n  [   {\n   \"diskSizeGb\": \"375\",\n   \"interface\": \"RESERVED_INTERFACE_1\"\n   },\n   {\n   \"diskSizeGb\": \"375\",\n   \"interface\": \"RESERVED_INTERFACE_2\"\n   }\n  ],\n  \"machineType\": \"RESERVED_MACHINE_TYPE\",\n  \"minCpuPlatform\": \"MINIMUM_CPU_PLATFORM\"\n  }\n },\n \"specificReservationRequired\": REQUIRE_SPECIFIC_RESERVATION_VALUE\",\n \"zone\": \"RESERVED_ZONE\",\n \"shareSettings\":\n {\n  \"shareType\": \"SPECIFIC_PROJECTS\",\n  \"projectMap\":\n  {\n  \"CONSUMER_PROJECT_ID_1\":\n  {\n   \"projectId\": \"CONSUMER_PROJECT_ID_1\"\n  },\n  \"CONSUMER_PROJECT_ID_2\":\n  {\n   \"projectId\": \"CONSUMER_PROJECT_ID_2\"\n  }\n  }\n }\n }\n]\n}\n```\n- To create your new reservation by specifying an instance template, include the `sourceInstanceTemplate` field and exclude the `instanceProperties` field.```\nPOST https://compute.googleapis.com/compute/v1/projects/PROJECT_ID/regions/REGION/commitments\n{\n\"name\": \"COMMITMENT_NAME\",\n\"plan\": \"DURATION\",\n\"type\": COMMITMENT_TYPE,\n\"resources\":\n[ {\n \"amount\": \"COMMITTED_VCPUS\",\n \"type\": \"VCPU\"\n },\n {\n \"amount\": \"COMMITTED_MEMORY\",\n \"type\": \"MEMORY\"\n },\n {\n \"acceleratorType\": \"COMMITTED_ACCELERATOR_TYPE\",\n \"amount\": \"COMMITTED_ACCELERATOR_COUNT\",\n \"type\": \"ACCELERATOR\"\n }\n {\n \"amount\": \"COMMITTED_LOCAL_SSD\",\n \"type\": \"LOCAL_SSD\"\n }\n],\n\"reservations\":\n[ {\n \"name\": \"RESERVATION_NAME\",\n \"specificReservation\":\n {\n  \"count\": \"NUMBER_OF_RESERVED_VMS\",\n  \"sourceInstanceTemplate\": \"projects/PROJECT_ID/LOCATION/instanceTemplates/INSTANCE_TEMPLATE_NAME\"\n },\n \"specificReservationRequired\": REQUIRE_SPECIFIC_RESERVATION_VALUE\",\n \"zone\": \"RESERVED_ZONE\",\n \"shareSettings\":\n {\n  \"shareType\": \"SPECIFIC_PROJECTS\",\n  \"projectMap\":\n  {\n  \"CONSUMER_PROJECT_ID_1\":\n  {\n   \"projectId\": \"CONSUMER_PROJECT_ID_1\"\n  },\n  \"CONSUMER_PROJECT_ID_2\":\n  {\n   \"projectId\": \"CONSUMER_PROJECT_ID_2\"\n  }\n  }\n }\n }\n]\n}\n```\nReplace the following with the corresponding properties of the commitment and the attached reservations:\n- ``: the name of the commitment.\n- ``: the region where the commitment is located.\n- ``: the ID of the project where you want to purchase the commitment with the attached reservations.\n- ``: the term duration of the commitment, either`TWELVE_MONTH`or`THIRTY_SIX_MONTH`.\n- `` : the commitment type. The following commitment types provide options for GPUs, Local SSD disks, or both:- `ACCELERATOR_OPTIMIZED`for machine type resources\n- `COMPUTE_OPTIMIZED`for C2 machine type resources\n- `COMPUTE_OPTIMIZED_C2D`for C2D machine type resources\n- `COMPUTE_OPTIMIZED_C3`for C3 machine type resources\n- `COMPUTE_OPTIMIZED_C3D`for C3D machine type resources\n- `GENERAL_PURPOSE`for N1 machine type resources\n- `GENERAL_PURPOSE_E2`for E2 machine type resources\n- `GENERAL_PURPOSE_N2`for N2 machine type resources\n- `GENERAL_PURPOSE_N2D`for N2D machine resources\n- `GENERAL_PURPOSE_T2D`for Tau T2D machine type resources\n- `GRAPHICS_OPTIMIZED`for G2 machine type resources\n- `MEMORY_OPTIMIZED`for M1 or M2 machine type resources\n- `MEMORY_OPTIMIZED_M3`for memory-optimized M3 machine type\n- `` : the number of vCPUs that you want in your commitment. The number must be a positive integer.\n- `` : the amount, in MB, of memory that you want in your commitment. For example, `10240MB` . You can purchase memory in increments of 256 MB.\n- `` : the amount, in GB, of Local SSD storage that you want in your commitment. Each Local SSD disk is 375 GB.\n- `` : the number of GPUs that you want in your commitment.\n- `` : the GPU type that you want in your commitment.\n- ``: the name of the attached reservation.\n- ``: the zone of the attached reservation.\n- ``: specifies if the attached reservation is a specifically targeted reservation; either`true`or`false`. For more information about specifically targeted reservations, see [How reservations work](/compute/docs/instances/reservations-overview#how-reservations-work) .\n- ``: the number of VMs that you want to reserve in the attached reservation.\n- `` : the [machine type](/compute/docs/machine-types) that you want for the VMs in your attached reservation.- For **predefined** machine types, use the format`` `-standard-` ``; for example,`n2-standard-4`.\n- For **custom** machine types, use the format `` `-custom-` `` `-` `` ; for example `n2-custom-4-5120` . For a full list of restrictions, read the [specifications](/compute/docs/instances/creating-instance-with-custom-machine-type#specifications) for custom machine types.Replace the following:- ``: the family of machine types; for example, specify`n2`for N2 VMs.\n- ``: the number of [vCPUs](/compute/docs/cpu-platforms) .\n- ``: the total memory for a reserved VM. Memory must be a multiple of 256 MB and must be supplied in MB; for example, to create an N2 VM with 4 vCPUs and 5 GB of memory, which is 5120 MB, use`n2-custom-4-5120`.\n- `` : the number of GPUs you want to add, per VM, in the attached reservation.\n- `` : the [type of accelerator](/compute/docs/gpus) you want to add in the attached reservation.\n- `` and `` : the type of interface you want the [Local SSD disks](/compute/docs/disks#localssds) for each reserved VM to use. Valid options are: `scsi` and `nvme` . Each Local SSD disk is 375 GB. Repeat the `localSsds` parameter for each Local SSD disk that you want to add. You can specify up to 24 Local SSD disks.\n- `` : the minimum CPU platform that you want to specify for the attached reservation.\n- `` : the name of the instance template that you want to use to create your attached reservation.\n- `` : the type of sharing for the attached reservation. Specify this field with the value as `SPECIFIC_PROJECTS` if you want to share your attached reservation across multiple consumer projects. Exclude this field if you want create a single-project reservation.\n- `` and `` : the [project IDs](/resource-manager/docs/creating-managing-projects#identifying_projects) of the projects that can share this reservation; for example, `project-1` and `project-2` . You can include up to 100 consumer projects. These projects must be in the same organization as the owner project. Don't include the ID of the project where you create this reservation, as that project is allowed to consume this reservation by default. Exclude these fields if you want to create a single-project reservation.\nCompute Engine creates the commitment and the attached reservations only if there are enough resources of the specified machine type in the target zone, and sufficient quota, at the time of your request. If your purchase was successful, Compute Engine returns a `200` status for your REST API request.\n### Examples for purchasing commitments by creating new reservations to attachThe following example scenarios and commands show how you can purchase a commitment for GPUs, Local SSD disks, or both by creating new reservations to attach to that commitment.Suppose you want to purchase a commitment `commitment-01` in the `us-central1` region that includes 4 NVIDIA V100 GPUs. You want to create a new reservation `reservation-01` as the attached reservation for those GPUs. Suppose you also want to specify Compute Engine to use those reserved GPUs across 2 `n1-standard-8` VMs in the `us-central1-a` zone. To purchase this example commitment with its attached reservation, make the following `POST` request:\n```\nPOST https://compute.googleapis.com/compute/v1/projects/my-project/regions/us-central1/commitments\n{\n \"name\": \"commitment-01\",\n \"plan\": \"TWELVE_MONTH\",\n \"type\": \"GENERAL_PURPOSE\"\n \"resources\":\n [ {\n  \"amount\": \"96\",\n  \"type\": \"VCPU\"\n },\n {\n  \"amount\": \"638976\",\n  \"type\": \"MEMORY\"\n },\n {\n  \"acceleratorType\": \"nvidia-tesla-v100\",\n  \"amount\": \"4\",\n  \"type\": \"ACCELERATOR\"\n }\n ],\n \"reservations\":\n [ {\n  \"name\": \"reservation-01\",\n  \"specificReservation\":\n  {\n  \"count\": \"2\",\n  \"instanceProperties\":\n  {\n   \"guestAccelerators\":\n   [   {\n    \"acceleratorCount\": 2,\n    \"acceleratorType\": \"nvidia-tesla-v100\"\n   }\n   ],\n   \"machineType\": \"n1-standard-8\"\n  }\n  },\n  \"specificReservationRequired\": false,\n  \"zone\": \"us-central1-a\"\n }\n ]\n}\n```To commit to and reserve GPUs and Local SSD disks without committing to vCPUs or memory, specify `0` as the value for vCPU and memory quantities. For example, suppose you want to purchase a commitment `commitment-02` for a single NVIDIA P4 GPU in the `us-west2` region. You also want to create a new reservation as the attached reservation and specify Compute Engine to use the reserved GPU on an `n1-standard-2` VM in the `us-west2-b` zone. To purchase this example commitment with its attached reservation, make the following `POST` request:\n```\nPOST https://compute.googleapis.com/compute/v1/projects/my-project/regions/us-west2/commitments\n{\n \"name\": \"commitment-02\",\n \"plan\": \"TWELVE_MONTH\",\n \"type\": \"GENERAL_PURPOSE\",\n \"resources\":\n [ {\n  \"amount\": \"0\",\n  \"type\": \"VCPU\"\n },\n {\n  \"amount\": \"0\",\n  \"type\": \"MEMORY\"\n },\n {\n  \"acceleratorType\": \"nvidia-tesla-p4\",\n  \"amount\": \"4\",\n  \"type\": \"ACCELERATOR\"\n }\n ],\n \"reservations\":\n [ {\n  \"name\": \"reservation-01\",\n  \"specificReservation\":\n  {\n  \"count\": \"1\",\n  \"instanceProperties\":\n  {\n   \"guestAccelerators\":\n   [   {\n    \"acceleratorCount\": 4,\n    \"acceleratorType\": \"nvidia-tesla-p4\"\n   }\n   ],\n   \"machineType\": \"n1-standard-2\"\n  }\n  },\n  \"specificReservationRequired\": false,\n  \"zone\": \"us-west2-b\"\n }\n ]\n}\n```Suppose you want to purchase a commitment `commitment-03` for 1 NVIDIA V 100 GPU and 2 Local SSD disks in the `us-central1` region. You also want to create and attach two reservations in the `us-central1-a` zone. In the first reservation, `res-01` , you want to reserve 1 `n1-standard-2` VM with 1 GPU. You want to make `res-01` a targeted reservation, which means that you must specifically target that reservation by name to use its reserved VMs. In the second reservation, `res-02` , you want to reserve 1 `n1-standard-8` VM with 2 types of attached Local SSD disks. To purchase this example commitment with the attached reservations, make the following `POST` request. Note that the example commitment also contains vCPU and memory resources.\n```\nPOST https://compute.googleapis.com/compute/v1/projects/my-project/regions/us-central1/commitments\n{\n \"name\": \"commitment-03\",\n \"plan\": \"TWELVE_MONTH\",\n \"type\": \"GENERAL_PURPOSE\",\n \"resources\":\n [ {\n  \"amount\": \"96\",\n  \"type\": \"VCPU\"\n },\n {\n  \"amount\": \"638976\",\n  \"type\": \"MEMORY\"\n },\n {\n  \"acceleratorType\": \"nvidia-tesla-v100\",\n  \"amount\": \"1\",\n  \"type\": \"ACCELERATOR\"\n },\n {\n  \"amount\": \"768000\",\n  \"type\": \"LOCAL_SSD\"\n }\n ],\n \"reservations\":\n [ {\n  \"name\": \"res-01\",\n  \"specificReservation\":\n  {\n  \"count\": \"1\",\n  \"instanceProperties\":\n  {\n   \"guestAccelerators\":\n   [   {\n    \"acceleratorCount\": 1,\n    \"acceleratorType\": \"nvidia-tesla-v100\"\n   }\n   ],\n   \"machineType\": \"n1-standard-2\"\n  }\n  },\n  \"specificReservationRequired\": true,\n  \"zone\": \"us-central1-a\"\n },\n {\n  \"name\": \"res-02\",\n  \"specificReservation\":\n  {\n  \"count\": \"1\",\n  \"instanceProperties\":\n  {\n   \"localSsds\":\n   [   {\n    \"diskSizeGb\": \"375\",\n    \"interface\": \"SCSI\"\n   },\n   {\n    \"diskSizeGb\": \"375\",\n    \"interface\": \"NVME\"\n   }\n   ]\n   \"machineType\": \"n1-standard-8\"\n  }\n  },\n  \"specificReservationRequired\": false,\n  \"zone\": \"us-central1-a\"\n }\n ]\n}\n```\n## Replace reservations that are attached to commitments\nReplace your commitment's existing attached reservations with new ones if you want to modify the types and numbers of VMs that use your committed resources.\n### Allowed changes\nWhen you replace a commitment's existing attached reservation with a new reservation, you can request any of the following changes:\n- You can reserve VMs from a different machine type. However, you must still reserve VMs from the same machine series in order to continue receiving CUDs for your reserved resources.\n- You can change the number of VMs that you want to reserve.\n- You can change the quantity of GPUs and Local SSD disks that is attached per VM as long as the total quantity of reserved GPUs and Local SSD disks remain the same.\n- You can specify your replaced reservations to be either Local or shared reservations. **Important:** If a reservation attached to a commitment is consumed by a project that is not included in the commitment, then you don't get the discounted price. If your attached reservations are shared reservations, share those reservations only with projects that are included in the commitment to ensure you receive the committed use discounts.\n### Requirements\nWhen you replace your commitment's attached reservation with a new one, your request must meet all of the following requirements:\n- You can replace only one attached reservation at a time with exactly one new attached reservation. To replace an attached reservation, simultaneously remove an existing attached reservation by setting its VM count to 0 and define a new attached reservation that you want to replace it.\n- The new reservation must exist in the same project as the commitment.\n- The new reservation must be located in the same zone as the removed reservation.\n- The amount and types of GPUs specified in the new reservation must match the removed reservation.\n- The numbers and types of Local SSD disks specified in the new reservation must match the removed reservation.\n- You can only change up to 100 VMs per request. To make a change that involves more than 100 VMs, divide the change into multiple smaller requests or reach out to Google Cloud Support.\nYour request to replace a reservation also depends on the capacity availability at that time. If the capacity for a request is unavailable, the request fails and returns a resource availability error, which you can try to resolve by modifying or postponing the request. For more information, see the documentation for [troubleshooting resource availability](/compute/docs/troubleshooting/troubleshooting-reservation-creation#resource-availability) .\nIf your request to replace an attached reservation fails, then the attached reservation and your existing reserved resources remain unaffected. To preserve your capacity, wait to make any corresponding changes to your VMs until after your request to replace a reservation is successful.\n### Steps to replace an attached reservation\nYou can replace a commitment's reservations using the Google Cloud CLI or REST.\nTo replace reservations that are attached to commitments, do the following:- Create a YAML file in the current directory with the configurations of the following attached reservations:- The current reservation that you want to replace.To retrieve the details of this reservation, see [View details of a reservation](/compute/docs/instances/reservations-view#describe-reservations) .\n- The new replacement reservation.\nThe contents of the YAML file are similar to the following:```\n- reservation: CURRENT_RESERVATION_NAME  reservation_zone: CURRENT_RESERVATION_ZONE  vm_count: 0  machine_type: CURRENT_RESERVATION_MACHINE_TYPE  accelerator:  - count: CURRENT_RESERVATION_NUMBER_OF_ACCELERATORS    type: CURRENT_RESERVATION_ACCELERATOR_TYPE  localssd:  - interface: CURRENT_RESERVATION_INTERFACE_1    size: 375  - interface: CURRENT_RESERVATION_INTERFACE_2    size: 375  project: CURRENT_RESERVATION_PROJECT_ID  share-setting: CURRENT_RESERVATION_SHARE_SETTING  share-with:  - CURRENT_RESERVATION_CONSUMER_PROJECT_ID_1  - CURRENT_RESERVATION_CONSUMER_PROJECT_ID_2- reservation: REPLACEMENT_RESERVATION_NAME  reservation_zone: REPLACEMENT_RESERVATION_ZONE  vm_count: REPLACEMENT_RESERVATION_NUMBER_OF_VMs  machine_type: REPLACEMENT_RESERVATION_MACHINE_TYPE  accelerator:  - count: REPLACEMENT_RESERVATION_ACCELERATOR_COUNT    type: REPLACEMENT_RESERVATION_ACCELERATOR_TYPE  localssd:  - interface: REPLACEMENT_RESERVATION_INTERFACE_1    size: 375  - interface: REPLACEMENT_RESERVATION_INTERFACE_2    size: 375  project: REPLACEMENT_RESERVATION_PROJECT_ID  share-setting: REPLACEMENT_RESERVATION_SHARE_SETTING  share-with:  - REPLACEMENT_RESERVATION_CONSUMER_PROJECT_ID_1  - REPLACEMENT_RESERVATION_CONSUMER_PROJECT_ID_2\n```Replace the following with the corresponding properties of the current and replacement reservations:\nFor the current reservation, all of the following properties must be exactly the same as when you viewed the reservation. Omit the fields for any properties that the current reservation does not already have.- ``: the name of the current attached reservation.\n- ``: the zone of the current attached reservation.\n- ``: the [machine type](/compute/docs/machine-types) of the current attached reservation.\n- ``: the number of GPUs reserved in the current attached reservation.\n- ``: the [type of accelerator](/compute/docs/gpus) reserved in the current attached reservation.\n- ``and``: the type of interface that the [Local SSD disk](/compute/docs/disks#localssds) for each reserved VM use in the current attached reservation. Valid options are:`scsi`and`nvme`. Each Local SSD disk is 375 GB. Repeat the`local_ssd`parameter for all the reserved Local SSD disks.\n- ``: the project ID of the current project that has the commitment and the attached reservation. Specify this field if your current attached reservation is shared across multiple consumer projects.\n- ``: The type of sharing for the current reservation. Specify this field with the value as`projects`if your current attached reservation is shared across multiple consumer projects.\n- ``and``: the [project IDs](/resource-manager/docs/creating-managing-projects#identifying_projects) of the projects that you share the current attached reservation with, for example`project-1`and`project-2`.\nFor the replacement reservation, set the following properties as required. Ensure that you meet all the [requirements](#modifying_attached_reservations_requirements) when you specify these properties. Omit any additional fields that you don't want to use.- ``: the name of the new replacement reservation.\n- ``: the zone of the new replacement reservation.\n- ``: the number of VMs that you want to reserve in the new replacement reservation.\n- `` : the [machine type](/compute/docs/machine-types) that you want for the VMs in your new replacement reservation.- For **predefined** machine types, use the format`` `-standard-` ``; for example,`n2-standard-4`.\n- For **custom** machine types, use the format`` `-custom-` `` `-` ``; for example`n2-custom-4-5120`. For a full list of restrictions, read the [specifications](/compute/docs/instances/creating-instance-with-custom-machine-type#specifications) for custom machine types.\nReplace the following:- ``: the family of machine types; for example, specify`n2`for N2 VMs.\n- ``: the number of [vCPUs](/compute/docs/cpu-platforms) .\n- ``: the total memory for a reserved VM. Memory must be a multiple of 256 MB and must be supplied in MB; for example, to create an N2 VM with 4 vCPUs and 5 GB of memory, which is 5120 MB, use`n2-custom-4-5120`.\n- `` : the number of GPUs you want to add, per VM, in the replacement reservation.\n- `` : the [type of accelerator](/compute/docs/gpus) you want to add in the replacement reservation.\n- `` and `` : the type of interface you want the [Local SSD disks](/compute/docs/disks#localssds) for each reserved VM to use. Valid options are: `scsi` and `nvme` . Each Local SSD disk is 375 GB. Repeat the `local_ssd` parameter for each Local SSD disk that you want to add. You can specify up to 24 Local SSD disks.\n- `` : the project ID of the current project that has the commitment and the attached reservation. Specify this field if you want to share your replacement reservation across multiple consumer projects.\n- `` : the type of sharing for the replacement reservation. Specify this field with the value as `projects` if you want to share your replacement reservation across multiple consumer projects.\n- `` and `` : the [project IDs](/resource-manager/docs/creating-managing-projects#identifying_projects) of the projects that can share this reservation, for example `project-1,project-2` . You can include up to 100 consumer projects. These projects must be in the same organization as the owner project. Don't include the `` , which is already allowed to consume this reservation by default.- Run the [gcloud beta compute commitments update-reservations](/sdk/gcloud/reference/beta/compute/commitments/update-reservations) command and specify the path to the YAML file using the `--reservations-from-file` flag.```\ngcloud beta compute commitments update-reservations COMMITMENT_NAME \\\n --project= PROJECT_ID \\\n --region= REGION \\\n --reservations-from-file= YAML_FILE\n```Replace the following:- ``: the name of the commitment with the attached reservation.\n- ``: the project ID of the commitment with the attached reservation.\n- ``: The region where the commitment is located.\n- ``: The path to the YAML file that contains the configuration of the current and replacement reservations.\n### Example for replacing a reservation that is attached to a commitmentTo demonstrate this, this section shows an [example commitment with an attached reservation](#gcloud-example-commitment) and how to [replace the example attached reservation](#gcloud-example-replace) .For example, suppose that you want to update the attached reservations for the `my-commitment-with-reservations` commitment, that was purchased using the following command:\n```\n gcloud beta compute commitments create my-commitment-with-reservations \\\n  --region=asia-east1 \\\n  --resources=vcpu=16,memory=60GB,local-ssd=3000GB \\\n  --resources-accelerator=type=nvidia-tesla-p100,count=4 \\\n  --plan=12-month \\\n  --type=general-purpose \\\n  --reservations-from-file=one-reservation.yaml\n```\nFor this example, suppose that when this command was run, `one-reservation.yaml` was a file in the current directory with the following contents, that define an attached reservation named `res-1` .\n```\n  - reservation: res-1    reservation_zone: asia-east1-a    vm_count: 4    machine_type: n1-standard-4    accelerator:    - count: 1      type: nvidia-tesla-p100    local_ssd:    - interface: scsi      size: 375    - interface: scsi      size: 375\n```\nThis `my-commitment-with-reservations` commitment and the attached reservation `res-1` resulted in the following committed and reserved resources:\n| Resource type | Resources in commitment (my-commitment-with-reservations) | Resources in current attached reservation (res-1)        |\n|:-----------------|:------------------------------------------------------------|:-------------------------------------------------------------------------------|\n| vCPUs and memory | 16 vCPUs and 60 GB           | 16 vCPUs and 60 GB (4 reserved n1-standard-4 VMs)*        |\n| GPUs    | 4 P100 GPUs             | 4 P100 GPUs (1 P100 GPU per VM, for 4 VMs)*         |\n| Local SSD disks | 3000 GB or 8 Local SSD disks        | 3000 GB or 8 Local SSD disks (750 GB or 2 Local SSD disks per VM, for 4 VMs)* |\n Specifically, the example attached reservation, `res-1` , reserves 4 `n1-standard-4` VMs, each with 1 P100 GPU and 2 Local SSD disks of `scsi` interface type. The `n1-standard-4` [machine type](/compute/docs/general-purpose-machines#n1_machines) uses 4 vCPUs and 15 GB for each VM.Suppose you want to replace the attached reservation `res-1` for the with a new attached reservation `res-2` and change the reserved resources to the following:\n| Resource type | Resources in commitment (my-commitment-with-reservations) | Resources in current attached reservation (res-1)        | Resources in replacement attached reservation (res-2)       |\n|:-----------------|:------------------------------------------------------------|:-------------------------------------------------------------------------------|:--------------------------------------------------------------------------------|\n| vCPUs and memory | 16 vCPUs and 60 GB           | 16 vCPUs and 60 GB (4 reserved n1-standard-4 VMs)*        | 16 vCPUs and 60 GB (2 reserved and shared n1-standard-8 VMs)†     |\n| GPUs    | 4 P100 GPUs             | 4 P100 GPUs (1 P100 GPU per VM, for 4 VMs)*         | 4 P100 GPUs (2 P100 GPUs per VM, for 2 VMs)†         |\n| Local SSD disks | 3000 GB or 8 Local SSD disks        | 3000 GB or 8 Local SSD disks (750 GB or 2 Local SSD disks per VM, for 4 VMs)* | 3000 GB or 8 Local SSD disks (1500 GB or 4 Local SSD disks per VM, for 2 VMs)* |\n Specifically, the example attached reservation, `res-1` , reserves 4 `n1-standard-4` VMs, each with 1 P100 GPU and 2 Local SSD disks of `scsi` interface type. The `n1-standard-4` [machine type](/compute/docs/general-purpose-machines#n1_machines) uses 4 vCPUs and 15 GB for each VM.\n Specifically, the replacement attached reservation defines `res-2` , which reserves 2 `n1-standard-8` VMs, each with 1 P100 GPU and 4 Local SSD disks of `scsi` interface type. Additionally, `res-2` is shared with 2 other projects, `project-1` and `project-2` and owned by the current project, `my-project` . The `n1-standard-8` machine type uses 8 vCPUs and 30 GB for each VM.\nTo replace the attached reservation `res-1` with `res-2` for the `my-commitment-with-reservations` commitment, do the following:- Create a file named `two-reservations.yaml` in the current directory that file contains the following contents:```\n- reservation: res-1  reservation_zone: asia-east1-a  vm_count: 0  machine_type: n1-standard-4  accelerator:  - count: 1    type: nvidia-tesla-p100  local_ssd:  - interface: scsi    size: 375  - interface: scsi    size: 375- reservation: res-2  reservation_zone: asia-east1-a  vm_count: 2  machine_type: n1-standard-8  accelerator:  - count: 2    type: nvidia-tesla-p100  project: my-project  share-setting: projects  share-with:  - project-1  - project-2  local_ssd:  - interface: scsi    size: 375  - interface: scsi    size: 375  - interface: scsi    size: 375  - interface: scsi    size: 375\n```\n- Run the following command:```\ngcloud beta compute commitments update-reservations my-commitment-with-reservations \\\n --region=asia-east1-a \\\n --reservations-from-file=two-reservations.yaml\n```\nTo replace reservations that are attached to commitments, make a `POST` request using the [regionCommitments.updateReservations](/compute/docs/reference/rest/beta/regionCommitments/updateReservations) method.\n```\nPOST https://compute.googleapis.com/compute/beta/projects/PROJECT_ID/regions/COMMITMENT_ZONE/commitments/COMMITMENT_NAME/updateReservations{  \"reservations\":  [    {      \"name\": \"REPLACEMENT_RESERVATION_NAME\",      \"specificReservation\":      {        \"count\": \"REPLACEMENT_RESERVATION_NUMBER_OF_VMS\",        \"instanceProperties\":        {          \"guestAccelerators\":          [            {              \"acceleratorCount\": \"REPLACEMENT_RESERVATION_NUMBER_OF_ACCELERATORS\",              \"acceleratorType\": \"REPLACEMENT_RESERVATION_ACCELERATOR_TYPE\"            }          ],          \"localSsds\":          [            {              \"diskSizeGb\": \"375\",              \"interface\": \"REPLACEMENT_RESERVATION_INTERFACE_1\"            },            {              \"diskSizeGb\": \"375\",              \"interface\": \"REPLACEMENT_RESERVATION_INTERFACE_2\"            }          ],          \"machineType\": \"REPLACEMENT_RESERVATION_MACHINE_TYPE\"        }      },      \"zone\": \"REPLACEMENT_RESERVATION_ZONE\",      \"shareSettings\":      {        \"shareType\": \"SPECIFIC_PROJECTS\",        \"projectMap\":        {          \"REPLACEMENT_RESERVATION_CONSUMER_PROJECT_ID_1\":          {            \"projectId\": \"REPLACEMENT_RESERVATION_CONSUMER_PROJECT_ID_1\"          },          \"REPLACEMENT_RESERVATION_CONSUMER_PROJECT_ID_2\":          {            \"projectId\": \"REPLACEMENT_RESERVATION_CONSUMER_PROJECT_ID_2\"          }         }      }    },    {      \"name\": \"CURRENT_RESERVATION_NAME\",      \"specificReservation\":      {        \"count\": \"0\",        \"instanceProperties\":        {          \"guestAccelerators\":          [            {              \"acceleratorCount\": \"CURRENT_RESERVATION_NUMBER_OF_ACCELERATORS\",              \"acceleratorType\": \"CURRENT_RESERVATION_ACCELERATOR_TYPE\"            }          ],          \"localSsds\":          [            {              \"diskSizeGb\": \"375\",              \"interface\": \"CURRENT_RESERVATION_INTERFACE_1\"            },            {              \"diskSizeGb\": \"375\",              \"interface\": \"CURRENT_RESERVATION_INTERFACE_2\"            }          ],          \"machineType\": \"CURRENT_RESERVATION_MACHINE_TYPE\"        }      },      \"zone\": \"CURRENT_RESERVATION_ZONE\",      \"shareSettings\":      {        \"shareType\": \"SPECIFIC_PROJECTS\",        \"projectMap\":        {          \"CURRENT_RESERVATION_CONSUMER_PROJECT_ID_1\":          {            \"projectId\": \"CURRENT_RESERVATION_CONSUMER_PROJECT_ID_1\"          },          \"CURRENT_RESERVATION_CONSUMER_PROJECT_ID_2\":          {            \"projectId\": \"CURRENT_RESERVATION_CONSUMER_PROJECT_ID_2\"          }         }      }    }  ]}\n```\nReplace the following with the corresponding properties of the commitment, the current reservation, and the replacement reservation:\n- ``: the name of the commitment with the attached reservation.\n- ``: the project ID of the commitment with the attached reservation. This is also the project ID for the current and attached reservations.\n- ``: the zone of the commitment with the attached reservation.\nFor the current reservation, all of the following properties must be exactly the same as when you viewed the reservation. Omit the fields for any properties that the current reservation does not already specify.- ``: the name of the current attached reservation.\n- ``: the zone of the current attached reservation.\n- ``: the [machine type](/compute/docs/machine-types) of the current attached reservation.\n- ``: the number of GPUs reserved in the current attached reservation.\n- ``: the [type of accelerator](/compute/docs/gpus) reserved in the current attached reservation.\n- ``and``: the type of interface that the [Local SSD disks](/compute/docs/disks#localssds) for each reserved VM use in the current attached reservation. Valid options are:`scsi`and`nvme`. Each Local SSD disk is 375 GB. Repeat the`localSsds`parameter for all the reserved Local SSD disks.\n- ``: The type of sharing for the current reservation. Specify this parameter with the value as`projects`if your current attached reservation is shared across multiple consumer projects.\n- ``and``: the [project IDs](/resource-manager/docs/creating-managing-projects#identifying_projects) of the projects that you share the current attached reservation with, for example`project-1`and`project-2`.\nFor the replacement reservation, set the following properties as required. Ensure that you meet all the [requirements](#modifying_attached_reservations_requirements) when you specify these properties. Omit any additional fields that you don't want to use.- ``: the name of the new replacement reservation.\n- ``: the zone of the new replacement reservation.\n- ``: the number of VMs that you want to reserve in the new replacement reservation.\n- `` : the [machine type](/compute/docs/machine-types) that you want for the VMs in your new replacement reservation.- For **predefined** machine types, use the format`` `-standard-` ``; for example,`n2-standard-4`.\n- For **custom** machine types, use the format`` `-custom-` `` `-` ``; for example`n2-custom-4-5120`. For a full list of restrictions, read the [specifications](/compute/docs/instances/creating-instance-with-custom-machine-type#specifications) for custom machine types.\nReplace the following:- ``: the family of machine types; for example, specify`n2`for N2 VMs.\n- ``: the number of [vCPUs](/compute/docs/cpu-platforms) .\n- ``: the total memory for a reserved VM. Memory must be a multiple of 256 MB and must be supplied in MB; for example, to create an N2 VM with 4 vCPUs and 5 GB of memory, which is 5120 MB, use`n2-custom-4-5120`.\n- `` : the number of GPUs you want to add, per VM, in the replacement reservation.\n- `` : the [type of accelerator](/compute/docs/gpus) you want to add in the replacement reservation.\n- `` and `` : the type of interface you want the [Local SSD disks](/compute/docs/disks#localssds) for each reserved VM to use. Valid options are: `scsi` and `nvme` . Each Local SSD disk is 375 GB. Repeat the `localSsds` parameter for each Local SSD disks that you want to add. You can specify up to 24 Local SSD disks.\n- `` : The type of sharing for the replacement reservation. Specify this parameter with the value as `projects` if you want to share your replacement reservation across multiple consumer projects.\n- `` and `` : the [project IDs](/resource-manager/docs/creating-managing-projects#identifying_projects) of the projects that can share this reservation, for example `project-1,project-2` . You can include up to 100 consumer projects. These projects must be in the same organization as the owner project. Don't include the `` , which is already allowed to consume this reservation by default.### Example for replacing a reservation that is attached to a commitmentTo demonstrate this, this section shows an [example commitment with an attached reservation](#api-example-commitment) and how to [replace the example attached reservation](#api-example-replace) .For example, suppose that you want to replace the attached reservation `res-1` for the `my-commitment-with-reservations` commitment, that was purchased by making the following `POST` request:\n```\n  POST https://compute.googleapis.com/compute/beta/projects/my-project/regions/asia-east1/commitments  {    \"name\": \"my-commitment-with-reservations\",    \"plan\": \"TWELVE_MONTH\",    \"reservations\":    [      {        \"name\": \"res-1\",        \"specificReservation\":        {          \"count\": \"4\",          \"instanceProperties\":          {            \"guestAccelerators\":            [              {                \"acceleratorCount\": \"1\",                \"acceleratorType\": \"nvidia-tesla-p100\"              }            ],            \"localSsds\":            [              {                \"diskSizeGb\": \"375\",                \"interface\": \"scsi\"              },              {                \"diskSizeGb\": \"375\",                \"interface\": \"scsi\"              }            ],            \"machineType\": \"n1-standard-4\"          }        },        \"zone\": \"asia-east1-a\"      }    ],    \"resources\":    [      {        \"amount\": \"16\",        \"type\": \"VCPU\"      },      {        \"amount\": \"61440\",        \"type\": \"MEMORY\"      },      {        \"acceleratorType\": \"nvidia-tesla-p100\",        \"amount\": \"4\",        \"type\": \"ACCELERATOR\"      }      {        \"amount\": \"3072000\",        \"type\": \"LOCAL_SSD\"      }    ],    \"type\": \"GENERAL_PURPOSE\"  }\n```\nThis `my-commitment-with-reservations` commitment and the attached reservation `res-1` resulted in the following committed and reserved resources:\n| Resource type | Resources in commitment (my-commitment-with-reservations) | Resources in current attached reservation (res-1)        |\n|:-----------------|:------------------------------------------------------------|:-------------------------------------------------------------------------------|\n| vCPUs and memory | 16 vCPUs and 60 GB           | 16 vCPUs and 60 GB (4 reserved n1-standard-4 VMs)*        |\n| GPUs    | 4 P100 GPUs             | 4 P100 GPUs (1 P100 GPU per VM, for 4 VMs)*         |\n| Local SSD disks | 3000 GB or 8 Local SSD disks        | 3000 GB or 8 Local SSD disks (750 GB or 2 Local SSD disks per VM, for 4 VMs)* |\n Specifically, the example attached reservation, `res-1` , reserves 4 `n1-standard-4` VMs, each with 1 P100 GPU and 2 Local SSD disks of `scsi` interface type. The `n1-standard-4` [machine type](/compute/docs/general-purpose-machines#n1_machines) uses 4 vCPUs and 15 GB for each VM.Suppose you want to replace the attached reservation `res-1` for the with a new attached reservation `res-2` and change the reserved resources to the following:\n| Resource type | Resources in commitment (my-commitment-with-reservations) | Resources in current attached reservation (res-1)        | Resources in replacement attached reservation (res-2)       |\n|:-----------------|:------------------------------------------------------------|:-------------------------------------------------------------------------------|:--------------------------------------------------------------------------------|\n| vCPUs and memory | 16 vCPUs and 60 GB           | 16 vCPUs and 60 GB (4 reserved n1-standard-4 VMs)*        | 16 vCPUs and 60 GB (2 reserved and shared n1-standard-8 VMs)†     |\n| GPUs    | 4 P100 GPUs             | 4 P100 GPUs (1 P100 GPU per VM, for 4 VMs)*         | 4 P100 GPUs (2 P100 GPUs per VM, for 2 VMs)†         |\n| Local SSD disks | 3000 GB or 8 Local SSD disks        | 3000 GB or 8 Local SSD disks (750 GB or 2 Local SSD disks per VM, for 4 VMs)* | 3000 GB or 8 Local SSD disks (1500 GB or 4 Local SSD disks per VM, for 2 VMs)* |\n Specifically, the example attached reservation, `res-1` , reserves 4 `n1-standard-4` VMs, each with 1 P100 GPU and 2 Local SSD disks of `scsi` interface type. The `n1-standard-4` [machine type](/compute/docs/general-purpose-machines#n1_machines) uses 4 vCPUs and 15 GB for each VM.\n Specifically, the replacement attached reservation defines `res-2` , which reserves 2 `n1-standard-8` VMs, each with 1 P100 GPU and 4 Local SSD disks of `scsi` interface type. Additionally, `res-2` is shared with 2 other projects, `project-1` and `project-2` and owned by the current project, `my-project` . The `n1-standard-8` machine type uses 8 vCPUs and 30 GB for each VM.\nTo replace the attached reservation `res-1` with `res-2` for the `my-commitment-with-reservations` commitment, make the following `POST` request by using the [regionCommitments.updateReservations](/compute/docs/reference/rest/beta/regionCommitments/updateReservations) method:\n```\n  POST https://compute.googleapis.com/compute/beta/projects/my-project/regions/asia-east1/commitments/my-commitment-with-reservations/updateReservations  {    \"reservations\":    [      {        \"name\": \"res-2\",        \"specificReservation\":        {          \"count\": \"2\",          \"instanceProperties\":          {            \"guestAccelerators\":            [              {                \"acceleratorCount\": 2,                \"acceleratorType\": \"nvidia-tesla-p100\"              }            ],            \"localSsds\":            [              {                \"diskSizeGb\": \"375\",                \"interface\": \"scsi\"              },              {                \"diskSizeGb\": \"375\",                \"interface\": \"scsi\"              },              {                \"diskSizeGb\": \"375\",                \"interface\": \"scsi\"              },              {                \"diskSizeGb\": \"375\",                \"interface\": \"scsi\"              }            ],            \"machineType\": \"n1-standard-8\"          }        },        \"zone\": \"asia-east1-a\"      },      {        \"name\": \"res-1\",        \"specificReservation\":        {          \"count\": \"0\",          \"instanceProperties\":          {            \"guestAccelerators\":            [              {                \"acceleratorCount\": 1,                \"acceleratorType\": \"nvidia-tesla-p100\"              }            ],            \"localSsds\":            [              {                \"diskSizeGb\": \"375\",                \"interface\": \"scsi\"              },              {                \"diskSizeGb\": \"375\",                \"interface\": \"scsi\"              }            ],            \"machineType\": \"n1-standard-4\"          }        },        \"zone\": \"asia-east1-a\"      }    ]  }\n```\n## What's next\n- Learn more about [resource-based CUDs](/compute/docs/instances/signing-up-committed-use-discounts) .\n- Learn how to [consume reservations](/compute/docs/instances/reservations-consume) .\n- Learn how to [modify reservations](/compute/docs/instances/reservations-modify) .\n- Learn how to [delete reservations](/compute/docs/instances/reservations-delete) .", "guide": "Compute Engine"}