{"title": "Compute Engine - Sustained use discounts for Compute Engine", "url": "https://cloud.google.com/compute/docs/instances", "abstract": "# Compute Engine - Sustained use discounts for Compute Engine\nGoogle Cloud offers sustained use discounts (SUDs) on Compute Engine resources that are used for more than 25% of a billing month and are not receiving any other discounts. Whenever you use an applicable resource for more than a fourth of a billing month, Compute Engine automatically gives you sustained use discounts for every incremental hour that you continue to use that resource. The discount increases incrementally with usage and you can get up to a 30% net discount off of the resource cost for virtual machine (VM) instances that run the entire month.\nSustained use discounts apply to the following resources:\n- The vCPUs and memory for [general-purpose custom and predefined machine types](/compute/docs/general-purpose-machines) \n- The vCPUs and memory for [compute-optimized machine types](/compute/docs/compute-optimized-machines) \n- The vCPUs and memory for [memory-optimized machine types](/compute/docs/memory-optimized-machines) \n- The vCPUs and memory for [sole-tenant nodes](/compute/docs/nodes) \n- The premium cost for sole-tenant nodes, even if the vCPUs and memory in those nodes are covered by [committed use discounts](/compute/docs/instances/signing-up-committed-use-discounts) \n- All [GPU devices](/compute/docs/gpus) with the exception of NVIDIA H100, A100, and L4 GPU types.\nCompute Engine offers a maximum monthly SUD percentage of either 20% or 30% depending on the resource and machine types. The following table shows the list of resources that are eligible for each SUD percentage:\n| Maximum of 20% monthly SUDs                                              | Maximum of 30% monthly SUDs                                                                           |\n|:----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|:--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| All general-purpose N2 and N2D predefined and custom machine types All general-purpose N2 and N2D sole-tenant node types All compute-optimized C2 machine types All compute-optimized C2 sole-tenant node types | All general-purpose N1 predefined and custom machine types All general-purpose N1 sole-tenant node types All memory-optimized M1 and M2 machine types All memory-optimized M1 and M2 sole-tenant node types f1-micro and g1-small shared-core machine types All GPU devices with the exception of NVIDIA H100, A100, and L4 GPU types |\n**Note:** For sole-tenant nodes, sustained use discounts apply to the sole-tenant premium costs as well as the base price for the vCPU and memory resources that your nodes occupy.\nSustained use discounts are calculated and applied automatically to usage within a Cloud Billing account, so there is no action required on your part to enable these discounts.\n**Caution:** When you move a project to a new Cloud Billing account in the middle of a month, SUDs are calculated separately for both Cloud Billing accounts. The new Cloud Billing account doesn't take into consideration the sustained resource usage time from your old Cloud Billing account and it restarts the sustained resource usage time calculation from zero. Hence, if you plan to make any modifications to the Cloud Billing accounts of your projects, we recommend that you make these changes on the first day of any given month.\n", "content": "## Limitations\n- Sustained use discounts automatically apply to VMs created by both Google Kubernetes Engine and Compute Engine.\n- Sustained use discounts don't apply to VMs created using the App Engine (standard and flexible) environments and Dataflow.\n- Sustained use discounts apply to only N1, N2, N2D, C2, M1, and M2 machine types.\n### Sustained use discount credits\nAt the end of every month, Compute Engine automatically calculates and applies your earned SUDs to your monthly resource costs. You can view a detailed breakdown of your earned SUDs on the monthly cost table report for your Cloud Billing account on the Google Cloud console. On this report, you see all the applicable SUDs for your resource usage listed as credits.\nAny credits that you see for your SUDs have no cash value. Compute Engine treats these credits as negative costs that offset your monthly resource usage costs. You can't store or use these credits beyond the month in which you receive them.\nFor more information about cost table reports, see [View and download the cost details of your invoice or statement](/billing/docs/how-to/cost-table) .\n## Sustained use discounts at different usage levels\nTo take advantage of the full discount, create your VM instances on the first day of the month. Discounts reset at the beginning of each month.\nThe following tables describe the discount you get at each usage level of a VM. These discounts apply for all machine types but don't apply to preemptible VMs.\n**Sustained use discounts for up to 30%**\nThe following table shows the SUDs breakdown per usage level for the resources that receive a maximum monthly discount of 30%:\n| Resources                                                                 | Usage level (% of month) | % at which incremental is charged | Incremental rate (USD/hour) example: n1-standard-1 VM |\n|:-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|:---------------------------|:------------------------------------|:--------------------------------------------------------|\n| All N1 predefined and custom machine types, All N1 sole-tenant node types, All M1 and M2 machine types, All M1 and M2 sole-tenant node types, f1-micro and g1-small shared-core machine types, All GPU devices with the exception of NVIDIA H100, A100, and L4 GPU types | nan      | nan         | nan              |\n| All N1 predefined and custom machine types, All N1 sole-tenant node types, All M1 and M2 machine types, All M1 and M2 sole-tenant node types, f1-micro and g1-small shared-core machine types, All GPU devices with the exception of NVIDIA H100, A100, and L4 GPU types | 0%–25%      | 100% of base rate     | $0.0475             |\n| All N1 predefined and custom machine types, All N1 sole-tenant node types, All M1 and M2 machine types, All M1 and M2 sole-tenant node types, f1-micro and g1-small shared-core machine types, All GPU devices with the exception of NVIDIA H100, A100, and L4 GPU types | 25%–50%     | 80% of base rate     | $0.0380             |\n| All N1 predefined and custom machine types, All N1 sole-tenant node types, All M1 and M2 machine types, All M1 and M2 sole-tenant node types, f1-micro and g1-small shared-core machine types, All GPU devices with the exception of NVIDIA H100, A100, and L4 GPU types | 50%–75%     | 60% of base rate     | $0.0285             |\n| All N1 predefined and custom machine types, All N1 sole-tenant node types, All M1 and M2 machine types, All M1 and M2 sole-tenant node types, f1-micro and g1-small shared-core machine types, All GPU devices with the exception of NVIDIA H100, A100, and L4 GPU types | 75%–100%     | 40% of base rate     | $0.0190             |\n**Sustained use discounts for up to 20%**\nThe following table shows the SUDs breakdown per usage level for the resources that receive a maximum monthly discount of 20%:\n| Resources                                   | Usage level (% of the month) | % at which incremental is charged | Incremental rate (USD/hour) example: c2-standard-4 VM |\n|:--------------------------------------------------------------------------------------------------------------------------------------------------|:-------------------------------|:------------------------------------|:--------------------------------------------------------|\n| All N2 and N2D predefined and custom machine types, All N2 and N2D sole-tenant node types, All C2 machine types, All C2 sole-tenant node types | nan       | nan         | nan              |\n| All N2 and N2D predefined and custom machine types, All N2 and N2D sole-tenant node types, All C2 machine types, All C2 sole-tenant node types | 0%–25%       | 100% of base rate     | $0.2088             |\n| All N2 and N2D predefined and custom machine types, All N2 and N2D sole-tenant node types, All C2 machine types, All C2 sole-tenant node types | 25%–50%      | 86.78% of base rate     | $0.1811             |\n| All N2 and N2D predefined and custom machine types, All N2 and N2D sole-tenant node types, All C2 machine types, All C2 sole-tenant node types | 50%–75%      | 73.3% of base rate     | $0.1530             |\n| All N2 and N2D predefined and custom machine types, All N2 and N2D sole-tenant node types, All C2 machine types, All C2 sole-tenant node types | 75%–100%      | 60% of base rate     | $0.1252             |\nSustained use discounts are applied on incremental use after you reach certain usage thresholds. This means that you pay only for the number of hours that you use a VM, and Compute Engine automatically gives you the best price. There's no reason to run a VM for longer than you need it.\nThe following graph shows how your effective discount increases with use, up to 30%:\nFor example, if you use a virtual machine for 50% of the month, you get an effective discount of 10%. If you use it for 75% of the month, you get an effective discount of 20%. If you use it for 100% of the month, you get an effective discount of 30%. You can also use the [Google Cloud Pricing Calculator](/products/calculator) to estimate your sustained use discount for any arbitrary workload.\n**Note:** Sustained use discounts apply only to machine type prices. All other charges are applied on top of the discounted machine type price. For example, [premium images](/compute/disks-image-pricing#premiumimages) are charged at an additional fee on top of any sustained use discounted machine type prices.\n## Applying sustained use discounts\nConsider a scenario where you have two VMs or sole-tenant nodes in the same region that have different machine types and run at different times of the month. Compute Engine breaks down the number of vCPUs and amount of memory used across all VMs that use predefined machine types and combines the resources to qualify for the largest sustained usage discounts possible.\nAssume you run the following two VMs in the `us-central1` region during a month:\n- For the first half of the month, you run an`n1-standard-4`VM with 4 vCPUs and 15 GB of memory\n- For the second half of the month, you run a larger`n1-standard-16`VM with 16 vCPUs and 60 GB of memory\nIn this scenario, Compute Engine reorganizes these machine types into individual vCPU and memory resources and combines their usage to create the following resources:\n- 4 vCPUs for a full month\n- 12 vCPUs for half of the month\n- 15 GB of memory for a full month\n- 45 GB of memory for half of the month\nFor example, you can see how the sustained use discounts apply to the vCPUs for this scenario:\nThe monthly bill for these resources would be calculated using the following formulas:\n```\n(4 vCPUs x $0.031611 x 730 hours) x 0.7 for the 30% full-month discount = $64.612884\n```\n```\n(12 vCPUs x $0.031611 x 365 hours) x 0.9 for the 10% half-month discount = $124.610562\n```\n```\n(15 GB x $0.004237 x 730 hours) x 0.7 for the 30% full-month discount = $32.476605\n```\n```\n(45 GB x $0.004237 x 365 hours) x 0.9 for the 10% half-month discount = $62.6334525\n```\nCompare this total to the previous way that sustained use discounts would have been calculated for these same predefined machine types. For example, you can see how the vCPUs are billed when they are inferred by machine type rather than combined by resource types:\n```\n(1 n1-standard-4 machine x $0.189999 x 365 hours) x 0.9 for the 10% half-month discount = $62.4146715\n```\n```\n(1 n1-standard-16 machine x $0.759996 x 365 hours) x 0.9 for the 10% half-month discount = $249.658686\n```\n## Sustained use discounts for GPUs\nFor GPU devices, Compute Engine calculates sustained use discounts based on the number of a GPU model that you have attached to running VMs during the month. You can receive sustained use discounts only on GPUs of the same model. Sustained use discounts for GPUs are calculated separately from VM machine type, vCPU, and memory discounts.\nFor example, consider a scenario where you have two VMs with different numbers of GPUs that run at different non-overlapping times of the month. Compute Engine breaks down the number of GPUs used across all VMs and combines them to qualify for the biggest sustained usage discounts possible.\nIf you run one VM with 1 GPU for the first half of the month, and then run another VM with 4 GPUs for the second half of the month, Compute Engine calculates discounts for these GPUs as if you had used 1 GPU for a whole month and 3 remaining GPUs for half of the month. Compute Engine applies the following sustained use discounts:\n- A 30% discount off the cost of using 1 GPU for a full month\n- A 10% discount off the cost of using the remaining 3 GPUs because you used each resource for half of the month## Viewing sustained use discounts\nSustained use discounts automatically appear on your bill at the end of the billing cycle. Sustained use discounts are a separate line item combining all discounts of all machine types for all projects in your Cloud Billing account.\nYou can view the total sustained use discounts that you receive for each project and the cost of your VMs in the [Google Cloud console](https://console.cloud.google.com/) billing history.\n## Sustained use discounts and Always Free usage quotas\nGoogle Cloud offers [Always Free usage quotas](/free/docs/always-free-usage-limits) that provide free use of one e2-micro VM equivalent to the number of total hours within the current month. This is enough to run one VM without interruption for the entire month. You cannot receive sustained use discounts for use of the free tier VM.\n## What's next\n- Review the [pricing](/compute/vm-instance-pricing) page to understand the price points for different machine types.\n- Consider [committed use discounts](/compute/docs/instances/signing-up-committed-use-discounts) if you have a predictable workload.\n- Get more savings by using [preemptible VMs](/compute/docs/instances/preemptible) .", "guide": "Compute Engine"}