{"title": "Compute Engine - Upgrade the term of commitments", "url": "https://cloud.google.com/compute/docs/instances", "abstract": "# Compute Engine - Upgrade the term of commitments\nYou can upgrade the term of your 1-year commitments and convert them into 3-year commitments to get a higher discount rate for your committed resources and continue receiving the discounts for a longer time period.\nThis document shows you how to upgrade the term of your commitment from 1 year to 3 years.\n", "content": "## Limitations\n- You can upgrade the term for only active commitments.\n- You can't upgrade the term for software license commitments.\n- You can't upgrade the term for your commitments that have`nvidia-tesla-k80`GPUs as commitments for these GPUs are available only as 1-year commitments.## How a term upgrade works\nWhen you upgrade the term for your commitment, the expiration date of the commitment moves into the future by two years. The upgraded commitment term becomes valid at 12 AM US and Canadian Pacific Time (UTC-8, or UTC-7 during daylight saving time) on the day following the upgrade operation and you begin to receive the new discount percentage that is applicable for your upgraded term.\nUpgrading the term doesn't affect the other properties of your commitment. The following commitment properties remain the same after the upgrade operation:\n- Name\n- Start date\n- Region\n- Project\n- Commitment type\n- Auto renew status\n- Committed resources\nAny attached reservations for your commitment continue to exist throughout the lifetime of your upgraded term, unless you manually replace them.\n### Pricing implications for term upgrade\nYour commitment fee is the sum of the discounted prices of all your committed resources. When you upgrade your commitment's term, Compute Engine applies the new 3-year CUD percentage and recalculates the discounted price for each committed resource. To do this recalculation, Compute Engine uses the prevailing on-demand price of each resource on the day your original term became active. This new discounted price for each resource stays the same until the end of your upgraded term, even if the on-demand prices change.\n**Note:** If you merge or split your commitments, then the discounted prices for your committed resources might change on the day your merged or split commitments become active.\nThe following table shows an example where the term of an existing commitment ( `commitment-1` ) gets upgraded by 2 years:\n| Commitment property | Before term upgrade  | After term upgrade  |\n|:----------------------|:--------------------------|:--------------------------|\n| Name     | commitment-1    | commitment-1    |\n| Type     | N2      | N2      |\n| Region    | us-central-1    | us-central-1    |\n| Project    | example-project-1   | example-project-1   |\n| Resources    | vCPUs: 200 Memory: 200 GB | vCPUs: 200 Memory: 200 GB |\n| Term     | 1 year     | 3 years     |\n| Start date*   | January 1, 2020   | January 1, 2020   |\n| End date†    | January 1, 2021   | January 1, 2023   |\n| Auto-renew status  | Disabled     | Disabled     |\nCommitment starts at 12 AM US and Canadian Pacific Time (UTC-8, or UTC-7) on the specified start date. Commitment ends at 12 AM US and Canadian Pacific Time (UTC-8, or UTC-7) on the specified end date.\n## Quota considerations during a term upgrade\nYou don't typically need to request additional quota when you upgrade your commitment's term. However, if you upgrade a commitment's term on the same day that it expires, you must [verify](/compute/docs/instances/signing-up-committed-use-discounts#to-check-quota-in-the-console) that you still have sufficient quota available. That's because on the day that a commitment expires, whatever quota the commitment was using up gets released back into your pool of available quota, and it might get used up by your other business needs.\n## Perform a term upgrade\nUpgrade your commitment's term by using the gcloud CLI, Google Cloud console, or the Compute Engine API.\n**Note:** If you are using the gcloud CLI or the Compute Engine API to upgrade a commitment's term and also want to [enable auto renew](/compute/docs/instances/renew-commitments-automatically) on that commitment, then you must do so using two separate operations. You can perform these two operations at the same time using the Google Cloud console, but on the gcloud CLI or the Compute Engine API, you must enable auto renew either before or after you upgrade the commitment's term.- In the Google Cloud console, select the project where you want to upgrade your commitment's term, and go to the **Committed use discounts** page. [Go to Committed use discounts](https://console.cloud.google.com/compute/commitments) \n- To initiate the term upgrade operation for a commitment, select an active hardware commitment in the **Hardware commitments** tab of the **Commitment list** page and click event_available **Upgrade** .- Alternatively, you can click the name of the active commitment that you want to upgrade. After the **Hardware commitment details** page opens, clickevent_available **Upgrade** .\n- In the **Upgrade committed use discount** pane that appears, verify the **New end time** of your modified commitment and click **Upgrade** .\n- To finish the term upgrade operation and return to the **Commitment list** page, in the **Upgrade your commitment?** dialogue that appears, review the terms and conditions and then click **Upgrade** .\nTo upgrade your commitment's term, use the [gcloud compute commitments update command](/sdk/gcloud/reference/compute/commitments/update) command with the `--plan` flag.\n```\ngcloud compute commitments update COMMITMENT_NAME \\\n --plan=36-month \\\n --region=REGION \\\n --project=PROJECT_NAME\n```\nReplace the following:- ``: the name of the commitment whose term you want to upgrade.\n- ``: the region of your commitment whose term you want to upgrade.\n- ``: the name of the project for which you want to upgrade the commitment.\nFor example, consider a 1-year commitment, `commitment-upgrade-example` , in `us-central1` region and for the project `project-upgrade-example` . The following gcloud CLI command upgrades the commitment's term and modifies it into a 3-year commitment.\n```\ngcloud compute commitments update commitment-upgrade-example \\\n --plan=36-month \\\n --region=us-central1 \\\n --project=project-upgrade-example\n```\nTo upgrade your commitment's term, use the [regionCommitments.update method](/compute/docs/reference/rest/v1/regionCommitments/update) .\n```\nPATCH https://compute.googleapis.com/compute/v1/projects/PROJECT_ID/regions/REGION/commitments/COMMITMENT_NAME\n{\n \"name\": COMMITMENT_NAME,\n \"plan\": \"THIRTY_SIX_MONTH\",\n}\n```\nReplace the following:- ``: the project ID of the project where you want to upgrade your commitment's term.\n- ``: the region of the commitment whose term you want to upgrade.\n- ``: the name of the commitment whose term you want to upgrade.\nFor example, consider a 1-year commitment, `commitment-upgrade-example` in `us-central1` region and for the project `project-upgrade-example` . The following Compute Engine API request upgrades the commitment's term and modifies it into a 3-year commitment.\n```\nPATCH https://compute.googleapis.com/compute/v1/projects/project-upgrade-example/regions/us-central1/commitments/commitment-upgrade-example\n{\n \"name\": \"commitment-upgrade-example\",\n \"plan\": \"THIRTY_SIX_MONTH\",\n}\n```\n## What's next\n- Learn how to [renew commitments automatically](/compute/docs/instances/renew-commitments-automatically) .\n- Learn how to [merge and split resource-based commitments](/compute/docs/instances/merge-and-split-commitments) .\n- Learn how to [analyze the effectiveness of your resource-based committed use discounts](/billing/docs/how-to/cud-analysis-resource-based) .", "guide": "Compute Engine"}