{"title": "Compute Engine - Troubleshooting resource availability errors", "url": "https://cloud.google.com/compute/docs/instances", "abstract": "# Compute Engine - Troubleshooting resource availability errors\nThis document describes how to resolve resource availability errors that might occur when you try to request new Compute Engine resources or create reservations of Compute Engine resources. Resource errors occur when you try to request resources in a zone that cannot accommodate your request due to the current unavailability of a Compute Engine resource, such as GPUs or CPUs.\nResource errors only apply to new resource requests in the zone and do not affect existing resources. Resource errors are not related to your Compute Engine quota and only apply to the resource you specified in your request at the time you sent the request, not to all resources in the zone.\n", "content": "## Common error messages\nThe following are examples of common resource errors that you might encounter when you request new Compute Engine resources or create new reservations:\n```\nZONE_RESOURCE_POOL_EXHAUSTED\n```\n```\nZONE_RESOURCE_POOL_EXHAUSTED_WITH_DETAILS\n```\n```\nThe zone 'projects/PROJECT_ID/zones/ZONE' does not have enough resources available to fulfill the request.\nTry a different zone, or try again later.\n```\n```\nA VM_TYPE_AND_SIZE VM instance with RESOURCE_ATTACHMENT is currently unavailable in the ZONE zone.\nCapacity changes frequently, so try your request in a different zone, with a different VM hardware\nconfiguration, or at a later time. For more options, see troubleshooting documentation.\n```\n```\nA VM_TYPE_AND_SIZE VM instance with RESOURCE_ATTACHMENT is currently unavailable in the ZONE zone, because of REASON.\nConsider trying your request in the ZONE zone(s), which currently has capacity to accommodate your request.\nIf you cannot move your VM to ZONE, review the REASON failure resolution instructions available in troubleshooting documentation, then try your request again.\nIf your workload can't accommodate the suggested resolution, try your request with a different VM hardware configuration or at a later time.\n```\nSome error messages include a `reason` field that provides information about the specific resource that Compute Engine was unable to fulfill from your request. View the [Resource error reasons and recommendations](#reasons-recommendations) section of this document to learn more about the reasons resource errors occur and resolution strategies for each error `reason` .\n## Resolve resource errors\nIn general, the best way to resolve a resource error is to retry the request in a different zone, at a different time, or with a different VM configuration. If the error message you received included a `reason` field, you can find specific remediation recommendations to help you resolve the error in the [Resource error reasons and recommendations](#reasons-recommendations) section of this document.\nIf you're trying to create a zonal managed instance group (MIG) with GPU VMs, then [create a resize request in the MIG](/compute/docs/instance-groups/about-resize-requests-mig) . Resize requests are helpful to obtain highly-demand resources all at once in a MIG and run the VMs for a specific time. Specifying the run duration improves obtainability of highly-demanded resources and avoids unnecessary charges.\nIf you're trying to create a regional MIG, try changing the MIGs distribution shape to [BALANCED](/compute/docs/instance-groups/regional-mig-distribution-shape#how_balanced_works) , [ANY](/compute/docs/instance-groups/regional-mig-distribution-shape#how_any_works) , or [ANY_SINGLE_ZONE](/compute/docs/instance-groups/regional-mig-distribution-shape#how_any_single_zone_works) . For more information about distribution shapes, see [Regional MIG target distribution shape](/compute/docs/instance-groups/regional-mig-distribution-shape) .\nIf you are trying to create Spot VMs (or legacy preemptible VMs), remember that these VMs are spare capacity, which is unplanned and volatile, so they might not be obtainable at peak demand periods. Consequently, Spot VMs are only recommended for workloads with flexible time, location, and VM-configuration requirements. You can help prevent this error for Spot VMs by following the [best practices](/compute/docs/instances/create-use-spot#best-practices) to make your workload more flexible. If this error persists, use [standard VMs](/compute/docs/instances/create-start-instance) instead.\nThe best way to prevent resource errors is to create [Compute Engine reservations](/compute/docs/instances/reserving-zonal-resources) ahead of when you need the resources. Reservations help ensure that resources are available when you need them.\n### Resource error reasons and recommendations\nThe following table provides information about the `reason` field present in some resource error messages and recommendations about resolution strategies for each `reason` .\n| Error reason   | Description                           | Recommendation                                                                                                                       |\n|:-----------------------|:---------------------------------------------------------------------------------------------------------------------|:-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| resource_availability | The type and size of VM that you requested is currently unavailable in the zone that you requested it in.   | Try requesting the VM in another zone.                                                                                                                 |\n| cpu_availability  | A VM with the amount of CPU that you requested is currently unavailable in the zone that you requested it in.  | Try one of the following: If you're requesting a single VM, request the VM in another zone. If you're requesting multiple VMs, try one or more of the following: Request the VMs in another zone. Divide the total amount of vCPU across smaller VMs. For example, if you requested 80 VMs with 224 vCPUs, try requesting 160 VMs with 128 vCPUs each.                                    |\n| memory_availability | A VM with the amount of memory that you requested is currently unavailable in the zone that you requested it in. | Try one of the following: If you're requesting a single VM, request the VM in another zone. If you're requesting multiple VMs, try one or more of the following: Request the VMs in another zone. Split your memory request into multiple VMs. For example, if you requested three VMs with 1.88TB of memory each, divide the request into several VMs that have a total combined memory of 1.88TB.                         |\n| local_ssd_availability | A VM with the amount of local SSD that you requested is currently unavailable in the zone that you requested it in. | Try one of the following: If you're requesting a single VM, request the VM in another zone. If you're requesting multiple VMs, try one or more of the following: Request the VMs in another zone. If your workload permits, request a zonal or regional SSD persistent disk instead of local SSD. Split your local SSD request into multiple VMs. For example, if you requested one VM with 600GB of local SSD, divide the request into several VMs that have a total combined local SSD of 600GB. |\n| gpu_availability  | A VM with the GPU that you requested is currently unavailable in the zone you requested it in.      | Try requesting the VM in another zone.                                                                                                                 |\nIf you were unable to resolve the error using any of the preceding resolution recommendations, try [Getting support](/compute/docs/getting-support) .", "guide": "Compute Engine"}