{"title": "Compute Engine - Troubleshooting standard disk snapshots", "url": "https://cloud.google.com/compute/docs/instances", "abstract": "# Compute Engine - Troubleshooting standard disk snapshots\nThis page shows you how to resolve issues with [standard snapshots](/compute/docs/disks/snapshots) .\n", "content": "## VSS snapshot errors\nThis section lists issues that you might encounter when backing up your disks with [Windows VSS snapshots](/compute/docs/instances/windows/creating-windows-persistent-disk-snapshot) , and provides suggestions for how to fix them.\n### VSS snapshot failed\nThe following error might occur when you attempt to create a VSS snapshot of a disk:\n```\nGuest Consistent Snapshot failed (Detail: Failure within guest).\nVerify you are running the latest image version and agent.\n```\nThis error can occur for several reasons. Some of the most common causes of this error are:\n- **The VM is running an outdated version of the guest environment.** To resolve this issue, [install the latest version of the guest environment](/compute/docs/images/install-guest-environment#update-guest) and then reattempt to create the snapshot.\n- **Many disks are attached to the same snapshot schedule.** When several disks are attached to the same snapshot schedule, Compute Engine starts each snapshot at the same time. In some cases, this may cause some snapshots to fail.To resolve this issue, [create multiple snapshot schedules](/compute/docs/disks/scheduled-snapshots#create_snapshot_schedule) that run at different times, and spread your disks across those schedules.\n### Failure to boot VM after creating VSS snapshot of a boot disk\nWhen you create a VSS snapshot, Windows Server marks the source disk as read-only. When you create a new persistent disk from the VSS snapshot, that disk is also set to read-only mode, which might cause issues.\nFor example, if you create a VM instance with a new boot disk that is based on a VSS snapshot of a boot disk, the read-only flag on the new boot disk prevents the VM instance from booting correctly. In this scenario, the VM might fail to boot with the following errors:\n- ```\nFailed to open disk\n```\n- ```\nStatus: 0xC0000225 Info: The boot selection failed because a required device is inaccessible.\n```\n- ```\nERROR: (gcloud.beta.compute.instances.create) Could not fetch resource:\n - Internal error. Please try again or contact Google Support.\n```\n- ```\nNo startup scripts to run.\n```\nTo resolve these errors, remove the read-only flag from any new disk that you create from a VSS snapshot. For more information, see [Marking your disk asavailable for read and write](/compute/docs/instances/windows/creating-windows-persistent-disk-snapshot#read-only) .\n## Snapshot frequency errors\nThis section lists issues that you might encounter when creating frequent disk snapshots and provides suggestions for how to fix them.\n### Creating snapshots from persistent disks\nIf you try to snapshot your disk more than once during a ten minute period, or if you issue more than six burst snapshot requests in 60 minutes, you see the following error:\n```\n\"code\": \"RESOURCE_OPERATION_RATE_EXCEEDED\",\"message\": \"Operation rate exceeded for resource 'projects/project-id/zones/zone-id/disks/disk-name'. Too frequent operations from the source resource.\"\n```\nTo resolve this issue, take a snapshot of the disk at most once per hour as a best practice. Avoid taking snapshots more often than that. The easiest way to achieve this is to set up a snapshot schedule. For more information, see [Bestpractices for creating snapshots from persistent disks](/compute/docs/disks/snapshot-best-practices#freq-create-snaps) .\n### Creating new zonal persistent disks from snapshots\nIf you try to create a new zonal persistent disk from the same snapshot in the same zone, more than once in 10 minutes, you see the following error:\n```\n\"code\": \"RESOURCE_OPERATION_RATE_EXCEEDED\",\"message\": \"Operation rate exceeded for resource 'projects/project-id/zones/zone-id/disks/disk-name'. Too frequent operations from the source resource.\"\n```\nTo resolve this issue, create an image from the snapshot instead of repeatedly restoring the snapshot in the same zone to create many persistent disks.\nThen, use the image to create new disks. For more information, see [Bestpractices for creating new zonal persistent disks from snapshots](/compute/docs/disks/snapshot-best-practices#freq-create-disks) .", "guide": "Compute Engine"}