{"title": "Compute Engine - Troubleshooting VM shutdowns and reboots", "url": "https://cloud.google.com/compute/docs/instances", "abstract": "# Compute Engine - Troubleshooting VM shutdowns and reboots\nThis document describes the common causes of unexpected shutdowns and reboots of virtual machine (VM) instances and how to prevent them.\nVM shutdowns and reboots can be caused by system events or admin activities. System event shutdowns and reboots are generated by Google systems or your VM's operating system. Admin activity shutdowns and reboots are generated by a user- or service account-generated API call. All shutdowns and reboots are logged, except for reboots that are initiated from within the VM.\n", "content": "## Before you begin\n- If you haven't already, set up authentication. [Authentication](/compute/docs/authentication) is the process by which your identity is verified for access to Google Cloud services and APIs. To run code or samples from a local development environment, you can authenticate to Compute Engine as follows.Select the tab for how you plan to use the samples on this page:\nWhen you use the Google Cloud console to access Google Cloud services and   APIs, you don't need to set up authentication.- [Install](/sdk/docs/install) the Google Cloud CLI, then [initialize](/sdk/docs/initializing) it by running the following command:```\ngcloud init\n``` **Note:** If you installed the gcloud CLI  previously, make sure you have the latest version by running`gcloud components  update`.\n- [ Set a default region and zone](/compute/docs/gcloud-compute#set_default_zone_and_region_in_your_local_client) .\n## Diagnosing VM shutdowns and reboots\nTo diagnose the cause of a VM's spontaneous shutdown or reboot, you must [queryyour VM's logs](#querying) . To quickly identify the cause of future VM shutdowns or reboots, [build a dashboard](#monitor-events) that contains the logs. After you query the logs, review the `method` and `principalEmail` fields to determine what event and which user or service initiated the shutdown or reboot.\n### Querying Cloud Audit Logs\nQuery Cloud Audit Logs to display a list of system events and admin activities that might have caused the shutdown or reboot.- In the Google Cloud console, go to the **Logs Explorer** page. [Go to Logs Explorer](https://console.cloud.google.com/logs/) **Note:** You might need to click **Upgrade** to use Logs Explorer instead of the Legacy Logs Viewer.\n- In the **Query** field, enter the following query:```\nresource.type=\"gce_instance\"\n\"VM_NAME\"\nlogName:(\"logs/cloudaudit.googleapis.com%2Fsystem_event\" OR \"logs/cloudaudit.googleapis.com%2Factivity\")\n```Replace `` with the name of the VM that shut down or rebooted.\n- If the event you're looking for happened more than an hour ago, set a custom time frame by clicking the clock symbol and entering a custom range.\n- Click **Run query** . The results are displayed in the **Queryresults** section. **Tip:** To increase the size of the **Query results** section, click fullscreen **Enter fullscreen Query results** .\n- Click the chevron_right expander arrow next to each result to show detailed information.\n- See [Reviewing Cloud Audit Logs](#reviewing-logs) to learn more about the `method` and `principalEmail` fields that are associated with shutdowns and reboots, and what you can do to prevent them.\n- View Cloud Audit Logs using the [gcloud logging read command](/sdk/gcloud/reference/logging/read) :```\ngcloud logging read --freshness=TIME 'resource.type=\"gce_instance\" \"VM_NAME\" logName:(\"logs/cloudaudit.googleapis.com%2Fsystem_event\" OR \"logs/cloudaudit.googleapis.com%2Factivity\")'\n```Replace the following:- ``: the amount of time you want to query. For example,`1h`queries log entries in the past hour. For information about date and time formats, see [gcloud topic datetimes](/sdk/gcloud/reference/topic/datetimes) .\n- ``: the name of the VM that shutdown or rebooted.\nThe results display.\n- See [Reviewing Cloud Audit Logs](#reviewing-logs) to learn more about the `method` and `principalEmail` fields that are associated with shutdowns and reboots, and what you can do to prevent them.\n### Reviewing Cloud Audit Logs\nReview the `method` and `principalEmail` fields of the Cloud Audit Logs to determine why your VM was shut down or rebooted.\n- Review the `method` fields of the Cloud Audit Logs and compare them with the methods listed in the following table. **Note:** If your VM rebooted and you don't see a comparable method listed in the following table in the Cloud Audit Logs, the reboot likely happened because your VM's operating system initiated the reboot. Causes of reboots are often difficult to identify. If your VMs experience frequent reboots, consider [Getting support](/compute/docs/getting-support) .| Method          | Shutdown type | Description                                                                                                                                                                                                                                                                                                                                                                                                                                                         |\n|:---------------------------------------------|:----------------|:----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| compute.instances.repair.recreateInstance | System event | If your VM belongs to a managed instance group (MIG), the MIG recreates the VM if the VM's state changes from RUNNING and the MIG did not initiate the change in state. Changes of instance state that are not initiated by the MIG include: Hardware failures. Terminating a preemptible instance. Infrastructure maintenance events when the VM instance is not set to live migrate. Deleting a MIG instance by using one of the following methods: The instances.delete API method The gcloud compute instances delete command Note: To ensure that your configuration changes aren't reverted by the MIG, it's important to use the group's methods. For example, to delete a managed instance, use one of the following methods: For a zonal MIG: instanceGroupManagers.deleteInstances For a regional MIG: regionInstanceGroupManagers.deleteInstances In gcloud: gcloud compute instance-groups managed delete-instances                                                                                                                                                                                                                          |\n| compute.instances.hostError     | System event | A host error (compute.instances.hostError) means that there was a hardware or software issue on the physical machine hosting your VM that caused your VM to crash. A host error which involves total hardware failure or other hardware issues might prevent live migration of your VM. If your VM is set to automatically restart, which is the default setting, Google restarts your VM, typically within three minutes from the time the error was detected. Depending on the issue, the restart might take up to 5.5 minutes. VMs with local SSD disks If a host error occurs on a VM that has one or more Local SSD disks attached, Compute Engine makes a best effort to reconnect to the VM and preserve the Local SSD data. While Compute Engine is recovering your VM and Local SSD disk, the host system and the underlying disk are unresponsive. You can specify how much time Compute Engine spends trying to recover Local SSD data by setting the Local SSD recovery timeout. For more information about how Local SSD disks behave when a host error occurs, see Local SSD data persistence. Unresponsive VMs Occasionally, a VM might become unresponsive before a host error is detected. You can reduce the time Compute Engine waits to restart or terminate the VM by setting the host error recovery timeout (Preview). For more information, see Set availability policies. Physical hardware and software failures can happen occasionally but are rare occurrences. To protect your applications and services from these potentially disruptive system events, review the following resources: Designing robust systems Patterns for scalable and resilient apps Creating managed instance groups Google also offers managed services such as App Engine and the App Engine flexible environment. |\n| compute.instances.automaticRestart   | System event | This event occurs after a hostError event or a terminateOnHostMaintenance event if your VM's automaticRestart host maintenance policy is set to true. In the logs, a hostError or a terminateOnHostMaintenance log entry precedes this log. If you want to change your VM's host maintenance policy, see Updating options for an instance.                                                                                                                                                                                                                                                                                                                                                                         |\n| compute.instances.guestTerminate    | System event | Your VM's operating system initiated the shutdown.                                                                                                                                                                                                                                                                                                                                                                                                                                               |\n| compute.instances.terminateOnHostMaintenance | System event | If you set your VM's onHostMaintenance host maintenance policy to TERMINATE, Compute Engine stops your VM when there is a maintenance event where Google must move your VM to another host. If you want to change your VM's onHostMaintenance policy, see Updating options for an instance.                                                                                                                                                                                                                                                                                                                                                                                     |\n| compute.instances.preempted     | System event | Compute Engine preempted your Spot VM or legacy preemptible VM: When Compute Engine preempts a Spot VM, Compute Engine either stops or deletes the Spot VM based on its termination action. Spot VMs do not have a maximum runtime. When Compute Engine preempts a preemptible VM, Compute Engine stops the VM after a maximum runtime of 24 hours. To avoid these limitations, use Spot VMs instead. Spot VMs and preemptible VMs are excess Compute Engine capacity, so Compute Engine might preempt them any time that capacity is needed elsewhere. You can help mitigate the effects of preemption by following the best practices. Alternatively, if you require VMs with user-controlled runtimes, create standard VMs instead.                                                                                                                                                                                                                                                                          |\n| compute.instances.stop      | Admin activity | A user or service account stopped your VM. Continue to the next step to identify the user or service account that stopped your VM. For information about restarting your VM, see Restarting a stopped instance.                                                                                                                                                                                                                                                                                                                                                                                                        |\n| compute.instances.delete      | Admin activity | A user or service account deleted your VM. Continue to the next step to identify the user or service account that deleted your VM. For information about creating a new VM, see Creating and starting a VM.                                                                                                                                                                                                                                                                                                                                                                                                         |\n| compute.instances.insert      | Admin activity | A user or service account created your VM. Continue to the next step to identify the user or service account that created your VM. For information about creating a new VM, see Creating and starting a VM.                                                                                                                                                                                                                                                                                                                                                                                                         |\n| compute.instances.reset      | Admin activity | A user or service account reset your VM. Continue to the next step to identify the user or service account that stopped your VM.                                                                                                                                                                                                                                                                                                                                                                                                                            |\n- Review the `principalEmail` fields of the Cloud Audit Logs to identify the user or service that initiated the shutdown or reboot. The following table include common Google managed services that initiate shutdowns or reboots.| Email           | Description                                                                         |\n|:-------------------------------------------------|:------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| system@google.com        | A system event caused the shutdown or reboot.                                                                |\n| project-number@cloudservices.gserviceaccount.com | A Google-managed service account initiated the shutdown. To determine which project the service initiated the shutdown from, review the service account's project-number. To determine which Google service made the request, review the protoPayload.requestMetadata.callerSuppliedUserAgent field. |If a user triggered the shutdown or reboot, their email address appears in the `principalEmail` field. For example, `cloudysanfrancisco@gmail.com` .Administrators can prevent users from changing the state of project VMs by changing Identity and Access Management permissions on user accounts. For more information, see [Granting, changing, and revoking access to resources](/iam/docs/granting-changing-revoking-access) .## Monitor VM lifecycle events\nYou can monitor VM lifecycle events (including shutdowns, reboots, and host errors) by building a Cloud Monitoring dashboard.\nThis dashboard enables you to visualize [system events and admin activities](/logging/docs/audit#types) that are described in further detail in the [Reviewing Audit Logs section](https://cloud.google.com/compute/docs/troubleshooting/troubleshooting-reboots#reviewing-logs) of this document.\n**Figure 1.** An example dashboard showing the availability of an instance and its lifecycle events such as a stopped instance.\n**Note:** The generated logs used in this dashboard are [chargeable metrics](/stackdriver/pricing#metrics-chargeable) .\n### Create log-based metric\nTo capture VM lifecycle events, create a [user-defined log-based metric](/logging/docs/logs-based-metrics#system-defined_metrics) . This metric uses Audit Logs to keep count of the number of times a particular VM lifecycle event has occurred.\nTo get the permissions that you need to create the metric,   ask your administrator to grant you the [Logs Writer ](https://cloud.google.com/iam/docs/understanding-roles#logging.logWriter) ( `roles/logging.logWriter` ) IAM role on the project.    For more information about granting roles, see [Manage access](/iam/docs/granting-changing-revoking-access) .\nYou might also be able to get  the required permissions through [custom  roles](/iam/docs/creating-custom-roles) or other [predefined  roles](/iam/docs/understanding-roles) .\nCreate a user-defined log-based metric by doing the following:\n- In the Google Cloud console, go to the **Log-based Metrics** page. [Go to Log-based Metrics](https://console.cloud.google.com/logs/metrics) \n- Click on **Create Metric** .\nIn the **Metric Type** section, do the following:\n- Select`Counter`.\n- Leave **Distribution** at the default setting of unselected.\nIn the **Details** section, enter the following information:\n- **Log-based metric name** :`vm-lifecycle-events`. You must use this exact name for the dashboard to work correctly.\n- **Description** : Optional — Enter a description for this metric.\n- **Units** :`1`\n- In the **Filter selection** section, specify the following:- From the **Select log scope** drop-down-menu, select: Project logs\n- In the **Build filter** enter:```\nresource.type = \"gce_instance\" ANDlog_id(\"cloudaudit.googleapis.com/activity\") ORlog_id(\"cloudaudit.googleapis.com/system_event\")operation.first=\"true\"\n```\n- In the **Labels** section, click **Add label** .\n- Specify the following:- **Label name** :`method`\n- **Label type** :`STRING`\n- **Field name** :`protoPayload.methodName`\n- **Regular expression** :```\n(recreateInstance|hostError|automaticRestart|guestTerminate|terminateOnHostMaintenance|preempted|insert|stop|delete|reset|start)\n```\n- Click **Done** \n- Click **Create metric** .\n### Use the dashboard\nNo data appears on the dashboard until a VM experiences a system event or an admin activity. To test that the dashboard works, perform an admin activity, such as a `stop` and `start` operation:\n- Perform a [stop and start operation](/compute/docs/instances/stop-start-instance) on any existing VM, or create a new VM for testing purposes.\nTo get the permissions that you need to use the dashboard,   ask your administrator to grant you the [Monitoring Dashboard Viewer ](https://cloud.google.com/iam/docs/understanding-roles#monitoring.dashboardViewer) ( `roles/monitoring.dashboardViewer` ) IAM role on the project.    For more information about granting roles, see [Manage access](/iam/docs/granting-changing-revoking-access) .\nYou might also be able to get  the required permissions through [custom  roles](/iam/docs/creating-custom-roles) or other [predefined  roles](/iam/docs/understanding-roles) .\n- Open **Dashboards** in the Google Cloud console. [Go to Dashboards](https://console.cloud.google.com/monitoring/dashboards) \n- From the **Dashboard List** tab open the `GCE VM Lifecycle Events Monitoring` dashboard.\n- Select the VM from the **Name** drop-down menu.\n- Narrow the time series to a relevant timeframe.For more ways to filter the dashboard see [Add a temporary filter](/monitoring/charts/filter-dashboard#add-temp-filter) .\nThe dashboard contains two charts that display a timeline of system events and admin activities that occur on a VM:\n- The **VM Lifecycle Timeline** chart displays the following:- The [compute.googleapis.com/instance/uptime](/monitoring/api/metrics_gcp#gcp-compute) metric that indicates whether the VM was running at a given point in time, where 1 is up and 0 is down. Note this metric reflects availability as a result of user activity and system events, and is not an indication of [Compute Engine SLA](/compute/sla) .\n- The`vm-lifecycle-events`log-based metric to count the number of lifecycle actions, such as`stop`or`start`that performed were performed against the VM at a given point in time\n- The Events chart shows the same `vm-lifecycle-events` log-based metric but in a magnified view for easier readability. Note that although the X-axes are aligned, the colors are not synchronized between the two charts.## Investigating mass VM shutdown across projects\nCompute Engine might shut down multiple VMs that are connected to a Shared VPC host project, if the Shared VPC host project's billing is inactive or disabled.\nTo determine if your VMs have been shut down by a mass shutdown request, look for stop operations initiated by `cloud-cluster-manager@prod.google.com` .\nStarting an affected instance returns an error similar to the following:\n```\nStarting instance(s) INSTANCE_NAME...failed.\nERROR: (gcloud.compute.instances.start) The default network interface [nic0] is frozen.\n```\nTo resolve this issue, do the following:\n- Identify the Shared VPC used by the VMs, by using the [gcloud compute instances describe command](/sdk/gcloud/reference/compute/instances/describe) :```\ngcloud compute instances describe VM_NAME \\\n --format=\"flattened(networkInterfaces[].network)\"\n```The output is similar to the following:```\nnetworkInterfaces[0].network: https://www.googleapis.com/compute/v1/projects/SHARED_VPC_PROJECT/global/networks/FROZEN_NETWORK\n```\n- Verify in the Shared VPC's host project if billing has been disabled.```\nresource.type=\"project\"protoPayload.request.@type=\"type.googleapis.com/google.internal.cloudbilling.billingaccount.v1.DisableResourceBillingRequest\"protoPayload.response.resourceBillingInfo.billingAccountAssignmentType=\"DISABLED\"\n```\n- If applicable, [Enable billing on the host project](/billing/docs/how-to/modify-project) .\nTo help prevent this issue from reoccurring, read [Secure the link between a project and its billing account](/billing/docs/how-to/secure-project-billing-account-link) .", "guide": "Compute Engine"}