{"title": "Compute Engine - Troubleshoot future reservation requests", "url": "https://cloud.google.com/compute/docs/instances", "abstract": "# Compute Engine - Troubleshoot future reservation requests\n**    Preview     ** This product or feature is subject to the \"Pre-GA Offerings Terms\" in the General Service Terms section   of the [Service Specific Terms](/terms/service-terms#1) .     Pre-GA products and features are available \"as is\" and might have limited support.    For more information, see the [launch stage descriptions](/products#product-launch-stages) .\nThis document explains how to resolve issues when creating or modifying [future reservation requests](/compute/docs/instances/future-reservations-overview) for Compute Engine zonal resources.\n", "content": "## General future reservation requests errors\nFailure to create or modify a future reservation request might be due to one of the errors in this section.\n### Can't access and see future reservations\nIf you can't access and use future reservations in the gcloud CLI or Compute Engine API, you might not be eligible to access and use future reservations at this time. In that case, contact your [Technical Account Manager](/tam) or the [Sales Team](/contact) .\n### Exceeded maximum number of consumer projects\nThis error occurs when you specify more than 100 consumer projects for a shared future reservation request.\n**Error message** :\n```\nCan only share with at most 100 projects.\n```\n**Resolution** : You can specify up to 100 consumer projects for a shared future reservation request. If you want to specify more, create multiple shared future reservation requests. For more information, see the [best practices](/compute/docs/instances/reservations-shared#best_practices) for shared on-demand reservations.\n### Invalid deletion time for the auto-created reservations\nThis error occurs when you specify an invalid deletion time for the auto-created reservations for a future reservation request.\n**Error message** :\n```\nAuto-created reservations cannot be deleted before future reservation end time.\n```\n**Resolution** : You can only delete an auto-created reservation for a future reservation after the end time of the reservation period. To view the date and time when you can delete an auto-created reservation, [view the details of the reservation](/compute/docs/instances/reservations-view#describe-reservations) and look for the value of the `deleteAtTime` field.\n### Invalid end time\nThis error occurs when you specify an invalid duration for the reservation period of a future reservation request.\n**Error message** :\n```\nFuture reservation end time must be at least 24 hours later than start time.\n```\n**Resolution** : The end time of a reservation period must be at least 24 hours later than the start time of the reservation period. Additionally, to increase the likelihood that Google Cloud approves your future reservation request, make sure to specify one of the [recommended values for your reservation period](/compute/docs/instances/future-reservations-overview#recommended-minimum-reservation-period) .\n### Invalid start time\nThis error occurs when you specify an invalid start time for the reservation period of a future reservation request.\n**Error messages** :\n```\nFuture reservation start time is either in the past or too early.\n```\n**Resolution** : When creating or modifying a future reservation request, make sure to specify a start time of the reservation period that is at least 1 hour later than the date and time at which you submit a future reservation request for review. However, to increase the likelihood that Google Cloud approves your future reservation request, specifying a [recommended value for the start time](/compute/docs/instances/future-reservations-overview#recommended-start-time) is recommended.\n### Overlapping consumer projects\nThis error occurs when your current project, or a project you want to share a future reservation request with, contains one or both of the following:\n- A shared reservation with matching VM properties and zone that specifies a consumer project that isn't specified in the future reservation request that you want to create.\n- A future reservation request with matching VM properties and zone that specifies an owner or consumer project that is not specified in the future reservation request that you want to create.\n**Error message** :\n```\nFuture reservation with conflicting projects and matching instance properties with existing and overlapping shared projects is not allowed.\n```\n**Resolution** : When you're creating a future reservation request, make sure to follow the [restrictions for creating future reservation requests](/compute/docs/instances/future-reservations-overview#restrictions-create) .\nIf you need to delete or modify auto-created reservations, on-demand reservations, or future reservation requests to stop them from restricting the type of future reservation requests that you can create, do one or more of the following:\n- Modify existing [draft](/compute/docs/instances/manage-future-reservations#modify-draft-future-reservation) or [approved shared future reservation requests](/compute/docs/instances/manage-future-reservations#modify-submitted-future-reservation) to change their consumer projects or share type.\n- [Modify existing on-demand or auto-created reservations](/compute/docs/instances/reservations-modify#modifying-consumer-projects-shared-reservation) to modify their consumer projects. You can only modify an auto-created reservation after the end of its reservation period.\n- [Delete any existing future reservation requests](/compute/docs/instances/manage-future-reservations#delete-future-reservation) before the start time of its reservation period or after the end time of its reservation period.\n- [Delete any existing on-demand or auto-created reservations](/compute/docs/instances/reservations-delete) . You can only delete an auto-created reservation after the end of its reservation period.\n### Overlapping reservation periods\nThis error occurs because the reservation period of your future reservation request overlaps with the reservation period of an existing future reservation request with the matching VM properties and zone.\nThe existing future reservation request can be either located in the same project of your reservation request or in a project you want to share your future reservation request with.\n**Error message** :\n```\nFuture reservation with overlapping time window for same instance properties and overlapping shared projects is not allowed.\n```\n**Resolution** : Try one of the following:\n- Modify the reservation period of the future reservation request that you're creating.\n- Modify the reservation period of an existing [draft](/compute/docs/instances/manage-future-reservations#modify-draft-future-reservation) or [approved future reservation request](/compute/docs/instances/manage-future-reservations#modify-submitted-future-reservation) \n- [Delete an existing future reservation request](/compute/docs/instances/manage-future-reservations#delete-future-reservation) and stop it from restricting the reservation period of the future reservation request that you're creating.\n### Project without an organization\nThe following error occurs when you specify a project that doesn't belong to an organization.\n**Error message** :\n```\nCannot create Shared Future Reservations in a project that does not belong to an organization.\n```\n**Resolution** : Try one of the following:\n- [Migrate your current project to an organization](/resource-manager/docs/project-migration#migrating_projects_no_org) and then create the shared future reservation request. **Caution:** Any existing reservations and future reservations in a project you want to share the future reservation request with restrict the project from the types of future reservation requests you can create. For more information, see [Restrictions](/compute/docs/instances/future-reservations-overview#restrictions) .\n- Create a shared future reservation request in a project that belongs to the [organization](/resource-manager/docs/creating-managing-organization) where you want to create the future reservation request.## Future reservation requests created from instance templates errors\nFailure to create or modify a future reservation request created by [specifying an instance template](/compute/docs/instances/create-single-project-future-reservations#specify-instance-template) might be due to one of the errors in this section.\n### Cross project referencing is not allowed\nThe following error occurs when you try to create a future reservation request by specifying an instance template from another project.\n**Error message** :\n```\nCross project referencing is not allowed for this resource.\n```\n**Resolution** : Do the following:\n- Make sure that the project ID and instance template's name you specify in your future reservation request are correct. To check that an instance template exists, [get information about the template](/compute/docs/instance-templates/get-list-delete-instance-templates#get_information_about_an_instance_template) .\n- An instance template contains project-specific settings, so you can only access and use an instance template within the same project. Instead, do one of the following:- To create a future reservation request by specifying an instance template:- [Create a new instance template](/compute/docs/instance-templates/create-instance-templates#based-on-existing-template) within your project.\n- Specify the newly created instance template when creating a [single-project](/compute/docs/instances/create-single-project-future-reservations#specify-instance-template) or [shared future reservation request](/compute/docs/instances/create-shared-future-reservations#specify-instance-template) . **Caution:** Any [regional](/compute/docs/regions-zones/global-regional-zonal-resources#regionalresources) or [zonal resources](/compute/docs/regions-zones/global-regional-zonal-resources#zoneresource) that are specified in an instance template—such as a machine type or a disk—restrict the use of the template to the locations where those resources exist. For example, if your instance template specifies an existing disk in `us-central1-a` zone, then you must create your reservation in the same zone. Otherwise, creating the reservation or the VMs that can consume the reservation fails.To check if an existing template specifies any resources that bind the template to a specific region or zone, [get information about the instance template](/compute/docs/instance-templates/get-list-delete-instance-templates#get_information_about_an_instance_template) and look for references to regional or zonal resources inside of it.\n- To create a future reservation request without specifying an instance template, create instead a [single-project](/compute/docs/instances/create-single-project-future-reservations#specify-vm-properties) or [shared reservation request](/compute/docs/instances/create-shared-future-reservations#specify-vm-properties) by specifying VM properties directly.\n### Invalid zone for an instance template\nThe following error occurs when you try to create a future reservation request by specifying an instance template with an invalid location for your template.\n**Error message** :\n```\nFuture reservation cannot be created outside the zone/region of source resource.\n```\n**Resolution** : Do one of the following:\n- Make sure to create your future reservation request in the same region and zone as the resources within the instance template. Any [regional](/compute/docs/regions-zones/global-regional-zonal-resources#regionalresources) or [zonal resources](/compute/docs/regions-zones/global-regional-zonal-resources#zoneresource) that are specified in an instance template—such as a machine type or a disk—restrict the use of the template to the locations where those resources exist. For example, if your instance template specifies an existing disk in the `us-central1-a` zone, then you must create your future reservation request in the same zone. Otherwise, creating the future reservation request fails.To check if an existing template specifies any resources that bind the template to a specific region or zone, [get information about the template](/compute/docs/instance-templates/get-list-delete-instance-templates#get_information_about_an_instance_template) and look for references to regional or zonal resources inside of it.\n- Use an instance template that doesn't restrict to a specific region or zone. Because you can't update instance templates, do the following:- [Create a new instance template based on an existing template](/compute/docs/instance-templates/create-instance-templates#based-on-existing-template) with the updated properties.\n- Create a [single-project](/compute/docs/instances/create-single-project-future-reservations#specify-instance-template) or [shared future reservation request](/compute/docs/instances/create-shared-future-reservations#specify-instance-template) . by specifying the newly created instance template.\n- Optional: [Delete the older instance template](/compute/docs/instance-templates/get-list-delete-instance-templates#delete_an_instance_template) .\n### Override instance template properties\nThis error occurs when you try to create a future reservation request by specifying an instance template, and you specify both an instance template and VM properties.\n**Error message** :\n```\nInstanceProperties cannot be specified while an instance template is being provided.\n```\n**Resolution** : Do one of the following:\n- To create a future reservation request by specifying an instance template, make sure to remove field that specifies VM properties.\n- To create a future reservation request by specifying an instance template with different VM properties, do the following:- You can't update an existing instance template. Instead, [create a new instance template based on an existing template](/compute/docs/instance-templates/create-instance-templates#based-on-existing-template) .\n- Specify the newly created instance template when creating a [single-project](/compute/docs/instances/create-single-project-future-reservations#specify-instance-template) or [shared future reservation request](/compute/docs/instances/create-shared-future-reservations#specify-instance-template) . **Caution:** Create your future reservation request in the same region and zone as the resources within the instance template. Any [regional](/compute/docs/regions-zones/global-regional-zonal-resources#regionalresources) or [zonal resources](/compute/docs/regions-zones/global-regional-zonal-resources#zoneresource) that are specified in an instance template—such as a machine type or a disk—restrict the use of the template to the locations where those resources exist. For example, if your instance template specifies an existing disk in the `us-central1-a` zone, then you must create your future reservation request in the same zone. Otherwise, creating the future reservation request fails.To check if an existing template specifies any resources that bind the template to a specific region or zone, [view details about the instance template](/compute/docs/instance-templates/get-list-delete-instance-templates#get_information_about_an_instance_template) and look for references to regional or zonal resources inside of it.\n- Optional: [Delete the older instance template](/compute/docs/instance-templates/get-list-delete-instance-templates#delete_an_instance_template) .\n- To create a future reservation request without specifying an instance template, create instead a [single-project](/compute/docs/instances/create-single-project-future-reservations#specify-vm-properties) or [shared future reservation request](/compute/docs/instances/create-shared-future-reservations#specify-vm-properties) by specifying VM properties directly.", "guide": "Compute Engine"}