{"title": "Compute Engine - Troubleshoot GPU VMs", "url": "https://cloud.google.com/compute/docs/instances", "abstract": "# Compute Engine - Troubleshoot GPU VMs\nThis page shows you how to resolve issues for VMs running on Compute Engine that have attached GPUs.\nIf you are trying to create a VM with attached GPUs and are getting errors, review [Troubleshooting resource availability errors](/compute/docs/troubleshooting/troubleshooting-resource-availability) and [Troubleshooting creating and updating VMs](/compute/docs/troubleshooting/troubleshooting-vm-creation) .\n", "content": "## Xid messages\nAfter you create a VM that has attached GPUs, you must install NVIDIA device drivers [on your GPU VMs](/compute/docs/gpus/install-drivers-gpu) so that your applications can access the GPUs. However, sometimes these drivers return error messages.\nAn Xid message is an error report from the NVIDIA driver that is printed to the operating system's kernel log or event log for your Linux VM. These messages are placed in the `/var/log/messages` file.\nFor more information about Xid messages including potential causes, see [NVIDIA documentation](https://docs.nvidia.com/deploy/xid-errors/index.html) .\nThe following section provides guidance on handling some Xid messages grouped by the most common types: GPU memory errors, GPU System Processor (GSP) errors, and illegal memory access errors.\n### GPU memory errors\nGPU memory is the memory that is available on a GPU that can be used for temporary storage of data. GPU memory is protected with Error Correction Code, ECC, which detects and corrects single bit errors (SBE) and detects and reports Double Bit Errors (DBE).\nPrior to the release of the NVIDIA A100 GPUs, [dynamic page retirement](https://docs.nvidia.com/deploy/a100-gpu-mem-error-mgmt/index.html#dynamic-blacklisting) was supported. For NVIDIA A100 and later GPU releases (such as NVIDIA H100), [row remap error](https://docs.nvidia.com/deploy/a100-gpu-mem-error-mgmt/index.html#row-remapping) recovery is introduced. ECC is enabled by default. Google highly recommends keeping ECC enabled.\nThe following are common GPU memory errors and their suggested resolutions.\n| Xid error message                                     | Resolution                                            |\n|:--------------------------------------------------------------------------------------------------------------------------------------------------------------------|:---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| Xid 48: Double Bit ECC                                    | Stop your workloads. Delete and recreate the VM. If the error persists, file a case with Cloud Customer Care.                  |\n| Xid 63: ECC page retirement or row remapping recording event                          | Stop your workloads. Reset the GPUs.                                     |\n| Xid 64: ECC page retirement or row remapper recording failure And the message contains the following information: Xid 64: All reserved rows for bank are remapped | Stop your workloads. Delete and recreate the VM. If the error persists, file a case with Cloud Customer Care.                  |\n| If you get at least two of the following Xid messages together: Xid 48 Xid 63 Xid 64 And the message contains the following information: Xid XX: row remap pending | Stop your workloads. Reset the GPUs. Resetting the GPU allows the row remap and page retirement process to complete and heal the GPU.            |\n| Xid 92: High single-bit ECC error rate                                | This Xid message is returned after the GPU driver corrects a correctable error, and it shouldn't affect your workloads. This Xid message is informational only. No action is needed. |\n| Xid 94: Contained ECC error                                   | Stop your workloads. Reset the GPUs.                                     |\n| Xid 95: Uncontained ECC error                                  | Stop your workloads. Reset the GPUs.                                     |\n### GSP errors\nA [GPU System Processor](https://download.nvidia.com/XFree86/Linux-x86_64/510.39.01/README/gsp.html) (GSP) is a microcontroller that runs on GPUs and handles some of the low level hardware management functions.\n| Xid error message  | Resolution                                   |\n|:-------------------------|:----------------------------------------------------------------------------------------------------------------------------------------------------|\n| Xid 119: GSP RPC timeout | Stop your workloads. Delete and recreate the VM. If the error persists, collect the NVIDIA bug report and file a case with Cloud Customer Care. |\n| Xid 120: GSP error  | Stop your workloads. Delete and recreate the VM. If the error persists, collect the NVIDIA bug report and file a case with Cloud Customer Care. |\n### Illegal memory access errors\nThe following Xids are returned when applications have illegal memory access issues:\n- `Xid 13:` ``\n- `Xid 31:` ``\nIllegal memory access errors are typically caused by your workloads trying to access memory that is already freed or is out of bounds. This can be caused by issues such as the dereferencing of an invalid pointer, or an out bounds array.\nTo resolve this issue, you need to debug your application. To debug your application, you can use [cuda-memcheck](https://developer.nvidia.com/cuda-memcheck) and [CUDA-GDB](https://docs.nvidia.com/cuda/cuda-gdb/index.html) .\nIn some very rare cases, hardware degradation might cause illegal memory access errors to be returned. To identify if the issue is with your hardware, use [NVIDIA Data Center GPU Manager (DCGM)](https://developer.nvidia.com/dcgm) . You can run `dcgmi diag -r 3` or `dcgmi diag -r 4` to run different levels of test coverage and duration. If you identify that the issue is with the hardware, file a case with [Cloud Customer Care](/support/docs) .\n### Other common Xid error messages\n| Xid error message                     | Resolution       |\n|:--------------------------------------------------------------------------------------------------|:-------------------------------------|\n| Xid 74: NVLINK error                    | Stop your workloads. Reset the GPUs. |\n| Xid 79: GPU has fallen off the bus This means the driver is not able to communicate with the GPU. | Reboot the VM.      |\n## Reset GPUs\nSome issues might require you to reset your GPUs. To reset GPUs, complete the following steps:\n- For N1, G2, and A2 VMs, reboot the VM by running`sudo reboot`.\n- For A3 VMs, run`nvidia-smi reset GPU`.\nIf errors persist after resetting the GPU, you need to [delete](/compute/docs/instances/deleting-instance) and [recreate the VM](/compute/docs/gpus/create-vm-with-gpus) .\nIf the error persists after a delete and recreate, file a case with [Cloud Customer Care](/support/docs) to move the VM into the [repair stage](/compute/docs/instances/instance-life-cycle) .", "guide": "Compute Engine"}