{"title": "Compute Engine - Applying machine type recommendations for VM instances", "url": "https://cloud.google.com/compute/docs/instances", "abstract": "# Compute Engine - Applying machine type recommendations for VM instances\nCompute Engine provides machine type recommendations to help you optimize the resource utilization of your virtual machine (VM) instances. These recommendations are generated automatically based on system metrics gathered by the Cloud Monitoring service over the previous 8 days. Use these recommendations to resize your instance's machine type to more efficiently use the instance's resources. This feature is also known as .\nTo learn more about the available machine types for VM instances, read the [machine types](/compute/docs/machine-resource) documentation.\n", "content": "## Before you begin\n- Read the [Google Cloud console](/compute/docs/console) documentation.\n- If you haven't already, set up authentication. [Authentication](/compute/docs/authentication) is the process by which your identity is verified for access to Google Cloud services and APIs. To run code or samples from a local development environment, you can authenticate to Compute Engine as follows.Select the tab for how you plan to use the samples on this page:\nWhen you use the Google Cloud console to access Google Cloud services and   APIs, you don't need to set up authentication.- [Install](/sdk/docs/install) the Google Cloud CLI, then [initialize](/sdk/docs/initializing) it by running the following command:```\ngcloud init\n``` **Note:** If you installed the gcloud CLI  previously, make sure you have the latest version by running`gcloud components  update`.\n- [ Set a default region and zone](/compute/docs/gcloud-compute#set_default_zone_and_region_in_your_local_client) .\nTo use the REST API samples on this page in a local development environment, you use the credentials you provide to the gcloud CLI.- [Install](/sdk/docs/install) the Google Cloud CLI, then [initialize](/sdk/docs/initializing) it by running the following command:\n- ```\ngcloud init\n```## Pricing\nMachine type recommendations are available free of charge. If you apply a recommendation to resize your instance's machine type, you are charged for the machine type that you choose.\n## Limitations and use cases\nMachine type recommendations are not available in the following cases:\n- VM instances created using App Engine flexible environment, Dataflow, Google Kubernetes Engine, or Dataproc\n- VM instances with ephemeral disks, GPUs, or TPUs\n- VM instances in the [memory-optimized machine family](/compute/docs/memory-optimized-machines) \nThe recommendation algorithm is suited to workloads that follow weekly patterns, workloads that grow or shrink over weeks of time, workloads that persistently underutilize their resources, or workloads that are persistently throttled by insufficient resources. In such cases, 8 days of historical data is enough to predict how a change in the size of the machine can improve resource utilization.\nThe machine type recommendation algorithm is less suited to the following workloads:\n- Workloads that spike infrequently (for example, monthly spikes) because 8 days of data is not enough to capture or predict the CPU fluctuations.\n- Workloads that have very brief CPU spikes because recommendations are based on average CPU utilization over 60-second intervals. Recommendations might not be generated quickly enough to capture shorter spikes. See [How machine type recommendations work](#how_sizing_recommendations_work) for more information.\nFor workloads where cost is more important to you than performance, such as batch workloads, you can ignore recommendations to increase size.\nIn rare cases, you might see an error message when applying a recommendation. For example, a recommended machine type might be too small for the number of attached disks, it might not meet the resource requirements of your images or licenses, or it might not be available in a particular zone.\nWe also don't show recommendations if the estimated saving is less than $10/month.\n## How machine type recommendations work\nCompute Engine monitors the CPU and memory utilization of running VMs and makes recommendations using the last 8 days of data. Compute Engine makes recommendations like the following:\n- If your instance has had low CPU utilization most of the time, Compute Engine recommends a machine type with fewer virtual CPUs.\n- If your instance has had high CPU utilization most of the time, Compute Engine recommends a machine type with more virtual CPUs.\n- If your instance hasn't used a large fraction of its memory, Compute Engine recommends a machine type with less memory.\n- If your instance has actively been using a large fraction of its memory most of the time, Compute Engine recommends a machine type with more memory.\n**Note:** Compute Engine uses the same CPU utilization numbers that are reported on the [Compute Engine dashboard](https://console.cloud.google.com/compute/instances) to determine what recommendations to make. These numbers are based on the average utilization of your instances over 60-second intervals, so they don't capture short CPU spikes. Apps with short CPU spikes might need to run on a larger machine type than the one recommended by Google, to accommodate these spikes.\nCompute Engine might make recommendations to use either a standard or custom machine type. Note that there are some limitations in the amount of memory and vCPU available to a machine. In particular, increasing one resource might require increasing the other at the same time, to follow the [specifications](/compute/docs/instances/creating-instance-with-custom-machine-type#specifications) of a valid machine type. Also, Compute Engine only recommends machine types that are available in the zone where the instance is running.\nSee [custom machine type specifications](/compute/docs/instances/creating-instance-with-custom-machine-type#specifications) for details.\nFor cost difference estimations, the cost of an instance is based on the previous week's usage (before sustained use discount) and is extrapolated to 30 days. This is then compared to the recommended machine type monthly cost (before sustained use discount). For accurate pricing and details, read the [pricing documentation](/compute/vm-instance-pricing) .\n## Viewing machine type recommendations\nCompute Engine makes recommendations available through the [Google Cloud console](https://console.cloud.google.com/) . Recommendations are also available through the [Recommender](/recommender/docs) using the gcloud CLI or REST.- In the Google Cloud console, go to the **VM instances** page. [Go to the VM instances page](https://console.cloud.google.com/compute/instances) \n- Look at the **Recommendation** column to review recommendations for individual instances. You can also sort the column by amount of estimated savings. If there are no recommendations next to your instances, Compute Engine doesn't have any recommendations to make.\nUse the [gcloud recommender recommendations list](/sdk/gcloud/reference/recommender/recommendations/list) command and specify the [VM instance rightsizing recommender](/recommender/docs/vm-instance-rightsizing-recommender) .\n```\ngcloud recommender recommendations list \\\n --recommender=google.compute.instance.MachineTypeRecommender \\\n --project=PROJECT_ID \\\n --location=ZONE \\\n --format=[config | csv | default | diff | flattened | get | json | list | object | table | text | value | yaml]\n```\nReplace the following:- ``: the ID of your project.\n- ``: the zone that contains instances to list recommendations for.\n- ``: your preferred output format.- `csv`,`diff`,`get`,`table`, and`value`require non-empty [projections](/sdk/gcloud/reference/topic/projections) .\nThe output of the `gcloud recommender recommendations list` command includes the following fields:- `name`: the name of the recommendation.\n- `description`: a human-readable explanation of the recommendation.\n- [operationGroups](/recommender/docs/key-concepts#operation_groups) : groups of operations that you can perform in serial order to [apply the recommendation](#changing_machine_types_according_to_recommendations) .\nFor more information, see the [Recommender documentation](/recommender/docs/using-api) .\nUse the [Recommender API](/recommender/docs/vm-instance-rightsizing-recommender) with the VM instance rightsizing Recommender ID.\n```\nPROJECT_ID=my-project\nLOCATION=us-central1-c\nRECOMMENDER_ID=google.compute.instance.MachineTypeRecommender\ncurl -H \"Authorization: Bearer $(gcloud auth print-access-token)\" \\\n https://recommender.googleapis.com/v1/projects/$PROJECT_ID/locations/$LOCATION/recommenders/$RECOMMENDER_ID/recommendations\n```\nThe response includes the following fields:- `name`: The name of the recommendation.\n- `description`: A human-readable explanation of the recommendation.\n- [operationGroups](/recommender/docs/vm-instance-group-rightsizing-recommender#operation_groups) : Groups of operations that you can perform in serial order to [apply the recommendation](#changing_machine_types_according_to_recommendations) .\nFor more information, see the [Recommender documentation](/recommender/docs/using-api) .\nWhen you create an instance, recommendations for the instance appear 24 hours after the instance was created. If you change the machine type of an instance, Compute Engine provides any further recommendations within 24 hours after the change.\nAfter that, VM instance recommendations are refreshed at regular intervals throughout the day.\n## Changing machine types according to recommendations\n**Note:** You might have valid reasons for running a particular instance at very low or very high utilization. Machine type recommendations are suggestions to help you more efficiently use your instances, but they might not be appropriate for every situation.\nIf you determine that you want to apply the recommendations made by Compute Engine, you can change the instance's machine type directly from the recommendations screen, or manually step through the operations that are returned when [viewing machine type recommendations](#viewing_sizing_recommendations) .- In the Google Cloud console, go to the **VM instances** page. [Go to the VM instances page](https://console.cloud.google.com/compute/instances) If a recommendation exists for an instance, it appears in the **Recommendation** column.\n- Click the recommendation text for the instance you want to resize.\n- A dialog opens with information about the recommendation. To apply the recommendation and change the VM machine type, click **Apply** . Compute Engine stops the instance, changes its machine type, and restarts the instance.\n- Optionally, you can also click the **Customize** link to customize the instance as you prefer.\n- Click the **Apply** button to apply the changes.\nSee [Changing a machine type](/compute/docs/instances/changing-machine-type-of-stopped-instance#changing_a_machine_type) for information.\nSee [Changing a machine type](/compute/docs/instances/changing-machine-type-of-stopped-instance#changing_a_machine_type) for information.\n## Dismissing and restoring recommendations\nWhen you have finished using a recommendation, you can dismiss it from the console. Within the console, dismissing removes a recommendation from the total savings estimate and also minimizes the appearance of the recommendation so that it appears dimmed.\nActing on a recommendation through the console does not affect the list of or states of recommendations that are returned by the [Recommender API](/recommender/docs) . To manage the state of recommendations returned by the Recommender API, see [Using the API](/recommender/docs/using-api) .\nTo dismiss a single recommendation from the console:\n- In the Google Cloud console, go to the **VM instances** page. [Go to the VM instances page](https://console.cloud.google.com/compute/instances) If a recommendation exists for an instance, it appears in the **Recommendation** column.\n- Click the recommendation text for the recommendation you want to dismiss.\n- A dialog opens with more detail and a **Dismiss recommendation** button.\n- Click **Dismiss recommendation** .\nTo dismiss all recommendations from the console:\n- In the Google Cloud console, go to the **VM instances** page. [Go to the VM instances page](https://console.cloud.google.com/compute/instances) \n- Click the **Dismiss all** button.**Note:** Dismissing a recommendation de-emphasizes it in the table but does not hide it.\nTo restore a recommendation:\n- In the Google Cloud console, on the **VM instances** page, click the dimmed recommendation text you want to restore.\n- A dialog opens with more detail and a **Restore recommendation** button.\n- Click **Restore recommendation** .## Using the monitoring agent for more precise recommendations\nCloud Monitoring offers a [Monitoring agent](/monitoring/agent) that collects additional disk, CPU, network, and process metrics from your VM instances. To collect this data, install the Monitoring agent on your VM instances so it can access system resources and app services.\nIf the Monitoring agent is installed and running on a VM instance, the CPU and memory metrics collected by the agent are automatically used to compute machine type recommendations. The [agent metrics](/monitoring/api/metrics_agent) provided by the Monitoring agent give better insights into resource utilization of the instance than the default Compute Engine metrics. This allows the recommendation engine to estimate resource requirements better and make more precise recommendations.\nTo install the agent, see [Installing the Monitoring agent](/monitoring/agent/install-agent) .\n**Note:** Metric data from the Monitoring agent is priced by volume on a sliding scale. For details, see [Cloud Monitoring pricing](/stackdriver/pricing) .\n## What's next\n- Learn more about [changing the machine type](/compute/docs/instances/changing-machine-type-of-stopped-instance) of an instance.\n- Read up on what happens when you [stop an instance](/compute/docs/instances/stop-start-instance) .\n- See how you can [apply recommendations to managed instance groups](/compute/docs/instance-groups/apply-sizing-recommendations-managed-instance-groups) .\n- Review the [Google Cloud console](/compute/docs/console) documentation.\n- Learn more about the [Recommender](/recommender/docs) and its [API](/recommender/docs/using-api) .\n- Learn more about [insights for machine type recommendation](/compute/docs/instances/view-and-understand-vm-insights) .", "guide": "Compute Engine"}