{"title": "Documentation - Monitor VM metrics", "url": "https://cloud.google.com/distributed-cloud/hosted/docs/latest/gdch/overview", "abstract": "# Documentation - Monitor VM metrics\nThe VM-level metrics dashboard provides you with graphs for viewing VM-specific metrics for your projects. Access the dashboard from this address:\n`https://` `` `/` `` `/grafana/d/h2Wx80n4k/workload-vms`\n- Replacewith your host name.\n- Replacewith the name of your project.\nThis page provides an overview of the VM dashboard and the type of information provided by the different graphs accessible from it.\n", "content": "## VM dashboard\nThe VM dashboard presents graphs that contain information regarding the following for each VM in each of your project namespaces:\n- [CPU](#cpu-graph) \n- [Memory](#memory-graph) \n- [Network](#network-graph) \n- [Disk](#disk-graph) \nThese graph types are generated using the VM monitoring metrics. The metrics are named and described according to their type, labels, and meanings.\nIn the dashboard view, from the selection box at the beginning of the page, which is marked in the following image as \"vm\", choose the VM you want to observe. The image shows that vm1 was selected.\n## CPU\nView the CPU utilization - the amount of time that each vCPU spends in different states. The graph displays information for each of the vCPUs specified by your machine type.\n## Memory\nFrom the memory graph, view such attributes as the total memory allocated to the VM, the amount of memory available, and the amount of memory being used.\n## Network\nUse the Network page to view the following:\n- The number of packets received from and sent to the network.\n- The quantity of bytes received from and sent to the network.\n- The number of receive and transmit packets that have been dropped on virtual network interface card (vNIC) interfaces.\n- The network transmit error packet count.\n## Disk\nView the Disk page to see the following:\n- A bytes count for reads from or writes to a disk\n- A count of write or read IO operations.\n- The cumulative time taken for a read or write operation:- The time the operation is in queue\n- The time spent actually executing the operation (disk busy)\n- Disk flush request numbers, and the time spent on cache flushing.\n## Metrics list\nTo see a list of the metrics definitions, view the list on the [Virtual Machine Management (VMM) ](/distributed-cloud/hosted/docs/latest/gdch/platform-application/pa-ao-operations/metrics-vmm#metrics-list) page.", "guide": "Documentation"}