{"title": "Documentation - Disaster recovery overview", "url": "https://cloud.google.com/distributed-cloud/hosted/docs/latest/gdch/overview", "abstract": "# Documentation - Disaster recovery overview\nGoogle Distributed Cloud Hosted (GDCH) supports the ability to take disk-level snapshots and complete virtual machine (VM) backups to facilitate disaster recovery.\n", "content": "## Planning\nYou must have sufficient capacity to back up workload data, given the size of the data and its retention period. GDCH provides backup capabilities for customer workloads to compatible object storage buckets.\nThese backups are not incremental, so the storage housing the backups must have enough capacity to hold full backups for the given backup frequency and retention periods. For example, a daily backup with a retention period of 365 days requires 365 times the storage capacity to hold a single backup. You also need to account for growth of the data being backed up to ensure the backups don't exceed the storage capacity.\nIf you are planning on using object storage on a remote GDCH instance, you must create the storage buckets within the same organization on the target instance where the workloads are running in the source instance, so billing functions correctly. The organization control plane on one GDCH instance must be backed up into buckets hosted in the same organization on another instance. You can also create buckets for backing up workloads in the same organization on the control plane backup instance.\nYou must also have sufficient capacity such as compute and storage to run any failed workloads on a separate GDCH instance that you want to be able to restore to in the case of a disaster. For example, if you have two GDCH instances and you want to be able to run all workloads while only one of the instances is available, the capacity of both instances individually must be greater than or equal to the overall capacity needed to run all of the workloads. However, if only some workloads must be recovered during a system failure, your planning can include temporarily shutting down less critical applications to free up resources until the failing systems are functioning again.\n## Backup and Restore\nThe following sections navigate to other guides on how to set up backups and perform restores for GDCH.\n### Kubernetes workloads\nTo configure automatic backups to save your cluster workloads, see [Install backup and restore components](https://cloud.google.com/distributed-cloud/hosted/docs/latest/gdch/platform-application/pa-ao-operations/install-backup-restore) and follow the steps.\n### Virtual machines\nTo create the storage elements and configuration for automatic backups, see [Planning VM backups](https://cloud.google.com/distributed-cloud/hosted/docs/latest/gdch/platform/pa-user/backup-plan-vm) .\nTo use your existing backup plans to make a manual backup, see [Backup virtual machines](https://cloud.google.com/distributed-cloud/hosted/docs/latest/gdch/application/ao-user/vms/backup-and-restore/back-up-vms) .\nTo manually backup persistent disks to maintain relevant workload information, see [Backup disks](https://cloud.google.com/distributed-cloud/hosted/docs/latest/gdch/application/ao-user/vms/backup-and-restore/back-up-disks) .", "guide": "Documentation"}