{"title": "Documentation - Resource Manager API overview", "url": "https://cloud.google.com/distributed-cloud/hosted/docs/latest/gdch/overview", "abstract": "# Documentation - Resource Manager API overview\nThe Resource Manager API uses Kubernetes custom resources and relies on the Kubernetes Resource Model (KRM) for provisioning and administration of organization and project resources. It is used to manage the lifecycle of Google Distributed Cloud Hosted (GDCH) organizations and projects, such as installing, upgrading, and uninstalling.\nTo use the Resource Manager API, we recommend that you use the GDCH console and gdcloud CLI. If your application needs to use your own libraries to call this API, use the following example and the [full API definition](/distributed-cloud/hosted/docs/latest/gdch/apis/resource-manager-krm-api) to build your requests.\n", "content": "## Service endpoint and discovery document\nThe API endpoint for the Resource Manager API is `https://` `` `/apis/resourcemanager.gdc.goog/v1` where `` is the endpoint of the GDCH API server.\nThe Resource Manager View API follows a similar convention for its API endpoint: `https://` `` `/apis/resourcemanagerview.gdc.goog/v1` .\nUsing the `kubectl proxy` command, you can access the API endpoint URLs in your browser or with a tool such as `curl` to get the discovery document for the Resource Manager API. The `kubectl proxy` command opens up a proxy to the Kubernetes API server on your local machine. Once that command is running, you can access the document at the following URL: `http://127.0.0.1:8001/apis/resourcemanager.gdc.goog/v1` .\n## Example Project resource\nThe following is an example of a `Project` object configured as a GDCH project resource. As a user of the Resource Manager API, creating a project through the GDCH console generates the `Project` object by default. You must only modify it to reflect the project state you want.\n```\napiVersion: resourcemanager.gdc.goog/v1kind: Project  labels:    atat.config.google.com/clin-number: \"GDCH_INTERNAL\"    atat.config.google.com/task-order-number: \"0001\"  name: test-project  namespace: platform\n```", "guide": "Documentation"}