{"title": "Documentation - Manage AO alert rules and groups", "url": "https://cloud.google.com/distributed-cloud/hosted/docs/latest/gdch/overview", "abstract": "# Documentation - Manage AO alert rules and groups\nYou can perform the following actions from the GDCH console regarding Observability alert rules and groups for system monitoring:\n- [Update alert rule groups](#update-alert-rule-groups) \n- [Delete alert rule groups](#delete-alert-rule-groups) \n- [Update alert rules](#update-alert-rules) \n- [Delete alert rules](#delete-alert-rules) \n**Note:** Some alert rules are read-only because the system generates them, so you cannot edit or delete them. Ensure the alert rules display editable permissions when updating or deleting rule groups and alerts.\n", "content": "## Update alert rule groups\nAlert rule groups contain alert rules. Select a rule group from the list and edit the rule group details.\nUpdate alert rule groups in a project from the GDCH console:\n- In the GDCH console, select a project.\n- In the navigation menu, click **Operations** > **Alerting** .\n- Click the **Alerting Policy** tab.\n- View the list of alert rule groups.\n- Click a rule group name that has the **Editable** value in the **Permissions** column.\n- In the rule group details page, click **Edit** next to the field that you want to update, such as **Limit** .\n- Edit the value and click **Save** .## Delete alert rule groups\nSelect a rule group from the list and entirely delete the group. When you delete an alert rule group, the alert rules associated with the group are also deleted.\nDelete alert rule groups in a project from the GDCH console:\n- In the GDCH console, select a project.\n- In the navigation menu, click **Operations** > **Alerting** .\n- Click the **Alerting Policy** tab.\n- Click the name of the rule group that you want to delete. The rule group must have the **Editable** value in the **Permissions** column so you can delete it.\n- Click **Delete** .\n- In the confirmation dialog, click **Confirm** to delete.## Update alert rules\nSelect a rule group from the list and edit an alert rule that belongs to the group.\nUpdate alert rules in a project from the GDCH console:\n- In the GDCH console, select a project.\n- In the navigation menu, click **Operations** > **Alerting** .\n- Click the **Alerting Policy** tab.\n- Click the name of the rule group that contains the rule that you want to update. The rule group must have the **Editable** value in the **Permissions** column so you can update its alert rules.\n- In the **Alert rules** section, click a rule that is editable.\n- In the **Edit alert rule** page, edit the values and click **Save** .## Delete alert rules\nSelect a rule group from the list and delete an alert rule that belongs to the group.\nDelete alert rules in a project from the GDCH console:\n- In the GDCH console, select a project.\n- In the navigation menu, click **Operations** > **Alerting** .\n- Click the **Alerting Policy** tab.\n- Click the name of the rule group that contains the rule that you want to delete. The rule group must have the **Editable** value in the **Permissions** column so you can delete its alert rules.\n- In the **Alert rules** section, select the check box for the rule that you want to delete.\n- Click **Delete** .\n- In the confirmation dialog, click **Confirm** to delete.", "guide": "Documentation"}