{"title": "Documentation - Manage the VM instance lifecycle", "url": "https://cloud.google.com/distributed-cloud/hosted/docs/latest/gdch/overview", "abstract": "# Documentation - Manage the VM instance lifecycle\nA VM instance can transition through many states throughout its lifecycle. When you create a VM, Google Distributed Cloud Hosted (GDCH) provisions resources to start the VM. Next, the VM moves into the start state, where it prepares for a first boot. During and after start-up, a VM is considered to be running. During its lifetime, a running VM can be repeatedly stopped and restarted, or suspended and resumed.\n", "content": "## VM status definitions\n| State    | Definition                                   |\n|:--------------------|:------------------------------------------------------------------------------------------------------------------------------------------------------|\n| Pending    | The VM is accepted by the system and is waiting for allocation.                      |\n| Provisioning  | Resources associated with the VM, such as VirtualMachineDisk, are being provisioned and prepared.              |\n| Starting   | The VM is being prepared to run.                              |\n| Running    | The VM is running.                                 |\n| Stopping   | The VM is in the process of stopping.                             |\n| Stopped    | The VM is stopped and isn't expected to start.                          |\n| Paused    | The VM is paused and in a frozen state, which is preserved. The VM cannot be accessed.                |\n| Terminating   | The VM and its associated resources are undergoing the deletion process.                    |\n| ErrorConfiguration | The VM has a configuration error. The invalid configuration states can be caused by the following:             |\n| nan     | MachineTypeNotFound - VM type the VM refers to is not found or is being deleted.                  |\n| nan     | MachineDiskMisconfig - The VM disk is incorrectly configured.                       |\n| nan     | InterfaceCreationFailed - The network interface creation failed.                      |\n| CrashLoopBackOff | The VM is in a crash loop and is waiting to be retried.                        |\n| PendingIPAllocation | The VM is waiting for the system to assign it an IP address.                       |\n| Unknown    | The VM state could not be obtained, typically due to an error in communicating with the host on which it's running.         |\n| ErrorUnschedulable | An error has occurred while scheduling the VM, for example, due to resource requests or scheduling constraints that cannot be satisfied or supported. |\n| DiskError   | The VM has an error with one or more of the attached disks.                       |\n| WaitingForDisk  | The VM is waiting for one or more of the attached VirtualMachineDisk to be ready.                  |\n| CrashLoopBackoff | The VM has been consistently crashing for some reason.                        |\n## Before you begin\nTo use `gdcloud` command-line interface (CLI) commands, ensure that you have downloaded, installed, and configured the [gdcloud CLI](/distributed-cloud/hosted/docs/latest/gdch/resources/gdcloud-overview) . All commands for Distributed Cloud Hosted use the `gdcloud` or `kubectl` CLI, and require an operating system (OS) environment.\n### Get the kubeconfig file path\nTo run commands against the org admin cluster, ensure you have the following resources:\n- Locate the org admin cluster name, or ask your Platform Administrator (PA) what the cluster name is.\n- [Sign in and generate](/distributed-cloud/hosted/docs/latest/gdch/application/ao-user/iam/sign-in#cli) the kubeconfig file for the org admin cluster if you don't have one.\n- Use the path to the kubeconfig file of the org admin cluster to replace `` in these instructions.## Check VM status\nEvery VM reports its status as part of the VM's properties. Check a VM's status for any of the following reasons:\n- If there are issues with the VM.\n- To confirm the VM is running after it has started.\n- To verify the VM is in the`Paused`or`Stopped`state.\n### List VMs to check status\nThe following procedure shows how to list VMs, view their status, and get additional status information.\n- List all VMs and view the status of each:```\nkubectl --kubeconfig ORG_ADMIN_KUBECONFIG \\    get virtualmachines.virtualmachine.gdc.goog -n PROJECT\n```Replace the variables in the code examples with your own values according to the following table.| Variable    | Definition        |\n|:---------------------|:------------------------------------------|\n| ORG_ADMIN_KUBECONFIG | The org admin cluster kubeconfig path. |\n| PROJECT    | The GDCH project in which the VM resides. |Example output:```\nNAME          STATUS                    AGEvm-1          Running                    1dvm-2          Stopped                    8dvm-3          ErrorConfiguration         1d\n```\n- Get additional details about a particular VM's status:```\nkubectl --kubeconfig ORG_ADMIN_KUBECONFIG \\    get virtualmachines.virtualmachine.gdc.goog VM_NAME -n PROJECT -o \\    jsonpath='{\"State:\"}{.status.state}{\"\\n\"}{\"Reason:\"}{.status.reason}{\"\\n\"}{\"Message:\"}{.status.message}{\"\\n\"}'\n```Replace the following:- ``with the`kubeconfig`file path for the org admin cluster you obtained from the`gdcloud auth login`command.\n- ``with the name of the new VM.\n- ``with the GDCH project in which the VM resides.\nExample output showing `Reason` and `Message` values:```\nState: ErrorConfigurationReason: MachineDiskNotFoundMessage: VirtualMachineDisk disk-1 in namespace project-1 does not exist.\n```You might also get empty fields for `Reason` and `Message` . This indicates there was nothing for the system to report regarding them.Example output with `Reason` and `Message` empty:```\nState: RunningReason:Message:\n```## Stop, or restart a VM\nDuring the VM lifecycle you might need to stop and restart a VM, or delete a VM to respond to a status change or generally manage the VM. See these pages to stop, reset, or delete a VM:\n- [Stop a VM](/distributed-cloud/hosted/docs/latest/gdch/application/ao-user/vms/manage-vms/operations-and-lifecycle/start-and-stop-vm#stop-a-vm) \n- [Restart a VM](/distributed-cloud/hosted/docs/latest/gdch/application/ao-user/vms/manage-vms/operations-and-lifecycle/start-and-stop-vm#restart-a-vm) \n- [Delete a VM](/distributed-cloud/hosted/docs/latest/gdch/application/ao-user/vms/manage-vms/operations-and-lifecycle/delete-vms)", "guide": "Documentation"}