{"title": "Documentation - Configure notification channels for AO alerts", "url": "https://cloud.google.com/distributed-cloud/hosted/docs/latest/gdch/overview", "abstract": "# Documentation - Configure notification channels for AO alerts\nThe Observability platform lets you configure notification channels for the alerts you set up. The Observability system sends an alert to these customized channels whenever an event causes an alert. This way, you can notify the recipients you need according to your preferred methods.\nGoogle Distributed Cloud Hosted (GDCH) does not predefine notification channels intended for sending alerts. You must define at least one channel to receive alerts. If you don't define a notification channel configuration, the GDCH Observability system takes the configuration from the platform resources as a default. Consequently, if you don't configure notification channels but an administrator did it for the organization, then the system sends alerts to those channels.\nWork through the following steps to configure notification channels for the alerts you set up for system monitoring:\n- Define the Observability alerting configuration following the specification in [https://prometheus.io/docs/alerting/latest/configuration/](https://prometheus.io/docs/alerting/latest/configuration/) .\n- Create a `ConfigMap` object and deploy it into your project namespace. The object must contain the configuration rules in the `alertmanager.yml` file.```\napiVersion: v1kind: ConfigMapmetadata:  # The name must match the ConfigMap name specified in the ObservabilityPipeline custom resource.  name: CUSTOMIZED_CONFIGMAP_NAME  # The namespace must match the project namespace  namespace: PROJECT_NAMESPACEdata:  # The file name must be alertmanager.yml  alertmanager.yml: |    # Add the customized configuration in the following lines of this file.\n```Replace the following:- : the name of your configuration file. You use this name in the`ObservabilityPipeline`custom resource during [the following step](#observability-pipeline-custom-resource) .\n- : the namespace of your project\n **Note:** Follow the same syntax as described in [https://prometheus.io/docs/alerting/latest/configuration](https://prometheus.io/docs/alerting/latest/configuration) to define the notification channels in the `alertmanager.yml` file.\n- Configure the `ObservabilityPipeline` custom resource in a command-line editor to import the configuration to the `alertmanagerConfig` field.```\n # Configure observability pipelineapiVersion: observability.gdc.goog/v1kind: ObservabilityPipelinemetadata:  # The namespace must match the project namespace  namespace: PROJECT_NAMESPACE  name: observability-configspec:  # Configure alerts  alerting:    # The alerting configuration must be in the key \"alertmanager.yml\" file of the configMap object    alertmanagerConfig: CUSTOMIZED_CONFIGMAP_NAME  ...\n```Replace the following:- : the namespace of your project\n- : the name you used for [your configuration file in the ConfigMap object](#configmap-object) . The name must match exactly.\n- Save the changes in the `ObservabilityPipeline` custom resource and exit your command-line editor", "content": ".", "guide": "Documentation"}