{"title": "Documentation - Configure project network policies", "url": "https://cloud.google.com/distributed-cloud/hosted/docs/latest/gdch/overview", "abstract": "# Documentation - Configure project network policies\nThis document describes the operations available for the Application Operator (AO) to configure project network policies.\n", "content": "## Disable data exfiltration protection\nBy default, a project has data exfiltration protection enabled. The following are the default policies for a project with data exfiltration protection enabled:\n- Allow inbound traffic only from the same project. All other traffic is denied.\n- Allow outbound traffic to all destinations within the same organization. All other traffic is denied, which means that external traffic outside your organization is denied.\nWith data exfiltration protection enabled, you cannot create `ProjectNetworkPolicy` resources for outbound traffic.\nIf you disable data exfiltration protection by clearing the corresponding checkbox in the GDCH console for a project, the default policies for the project are the following:\n- Allow inbound traffic only from the same project. All other traffic is denied.\n- Allow outbound traffic to all destinations, including external projects from other organizations.\nWork through the following steps to disable data exfiltration protection for a project:\n- In the GDCH console, go to **Projects** in the navigation menu.\n- Click the name of the project where you want to disable data exfiltration protection.\n- Click theedit **Edit** button on the **Data exfiltration protection** field.\n- On the **Edit data exfiltration protection** page, clear the **Enable data exfiltration protection** checkbox.\n- Click **Save** . The **Data exfiltration protection** field changes its value to **Disabled** .\nYou must create `ProjectNetworkPolicy` egress policies for your projects to restrict the outbound traffic. For more information, see [Configure a project network policy](#configure-network-policy) .\n## Configure a project network policy\nThis section describes how to set a network policy for workloads at the project namespace level, using the `ProjectNetworkPolicy` resource, which is a multi-cluster network policy for Google Distributed Cloud Hosted (GDCH). This resource lets you define policies that allow communication within projects, between projects, and to external IP addresses.\nProject network policies define either ingress or egress rules. Unlike Kubernetes network policies, you can only specify one policy type for a policy.\nFor traffic within a project, GDCH applies a predefined project network policy, the intra-project policy, to each project by default.\nServices and workloads in a project are isolated from external services and workloads by default. However, services and workloads from different project namespaces and within the same organization can communicate with each other by applying [cross-project traffic](#cross-project-traffic) network policies.\nSimilarly, connecting services and workloads to a destination outside of your project in a different organization requires explicit approval. You must disable data exfiltration protection to allow [cross-organization traffic](#cross-organization-traffic) .\nIngress and egress firewall rules are the main components of project network policies and determine which types of traffic are allowed in and out of your network. To set firewall rules for your project namespace in GDCH, use the GDCH console.\n### Intra-project traffic\nBy default, workloads in a project namespace have the ability to communicate with each other without exposing anything to external resources.\nWhen you create a project, you implicitly create a default base `ProjectNetworkPolicy` that allows intra-project communication. This policy allows inbound traffic from other services in the same project.\nYou can remove the default policy, but be aware that this removal results in denying intra-project communication for all services and workloads within the project.\nBy default, there is no egress policy, so outbound traffic is allowed for all intra-project traffic. However, when you set a single egress policy, only the traffic that the policy specifies is allowed.\nWhen you disable data exfiltration prevention and apply a `ProjectNetworkPolicy` egress policy to the project, such as preventing access to an external resource, use the following required policy to allow intra-project outbound traffic:\n```\nkubectl --kubeconfig ORG_ADMIN_CLUSTER_KUBECONFIG apply -f - <<EOFapiVersion: networking.gdc.goog/v1kind: ProjectNetworkPolicymetadata:  namespace: PROJECT  name: allow-intra-project-outbound-trafficspec:  policyType: Egress  Egress:  - to:    - projects:        matchNames:        - PROJECTEOF\n```\nReplace `` with the name of the project where you want to allow intra-project outbound traffic.\n### Cross-project traffic\nCross-project traffic refers to the communication between services and workloads from different project namespaces but within the same organization.\nFor project workloads or services to allow connections from other workloads in another project within your organization, you must configure an ingress firewall rule to allow the inbound traffic of other project workloads.\nWork through the following steps to create a new firewall rule and allow inbound traffic from workloads in another project:\n- Within the GDCH console of the project you are configuring, go to **Networking** > **Firewall** in the navigation menu to open the **Firewall** page.\n- Click **Create** in the action bar to begin creating a new firewall rule.\n- On the **Firewall rule details** page, fill out the following information:- In the **Name** field, enter a valid name for your firewall rule.\n- In the **Direction of traffic** section, select **Ingress** to allow inbound traffic from workloads in other projects.\n- In the **Target** section, select one of the following options:- **All user workloads:** allow connections to the workloads of the project you are configuring.\n- **Service:** indicate that this firewall rule targets a specific service within the project you are configuring.\n- If your target is a project service, select the name of the service from the list of available services on the **Service** drop-down menu.\n- In the **From** section, select one of the following two options:- **All projects:** allow connections from workloads in all the projects of the same organization.\n- **Another project** and **All user workloads:** allow connections from workloads in another project of the same organization.\n- If you want to transfer workloads only from another project, select a project that you can access from the list of projects on the **Project ID** drop-down menu.\n- If your target is all user workloads, select one of the following options in the **Protocols and ports** section:- **Allow all:** allow connections using any protocol or port.\n- **Specified protocols and ports:** allow connections using only the protocols and ports that you specify in the corresponding fields for the ingress firewall rule.\n- On the **Firewall rule details** page, click **Create** .\nYou've now permitted connections from other project workloads within the same organization. After creating the firewall rule, the rule is visible in a table on the **Firewall** page.\nFor project resources to allow connections from other resources in another project, you must configure an ingress policy to allow inbound traffic from the other project resources.\nThe following policy enables workloads in the `` project to permit connections from workloads in the `` project, as well as the return traffic for the same flows. Apply the policy:\n```\nkubectl --kubeconfig ORG_ADMIN_CLUSTER_KUBECONFIG apply -f - <<EOFapiVersion: networking.gdc.goog/v1kind: ProjectNetworkPolicymetadata:namespace: PROJECT_1name: allow-inbound-traffic-from-PROJECT_2spec:policyType: Ingresssubject:    subjectType: UserWorkloadingress:- from:    - projects:        matchNames:        - PROJECT_2EOF\n```\nThe preceding command allows `` to go to `` , but doesn't allow connections initiated from `` to `` . For the latter, you require a reciprocal policy in the `` project. Apply the reciprocal policy:\n```\nkubectl --kubeconfig ORG_ADMIN_CLUSTER_KUBECONFIG apply -f - <<EOFapiVersion: networking.gdc.goog/v1kind: ProjectNetworkPolicymetadata:namespace: PROJECT_2name: allow-inbound-traffic-from-PROJECT_1spec:policyType: Ingresssubject:    subjectType: UserWorkloadingress:- from:    - projects:        matchNames:        - PROJECT_1EOF\n```\nConnections are now permitted to and from `` and `` .\nWhen you grant an ingress cross-project traffic policy to let workloads in one project to allow connections from workloads in another project, this action also grants the return traffic for the same flows. Therefore, you don't need an egress cross-project traffic network policy in the original project.\nFor example, if you create a policy allowing traffic from `` to `` and data exfiltration protection is disabled, you must create an ingress policy in `` and an egress policy on `` . However, the reply packets are excluded from the policy enforcement, so you don't require any additional policies.\nWork through the following steps to create a new firewall rule and allow outbound traffic from workloads in a project:\n- Within the GDCH console of the project you are configuring, go to **Networking** > **Firewall** in the navigation menu to open the **Firewall** page.\n- Click **Create** in the action bar to begin creating a new firewall rule.\n- On the **Firewall rule details** page, fill out the following information:- In the **Name** field, enter a valid name for your firewall rule.\n- In the **Direction of traffic** section, select **Egress** to indicate that this firewall rule is controlling outbound traffic.\n- In the **Target** section, select one of the following options:- **All user workloads:** allow connections from the workloads of the project you are configuring.\n- **Service:** indicate that this firewall rule targets a specific service within the project you are configuring.\n- If your target is a project service, select the name of the service from the list of available services on the **Service** drop-down menu.\n- In the **To** section, select one of the following two options:- **All projects:** allow connections to workloads in all the projects of the same organization.\n- **Another project** and **All user workloads:** allow connections to workloads in another project of the same organization.\n- If you want to transfer workloads only to another project, select a project that you can access from the list of projects on the **Project ID** drop-down menu.\n- If your target is all user workloads, select one of the following options in the **Protocols and ports** section:- **Allow all:** allow connections using any protocol or port.\n- **Specified protocols and ports:** allow connections using only the protocols and ports that you specify in the corresponding fields for the egress firewall rule.\n- On the **Firewall rule details** page, click **Create** .\nYou've now permitted connections to other project workloads within the same organization. After creating the firewall rule, the rule is visible in a table on the **Firewall** page.\n### Cross-organization traffic\nCross-organization traffic refers to the communication between services and workloads from different organizations.\n**Important:** Before allowing cross-organization traffic, you must disable data exfiltration protection.\nWhen exposing workloads in your project using an external load balancer, you must also create a `ProjectNetworkPolicy` ingress policy to allow external client IP addresses to access the workloads.\nWork through the following steps to create a new firewall rule and allow inbound traffic from workloads in a project of a different organization:\n- Within the GDCH console of the project you are configuring, go to **Networking** > **Firewall** in the navigation menu to open the **Firewall** page.\n- Click **Create** in the action bar to begin creating a new firewall rule.\n- On the **Firewall rule details** page, fill out the following information:- In the **Name** field, enter a valid name for your firewall rule.\n- In the **Direction of traffic** section, select **Ingress** to allow inbound traffic from workloads in other organizations.\n- In the **Target** section, select one of the following options:- **All user workloads:** allow connections to the workloads of the project you are configuring.\n- **Service:** indicate that this firewall rule targets a specific service within the project you are configuring.\n- If your target is a project service, select the name of the service from the list of available services on the **Service** drop-down menu.\n- In the **From** section, select **Outside the organization** and enter the CIDR block of another organization in the **CIDR** field to allow connections from that organization's network.\n- If your target is all user workloads, select one of the following options in the **Protocols and ports** section:- **Allow all:** allow connections using any protocol or port.\n- **Specified protocols and ports:** allow connections using only the protocols and ports that you specify in the corresponding fields for the ingress firewall rule.\n- On the **Firewall rule details** page, click **Create** .\nYou've now permitted connections from project workloads of a different organization. After creating the firewall rule, the rule is visible in a table on the **Firewall** page.\nConfigure and apply your own customized `ProjectNetworkPolicy` ingress policy:\n```\nkubectl --kubeconfig ORG_ADMIN_CLUSTER_KUBECONFIG apply -f - <<EOFapiVersion: networking.gdc.goog/v1kind: ProjectNetworkPolicymetadata:namespace: PROJECTname: allow-inbound-traffic-from-externalspec:policyType: Ingresssubject:    subjectType: UserWorkloadingress:- from:    - ipBlock:    - cidr: CIDREOF\n```\nThis policy is required as the external load balancer uses Direct Server Return (DSR), which preserves the source external IP address and bypasses the load balancer on the return path.\nTo transfer data to services outside of the organization, you must first disable data exfiltration protection. Then, you must configure an egress firewall rule to allow outbound traffic from your project workloads or services.\nThis section describes the process to enable outbound traffic at the project level. For information about managing egress connectivity at the workload level, see [Manage outbound traffic from workloads](/distributed-cloud/hosted/docs/latest/gdch/application/ao-user/manage-egress) .\nWork through the following steps to create a new firewall rule and allow outbound traffic from project workloads or services to workloads in another organization:\n- Within the GDCH console of the project you are configuring, go to **Networking** > **Firewall** in the navigation menu to open the **Firewall** page.\n- Click **Create** in the action bar to begin creating a new firewall rule.\n- On the **Firewall rule details** page, fill out the following information:- In the **Name** field, enter a valid name for your firewall rule.\n- In the **Direction of traffic** section, select **Egress** to indicate that this firewall rule is controlling outbound traffic.\n- In the **Target** section, select one of the following options:- **All user workloads:** allow connections from the workloads of the project you are configuring.\n- **Service:** indicate that this firewall rule targets a specific service within the project you are configuring.\n- If your target is a project service, select the name of the service from the list of available services on the **Service** drop-down menu.\n- In the **To** section, select **Outside the organization** and enter the CIDR block of another organization in the **CIDR** field to allow connections to that organization's network.\n- If your target is all user workloads, select one of the following options in the **Protocols and ports** section:- **Allow all:** allow connections using any protocol or port.\n- **Specified protocols and ports:** allow connections using only the protocols and ports that you specify in the corresponding fields for the egress firewall rule.\n- On the **Firewall rule details** page, click **Create** .\nYou've now permitted connections to another organization. After creating the firewall rule, the rule is visible in a table on the **Firewall** page.\nTo enable outbound traffic to services outside of the organization, customize your `ProjectNetworkPolicy` resource. However, because data exfiltration prevention is enabled by default, your customized `ProjectNetworkPolicy` egress policy shows a validation error in the status field, and the dataplane ignores it. This behavior happens by design.\nYou can transfer workloads from a given project when you allow data exfiltration for that project. The outbound traffic that you allow is a source network address translation (NAT) using a well-known IP address allocated for the project.\nThese directions show you how to enable your customized egress policy:- Configure and apply your own customized `ProjectNetworkPolicy` egress policy on all user workloads in a project.Use the following example:```\nkubectl --kubeconfig ORG_ADMIN_CLUSTER_KUBECONFIG apply -f - <<EOFapiVersion: networking.gdc.goog/v1kind: ProjectNetworkPolicymetadata:namespace: PROJECTname: allow-outbound-traffic-to-NAMEspec:policyType: Egresssubject:    subjectType: UserWorkloadegress:- to:    - ipBlock:        cidr: CIDREOF\n```The policy allows outbound traffic to all hosts in the CIDR block, which reside outside the organization. Your first attempt must cause an intended and necessary status error.\n- Confirm that you see a validation error in your status. **Important:** Only the outbound traffic to destinations outside your project's organization that you explicitly allow in your `ProjectNetworkPolicy` egress policy configuration is granted. Any other outbound traffic is denied. Therefore, only apply a customized `ProjectNetworkPolicy` egress policy when requirements mandate such a policy.\n- Ask the Organization IAM Admin to disable data exfiltration prevention. This action enables your configuration, while preventing all other outbound traffic. **Important:** Disabling data exfiltration prevention without defining one or more valid `ProjectNetworkPolicy` resources permits all outbound traffic to destinations outside your project's organization. Never disable this setting without configuring your customized `ProjectNetworkPolicy` egress policy.\n- Check the `ProjectNetworkPolicy` that you created and verify that the error in the validation status field is gone, and the status `Ready` is `True` , indicating that your policy is in effect:```\nkubectl --kubeconfig ORG_ADMIN_CLUSTER_KUBECONFIG \\    get projectnetworkpolicy allow-outbound-traffic-to-NAME \\    -n PROJECT -o yaml\n```Replace the following:- `` : the kubeconfig file for the org admin cluster.\n- `` : the name of the GDCH project.\n- `` : a name associated with the destination.\nAfter you have applied this policy, and provided that you have not defined other egress policies, all other outbound traffic is denied for `` .\n### Policies for managed services\nBy default, a managed service only allows connections from the project that created the service. An operator can expose the managed service to projects other than the project that created the service by using a project network policy.\nFor example, the following `ProjectNetworkPolicy` exposes the Database Service (DBS) as a managed service:\n```\nkubectl --kubeconfig ORG_ADMIN_CLUSTER_KUBECONFIG apply -f - <<EOFapiVersion: networking.gdc.goog/v1kind: ProjectNetworkPolicymetadata:  namespace: PROJECT_1  name: allow-inbound-traffic-from-project-2-to-dbs-servicespec:  subject:    subjectType: ManagedService    managedServices:      matchTypes:      - 'dbs'  ingress:  - from:    - projects:        matchNames:        - PROJECT_2EOF\n```\nWorkloads from the `` project can connect to workloads in the DBS managed service.\n## View the firewall rules of your organization\nTo view all the firewall rules associated with your organization from the GDCH console, follow these steps:\n- Within the GDCH console of your organization, go to **Networking** > **Firewall** in the navigation menu.The **Firewall** page displays the table of ingress and egress firewall rules for the [project network policies](#configure-network-policy) your organization has. These firewall rules establish communication within and between projects, as well as between organizations and managed services. The page classifies the existing rules as user-created and system-defined rules.\n- Optional: Use filtering to narrow the results in the table based on property names or values.\n- To view more details about a firewall rule, click its name.## Edit a firewall rule\nTo edit an existing firewall rule, follow these steps:\n- Within the GDCH console of your organization, go to **Networking** > **Firewall** in the navigation menu.The **Firewall** page displays the table of ingress and egress firewall rules for the [project network policies](#configure-network-policy) your organization has. These firewall rules are classified as user-created or system-defined rules. **Note:** System-defined rules cannot be edited using the UI.\n- Click the name of the firewall policy you want to edit.\n- Click **Edit** .\n- Make your changes. You can update all properties of the firewall rule except for the **Name** .## Delete a firewall rule\nTo delete an existing firewall rule, follow these steps:\n- Within the GDCH console of your organization, go to **Networking** > **Firewall** in the navigation menu.The **Firewall** page displays the table of ingress and egress firewall rules for the [project network policies](#configure-network-policy) your organization has. These firewall rules are classified as user-created or system-defined rules. **Note:** System-defined rules cannot be deleted using the UI.\n- Click the name of the firewall policy you want to delete.\n- Click **Delete** .\n- Click **Delete** .", "guide": "Documentation"}