{"title": "Documentation - Sign and verify data", "url": "https://cloud.google.com/distributed-cloud/hosted/docs/latest/gdch/overview", "abstract": "# Documentation - Sign and verify data\nThe AO performs sign and verify operations through Distributed Cloud Hosted gdcloud CLI to the KMS through a gRPC client.\n", "content": "## Sign data\nTo sign data, use the `gdcloud kms keys asymmetric-sign` command. This command creates a digital signature of an input file using the `Signing` key, and saves the base64 encoded signature.\n- To sign your data, pass in the key name and the following:```\ngdcloud kms keys asymmetric-sign \\namespaces/NAMESPACE/signingKeys/KEY_NAME \\--input-file=INPUT_PATH \\--signature-file=SIGNATURE_FILE\n```Replace the following variables:- : the project namespace—for example:`kms-test1`.\n- : the name of the key used to sign—for example:`key-1`.\n- : the path of the input file you want to have signed.\n- : the path of the output file to save the base64 encoded signature.\nAfter running the command, you see an output file you specified in the `--signature-file` flag that contains the base64 encoded signature.## Verify data\nAfter signing your data, verify the base64 digital signature using the `gdcloud kms keys asymmetric-verify` command. This command verifies whether or not the base64 encoded digital signature you receive after running the `gdcloud kms keys asymmetric-sign` command is valid.\n- To verify the signature, pass in the signature file and the following:```\ngdcloud kms keys asymmetric-verify \\namespaces/NAMESPACE/signingKeys/KEY_NAME \\  --input-file=INPUT_PATH \\  --signature-file=SIGNATURE_FILE\n```After running the command, you see the output `Verification OK` if successful. If not successful, you see the failure output `Verification Failure` .\n**Note:** The failure output `Verification Failure` might result if the paths of the signature and input files are not correct, and if the signature file is empty.", "guide": "Documentation"}