{"title": "Documentation - Set storage bucket retention periods for projects", "url": "https://cloud.google.com/distributed-cloud/hosted/docs/latest/gdch/overview", "abstract": "# Documentation - Set storage bucket retention periods for projects\nThis page shows you how to set retention periods for Google Distributed Cloud Hosted (GDCH) storage buckets.\n", "content": "## Before you begin\nA project namespace manages bucket resources in the org admin cluster. You must have a [project](/distributed-cloud/hosted/docs/latest/gdch/platform/pa-user/project-management) to work with buckets and objects.\nYou must also have the appropriate bucket permissions to perform the following operation. See [Grant bucket access](/distributed-cloud/hosted/docs/latest/gdch/application/ao-user/grant-obtain-storage-access#grant_bucket_access) .\n## Set a bucket retention period\n- In the navigation menu, click **Object Storage** .\n- Click the name of the bucket that you want to update.\n- Click the **Configuration** tab.\n- In the Security section, next to the **Retention policy** field, clickedit **Edit** .\n- Edit the number of days with a value higher than the existing number of days and click **Save** .\nBy default, you can delete objects at any time. You can enable object locking with a retention period to prevent all objects in the bucket from deletion for the specified number of days. You cannot delete a bucket until you delete all objects after the retention period.\nYou must enable object locking when creating the bucket. You cannot enable or disable object locking after you create a bucket. However, you can modify the default object retention period.\nYou can create a bucket with or without enabling object locking. If you've enabled object locking, specifying a default retention period is optional.\nTo modify the retention period, update the `Bucket.spec.buckePolicy.lockingPolicy.defaultObjectRetentionDays` field in the [Bucket resource](https://cloud.google.com/distributed-cloud/hosted/docs/latest/gdch/apis/storage-krm-api.md) .\nThe following is an example of updating the field in the Bucket resource:\n```\napiVersion: object.gdc.goog/v1kind: Bucketmetadata:  name: BUCKET_NAME  namespace: NAMESPACE_NAMEspec:  description: \"This bucket has a default retention period specified.\"  storageClass: Standard  bucketPolicy :    lockingPolicy :      defaultObjectRetentionDays: RETENTION_DAY_COUNT----------apiVersion: object.gdc.goog/v1kind: Bucketmetadata:  name: BUCKET_NAME  namespace: NAMESPACE_NAMEspec:  description: \"This would enable object locking but not specify a default retention period.\"  storageClass: Standard  bucketPolicy :    lockingPolicy :----------apiVersion: object.gdc.goog/v1kind: Bucketmetadata:  name: BUCKET_NAME  namespace: NAMESPACE_NAMEspec:  description: \"This bucket does not have locking or retention enabled.\"  storageClass: Standard\n```\nAny updates to the retention period apply to objects created in the bucket after the update. For pre-existing objects, the retention period does not change.\nWhen you've enabled object locking, if you attempt to overwrite an object, you add a new version of the object. You can retrieve both object versions. To retrieve object versions, see [List storage objects](/distributed-cloud/hosted/docs/latest/gdch/platform/pa-user/list-storage-objects) .\nTo create a write-once, read-many (WORM) bucket, refer to the [WORM Bucket](/distributed-cloud/hosted/docs/latest/gdch/platform/pa-user/create-storage-worm-buckets) section.", "guide": "Documentation"}