{"title": "Documentation - Calculate resource costs", "url": "https://cloud.google.com/distributed-cloud/hosted/docs/latest/gdch/overview", "abstract": "# Documentation - Calculate resource costs\nThe pricing calculator estimates the cost of using GDCH resources in the GDCH console. The calculator is in the table format with each column representing the following:\n- **SKU** : the name of the resource represented as a stock keeping unit (SKU). For example, the SKU for a resource in **Analytics** is **Dataproc Spark Container Image** .\n- **Quantity** : an input field column for citing the quantity of a specific SKU.\n- **Cost** : the total estimated cost, exclusive of taxes, that shows in the calculator's footer. **Note:** The calculator represents the **SKU** and **Quantity** columns in the **Compute and Infrastructure security** row as **Server** and **Number of servers** .\nAs you enter quantities into input fields for each line item SKU, the cost column updates with new values.\n", "content": "## Use the pricing calculator\nTo use the calculator, complete the following steps:\n- Enter the quantity of resources required for a particular SKU into the corresponding input field. The following image shows entering a quantity into the **Number of servers** field:\n- Press `ENTER` . You see the line item cost update.The total estimated cost in the footer also updates. \nThe cost for each line item is a cumulative total accrued over a time period you can adjust only on monthly intervals. The calculator sets the default time period to one month, and it calculates the total estimated cost for a one month period. See [Set the time period](#set-time-period) to adjust the time period of calculation.\n### SKU cost types\nThe following explains the SKU cost types available in the pricing calculator:\n- **Flat Rate** : the cumulative SKU costs that accrue over the selected time period.\n- **One-time Charge** : the SKU cost you add once to the total cost, regardless of the selected time period. This SKU cost is in contrast to the Flat Rate SKU cost, which accumulate over time. One-time Charge SKUs have a text indicator in the name column.\n- **Support** : the SKU costs have both a base fee and a variable percentage fee component.- The base fee is a Flat Rate support cost.\n- The variable percentage fee is calculated on a percentage of the total Flat Rate costs, and does not include the One-time Charge SKU costs and the Support base fee.\n## Set the time period\nYou can attain a longer term GDCH cost projection by adjusting the calculator's selected time period. The selector's available period options are as follows:\n- **1 month** \n- **3 months** \n- **6 months** \n- **9 months** \n- **1 year** \n- **Date Range** for a custom date\nTo adjust the selected time period, complete the following steps:\n- Click the time period **Edit** icon in the footer.\n- Select your preferred time period.\n- Click **Confirm** .\n- The **Cost** column updates along with the time period and total estimated cost.\nFor custom date ranges, the calculator adjusts the Flat Rate SKU costs based on month intervals, rounding up to include the latest interval. For example:\n- Selecting a range of November 15 to December 14 is equivalent to a one month period.\n- Selecting a range of November 15 to December 15 is equivalent to a two month period.## Export to CSV or PDF\nTo export the calculator data, complete the following:\n- In the footer, click **Export** , and then select **CSV** or **PDF** .\n- A file containing the Pricing Calculator data saves to your local computer.\n### Optional: Print local file\nTo print the data, do the following:\n- **CSV** - Import the newly saved file into a program that offers a structured table format, such as a spreadsheet.\n- Format the data to your preference, and print.\n- **PDF** - Locate the newly saved file on your local computer.\n- Print the file following the steps for your local application or operating system.", "guide": "Documentation"}