{"title": "Documentation - Respond to storage operational incidents", "url": "https://cloud.google.com/distributed-cloud/hosted/docs/latest/gdch/overview", "abstract": "# Documentation - Respond to storage operational incidents\n", "content": "## Tenant metrics\nAs a Platform Administrator (PA), view tenant metrics to help diagnose operational incidents.\n### Tenant capacity usage\nTo view current capacity usage of an organization by storage class in the monitoring dashboard, go to the **Explore** option. You can execute the following query to view the capacity percentage used by that organization and storage class.\n```\nsum by (TENANT_TYPE, SKU_NAME) (OBJECT_TENANT_USED_CAPACITY_BYTES_COUNT) / sum by (TENANT_TYPE, SKU_NAME) (OBJECT_TENANT_QUOTA_BYTES)\n```\n### Object Storage Platform dashboard\nThe **Object Storage Platform** dashboard shows a view of each object storage class in the organization with the respective usage, quota, and capacity remaining.\nYou can also view more granular usage stats about each storage class down to the bucket level.### Organization utilization alert\nIf you have received an alert with code `OBJ-A0011` , complete the following steps:\n- View the **Object Storage Platform** dashboard and determine the storage tier that causes the alert.\n- Depending on the value, choose the recommended course of action:- If the remaining capacity is near 25% but usage is stable and not increasing, choose to ignore the alert at the current time.\n- If usage is increasing and you are concerned about usage surpassing the set quota threshold, determine if there are any buckets or objects that are not vital and delete them.\n- If you do not want to delete any objects from object storage, or you are concerned with the available capacity, increase the allocated capacity for the specific storage class. To increase the quota, you must reach out to the Infrastructure Operator (IO) with a request to raise the specific storage class's quota.\n **Note:** Failure to increase quota prior to available capacity running out results in failures to add or modify objects in object storage for the specific storage class. You cannot add or modify objects until capacity is available.", "guide": "Documentation"}