{"title": "Documentation - Supportability", "url": "https://cloud.google.com/distributed-cloud/hosted/docs/latest/gdch/overview", "abstract": "# Documentation - Supportability\n", "content": "## Access software notifications\nCheck the following tools for notifications of when an issue appears in the software components of your platform:\n- **The common software dashboard:** For notifications about system health information, such as GKE Enterprise components, clusters, services, and VMs.\n- **Your mailbox:** For email notifications that include basic information about the problem, such as error codes.\nClick a notification to view the problematic component page and access the relevant logs.\n## Configure notifications recipients\nConfigure the following communication channels to receive alerts, even if they are disconnected from the dashboard:\n- SMS messages\n- Email notifications\n- PagerDuty\nOrganize the type of notification and recipient role, such as billing, software, and hardware.\n## Understand software errors\nFollow these practices to access relevant information about errors on software components, resolve the issue, and engage with Support effectively:\n- Find the error code of each error.\n- Use error codes to search the local and online documentation.\n- The user interface provides snippets of information regarding particular errors. Hold the pointer over an error code to view the snippets.## Sanitize software troubleshooting information from sensitive data\nSanitize troubleshooting information for the software components, including configurations, logs, status, and metrics of all sensitive data, and comply with sovereignty requirements.\nGoogle Distributed Cloud Hosted (GDCH) provides a list of default sensitive keywords to obfuscate and remove. Follow these steps to sanitize troubleshooting information:\n- Customize the default list by adding and removing custom keywords.\n- Receive a report of all the obfuscated occurrences.\n- Receive warnings of potential remaining sensitive information.\nCritical items to obfuscate include:\n- Fully Qualified Domain Names (FQDNs)\n- IP addresses\n- Usernames\n- Hostnames\n- Workload names\n- Hashes\n- Certificates\n- Customer names## Create a software system snapshot\nCreate a snapshot of your software components to pack all the information necessary to troubleshoot the issue and engage with Support effectively:\n- Select the components to include.\n- Generate a tar file with all the required configurations, logs, status, and metrics.\n- Specify the component to debug.\n- Specify how to sanitize the data.## Share information with Support\nGoogle provides level 1 (L1) and level 2 (L2) support for GDCH.\n## Enforce policies on snapshot sharing\nFollow these practices to ensure that the snapshot data you share with Support is secure, protected, and subject to data retention policies you control:\n- Define and enforce access control policies to the snapshot.\n- Define and enforce data retention policies for the snapshot.\n- Set up a secure channel to upload the snapshot to the Support portal.## Access hardware notifications\nCheck notifications of when an issue appears in the hardware components of your platform. Notifications appear in System Manager with system health information of hardware components such as racks, servers, switches, and storage.\nYou can receive email notifications too. They include basic information about the problem, such as error codes. Click the notification to view the problematic component page and access the relevant logs.\n## Request capacity upgrades\nMonitor, forecast, and request additional hardware capacity to ensure the health and scalability of your workloads.\n## Process the system snapshot\nBefore you process the system snapshot, ensure you have the following requirements:\n- The snapshot tool has a connection to a running cluster.\n- You have the following necessary permissions to read the configuration and logs on the cluster:- Application Operators have administrative capabilities.\n- Platform Administrators have access permissions restricted to assigned information.To process the system snapshot, select the components of the system to snapshot. The tool connects to your cluster to pull information for each selected component. Following the data retrieval, the data goes through post-processing to filter sensitive data. The tool then bundles the information into a zip file.\nOptionally, you can inspect the zip file and its content to ensure that you are not capturing any sensitive data before sharing it with Support.\n## Access Support documentation\nAccess the following documentation and playbooks to help troubleshoot the customer problem at hand:\n- Support playbooks\n- Public documentation, best practices, FAQs, and the knowledge base\n- The user community\nA partner might provide L1 and L2 support, so these artifacts must be publicly available.\n## Escalate a software problem to L3\nFollow these steps to escalate a software problem to Google for level 3 (L3) or advanced support:\n- Request permission to share snapshot data with Google.\n- Open a support ticket with Google.\n- Provide Google with access to your snapshot.\n- Monitor and provide visibility into the operations that Google performs on the snapshot.## Escalate a hardware problem to L3\nFollow these steps to escalate a problem to Google that a hardware failure caused:\n- Extract and sanitize the minimal information to troubleshoot the hardware components:- Logs\n- Status and configurations\n- Metrics\n- Physical information such as a rack number, component type, serial number, and physical location.\n- Request permission to share snapshot data with Google.\n- Open a support ticket with Google.\n- Provide Google with access to your snapshot.\n- Monitor and provide visibility into the operations that Google performs on the snapshot.## Open a hardware support case\nGoogle has access to the same troubleshooting tools to diagnose the customer's snapshot. Open a support case with the hardware-as-a-service (HWaaS) partner to get hardware support through the shared ticketing system.\nSupport tickets have the following priority levels with the corresponding service-level agreements (SLA):\n- Critical\n- High\n- Medium## Share customer data with the HWaaS partner\nFollow these steps to share system hardware data with the hardware partner and enable hardware troubleshooting:\n- Request permission to share snapshot data with an HWaaS partner.\n- Ensure you comply with sovereignty requirements: nationality and location of the Support agent.\n- Grant the HWaaS partner secure access to the customer hardware snapshot, including the serial number, physical location, logs, metrics, and configuration files.\n- Notify to who you have granted access.\n- Enforce automatic expiration of access privileges.\n- Log all activities and share them with all involved parties.## Notify Google of troubleshooting results and fix the timeline\nReport back to Google on the root cause of the issue and offer a gradual fix so that Google can notify the end customer and partner. Use a ticketing system to provide details of the required fix task and provide an estimated timeline for it to complete.\n## Coordinate data center access\nCoordinate logistics and permissions for secure access to the data center and perform the necessary hardware fix.\nThe HWaaS partner ensures compliance with sovereignty requirements, such as the nationality of the Support agent. They need the following information:\n- The details of the point of contact of the data center and location.\n- The exact location of the problem rack and component in the data center.\n- A process to get clearance and authorization to access the data center at an agreed-upon time.\n- A process to schedule on-site intervention at a data center.## Obtain hardware support for SLO and SLA\nGoogle provides support through a hardware original equipment manufacturer (OEM) partner. The process is as follows:\n- Google negotiates hardware support for service-level objectives (SLO) and service-level agreements (SLA) with an HWaaS partner.\n- SLO and SLA vary based on incident criticality, which can be critical, high, or medium.\n- The HWaaS partner updates the ticket with the status and estimated time to fix it.\n- The HWaaS partner confirms when the issue is resolved.## Upgrade capacity\nTo respond to a request for a capacity increase, use built-in extra capacity if available. Go onsite and upgrade physical capacity if no additional capacity is available on the racks.\n## Schedule recurring reviews with Google\nSet up periodic reviews with the HWaaS partner to check the current status of deployments and plan scheduled interventions.\nGo through the following actions during recurring reviews:\n- Check required scheduled updates to the operating system, hardware and firmware.\n- Review the status of existing deployments.\n- Plan new deployments.## Communicate scheduled maintenance and upgrades\nCommunicate with existing customers on upcoming scheduled maintenance plans. Go through the following actions with them:\n- Select the resources to upgrade.\n- Specify why the upgrades will perform in their current state.\n- Determine who will perform the upgrades and when, where, and how.\n- Plan for the possible impact and downtimes.## Set scheduled maintenance\nSchedule regular preventive maintenance and ensure that the system is up to date and performs well. The HWaaS reports back on the completion of maintenance. It needs the following processes:\n- A process to gain clearance to access the data center.\n- A process to schedule on-site intervention at the data center.", "guide": "Documentation"}