{"title": "Documentation - Marketplace overview", "url": "https://cloud.google.com/distributed-cloud/hosted/docs/latest/gdch/overview", "abstract": "# Documentation - Marketplace overview\nGoogle Distributed Cloud Hosted (GDCH) contains an air-gapped Marketplace where you can find software packages ready to run in your isolated environment. Software you install using the GDCH Marketplace are not managed by default: they run in your projects, under your responsibility. See the [Marketplace shared responsibility model](/distributed-cloud/hosted/docs/latest/gdch/application/ao-user/shared-responsibility-model) to learn more.\nAll software packages available in the GDCH Marketplace are validated by Google and the relevant partner, and can be installed and managed while being disconnected from the Internet. You may need an Internet connection to consult the documentation or other links provided by third-party software vendors.\n", "content": "## Billing and support\nFor third-party software, the GDCH Marketplace supports a bring-your-own-license (BYOL) model that lets you reuse your existing licenses or procure new ones and get support directly from a relevant vendor. As outlined in the shared responsibility model, the vendor is responsible for providing your support on their software. Google and your Infrastructure Operator can collaborate with the vendor directly if needed to solve a problem coming from an unexpected interaction between their software and the GDCH platform.\n## Available software packages\nThe following software packages are available on the GDCH Marketplace. Go to the relevant page in the GDCH Marketplace UI to learn more about each of the packages as well as about their pricing model and terms of services in particular. Learn how to install them in [Life Cycle of a marketplace deployment](/distributed-cloud/hosted/docs/latest/gdch/application/ao-user/shared-responsibility-model) .\n- Dataproc Container for Spark. An open source Google project which lets you run Apache Spark on GKE on GDCH clusters. Read the [Dataproc Container for Spark](/distributed-cloud/hosted/docs/latest/gdch/application/ao-user/marketplace-offerings#dataproc-container-for-spark) documentation to learn how to use it.\n- Elastic Cloud on Kubernetes (BYOL). Elastic provides flexible search, monitoring, and security solutions based on Elasticsearch. Read [Elastic Cloud on Kubernetes quickstart](https://www.elastic.co/guide/en/cloud-on-k8s/current/k8s-quickstart.html) and [Elastic documentation](https://www.elastic.co/guide/index.html) to learn how to use it.\n- MongoDB Enterprise Advanced (BYOL). A collection of products and services that drive security, efficiency, and put you in control of your MongoDB databases. Read [MongoDB Enterprise Kubernetes Operator](https://www.mongodb.com/docs/kubernetes-operator/master/) to learn how to use it.\nIf you have accreditation requirements, some of these software packages may not be listed in your instance of the GDCH Marketplace. Your Infrastructure Operator controls which packages are actually available for installation in your environment.\n## Differences with the Google Cloud Marketplace\nThe GDCH Marketplace is separate from the Google Cloud Marketplace due to its air-gapped nature. Many of the same vendors are present in both, but sometimes with different products: the same vendor may offer a multi-tenant Software as a service (SaaS) solution on Google Cloud and a single-tenant on-premises product on the GDCH Marketplace.\nToday, you cannot buy a product on the Google Cloud Marketplace whether with a public price, or a private offer, and use it on the GDCH Marketplace.", "guide": "Documentation"}