{"title": "Documentation - Create storage buckets for projects", "url": "https://cloud.google.com/distributed-cloud/hosted/docs/latest/gdch/overview", "abstract": "# Documentation - Create storage buckets for projects\nThis page shows you how to create Google Distributed Cloud Hosted (GDCH) storage buckets.\n", "content": "## Before you begin\nA project namespace manages bucket resources in the org admin cluster. You must have a [project](/distributed-cloud/hosted/docs/latest/gdch/platform/pa-user/project-management) to work with buckets and objects.\nYou must also have the appropriate bucket permissions to perform the following operation. See [Grant bucket access](/distributed-cloud/hosted/docs/latest/gdch/application/ao-user/grant-obtain-storage-access#grant_bucket_access) .\n## Storage bucket naming guidelines\nBucket names must adhere to the following naming conventions:\n- Be unique within the project. A project appends a unique prefix to the bucket name, ensuring there aren't clashes within the organization. In the unlikely event of a prefix and bucket name clash across organizations, the bucket creation fails with a \"bucket name in use\" error.\n- Refrain from including any personally identifiable information (PII).\n- Be DNS-compliant.\n- Have at least 1 and no more than 57 characters.\n- Start with a letter and use only letters, numbers, and hyphens.## Create a bucket\n- In the navigation menu, click **Object Storage** .\n- Click **Create Bucket** .\n- In the bucket creation flow, assign a name unique across all buckets within the project.\n- Enter a description.\n- Optional: Click thetoggle_offtoggle to set a retention policy and enter your desired number of days. Contact your IO if you need to exceed retention policy limits.\n- Click **Create** . A success message appears and you are directed back to the **Buckets** page.\nTo verify that you have successfully created a new bucket, refresh the **Buckets** page after a few minutes and check that the bucket state updates from `Not ready` to `Ready` .\nTo create a bucket, apply a bucket specification to your project namespace:\n```\nkubectl apply -f bucket.yaml\n```\nThe following is an example of a bucket specification:\n```\napiVersion: object.gdc.goog/v1kind: Bucketmetadata:  name: BUCKET_NAME  namespace: NAMESPACE_NAMEspec:  description: DESCRIPTION  storageClass: Standard  bucketPolicy :    lockingPolicy :      defaultObjectRetentionDays: RETENTION_DAY_COUNT\n```\nFor more details, see the [Bucket API reference](https://cloud.google.com/distributed-cloud/hosted/docs/latest/gdch/apis/storage-krm-api.md) .", "guide": "Documentation"}