{"title": "Documentation - Upload and download storage objects in projects", "url": "https://cloud.google.com/distributed-cloud/hosted/docs/latest/gdch/overview", "abstract": "# Documentation - Upload and download storage objects in projects\nThis page shows you how to upload and download objects to and from Google Distributed Cloud Hosted (GDCH) storage buckets.\n", "content": "## Before you begin\nA project namespace manages bucket resources in the org admin cluster. You must have a [project](/distributed-cloud/hosted/docs/latest/gdch/platform/pa-user/project-management) to work with buckets and objects.\nYou must also have the appropriate bucket permissions to perform the following operation. See [Grant bucket access](/distributed-cloud/hosted/docs/latest/gdch/application/ao-user/grant-obtain-storage-access#grant_bucket_access) .\n## Object naming guidelines\nUse the following guidelines to name objects:\n- Use UTF-8 characters when naming objects.\n- Refrain from including any personally identifiable information (PII).## Upload objects to storage buckets\n- In the navigation menu, click **Object Storage** .\n- Click the name of the bucket you want to upload the object to.\n- Optional: If you want to create a folder to store your object, click **Create folder** > enter a folder name > click **Create** .\n- Click **Upload file** directly, or navigate into the folder you just created and then click **Upload file** .\n- Select the desired file and click **Open** .\n- Wait for the confirmation message that the upload was successful.\nTo upload an object, run the following commands:\n* pragma: { seclinter_this_is_fine: true } *\n```\ngdcloud storage cp LOCAL_PATH s3://REMOTE_PATHgdcloud storage cp s3://REMOTE_SOURCE_PATH s3://REMOTE_MOVE_DESTINATION_PATHgdcloud storage mv s3://REMOTE_SOURCE_PATH s3://REMOTE_MOVE_DESTINATION_PATH\n```\n* pragma: { seclinter_this_is_fine: false } *\nThe following command uploads all text files from the local directory to a bucket:\n```\ngdcloud storage cp *.txt s3://BUCKET\n```\nThe following command uploads multiple files from the local directory to a bucket:\n```\ngdcloud storage cp abc1.txt abc2.txt s3://BUCKET\n```\nTo upload a folder to a bucket, use the --recursive option to copy an entire directory tree. The following command uploads the directory tree dir:\n```\ngdcloud storage cp dir s3://BUCKET --recursive\n```\nPerform multipart uploads for large objects, or use multipart uploads automatically when you have a file to upload that is larger than 15 MB. In that case, the file splits into multiple parts, with each part being 15 MB in size. The last part is smaller. Each part uploads separately and reconstructs at the destination when the transfer completes.\nIf an upload of one part fails, you can restart the upload without affecting any of the other parts already uploaded.\nThere are two options related to multipart uploads:- `--disable-multipart`: disables multipart uploads for all files.\n- `--multipart-chunk-size-mb=` ``: sets the size of each chunk of a multipart upload.\nFiles bigger than automatically upload as multithreaded-multipart. Smaller files upload using the traditional method. is in megabytes. The default chunk size is 15 MB. The minimum allowed chunk size is 5 MB, and the maximum is 5 GB.\n## Download objects from storage buckets\n- In the navigation menu, click **Object Storage** .\n- Click the name of the bucket containing the objects.\n- Select the checkbox next to the name of the object to download.\n- Click **Download** .\nTo get objects from the bucket:\n```\ngdcloud storage cp s3://BUCKET/OBJECT LOCAL_FILE_TO_SAVE\n```\nTo download all text files from a bucket to your current directory:\n```\ngdcloud storage cp s3://BUCKET/*.txt .\n```\nTo download the text file `abc.txt` from a bucket to your current directory:\n```\ngdcloud storage cp s3://BUCKET/abc.txt .\n```\nTo download an older version of the file, list all versions of the file first:\n```\ngdcloud storage ls s3://BUCKET/abc.txt --all-versions\n```\nExample output:\n```\ns3://my-bucket/abc.txt#OEQxNTk4MUEtMzEzRS0xMUVFLTk2N0UtQkM4MjAwQkJENjNDs3://my-bucket/abc.txt#ODgzNEYzQ0MtMzEzRS0xMUVFLTk2NEItMjI1MTAwQkJENjNDs3://my-bucket/abc.txt#ODNCNDEzNzgtMzEzRS0xMUVFLTlDOUMtQzRDOTAwQjg3RTg3\n```\nThen, download a specific version of the text file `abc.txt` from the bucket to your current directory:\n```\ngdcloud storage cp s3://BUCKET/abc.txt#OEQxNTk4MUEtMzEzRS0xMUVFLTk2N0UtQkM4MjAwQkJENjND .\n```", "guide": "Documentation"}