{"title": "Documentation - Manage load balancers", "url": "https://cloud.google.com/distributed-cloud/hosted/docs/latest/gdch/overview", "abstract": "# Documentation - Manage load balancers\nGoogle Distributed Cloud Hosted (GDCH) provides load balancers that enable applications to expose services to one another. Load balancers allocate a stable virtual IP (VIP) address that balances traffic over a set of backend workloads. Load balancers in GDCH perform layer four (L4) load balancing, which means they map a set of configured frontend TCP or UDP ports to corresponding backend ports.\nLoad balancers are configured for containerized workloads using the Kubernetes Service API. This section describes how to configure load-balancing `Service` objects in user clusters. For more information about Kubernetes Services, see [https://kubernetes.io/docs/concepts/services-networking/service/](https://kubernetes.io/docs/concepts/services-networking/service/)\n**Note:** GDCH currently supports load balancing for containerized workloads only. However, future releases include load balancing for VM-based workloads.\nGDCH applications have access to the following networking service types:\n- [Internal Load Balancer (ILB):](/distributed-cloud/hosted/docs/latest/gdch/application/ao-user/ilb-service) lets you expose a service to other clusters within the organization.\n- [External Load Balancer (ELB):](/distributed-cloud/hosted/docs/latest/gdch/application/ao-user/elb-service) allocates a VIP address from a range that is routable from external workloads and exposes services outside of the GDCH organization, such as other organizations inside or outside of the GDCH instance.\nLoad balancers are configured in a project and can only select backend workloads in that project. Both Internal and External load balancers currently support selecting backend workloads from a single cluster only.\n", "content": "## Service virtual IP addresses\nILBs allocate VIP addresses that are internal only to the organization. These VIP addresses are not reachable from outside the organization; therefore, you can only use them to expose services to other applications within an organization. These IP addresses may overlap between organizations in the same instance.\nOn the other hand, ELBs allocate VIP addresses that are externally reachable from outside the organization. For this reason, ELB VIP addresses must be unique among all organizations. Typically, fewer ELB VIP addresses will be available for use by the organization.", "guide": "Documentation"}