{"title": "Documentation - Calculate AO metrics based on metric data", "url": "https://cloud.google.com/distributed-cloud/hosted/docs/latest/gdch/overview", "abstract": "# Documentation - Calculate AO metrics based on metric data\nCalculating metrics means generating new metrics based on pre-existing logs or metrics for data observability. You calculate metrics in GDCH by configuring recording rules in a `MonitoringRule` custom resource. Recording rules precompute expressions that are frequently needed or computationally expensive. These rules save their result as a new set of time series. Querying the precomputed result is faster than executing the original expression whenever needed. This precomputation is especially useful for dashboards and complex alerts, which must query the same expression repeatedly every time they refresh or are evaluated.\nYou configure recording rules in the `MonitoringRule` custom resource to calculate metrics based on other system monitoring metrics. The `MonitoringRule` custom resource contains recording rules that describe the conditions to calculate new metrics based on pre-existing metrics.\n", "content": "## Create recording rules\nDefine a record name and a valid expression that evaluates the rule. The expression must resolve to a numeric value to record it as a new metric. Deploy the custom resource in your project namespace on the org admin cluster to create the recording rules for the Observability platform.\n**Important:** To create rules, verify that a project is deployed with workloads. To have data your rules can act on, verify that you configured scraping metrics.\nFor more information about recording rules for Observability, see [https://grafana.com/docs/loki/latest/rules/](https://grafana.com/docs/loki/latest/rules/)\nWork through the following steps to create recording rules and calculate metrics in your project namespace:\n- Open or create the YAML file for the custom resource using [the MonitoringRule custom resource](#monitoringrule-recording-rules) template for metric-based recording rules.\n- In the`namespace`field of the custom resource, enter your project namespace.\n- In the`name`field, enter the name for the rule configuration.\n- In the`interval`field, enter the number of seconds for the duration of the rule evaluation interval.\n- Optional: In the`limit`field, enter the maximum number of alerts. Enter`0`for unlimited alerts.\n- In the `recordRules` field, enter the following information to calculate metrics:- In the`record`field, enter the record name. This value defines the time series in which to write the recording rule and it must be a valid metric name.\n- In the `expr` field, enter a [PromQL](https://prometheus.io/docs/prometheus/latest/querying/basics/) (Prometheus Query Language) expression for the metric rule.This expression must resolve to a numeric value to be recorded as a new metric.\n- Optional: In the `labels` field, define the labels that you want to add or overwrite as key-value pairs.\n- Save the YAML file of the custom resource.\n- Deploy the custom resource in your project namespace on the admin cluster to create the recording rules.## The MonitoringRule recording rules\nA `MonitoringRule` custom resource contains recording rules that describe the conditions to calculate new metrics based on pre-existing system monitoring metrics for observability.\nThe following YAML file shows a template for the `MonitoringRule` custom resource:\n```\n# Configures either an alert or a target record for precomputationapiVersion: monitoring.gdc.goog/v1kind: MonitoringRulemetadata:  # Choose a namespace that matches the project namespace  # The alert or record is produced in the same namespace  namespace: PROJECT_NAMESPACE  name: alerting-configspec:  # Rule evaluation interval  interval: 60s  # Configure the limit for the number of alerts  # A value of '0' means no limit  # Optional  # Default value: '0'  limit: 0  # Configure recording rules to generate new metrics based on pre-existing metrics.  # Recording rules generate metrics based on metrics.  # Recording rules precompute expressions that are frequently needed or computationally expensive.  # These rules save their result as a new set of time series.  recordRules:    # Define which timeseries to write to    # The value must be a valid metric name  - record: MyMetricsName    # Define the PromQL expression to evaluate for this rule    expr: rate({service_name=\"bob-service\"} [1m])    # Define labels to add or overwrite    # Map of key-value pairs    # Optional    labels:      verb: read...\n```\nReplace with the namespace of your project.", "guide": "Documentation"}