{"title": "Documentation - Learn about OCR-supported languages", "url": "https://cloud.google.com/distributed-cloud/hosted/docs/latest/gdch/overview", "abstract": "# Documentation - Learn about OCR-supported languages\nThe text recognition feature of GDCH detects a variety of languages and can detect multiple languages in a single image.\nYou can specify an optional language hint to a `BatchAnnotateImages` request. For example, you might want to specify a hint if the API is having trouble detecting the language used in your image.\nTo specify optional language hints, add them to your `BatchAnnotateImages` or `BatchAnnotateFiles` request in the `ImageContext` field as a list of values in the `language_hints` field.\nEach language code parameter typically consists of a BCP-47 identifier. This parameter format is , where refers to the primary language, and the optional refers to a particular geographical area for a dialect, usually a country identifier. For example, Chinese can be represented as Simplified Chinese from the People's Republic of China ( `zh-Hans` ) or Traditional Chinese from Taiwan ( `zh-Hant` ).\nThe text recognition feature supports three levels of language:\n- [Supported](#supported-langs) languages are prioritized with regular performance evaluation.\n- [Experimental](#experimental-langs) languages are under active development. They don't have regular performance evaluations.\n- [Mapped](#mapped-langs) languages are supported by mapping them to another language code or a general character recognizer. For example,`en-GB`is supported but not treated differently than`en`for text recognition. Vertex AI tries to return the correct mapped language code in the`Entity`locale field but mapped languages are more likely to be misidentified than fully supported or experimentally supported languages.\n#", "content": "## Supported languages\nThe text recognition feature of GDCH prioritizes and regularly evaluates the following languages. To filter by language, type a language in the following textbox:### Experimental languages\nThe following languages are under active development and not currently evaluated. To filter by language, type a language in the following textbox:### Mapped languages\nThe following languages are mapped to another language code or mapped to a general character recognizer. To filter by language, type a language in the following textbox:", "guide": "Documentation"}