{"title": "Documentation - Life cycle of a Marketplace deployment", "url": "https://cloud.google.com/distributed-cloud/hosted/docs/latest/gdch/overview", "abstract": "# Documentation - Life cycle of a Marketplace deployment\nThis page explains how to install, upgrade, and uninstall GDCH Marketplace software packages using the GDCH console.\nYou can also use the [gdcloud marketplace CLI](/distributed-cloud/hosted/docs/latest/gdch/resources/gdcloud-reference/gdcloud-marketplace) or the [GDCH Marketplace API](/distributed-cloud/hosted/docs/latest/gdch/apis/service/marketplace/marketplace-api-overview) to achieve the same results.\n", "content": "## Install a GDCH Marketplace software package\nYou discover, select, and install software packages from the GDCH Marketplace page of the GDCH console.\nTo install a software package from the GDCH Marketplace, complete the following steps:\n- Using the project selector at the top of the GDCH console, select the project you want to install the software package in.\n- In the GDCH Marketplace, visit the listing page for the product that you want to install. From this page, you can review details of the product and follow links to its documentation, pricing, and terms of services.\n- If it's the first time you are installing this product, click **Install** . Otherwise, go to the Management tab and click **New Instance** .\n- In the dialog, select which user cluster you want to install the software package in, and click **Install** . After a few minutes, your new service install is marked as **Ready** in the Management tab of the page.\n- Consult the documentation of the relevant software vendor to learn how to use their solution once it's installed.## Upgrade a GDCH Marketplace software package\n**Warning:** While you can trigger the upgrade of a software package using the GDCH Marketplace, the upgrade process is implemented by the vendor who published the product. The upgrade process therefore varies from one software package to another. We recommend you carefully review the release notes and upgrade documentation of the relevant vendor before proceeding with an upgrade. Depending on how the vendor implemented their upgrade process, you may encounter downtime in the service delivered, or compatibility issues between older and newer versions.\nSome GDCH Marketplace software packages can be upgraded to a new version through the GDCH Marketplace once your Infrastructure Operator makes those new versions available to you.\nTo upgrade a GDCH Marketplace software package, work through the following steps:\n- Using the project selector at the top of the GDCH console, select the project in which you want to upgrade the software package.\n- On the GDCH Marketplace page, visit the listing page for the product you want to upgrade.\n- Click the Management tab.\n- Click **Upgrade** on the instance you want to upgrade. The upgrade completes in a few minutes.\n**Note:** Upgrading a software package through the GDCH console leads to the next available version of the software being installed. If there are multiple new versions of the software available, you need to repeat the process for each of them. If required, use the [GDCH Marketplace API](/distributed-cloud/hosted/docs/latest/gdch/apis/service/marketplace/v1/marketplace-v1) to upgrade to a specific version.\n## Uninstall a GDCH Marketplace software package\n**Warning:** Uninstalling a GDCH Marketplace software package is a destructive action, and may result in loss of data or downtime of systems dependent on this software. Ensure that you have backed up all important data and that no important system depends on the software you want to uninstall before proceeding. Consult the documentation of the relevant vendor to learn how to back up any data managed by their software.\nTo uninstall a GDCH Marketplace software package, complete the following steps:\n- Using the project selector at the top of the GDCH console, select the project you want to uninstall the software package from.\n- On the GDCH Marketplace page, visit the listing page for the product you want to uninstall.\n- Click the Management tab.\n- Click **Uninstall** for the instance you want to uninstall. The software package is uninstalled in a few minutes.", "guide": "Documentation"}