{"title": "Google Kubernetes Engine (GKE) - View GKE logs", "url": "https://cloud.google.com/kubernetes-engine/docs/concepts/kubernetes-engine-overview", "abstract": "# Google Kubernetes Engine (GKE) - View GKE logs\nThis page provides an overview of how to find and use your Google Kubernetes Engine (GKE) logs.\n", "content": "## Accessing your logs\nYou can access your GKE logs in many ways:\n- From the Google Cloud console, you can view logs from the following pages:- **Kubernetes Engine** :- Select a cluster on the **Clusters** page, and then select the **Logs** tab. This tab also offers suggested queries for your cluster logs.\n- Select a workload on the **Workloads** page. You can then click the **Container logs** or **Audit logs** links on the **Overview** tab to view your logs in Logs Explorer, or select the **Logs** tab to view your logs in context.\n- **Logging** : Select **Logs Explorer** , and then use logging filters to select the Kubernetes resources, such as cluster, node, namespace, pod, or container logs. For example queries to help you get started, see [Kubernetes-related queries](/logging/docs/view/query-library-preview#kubernetes-filters) .\n- **Monitoring** : GKE dashboards display metrics and logs for GKE resources like clusters, nodes, and pods. For more information, see [View observability metrics](/kubernetes-engine/docs/how-to/view-observability-metrics) .\n- From the Google Cloud CLI: Query logs from clusters, nodes, pods, and containers by using the [gcloud logging read](/logging/docs/reference/tools/gcloud-logging#reading_log_entries) command.\nFor custom log aggregation, log analytics, or integration with third-party systems, you can also use the logging sinks feature to export logs to BigQuery, Cloud Storage, and Pub/Sub.\n## Understanding your logs\nA log in Cloud Logging is a collection of [logentries](/logging/docs/overview#data_model_for_logs) , and each log entry applies to a certain type of [logging resource](/logging/docs/api/v2/resource-list) .\n### Resource types\nThese are the resource types that are specific to GKE clusters:\n| Resource type    | Display name      |\n|:----------------------------|:-----------------------------------|\n| k8s_cluster     | Kubernetes Cluster logs   |\n| k8s_node     | GKE Node Pool logs     |\n| k8s_pod      | GKE Pod logs      |\n| k8s_container    | GKE Container logs     |\n| k8s_control_plane_component | Kubernetes Control Plane Component |\nWhen GKE writes your cluster's logs, each log entry includes the resource type. Understanding where your logs appear makes it easier to find your logs when you need them.\n### System logs\n**System logs** include logs from the following sources:\n- All Pods running in namespaces `kube-system` , `istio-system` , `knative-serving` , `gke-system` , and `config-management-system` .\n- Key services that are not containerized including `docker` / `containerd` runtime, `kubelet` , `kubelet-monitor` , `node-problem-detector` , and `kube-container-runtime-monitor` .\n- The node's serial ports' output, if the VM instance metadata `serial-port-logging-enable` is set to true. As of GKE 1.16-13-gke.400, [serial port output](/compute/docs/instances/viewing-serial-port-output) for nodes is collected by the Logging agent. To disable serial port output logging, set `--metadata serial-port-logging-enable=false` during cluster creation. Serial port output is useful for troubleshooting crashes, failed boots, startup issues, or shutdown issues with GKE nodes. Disabling these logs might limit troubleshooting.\nSystem logs are captured for the following resource types:\n- cluster logs with `k8s_cluster`\n- node logs with `k8s_node`\n- pod with `k8s_pod`\n- system apps with `k8s_container`\nYour system audit logs will appear in Cloud Logging with the following names:\n- projects/ /logs/cloudaudit.googleapis.com%2Fdata_access – Data Access logs\n- projects/ /logs/cloudaudit.googleapis.com%2Factivity – Admin Activity logs\n- projects/ /logs/events – Events log\nFor detailed information about log entries that apply to the Kubernetes Cluster and GKE Cluster Operations resource types, refer to the [Audit logging](/kubernetes-engine/docs/how-to/audit-logging) documentation.\n[Controlling the collection of your application logs](/stackdriver/docs/solutions/gke/installing#controlling_the_collection_of_application_logs)\n### Application logs\nKubernetes containers collect logs for your workloads written to `STDOUT` and `STDERR` . You can find your workload application logs using the `k8s_container` or `gke_cluster` resource types. Your logs will appear in Logging with the following names:\n- projects/ /logs/stderr – logs written to standard error\n- projects/ /logs/stdout – logs written to standard out\n### Control Plane logs\nIf control plane logs are enabled for your GKE cluster, then logs emitted by certain Kubernetes control plane components (for instance, the API server, Scheduler, and Controller Manager) are exported to Cloud Logging.\nThese logs use the `k8s_control_plane_component` resource type and appear in Cloud Logging with the following names:\n- projects/ /logs/container.googleapis.com%2Fapiserver\n- projects/ /logs/container.googleapis.com%2Fscheduler\n- projects/ /logs/container.googleapis.com%2Fcontroller-manager## Finding your logs in the Logging user interface\nYou can view your logs using the [Logs Explorer](/logging/docs/view/logs-explorer-interface) in the Logging user interface.\n### Logs Explorer\nUsing the Query Builder, you can build a query either by selecting fields from a drop-down or by adding query parameters manually. For example, if you're reviewing logs for GKE clusters, you can start with selecting or searching for the Kubernetes Cluster resource type and then select the location and cluster name. You can then refine your search by selecting the Activity logs in the **Log Name** selector.\nThe Logs Explorer offers an additional way to build your search queries using the **Logs field explorer** . It shows the count of log entries, sorted by decreasing count, for the given log field. Using the **Logs field explorer** is particularly useful for GKE logs because the **Logs field explorer** provides a way to select the Kubernetes values for your resources to build a query. For example, using the **Logs field explorer** , you can select logs for a specific cluster, namespace, pod name, and then container name.\nYou can find more details in the Logging documentation about using the [Logs Explorer](/logging/docs/view/logs-explorer-interface) .\n## Sample queries\nIf you're looking for specific logs, use the following sample queries to help you find your GKE logs:\n- Sample Kubernetes-related log queries- [Logs Explorer](/logging/docs/view/query-library-preview#kubernetes-filters) \n- Sample Kubernetes Engine control plane log queries- [Audit log queries](/kubernetes-engine/docs/how-to/audit-logging#example_filters_for_your_admin_activity_log) \n## Troubleshooting logs\nIf you're writing a high volume of logs from your GKE cluster, you might find that many of those logs consistently don't appear in Cloud Logging. A potential cause is that your logging volume exceeds the supported logging throughput for GKE.\nLogging supports up to 100KB/s per node of logging throughput. If any of the nodes in your GKE cluster require greater logging throughput than this, then we recommend [increasing the logging agent throughput](/kubernetes-engine/docs/how-to/adjust-log-throughput#enable) .", "guide": "Google Kubernetes Engine (GKE)"}