{"title": "Google Kubernetes Engine (GKE) - Use application performance metrics", "url": "https://cloud.google.com/kubernetes-engine/docs/concepts/kubernetes-engine-overview", "abstract": "# Google Kubernetes Engine (GKE) - Use application performance metrics\nYou can configure your workloads on Google Kubernetes Engine (GKE) to send application performance metrics to Cloud Monitoring. You can then use these metrics to detect performance regressions in your application. Google Kubernetes Engine provides visualizations for the following kinds of performance measures for your workloads:\n- Requests: shows the per-second request rate, grouped by operation when available.\n- Errors: shows error rates, grouped by operation and response code.\n- Latency: shows 50th and 95th percentile response latency by operation.\n- CPU and memory: shows the utilization of CPU and memory as a percentage of a requested amount.\nThese metrics correspond to the [golden signals](https://sre.google/sre-book/monitoring-distributed-systems/#xref_monitoring_golden-signals) recommended in the Google [Site Reliability Engineering book](https://sre.google/sre-book/monitoring-distributed-systems/) for monitoring distributed systems.\nYou can also view and explore logs for your workloads.\nBefore you can use application performance metrics, your application must have a way to send the metrics to Cloud Monitoring. For information about recommended approaches, see [Collect application performance metrics](#app-perf-ingest) .\n", "content": "## Collect application performance metrics\nYou can collect application performance metrics for Google Kubernetes Engine by using the following supported integrations:\n- **Anthos Service Mesh** : If you use Anthos Service Mesh, then application performance metrics are collected automatically.\n- **Istio** : If you use [open source Istio](https://istio.io) , then we recommend that you [collect the metrics](/stackdriver/docs/managed-prometheus/exporters/istio) by using Google Cloud Managed Service for Prometheus.\n- **GKE Ingress** : When you configure [GKE Ingress for Application Load Balancers](/kubernetes-engine/docs/concepts/ingress) , performance metrics are automatically collected for the HTTP/S load balancers that route traffic to your GKE Service and Deployment resources behind GKE Ingress.\n- **NGINX Ingress** : If you are using [NGINX Ingress](https://kubernetes.github.io/ingress-nginx/) , then we recommend that you [collect the metrics](/stackdriver/docs/managed-prometheus/exporters/ingress-nginx) by using Google Cloud Managed Service for Prometheus.\n- **Prometheus HTTP and gRPC metrics** : If your application exposes Prometheus HTTP or gRPC metrics, then we recommend that you follow the [HTTP server](/stackdriver/docs/managed-prometheus/exporters/server/http) and [gRPC server](/stackdriver/docs/managed-prometheus/exporters/server/grpc) documents to collect the metrics by using Google Cloud Managed Service for Prometheus.## View application performance metrics\nAfter the performance data is available for analysis, you can [view the metrics](/kubernetes-engine/docs/how-to/view-observability-metrics#app-perf-view) for a Deployment on the application dashboard.", "guide": "Google Kubernetes Engine (GKE)"}