{"title": "Google Kubernetes Engine (GKE) - Troubleshoot upgrades", "url": "https://cloud.google.com/kubernetes-engine/docs/concepts/kubernetes-engine-overview", "abstract": "# Google Kubernetes Engine (GKE) - Troubleshoot upgrades\nThis page shows you how to resolve issues with Google Kubernetes Engine (GKE) cluster upgrades.\n[Cloud Customer Care](/kubernetes-engine/docs/getting-support)\n", "content": "## kube-apiserver unhealthy after control plane upgrade\nThe following issue occurs when you start a manual control plane upgrade of your cluster GKE version. Some user-deployed admission webhooks can block system components from creating permissive RBAC roles that are required to function correctly. During a control plane upgrade, Google Cloud re-creates the Kubernetes API server (kube-apiserver) component. If a webhook blocks the RBAC role for the API server component, the API server won't start and the cluster upgrade won't complete.\nThe error message in the gcloud CLI is similar to the following:\n```\nFAILED: All cluster resources were brought up, but: component \"KubeApiserverReady\" from endpoint \"readyz of kube apiserver is not successful\" is unhealthy.\n```\nTo identify the failing webhook, check your GKE audit logs for RBAC calls with the following information:\n```\nprotoPayload.resourceName=\"RBAC_RULE\"\nprotoPayload.authenticationInfo.principalEmail=\"system:apiserver\"\n```\n`` is the full name of an RBAC role, such as `rbac.authorization.k8s.io/v1/clusterroles/system:controller:horizontal-pod-autoscaler` .\nThe name of the failing webhook is displayed in the log with the following format:\n```\nadmission webhook WEBHOOK_NAME denied the request\n```\nTo resolve this issue, try the following:\n- Adjust your constraints to allow creating and updating ClusterRoles that have the`system:`prefix.\n- Adjust your webhook to not intercept requests for creating and updating system RBAC roles.\n- Disable the webhook.\n### Why does this happen?\nKubernetes [auto-reconciles](https://kubernetes.io/docs/reference/access-authn-authz/rbac/#auto-reconciliation) the default system RBAC roles with the default policies in the latest minor version. The default policies for system roles sometimes change in new Kubernetes versions.\nTo perform this reconciliation, GKE creates or updates the ClusterRoles and ClusterRoleBindings in the cluster. If you have a webhook that intercepts and rejects the create or update requests because of the scope of permissions that the default RBAC policies use, the API server can't function on the new minor version.\n## Workloads evicted after Standard cluster upgrade\nYour workloads might be at risk of eviction after a cluster upgrade if the following are all true:\n- The system workloads require more space when the cluster's control plane is running the new GKE version.\n- Your existing nodes do not have enough resources to run the new system workloads and your existing workloads.\n- Cluster autoscaler is disabled for the cluster.\nTo resolve this issue, try the following steps:\n- [Enable autoscaling for existing node pools](/kubernetes-engine/docs/how-to/cluster-autoscaler#enable_autoscaling) \n- [Enable node auto-provisioning](/kubernetes-engine/docs/how-to/node-auto-provisioning#enable) \n- [Create a new node pool](/kubernetes-engine/docs/how-to/node-pools#add) \n- [Scale up an existing node pool](/kubernetes-engine/docs/how-to/node-pools#resizing_a_node_pool) ## Next steps\n[Cloud Customer Care](/kubernetes-engine/docs/getting-support)", "guide": "Google Kubernetes Engine (GKE)"}