{"title": "Google Kubernetes Engine (GKE) - View observability metrics", "url": "https://cloud.google.com/kubernetes-engine/docs/concepts/kubernetes-engine-overview", "abstract": "# Google Kubernetes Engine (GKE) - View observability metrics\nThis page shows you how to view infrastructure and application health metrics for your Google Kubernetes Engine (GKE) clusters and workloads. These metrics can help [troubleshoot issues](#interpret) with your GKE clusters and workloads.\n", "content": "## Requirements\n- You must have [system metrics](/kubernetes-engine/docs/how-to/configure-metrics#system-metrics) enabled on your clusters to use the overview metrics in the **Observability** tab. System metrics areenabled in Autopilot clusters and are enabledin Standard clusters.\n- You must have [control plane metrics](/kubernetes-engine/docs/how-to/configure-metrics#control-plane-metrics) enabled on your clusters to use the control plane metrics in the **Observability** tab. If you select **Control plane** on the **Observability** tab for your cluster, and the metrics aren't enabled, then you see notification that the metrics aren't enabled. You can enable them by clicking **Enable package** . For information about other ways to enable control plane metrics, see [Configuring collection of control plane metrics](/kubernetes-engine/docs/how-to/configure-metrics#enable-control-plane-metrics) .\n- You must have [kube state metrics](/kubernetes-engine/docs/how-to/configure-metrics#ksm-package) enabled on your clusters to view the workload state metrics and persistent storage metrics in **Observability** tab on the cluster details page. For more information about ingesting metrics from a self-deployed kube state metrics collector, see [Kube State Metrics](/stackdriver/docs/managed-prometheus/exporters/kube_state_metrics) in the Google Cloud Observability documentation.\n- Your application must have a way to send the metrics to Cloud Monitoring to view application performance metrics. For information about recommended approaches, see [Collect application performance metrics](/kubernetes-engine/docs/how-to/app-performance-metrics#app-perf-ingest) .## Observability metrics\nIn the **Observability** tab in the Google Cloud console, you can view performance metrics for clusters and workloads.\nFor Google Kubernetes Engine (GKE) Enterprise edition, charts display all clusters in a fleet.\n### Metrics for clusters and workloads\nThe following metrics are available for both clusters and workloads:\n- **Overview:** Shows summary infrastructure health metrics such as CPU and memory request utilization, error logs, and warning events.\n- **CPU:** Shows CPU and core request utilization.\n- **Memory:** Shows memory request utilization.\nThe following metrics are available for clusters:\n- **Kubernetes Events:** Provides visibility into event counts over time and a detailed log of events.\n- **Control plane:** Provides visibility into the health of Kubernetes control plane components such as the kube-apiserver and scheduler. Also provides information such as the number of unschedulable pods. Pods in the unschedulable state were attempted for scheduling and have been determined to be unschedulable. Pods in this state are a sign that nothing in the cluster has changed that would make them schedulable.\n- **Cloud Ops Ingestion:** Provides visibility into the amount of logging and metrics ingestion which correlate to cost. For more information, see [Google Cloud Observability pricing](/stackdriver/pricing) .\n- **Ephemeral** : (available on the **Observability** tab for a chosen cluster): Provides visibility into ephemeral storage used by a cluster so that you can determine if the cluster's storage is being used efficiently. On the **Observability** tab's **Overview** page, a chart shows the ephemeral storage used by the cluster, and the **Ephemeral** page shows additional metrics, including capacity, throughput, rate of I/O operations, and others. Some of these metrics are not available for Autopilot clusters.\n- **Persistent** : Provides visibility into Persistent Volumes and Persistent Volume Claims.\n- **Workloads state** : Provides visibility into the following resource types: Pod, Deployment, StatefulSet, DaemonSet, and Horizontal Pod Autoscaler.\n- **GPU** (a subset of [GKE systemmetrics](/kubernetes-engine/docs/how-to/configure-metrics#system-metrics) , populated only for [clusters with GPU nodes](/kubernetes-engine/docs/concepts/gpus) ): Provides visibility into utilization of GPU resources, including utilization by GPU model and summaries of the five nodes with the highest and lowest resource utilization.\n### Interpret observability metrics\nMetrics can help you troubleshoot issues. For GKE clusters, examples include:\n- High CPU or memory request utilization trends might indicate that you should configure containers in a cluster or namespace to use fewer resources.\n- High container restart counts might indicate containers are crashing.\n- A high number of unschedulable Pods indicates insufficient resources or configuration errors. For more information, see [Troubleshooting unschedulable Pods](/kubernetes-engine/docs/troubleshooting#PodUnschedulable) .\n- High Cloud Logging or Google Cloud Managed Service for Prometheus ingestion correlates with Google Cloud Observability cost. You might be able to save costs by reducing ingestion. For more information about Google Cloud Managed Service for Prometheus, see [Cost controls and attribution](/stackdriver/docs/managed-prometheus/cost-controls) . For more information about logging, see [Exclusion filters](/logging/docs/routing/overview#exclusions) .\nApplication performance metrics help you to detect performance regressions in your application. Google Kubernetes Engine provides visualizations for the following kinds of performance measures for your workloads:\n- Requests: shows the per-second request rate, grouped by operation when available.\n- Errors: shows error rates, grouped by operation and response code.\n- Latency: shows 50th and 95th percentile response latency by operation.\n- CPU and memory: shows the utilization of CPU and memory as a percentage of a requested amount.\nThese metrics correspond to the [goldensignals](https://sre.google/sre-book/monitoring-distributed-systems/#xref_monitoring_golden-signals) recommended in the Google [Site ReliabilityEngineering book](https://sre.google/sre-book/monitoring-distributed-systems/) for monitoring distributed systems.\n## View cluster and workload observability metrics\nTo view observability metrics for your clusters or workloads, perform the following steps in the Google Cloud console:\n- Go to the **Kubernetes Clusters** or **Kubernetes Workloads** page: [Go to Kubernetes Clusters](https://console.cloud.google.com/kubernetes/list) [Go to Kubernetes Workloads](https://console.cloud.google.com/kubernetes/workload) \n- Select the **Observability** tab.\n- Choose the timeframe over which the metrics are aggregated. Drag inside a chart to focus on a specific time range. Click **Reset Zoom** to go back to the previously selected range.\nTo view observability metrics for a selected cluster or workload, perform the following steps in the Google Cloud console:\n- Go to the **Kubernetes Clusters** or **Kubernetes Workloads** page: [Go to Kubernetes Clusters](https://console.cloud.google.com/kubernetes/list) [Go to Kubernetes Workloads](https://console.cloud.google.com/kubernetes/workload) \n- Click the name of a cluster or workload.\n- Select the **Observability** tab.\n- Choose the timeframe over which the metrics are aggregated. Drag inside a chart to focus on a specific time range. Click **Reset Zoom** to go back to the previously selected range.## View application performance metrics\nTo view the application performance metrics for a Deployment, do the following:\n- In the navigation panel of the Google Cloud console, select **Kubernetes Engine** , and then select **Workloads** : [Go to Kubernetes Workloads](https://console.cloud.google.com/kubernetes/workload/overview) \n- Click a Deployment in the list of workloads. The **Type** column in the list indicates the type of the workload.\n- On the **Deployment details** page, click the **Observability** tab.If application performance metrics are available, the **Application** dashboard is selected by default and displays your metrics. Otherwise, the **Overview** dashboard is selected.\n### Create a customized dashboard to view specific metrics\nBy default, the Observability tab provides predefined dashboards that display relevant metrics. To view only the specific metrics that you want, you can modify the dashboards and create a customized dashboard. You can further edit the customized dashboard as you need.\nTo create a customized dashboard, do the following:\n- Go to the **Kubernetes Clusters** or **Kubernetes Workloads** page: [Go to Kubernetes Clusters](https://console.cloud.google.com/kubernetes/list) [Go to Kubernetes Workloads](https://console.cloud.google.com/kubernetes/workload) \n- Click the name of a cluster or workload.\n- Select the **Observability** tab.\n- To create a customized dashboard, click **Customize dashboard** and modify the dashboard as needed. For example, you can do the following:- To add a widget, click **Add widget** and complete the configuration.\n- For example, to view the logs with your metric data, click **Add widget** , select **Logs** , and then click **Apply** .\n- To remove or modify a widget, use the options in the toolbar of the widget. To reposition or resize a widget, use your pointer.\n- After you finish modifying, click **Save** .\n- In the dialog confirming the changes, click **View customized dashboard** to go to the customized view. You can switch back to the predefined view by selecting **Predefined** from the **Dashboard** drop-down.## View GKE dashboards in Cloud Monitoring\nMonitoring provides additional dashboards for GKE and other Google Cloud services. You can use the provided dashboards or make a copy of a dashboard so that you can customize it to meet your needs.\nThe dashboard list also includes GKE playbooks that you can use to help you troubleshoot common issues.\n- In the navigation panel of the Google Cloud console, select **Monitoring** , and then select **Dashboards** : [Go to Dashboards](https://console.cloud.google.com/monitoring/dashboards) \n- In the Categories list, select **G​C​P** .\n- Select the dashboard or playbook you want to view.- The **GKE** dashboard provides an overview of your clusters, workloads, services, and other resources that you can filter. You can click a resource to view metric and log details. For namespaces, worloads, and Kubernetes services you can also view and create [Service Level Objectives](/stackdriver/docs/solutions/slo-monitoring) (SLOs) from the detail view.\n- Other GKE dashboards and playbooks focus on specific resources or conditions such as workloads at risk.\n## What's next\n- [View cost-related optimization metrics](/kubernetes-engine/docs/how-to/cost-optimization-metrics) .", "guide": "Google Kubernetes Engine (GKE)"}