{"title": "Google Kubernetes Engine (GKE) - Resize a Standard cluster", "url": "https://cloud.google.com/kubernetes-engine/docs/concepts/kubernetes-engine-overview", "abstract": "# Google Kubernetes Engine (GKE) - Resize a Standard cluster\nThis page explains how to manually resize Google Kubernetes Engine (GKE) Standard clusters. You can resize a cluster to increase or decrease the number of nodes in that cluster. Alternatively, you can [autoscale](#autoscale) your cluster, where GKE automatically resizes your node pools in response to changing conditions, such as changes in your workloads and resource usage.\nThese instructions don't apply to GKE [Autopilot](/kubernetes-engine/docs/concepts/autopilot-overview) clusters, which automatically resize based on the number of Pods in the cluster.\nWhen you add or remove nodes in your cluster, GKE adds or removes the associated virtual machine (VM) instances from the underlying Compute Engine [Managed Instance Groups(MIGs)](/compute/docs/instance-groups#managed_instance_groups) provisioned for your node pools. For removing nodes, do not use `kubectl delete node` as this does not delete the Compute Engine VM instance in the node pool's underlying MIG. Use [cluster autoscaler](#autoscale) or manually [decrease the size of yourcluster](#decrease) .\n**Note:** When you increase or decrease the size of a node pool that spans multiple zones, the new size represents the number of nodes in the node pool per zone. For example, if you have a node pool size of two that spans two zones, the total node count is four. If you resize the node pool to a size of four nodes, the total node count becomes eight.\n", "content": "## Before you begin\nBefore you start, make sure you have performed the following tasks:\n- Enable    the Google Kubernetes Engine API.\n- [    Enable Google Kubernetes Engine API   ](https://console.cloud.google.com/flows/enableapi?apiid=container.googleapis.com) \n- If you want to use the Google Cloud CLI for this task, [install](/sdk/docs/install) and then [initialize](/sdk/docs/initializing) the  gcloud CLI. If you previously installed the gcloud CLI, get the latest  version by running`gcloud components update`. **Note:** For existing gcloud CLI  installations, make sure to set the`compute/region`and`compute/zone` [properties](/sdk/docs/properties#setting_properties) . By setting default locations,  you can avoid errors in gcloud CLI like the following:`One of [--zone, --region] must be supplied: Please specify location`.## Increase the size of your cluster\nWhen you increase the size of a cluster, the following changes occur:\n- New node instances are created using the same configuration as the existing instances.\n- New Pods may be scheduled on the new instances.\n- Existing Pods are **not** moved to the new instances.\nTo increase the size of a cluster's node pools, run the [gcloud container clusters resize](/sdk/gcloud/reference/container/clusters/resize) command:\n```\ngcloud container clusters resize CLUSTER_NAME --node-pool POOL_NAME \\\n --num-nodes NUM_NODES\n```\nReplace the following:- ``: the name of the cluster to resize.\n- ``: the name of the node pool to resize.\n- ``: the number of nodes in the pool in a zonal cluster. If you use multi-zonal or regional clusters,``is the number of nodes for each zone the node pools is in.\nRepeat this command for each node pool. If your cluster has only one node pool, omit the `--node-pool` flag.\nTo increase the size of a cluster's node pools, perform the following steps:- Go to the **Google Kubernetes Engine** page in the Google Cloud console. [Go to Google Kubernetes Engine](https://console.cloud.google.com/kubernetes/list) \n- Beside the cluster you want to edit, click **Actions** , then click **Edit** .\n- Click the **Nodes** tab next to the **Details** tab.\n- In the **Node Pools** section, click the name of the node pool that you want to increase in size.\n- Click **Resize** .\n- In the **Number of nodes** field, enter how many nodes that you want in the node pool, and then click **Resize** .\n- Repeat for each node pool as needed.## Decrease the size of your cluster\n**Warning:** Do not use both cluster autoscaler and manual resize commands simultaneously on a node pool, as this can cause interactions that result in unstable or incorrect node pool size.\nWhen you decrease the size of a cluster, the following changes occur:\n- GKE gracefully terminates nodes that are being deleted, using the [drain](https://kubernetes.io/docs/tasks/administer-cluster/safely-drain-node/) process to remove the Pods from the instance. [PodDisruptionBudget](https://kubernetes.io/docs/tasks/run-application/configure-pdb/) and [terminationGracePeriodSeconds](https://kubernetes.io/docs/concepts/workloads/pods/pod/#termination-of-pods) are both respected for up to one hour.\n- Pods managed by a replication controller are rescheduled by the controller to run on the remaining instances.\n- Pods not managed by a replication controller are not restarted.\nThe MIG does not differentiate between instances running Pods and instances without Pods. Resizing down removes instances at random.\nTo learn how to add node pools and to manage existing ones, refer to [Adding and managing node pools](/kubernetes-engine/docs/how-to/node-pools) .\nTo decrease the size of a cluster's node pools, run the [gcloud container clusters resize](/sdk/gcloud/reference/container/clusters/resize) command:\n```\ngcloud container clusters resize CLUSTER_NAME --node-pool POOL_NAME \\\n --num-nodes NUM_NODES\n```\nReplace the following:- ``: the name of the cluster to resize.\n- ``: the name of the node pool to resize.\n- ``: the number of nodes in the pool in a zonal cluster. If you use multi-zonal or regional clusters,``is the number of nodes for each zone the node pools is in.\nRepeat this command for each node pool. If your cluster has only one node pool, omit the `--node-pool` flag.\nTo decrease the size of a cluster's node pools, perform the following steps:- Go to the **Google Kubernetes Engine** page in the Google Cloud console. [Go to Google Kubernetes Engine](https://console.cloud.google.com/kubernetes/list) \n- Beside the cluster you want to edit, click **Actions** , then click **Edit** .\n- Click the **Nodes** tab next to the **Details** tab.\n- In the **Node Pools** section, click the name of the node pool that you want to decrease in size.\n- Click **Resize** .\n- In the **Number of nodes** field, enter how many nodes that you want in the node pool, and then click **Resize** .\n- Repeat for each node pool as needed.## Autoscaling a cluster\nGKE's [cluster autoscaler](/kubernetes-engine/docs/concepts/cluster-autoscaler) feature automatically resizes your node pools in response to changing conditions, such as changes in your workloads and resource usage.\nTo learn more about how autoscaling works, refer to the [cluster autoscaler](/kubernetes-engine/docs/concepts/cluster-autoscaler) documentation. To set up autoscaling for your cluster, see [Autoscaling a cluster](/kubernetes-engine/docs/how-to/cluster-autoscaler) .\n## What's next\n- [Learn more about clusters](/kubernetes-engine/docs/concepts/cluster-architecture) .", "guide": "Google Kubernetes Engine (GKE)"}