{"title": "Google Kubernetes Engine (GKE) - Observability for GKE", "url": "https://cloud.google.com/kubernetes-engine/docs/concepts/kubernetes-engine-overview", "abstract": "# Google Kubernetes Engine (GKE) - Observability for GKE\nThis page describes how you can understand the health of your applications and maintain application availability and reliability.\nWhen you create a GKE cluster, Cloud Logging, Cloud Monitoring and [Google Cloud Managed Service for Prometheus](/stackdriver/docs/managed-prometheus) are enabled by default and provide observability specifically tailored for Kubernetes.\n- Use the built-in dashboards to view default metrics and logs, and to set up recommended alerts.\n- Enable additional observability packages to monitor Kubernetes components and objects and use collected data for debugging and troubleshooting.\n- Configure data collection for third-party applications running on your clusters.\n- Define your own metrics, dashboards, and alerts to meet your needs.\nIn addition to the integration with Cloud Logging and Cloud Monitoring, GKE also provides other features to help you observe and maintain the health of your applications.\n", "content": "## Default observability features\nBy default, GKE clusters are configured to do the following:\n- Send [system logs, audit logs, and application logs](/stackdriver/docs/solutions/gke/managing-logs#what_logs) to Cloud Logging.\n- Send [system metrics](/stackdriver/docs/solutions/gke/managing-metrics#system-metrics) to Cloud Monitoring.\n- Use [Google Cloud Managed Service for Prometheus](/stackdriver/docs/managed-prometheus) to collect configured third-party and user-defined metrics and then send them to Cloud Monitoring. Google Cloud Managed Service for Prometheus lets you monitor and alert on your workloads using Prometheus, without manually managing and operating Prometheus at scale.## Customize and enhance data collection\nYou can control which logs and which metrics, if any, are sent from your GKE cluster to Cloud Logging and Cloud Monitoring.\nYou can also control whether to enable [Google Cloud Managed Service for Prometheus](/stackdriver/docs/managed-prometheus) . See [Configuring logging and monitoring for GKE](/stackdriver/docs/solutions/gke/installing) for configuration instructions.\nFor GKE Autopilot clusters, you cannot disable the Cloud Monitoring and Cloud Logging integration.\n### Additional observability metrics\nYou can collect additional observability metrics by enabling one or more [observability metrics packages](/stackdriver/docs/solutions/gke/managing-metrics) :\n- [Control plane metrics](/stackdriver/docs/solutions/gke/control-plane-metrics) : Monitor the health of Kubernetes components by collecting metrics for the Kubernetes API server, Scheduler, and Controller Manager. These metrics are useful signals of service health for defining service level objectives (SLOs).\n- [Kube state metrics](/stackdriver/docs/solutions/gke/kube-state-metrics) : Monitor the health of Kubernetes objects such as Deployments, Nodes, and Pods.\nIf you have enabled GKE Enterprise in your project, these metrics are [enabled by default](/kubernetes-engine/docs/how-to/config-logging-monitoring#default-logs-metrics) when you [register to a fleet](/anthos/fleet-management/docs/register/gke#register_your_cluster) during cluster creation.\n### Third-party and user-defined metrics\nTo monitor third-party applications running on your clusters such as Postgres, MongoDB, and Redis, use [Prometheus exporters](/stackdriver/docs/managed-prometheus/exporters/introduction) with Google Cloud Managed Service for Prometheus.\nYou can also [write custom exporters](https://prometheus.io/docs/instrumenting/writing_exporters/) to monitor other signals of health and performance.\n## Use collected data\nUse the data you collect to analyze application health, debug, troubleshoot, and test as you develop, deploy, and maintain your applications.\nGKE provides built-in observability features to get you started quickly:\n- View collected data for your clusters and workloads on in GKE [observability dashboards](/kubernetes-engine/docs/how-to/view-observability-metrics) . You can customize the provided dashboards for the following purposes:- View key cluster metrics, such as CPU utilization, memory utilization, and the number of open incidents.\n- View clusters by their infrastructure, workloads, or Services.\n- Inspect namespaces, Nodes, workloads, Services, Pods, and containers.\n- For Pods and containers, view metrics as a function of time and view log entries.\nYou can also [create your own dashboards](/monitoring/charts/dashboards) or [import Grafana dashboards](/monitoring/dashboards/import-grafana-dashboards) to meet your needs. **Note:** The provided GKE dashboards only display information for GKE clusters running on Google Cloud. They don't display information for GKE clusters running anywhere else, for example using on-premises or bare-metal servers.\n- From the **Observability** tab, you can create recommended alert policies so that you are notified about issues. To learn more about alerting, see the [Alerting overview](/monitoring/alerts) .\n- [Create SLOs](/stackdriver/docs/solutions/slo-monitoring/ui/create-slo) to monitor your service performance goals using collected GKE metrics.\n- Use GKE playbooks to troubleshoot common issues such as [unschedulable Pods](/kubernetes-engine/docs/troubleshooting#PodUnschedulable) and [containers that repeatedly crash after restart](/kubernetes-engine/docs/troubleshooting#CrashLoopBackOff) .\n- Explore and analyze your data with tools such as [Logs Explorer](/logging/docs/view/logs-explorer-interface) , [Metrics Explorer](/monitoring/charts/metrics-explorer) and [Error Reporting](/error-reporting/docs/grouping-errors) .\n- Review GKE [audit logs](/kubernetes-engine/docs/how-to/audit-logging) that record administrative activities and accesses as part of [Cloud Audit Logs](/logging/docs/audit) . [Audit log policy](/kubernetes-engine/docs/concepts/audit-policy) determines which events are recorded and whether a log entry belongs to an Admin Activity log or a Data Access log.## Other features\nGKE integrates with other Google Cloud services to help you monitor and manage your clusters and workloads.\n- Use the [security posture dashboard](/kubernetes-engine/docs/concepts/about-security-posture-dashboard) to identify security concerns based on our standards and industry best practices.\n- View [insights and recommendations](/kubernetes-engine/docs/how-to/optimize-with-recommenders) to optimize your clusters.\n- Use [network policy logging](/kubernetes-engine/docs/how-to/network-policy-logging) to help you troubleshoot issues with Kubernetes network policies. If you use [GKE Dataplane V2](/kubernetes-engine/docs/concepts/dataplane-v2) , then network policy logging is built-in.## Pricing\nPricing for integration with Cloud Logging (including Cloud Audit Logs), Cloud Monitoring, and Google Cloud Managed Service for Prometheus is based on the amount of logs and metrics collected. See the [Pricing](/stackdriver/pricing) page for details.\nFeatures provided by other Google Cloud services listed in [Other features](#other-features) have separate pricing. See the Pricing section of those documentation pages for more information.\n## What's next\n- [Configure logging and monitoring](/stackdriver/docs/solutions/gke/installing) in new and existing clusters.\n- [Observe your clusters](/kubernetes-engine/docs/how-to/view-observability-metrics) . Learn how to view dashboards, organize cluster information, and view alerting details.\n- [Enable verbose, OS-level audit logging](/kubernetes-engine/docs/how-to/linux-auditd-logging) on GKE cluster nodes and how to export logs to Cloud Logging.", "guide": "Google Kubernetes Engine (GKE)"}