{"title": "Integration Connectors - Integration Connectors overview", "url": "https://cloud.google.com/apigee/docs/api-platform/get-started/what-apigee", "abstract": "# Integration Connectors - Integration Connectors overview\n# Integration Connectors overview\nIntegration Connectors let you connect to various data sources from your integrations. With connectors, both Google Cloud services and other business applications are exposed to your integrations through a transparent, standard interface. As an integration developer, you can quickly connect to a growing pool of applications and systems .\n**Note:** Both [Application Integration](/application-integration/docs/overview) and [Apigee Integrations](/apigee/docs/api-platform/integration/what-is-apigee-integration) support Integration Connectors.\n", "content": "## Key benefits\nWith Integration Connectors, you can quickly and easily implement key configurations for each connected service or application:\n- **Authentication** : Each Connector offers one or more supported authentication methods that can be configured for the target application.\n- **Endpoint Configuration:** Each Connector is custom configured to connect to one instance of an application or technology via URL, tenant ID, or other identification mechanism specific to the connector type.\n- **Protocol Mediation: ** Each Connector translates the native communication protocol of the target application, such as Java Database Connectivity (JDBC), into a standard communication protocol, like REST.\n- **Data format mediation: ** Each Connector translates the native data format of the target application to a standardized data format. The Connector then loads the schema for targeted data into your integration, making the data available for use by integration tasks.\n- **Data discovery: ** Each Connector inspects the target application and provides a list of data objects and operations available for use in an integration.\n- **Event subscription: ** You can configure [event listeners for the connectors](None) , and use the events to trigger your integrations.## Simplified integration development\nAs an integration developer, you can use the Google Cloud console to:\n- Create and configure a connection once and use the connection in any future integrations.\n- Discover a wide array of available target application interfaces.\n- Interact with data from multiple disparate sources and formats in a standardized and streamlined manner.\n- <li>[FUTURE PLACEHOLDER] Trigger Integration Flows based on events that happen in the source application.</li>## What's next\n- To get started with Integration Connectors, see [Set up Integration Connectors](/integration-connectors/docs/setup-integration-connectors) .\n- To view the list of all the available connectors, see [All Integration Connectors](/integration-connectors/docs/all-integration-connectors) .\n- Try [Perform CRUD operations on a MySQL database](/integration-connectors/docs/perform-crud-operation-mysql-database) .\n- Discuss Integration Connectors with the community on [Cloud Forums](https://www.googlecloudcommunity.com/gc/Integration-Services/bd-p/cloud-integration-services) .", "guide": "Integration Connectors"}