{"title": "Cloud Deploy - Viewing release details", "url": "https://cloud.google.com/deploy/docs/view-release", "abstract": "# Cloud Deploy - Viewing release details\nThis document describes the information that you can find on the Cloud Deploy **Release details** page in Google Cloud console, including the following:\n- Metadata and other information about the release:\n- [Rollouts](#viewing_rollouts) You can view a list of rollouts for this release, and click a rollout to [view rollout details](#viewing_rollouts) .\n- [Release artifacts](#viewing_release_artifacts) - The rendering source, which was archived when the release was first created.\n- The names of all build artifacts, such as the container image that was deployed.\n- Rendered artifacts, including the rendered`manifest.yaml`and the rendered`skaffold.yaml`that was used for this release.You can also [view a diff](#viewing_diffs) of different versions of the rendered manifests and `skaffold.yaml` files.\n", "content": "## View rollouts\n- From the **Release details** page, select the **Rollouts** tab.\n- Click the name of the rollout that you want to view.The rollout details are displayed over the page. These details include links to render logs, deployment logs, and target artifacts ( `manifest.yaml` and `skaffold.yaml` ).The Rollout page is displayed. The **Summary** shows rollout metadata and status.The **Phases** tab shows the [phases](/deploy/docs/terminology#phase) and [jobs](/deploy/docs/terminology#job) in the rollout. From here you can [perform actions on the rollout](/deploy/docs/deployment-strategies/manage-rollout) , such as advance phases, terminate job runs, and more.\n**Note:** you can also view rollouts by selecting the **Rollouts** tab on the **Delivery pipeline details** page and clicking on a rollout listed in the table.\n## View release artifacts\nThe **Release details** page includes an **Artifacts** tab, listing build artifacts, target artifacts (manifests and Skaffold configs), and the rendering source for those target artifacts.\nFrom this page, you can do the following:\n- Download the rendering source archive file.\n- Click through to see the render logs for the target artifacts.\n- View the rendered target artifacts themselves.\n### View rendered manifests and diffs, with release inspector\nIn Google Cloud console, you can compare different versions of some of your release artifacts. You can view a diff of the following types of artifacts:\n- Rendered manifests\n- Rendered`skaffold.yaml`configuration filesTo view a diff:\n- In the Google Cloud console, navigate to the Cloud Deploy **Delivery pipelines** page to view your delivery pipelines. [Open the Delivery pipelines page](https://console.cloud.google.com/deploy/delivery-pipelines) \n- Click the delivery pipeline that's managing the release you want to inspect.\n- On the **Delivery pipeline details** page, make sure the **Releases** tab is selected, and click the name of the release you want to inspect.\n- On the **Release details** page, click the **Artifacts** tab.\n- In the **Target artifacts** list, click the **View artifacts** link for the artifact that you want to inspect.\n- Select the **Manifest** tab or the **Skaffold config** tab.\n- Click **Show diff** .The release inspector shows the same version of the artifact on both sides.\n- For each artifact shown, choose the release name, target name, phase name, or all, if necessary.This way you can choose which version of the artifact to compare on each side, by release and by target. For example, you can choose the same release for each, and compare the manifest for that release but for different targets.\nThe differences between the selected artifacts are highlighted.\n### View rendered artifacts in the Cloud Storage bucket\nThe Cloud Storage bucket that stores your rendered release artifacts is shown on, and linked from, the **Artifacts** tab on the release details page:- On the release details page, select the **Artifacts** tab.\n- In the **Target artifacts** table, find the target whose artifacts you want to view, and click the corresponding link in the **Storage location** column.The Cloud Storage bucket details are shown, for the specific target. The bucket contains rendered artifacts for each phase of the rollout:\n- Click on the phase whose rendered artifacts you want to view,The available artifacts for that phase are listed:\n- Click on the artifact you want to view to see its contents.", "guide": "Cloud Deploy"}