{"title": "Cloud Deploy - Secure deployments using Binary Authorization", "url": "https://cloud.google.com/deploy/docs/securing/binary-authorization", "abstract": "# Cloud Deploy - Secure deployments using Binary Authorization\n[Binary Authorization](/binary-authorization) is a Google Cloud service that provides software supply-chain security by enforcing a set of rules ( [policy](/binary-authorization/docs/overview#policy_model) ) on containers deployed on a Google Cloud [supported container-based platform](/binary-authorization/docs/overview#supported_platforms) . The service allows or blocks deployment of these containers based on that set of rules.\nAlso, Binary Authorization provides [continuous validation](/binary-authorization/docs/overview-cv#overview) to ensure that each deployed container continues to conform with policy.\nThere is no direct integration between Cloud Deploy and Binary Authorization, but you can use them together to help secure your software delivery process.\n", "content": "## What Binary Authorization can do for your deployable images\nAt deploy time, Binary Authorization can use [attestations](/binary-authorization/docs/key-concepts#attestations) to determine that a process was completed earlier. Here are some examples of what you can use Binary Authorization for:\n- Verify that a container image was built by a specific build system or continuous integration pipeline.\n- Validate that a container image complies with vulnerability signing policy.\n- Verify that a container image passes criteria for promotion to the next target.## What's next\n- Learn more about how to use [Binary Authorization](/binary-authorization/docs) to help ensure the integrity of your container images.\n- [Try a tutorial](/binary-authorization/docs/getting-started-cli) , for GKE, to configure and test a Binary Authorization policy that requires attestations.\n- Learn about the [deployment lifecycle](/binary-authorization/docs/overview#lifecycle) , in the context of Binary Authorization.", "guide": "Cloud Deploy"}