{"title": "Cloud Deploy - Promote your release and manage approvals", "url": "https://cloud.google.com/deploy/docs/promote-release", "abstract": "# Cloud Deploy - Promote your release and manage approvals\nThis page describes how to promote an existing Cloud Deploy release to the next target in a delivery pipeline [progression](/deploy/docs/terminology#progression) .\n", "content": "## Before you begin\nThis page assumes you have already [created a release](/deploy/docs/deploying-application#invoke_your_delivery_pipeline_to_create_a_release) .\n## Promote the release\nWhen your release is deployed into a target defined in your delivery pipeline, you can promote it to the next target:\n```\ngcloud deploy releases promote --release=RELEASE_NAME \\                               --delivery-pipeline=PIPELINE_NAME \\                               --region=REGION\n```\nWhere:\n`` is the name of the release you're promoting.\n`` is the name of the delivery pipeline you're using to manage deployment of this release.\n`` is the name of the region in which the release was created, for example `us-central1` . This is required.\nSee the Google Cloud SDK reference for more information about the [gcloud deploy releases promote command](/sdk/gcloud/reference/deploy/releases/promote) .\n **Note:** you can also include `--to-target=` `` to specify a destination target. If you omit `--to-target` , the release is promoted to the next target in the promotion sequence.- [Open the Deliverypipelines page](https://console.cloud.google.com/deploy/delivery-pipelines) .\n- Click your pipeline shown in the list of delivery pipelines.The Delivery pipeline details page shows a graphical representation of your delivery pipeline's progress.\n- On the first target in the delivery pipeline visualization, click **Promote** .The **Promote release** dialog is shown. It shows the details of the target you're promoting to.\n- Click **Promote** .\nIf the delivery pipeline or target has changed since the release was created, Cloud Deploy returns a message indicating a possible [mismatch](/deploy/docs/pipeline-instances#when_does_this_matter) , and prompts you to confirm the promotion. You can respond `n` to the prompt and examine the differences between the pipeline versions before you proceed. If you choose to promote anyway, the release is deployed according to the delivery pipeline as it was defined when the release was created. See [Pipeline instances per release](/deploy/docs/pipeline-instances) for more information about pipeline mismatches.\nCloud Deploy creates a `rollout` for the release into the destination target, and the release is queued for deployment. When it's deployed, the delivery pipeline visualization shows that fact:\n## Manage approvals for a delivery pipeline\nYou can require approval for any target, and you can approve or reject releases into that target.\nApprovals can be managed programmatically by integrating your workflow management system (such as ServiceNow), or other system, with Cloud Deploy using Pub/Sub and the Cloud Deploy API.\n### Require approval\nTo require approval on any target, set `requireApproval` to `true` in the target configuration:\n```\n     apiVersion: deploy.cloud.google.com/v1     kind: Target     metadata:      name:     description:     requireApproval: true\n```\nSee [Delivery pipeline configuration](/deploy/docs/config-files#requireapproval) for further details.\nWhen a rollout is pending approval, users or systems that subscribe to the `clouddeploy-approvals` Pub/Sub topic receive notification and can then approve or reject the rollout.\nWhen using [parallel deployment](/deploy/docs/parallel) , you can configure the multi-target to [require approval](/deploy/docs/parallel#approvals_for_parallel_deployment) . If promotion to the target is rejected, the controller rollout fails, with a state of `APPROVAL_REJECTED` , and the child rollouts are not created.\n### Approve or reject a rollout\nEach target can [require approval](/deploy/docs/promote-release#require_approval) before any release is deployed to it. When you promote to a target that requires approval, Cloud Deploy publishes a Pub/Sub message to the `clouddeploy-approvals` topic.\nAny user or service account with the role `roles/clouddeploy.approver` can approve a Cloud Deploy rollout to a target that requires approval.\nYour integrated workflow management system, having received an approval-required notification using [service notifications](/deploy/docs/subscribe-deploy-notifications) , can approve or reject the rollout using the Cloud Deploy API.- In the Google Cloud console, navigate to the Cloud Deploy **Delivery pipelines** page to view of list of your available delivery pipelines. [Open the Delivery pipelines page](https://console.cloud.google.com/deploy/delivery-pipelines) The list of delivery pipelines is shown in Google Cloud console. Delivery pipelines that have been configured but not [registered](/deploy/docs/deploying-application#defining_your_delivery_pipeline) with the Cloud Deployservice are not shown.\n- Click the name of the delivery pipeline.The pipeline visualization is shown. If approval is pending, and if you have the `roles/clouddeploy.approver` role, or equivalent permissions, the visualization includes a **Review** link.\n- Click **Review** .A list is shown of rollouts pending approval.\n- Click **Review** .The Approve rollout screen is shown.The **Manifest diff** tab shows any changes to the rendered manifest from the currently deployed version (if any) to the one you're now approving (or rejecting).\n- Click **Approve** or **Reject** .If you approve, your application is deployed into the target. If you reject, the application is not deployed, and can't be approved later unless re-promoted.\nA user with the `roles/clouddeploy.approver` role can manually approve or reject a rollout. To approve:\n```\ngcloud deploy rollouts approve rollout-name --delivery-pipeline=pipeline-name \\                                                                   --region=region \\                                                                   --release=release-name\n```\nTo reject:\n```\ngcloud deploy rollouts reject rollout-name --delivery-pipeline=pipeline-name \\                                                                  --region=region \\                                                                  --release=release-name\n```", "guide": "Cloud Deploy"}