{"title": "Cloud Deploy - Viewing metrics in Cloud Deploy", "url": "https://cloud.google.com/deploy/docs/metrics", "abstract": "# Cloud Deploy - Viewing metrics in Cloud Deploy\nCloud Deploy shows metrics for how many deployments occur for a given delivery pipeline, over time, and how many of those deployments succeed.\n", "content": "## About Cloud Deploy metrics\nAll deployment metrics in Cloud Deploy have the following characteristics:\n- All metrics are measured per delivery pipeline.\n- All metrics are for deployments to your target.The final target in your delivery pipeline [progression](/deploy/docs/terminology#progression) is considered to be the production target.\n- All metrics are measured for a rolling 30-day period.For example, the Deployments metric counts the number of successful and failed deployments over the last 30 days.\n- Metrics consider deployments, and some also report failed deployments.A successful deployment is one for which the pod or pods report a ready state. The Deployment failure rate metric counts failures as a percentage of all deployment attempts.\nCloud Deploy makes the following deployment metrics available in Google Cloud console:\n- [Deployments](#the_deployments_metric) \n- [Deployment frequency](#the_deployment_frequency_metric) \n- [Deployment failure rate](#the_deployment_failure_rate_metric) ## The Deployments metric\nThe metric shows the number of successful and failed deployments from the selected delivery pipeline to your production cluster.\n## The Deployment frequency metric\nThe metric shows how often the delivery pipeline successfully deploys to the production target per day. This is one of the four key metrics defined by the [DevOps Research and Assessment](https://dora.dev/) (DORA) research program.### How Deployment frequency is calculated\nDeployment frequency is calculated based on the number of deployment , not the number of deployments. That is, if the delivery pipeline generates four deployments to production on a given day, that's counted as one deployment day.\nThis metric is expressed per day, per week, or per month, depending on how many deployments there are:\n- If the median number of deployment days per week is greater than or equal to 3, then the frequency is expressed as daily:\".8 times per day.\"\n- Otherwise, if more than 2 weeks have more than 0 deployment days then it's expressed as weekly:\"2 days per week.\"\n- Otherwise, if there's at least one deployment day per month, then it's expressed as monthly:\"2 days per month.\"## The Deployment failure rate metric\nThe metric shows the percentage of deployments that have failed.", "guide": "Cloud Deploy"}