{"title": "Cloud Deploy - Manage Skaffold versions", "url": "https://cloud.google.com/deploy/docs/using-skaffold/select-skaffold", "abstract": "# Cloud Deploy - Manage Skaffold versions\nCloud Deploy uses [Skaffold](/skaffold) , through Cloud Build, to deploy your application by rendering and deploying manifests.\nThe page describes how Cloud Deploy selects what version of Skaffold to use. This page also includes information about the following:\n- [How often the Skaffold version changes](#how_selects_new_versions) \n- [How to find out the current version](#find_out_the_skaffold_version_associated_with_a_release) \n- [How long each version is supported](#skaffold_version_deprecation_and_maintenance_policy) ", "content": "## What version of Skaffold does Cloud Deploy use?\nCloud Deploy performs its operations using a custom image, which includes a Skaffold LTS version. Each supported version of Skaffold is listed in the [table](#supported_versions) in this document, linked to the repository of all Cloud Deploy images. The version number of each Cloud Deploy image corresponds to the Skaffold version number.\nBefore August 30, 2022, Cloud Deploy used the LTS version of the most recent [publicly available Skaffold images](https://console.cloud.google.com/gcr/images/k8s-skaffold/GLOBAL/skaffold?gcrImageListsize=30) .\n**Note:** the Skaffold version associated with a release is used for the entire lifecycle of that release, and cannot be changed during that lifetime. The release lifecycle consists of all render, deploy, and verify operations on that release. This includes up to deployment into the final target in the progression, and beyond (rollbacks or redeployments).\n### Supported versions\n| Skaffold version  | Max schema version | As-of date  | Default? |\n|:-----------------------|:---------------------|:-----------------|:-----------|\n| 2.10.x (release notes) | v4beta9    | February 2, 2024 | ✓   |\n| 2.8.x (release notes) | v4beta7    | October 27, 2023 | nan  |\n| 2.6.x (release notes) | v4beta6    | July 6, 2023  | nan  |\n| 2.3.x (release notes) | v4beta4    | April 24, 2023 | nan  |\n| 2.0.x (release notes) | v4beta1    | January 9, 2023 | nan  |\nEach version in this table links to a repository in Artifact Registry. In that repository, look for the most recent date for the latest version or for the version you want. The repository linked is in the `us-central1` region, but these images are available in each region where Cloud Deploy is available. The image that gets used is in the region where the delivery pipeline was created.\nCloud Deploy uses the latest patch release for each supported Skaffold version. We announce support for new versions, including specific Skaffold version patches, in the [release notes](/deploy/docs/release-notes) .\n### Preview version\nYou can use the [Cloud Deploy Preview image](https://console.cloud.google.com/artifacts/docker/cd-image-prod/us-central1/cd-image/cd?project=cd-image-prod) , which includes preview features.\nThe Skaffold version in the preview image can be updated at any time, and doesn't follow a regular release schedule. We recommend you not use the preview version for production workloads.\nThe preview version is in the same repository as the supported versions. Look for images with a tag that begins with `skaffold_preview` .\nSome preview features require the Cloud Deploy preview image. For these features, Cloud Deploy uses that preview version without you having to do anything. If you try to select a different Skaffold version when you create a release using a preview feature, the command fails.\n### Find out the Skaffold version associated with a release\nYou can find the version Cloud Deploy is using at any given time by running the following command:\n```\ngcloud deploy releases describe RELEASE \\       --delivery-pipeline=DELIVERY_PIPELINE \\       --region=REGION\n```\nThe version is shown in the `skaffoldVersion` attribute in the output.\n### Choose what version of Skaffold to use\nYou can use any [supported](#supported_versions) version of Skaffold. To select the version that you want to use, include the [--skaffold-version](https://cloud.google.com/sdk/gcloud/reference/deploy/releases/create#--skaffold-version) flag on the `gcloud deploy releases create` command:\n```\ngcloud deploy releases create RELEASE_NAME \\       --delivery-pipeline=PIPELINE_NAME \\       --skaffold-version=SKAFFOLD_VERSION \\       --region=REGION\n```\nWhere ' ' is the (supported) version of Skaffold to use for this release. The version should be in the form of `n.nn` for a numbered version, or `skaffold_preview` to use the [preview version](#preview_version) .\nFor example, the following command selects Skaffold version `2.8` :\n```\ngcloud deploy releases create release-001 \\                              --delivery-pipeline=my-pipeline \\                              --skaffold-version=2.8 \\                              --region=us-central1\n```\nAnd this command selects the Skaffold [preview version](#preview_version) :\n```\ngcloud deploy releases create release-001 \\                       --delivery-pipeline=my-pipeline \\                       --skaffold-version=skaffold_preview \\                       --region=us-central1\n```\n## How Cloud Deploy selects new versions\nA new version of Skaffold is selected every 90 days. At the end of that 90-day cycle, Google Cloud adds support for a new Skaffold version. You can now use that version with Cloud Deploy. It becomes the default version used to create and manage all releases for the next 90-day cycle.\nCloud Deploy [release notes](/deploy/docs/release-notes) are updated to announce each newly supported release.\n## Skaffold version deprecation and maintenance policy\nSkaffold versions are supported for 12 months, with a 60-day maintenance period. This maintenance period means that releases tied to a version are still supported for 60 days after support for that version has expired. You can still create rollouts from those releases, but you can't create using a Skaffold version that's in the maintenance period.\nAfter the 60-day maintenance period, the Skaffold version is no longer supported. You can no longer create rollouts from a release that uses the unsupported version. However, all data associated with the release remains.\n| Skaffold version  | As-of date  | Maintenance start | Expiration  |\n|:-----------------------|:-----------------|:--------------------|:------------------|\n| 2.10.x (release notes) | February 2, 2024 | February 2, 2025 | April 3, 2025  |\n| 2.8.x (release notes) | October 26, 2023 | October 26, 2024 | December 25, 2024 |\n| 2.6.x (release notes) | July 6, 2023  | July 6, 2024  | September 4, 2024 |\n| 2.3.x (release notes) | April 24, 2023 | May 1, 2024   | July 1, 2024  |\n| 2.0.x (release notes) | January 9, 2023 | January 9, 2024  | March 10, 2024 |\n## What's next\n- Read more about [integrating Cloud Deploy with other systems](/deploy/docs/integrating) .\n- [Find out more](/deploy/docs/set-up-skaffold) about how Skaffold works with Cloud Deploy and how to make it work well for you.\n- The document [Managing manifests in Cloud Deploy](/deploy/docs/using-skaffold/managing-manifests) describes more about how you can use Skaffold, including with other, third-party manifest-management tools.", "guide": "Cloud Deploy"}