{"title": "Cloud Deploy - Roll back a target", "url": "https://cloud.google.com/deploy/docs/roll-back", "abstract": "# Cloud Deploy - Roll back a target\nThis page describes how to roll back a Cloud Deploy target to an earlier release.\nWhen you roll back a target, Cloud Deploy creates a new `rollout` resource based on a previous release.\n", "content": "## Roll back a target to an earlier release\nBy default, the rollback uses the last release with a successful rollout to the indicated target, but you can choose a different one, using `--release` .\nTo roll back, run the following command from the directory containing your delivery pipeline:\n```\ngcloud deploy targets rollback TARGET_NAME \\   --delivery-pipeline=PIPELINE_NAME \\   --release=RELEASE_NAME \\   --rollout-id=ROLLOUT_ID\n```\nIn this command, `--release` and `--rollout-id` are optional. Use `--release` to identify a specific release to roll back to. If you omit this option, then Cloud Deploy uses the last known good release to the specified target.\nUse `--rollout-id` to assign an identifier to the generated `rollout` . If you omit this, Cloud Deploy generates an ID for the generated `rollout` .- [Open the Deliverypipelines page](https://console.cloud.google.com/deploy/delivery-pipelines) .\n- Click your pipeline shown in the list of delivery pipelines.The Delivery pipeline details page shows a graphical representation of the progress of your delivery pipeline.\n- Click the more menu and select **Roll back release** .The rollback form is displayed:\n- Select the release from the **Release** field.This release is the one which you're rolling back to. The **Rollout name** is populated based on the selected release.\n- If you want, you can change the rollout name and rollout description from the default.\n- Click **Roll back** .A new rollout is created from the chosen release, and deployed into the same target.\n### Roll back even further\nYou can roll back to an earlier release than the last successfully deployed one.\nSimply run `gcloud deploy releases promote` with the earlier release and include the `--to-target` option set to the target in which you want to roll back your release.", "guide": "Cloud Deploy"}