{"title": "Cloud Deploy - Use customer-managed encryption keys", "url": "https://cloud.google.com/deploy/docs/securing/cmek", "abstract": "# Cloud Deploy - Use customer-managed encryption keys\nCloud Deploy, along with its dependent services, lets you manage your own encryption keys for storage and transit of any user data.\n", "content": "## Cloud Deploy data\nCloud Deploy stores resource data encrypted. This storage does not include any user data.\nCloud Deploy dependent services can use customer-managed encryption keys. The sections that follow address the practices of each dependent service.\n## Cloud Build\nRender and deploy operations are performed through Cloud Build, which is CMEK compliant. For more information on configuring Cloud Build to be CMEK compliant, see the [Cloud Build documentation](https://cloud.google.com/build/docs/securing-builds/cmek) .\nRendering source and rendered manifests are stored in [Cloud Storagebuckets](#gcs) . Cloud Build stores its logs using [Cloud Logging](#logging) , and Cloud Deploy explicitly turns off Cloud Storage logging for use with Cloud Deploy.\n## Cloud Storage\nTo use CMEK with Cloud Deploy, you need to use custom Cloud Storage buckets and [configure those buckets for CMEK](/storage/docs/encryption/customer-managed-keys) .\nTo specify your custom, CMEK-managed Cloud Storage buckets for use with Cloud Deploy:\n- Include the [--gcs-source-staging-dir](https://cloud.google.com/sdk/gcloud/reference/deploy/releases/create#--gcs-source-staging-dir) flag on the `gcloud deploy releases create` command.This flag identifies the Cloud Storage bucket in which to store the rendering source files.\n- [Change the storage location](/deploy/docs/execution-environment#changing_the_storage_location) in your Cloud Deploy execution environment.This setting identifies the Cloud Storage bucket in which to store your rendered manifests.## Pub/Sub topics\nCloud Deploy [uses Pub/Sub to publish notificationsto topics](/deploy/docs/subscribe-deploy-notifications) . You can [configure these topics to use customer-managed encryption keys](/pubsub/docs/encryption#using-cmek) .\n## Logging\nCloud Deploy and its dependent services publish logs to Cloud Logging, part of Google Cloud Observability.\nYou can [configure Logging for CMEK](/logging/docs/routing/managed-encryption-storage) .", "guide": "Cloud Deploy"}