{"title": "Colab Enterprise - Idle shutdown", "url": "https://cloud.google.com/colab/docs/idle-shutdown?hl=zh-cn", "abstract": "# Colab Enterprise - Idle shutdown\n# Idle shutdown\n**    Experimental    — idle shutdown ** This feature is subject to the \"Pre-GA Offerings Terms\" in the General Service Terms section   of the [Service Specific Terms](/terms/service-terms#1) .     Pre-GA features are available \"as is\" and might have limited support.    For more information, see the [launch stage descriptions](/products#product-launch-stages) .\nColab Enterprise runtimes shut down after 180 minutes of inactivity by default. This page describes the idle shutdown feature and how to change the default idle shutdown settings or turn the feature off when you create a runtime template.\n", "content": "## Overview\nTo help manage costs, Colab Enterprise runtimes shut down after being idle for a specific time period by default. You can change the amount of time or turn this feature off when you create a runtime template.\nAfter you create a runtime template, its configuration can't be changed. Therefore, you can't change a runtime or runtime template's idle shutdown settings. To use a runtime with different idle shutdown settings, you must create a runtime template with the settings that you want, and then use a runtime generated from that runtime template.\n## Before you begin\n### Required roles\nTo ensure that your user account has the necessary  permissions to create a runtime template in Colab Enterprise,   ask your administrator to grant your user account the   Colab Enterprise Admin ( [roles/aiplatform.colabEnterpriseAdmin](/vertex-ai/docs/general/access-control#aiplatform.colabEnterpriseAdmin) ) IAM role on the project.    For more information about granting roles, see [Manage access](/iam/docs/granting-changing-revoking-access) .\nYour administrator might also be able to give your user account  the required permissions through [custom  roles](/iam/docs/creating-custom-roles) or other [predefined  roles](/iam/docs/understanding-roles) .\nUsers assigned the Code Creator role in a project can list the names of code assets in that project by using the Dataform API or the Dataform command-line interface (CLI). In preview, non-administrators using BigQuery Studio can only see code assets that they created or that were shared with them.\n## Create a runtime template with specific idle shutdown settings\nTo create a runtime template with specific idle shutdown settings:\n- In the Google Cloud console, go to  the Colab Enterprise **Runtime Templates** page. [Go to Runtime templates](https://console.cloud.google.com/vertex-ai/colab/runtime-templates) \n- Click add_box **New  template** .The **Create new runtime template** dialog appears.\n- In the **Runtime basics** section, enter  a **Display name** .\n- In the **Region** menu, select the region where you want  your runtime template.\n- To change the idle shutdown settings, click the **Configure compute** section, and complete the  following step.\n- In the **Idle shutdown** section:- To disable idle shutdown, clear **Enable idle shutdown** .\n- To change the inactivity time period, in **Time of inactivity before shutdown (Minutes)** ,   change the number to the number of minutes of inactivity that   you want. In the Google Cloud console, this setting can be set   to any integer value from 10 to 1440.\n- Idle shutdown is an Experimental setting. [Learn more about  product launch stages](/products#product-launch-stages) .\n- Complete the rest of the creation dialog.\n- Click **Create** to finish creating the runtime template.Your runtime template appears in the list on the **Runtime templates** tab.## How idle timeout works\nYour runtime shuts down when there is no kernel activity for the specified time period. For example, running a cell or new output printing to a notebook is activity that resets the idle timeout timer. Editing your notebook cells doesn't reset the idle timeout timer.\n## What's next\n- Learn more about [runtimes and runtime templates](/colab/docs/runtimes) .\n- Learn how to [create a runtime](/colab/docs/create-runtime) based on a runtime template.", "guide": "Colab Enterprise"}