{"title": "Colab Enterprise - Run code that interacts with Google Cloud", "url": "https://cloud.google.com/colab/docs/run-code-adc?hl=zh-cn", "abstract": "# Colab Enterprise - Run code that interacts with Google Cloud\n# Run code that interacts with Google Cloud\nThis page describes how to run code that interacts with Google Cloud services and APIs in a Colab Enterprise notebook.\n", "content": "## Overview\nWhen you run code in a Colab Enterprise notebook, you can access Google Cloud services and APIs by using the credentials associated with your Google Account, also called . This means that the runtime that you use has the same level of access to Google Cloud that the user does. This makes it easier to write and run code that interacts with Google Cloud services and APIs.\nColab Enterprise can use [Application Default Credentials(ADC)](/docs/authentication/application-default-credentials) to authenticate your user credentials to Google Cloud services and APIs. This page describes the following ways to provide your user credentials to ADC:\n- [Use a runtime that has end-user credentialsenabled](#end-user-credentials) .\n- [Provide your user credentials to ADC by running code inyour notebook](#run-code) .## Before you begin\n### Required roles\nTo ensure that your user account has the necessary  permissions to access Google Cloud services and APIs in a Colab Enterprise notebook,   ask your administrator to grant your user account the   Colab Enterprise Admin ( [roles/aiplatform.colabEnterpriseAdmin](/vertex-ai/docs/general/access-control#aiplatform.colabEnterpriseAdmin) ) IAM role on the project.    For more information about granting roles, see [Manage access](/iam/docs/granting-changing-revoking-access) .\nYour administrator might also be able to give your user account  the required permissions through [custom  roles](/iam/docs/creating-custom-roles) or other [predefined  roles](/iam/docs/understanding-roles) .\n## Use a runtime with end-user credentials enabled\nYou can use the default runtime, which has end-user credentials enabled, or any runtime created from a [runtimetemplate](/colab/docs/create-runtime-template) in which end-user credentials are enabled.\nIf you don't have a sufficient runtime template with end-user credentials enabled, you must create one. You must enable or turn off end-user credentials when you create a runtime template. This setting can't be modified later.\n**Note:** The first time that you connect to a runtime that has  end-user credentials enabled, a dialog asks you  to grant Colab Enterprise access to your user credentials.  If you complete the dialog without granting  access, you must take additional steps before you can successfully  run code that interacts with Google Cloud services and APIs.  See [User credentials not found when  running code](#run-code-user-credentials-not-found) .\n### Connect to a runtime with end-user credentials enabled\nTo connect to a runtime with end-user credentials enabled:\n- In the Google Cloud console, go to  the Colab Enterprise **Notebooks** page. [Go to Notebooks](https://console.cloud.google.com/vertex-ai/colab/notebooks) \n- In the **Region** menu, select the region that contains your notebook.\n- On the **My notebooks** tab, click the notebook  that you want to open. If you haven't created a notebook yet, [create a notebook](/colab/docs/create-console-quickstart#create) .\n- In your notebook, click the **Additional connection options** expander arrow,  and then select **Connect to a runtime** . The **Connect to Vertex AI runtime** dialog opens.\n- For **Select a runtime** ,  select **Connect to an existing runtime** .\n- For **Select an existing runtime option** ,  select the runtime that you want to connect to. If there aren't  any runtimes in the list, [create a runtime](#create) or [connect to the default runtime](#default) .\n- In the **Runtime details** table, verify that **Personal credentials** are `Enabled` .\n- Click **Connect** .\n- If this is your first time connecting to a runtime with  end-user credentials enabled, a **Sign in** dialog appears.To grant Colab Enterprise access to your user credentials, complete the following steps:- In the **Sign in** dialog, click your user account.\n- Select **See, edit, configure, and delete your  Google Cloud data...** to grant Colab Enterprise  access to your user credentials.\n- Click **Continue** .When you access Google Cloud services and APIs by using end-user credentials, be aware that if your Google Account doesn't have the required Identity and Access Management (IAM) permissions in your project, your code might not be able to access some resources. If this happens, ask your administrator to grant you the required permissions.\n## Provide your user credentials to ADC by running code in your notebook\nIf your runtime doesn't have end-user credentials enabled, you can still use your user credentials to access Google Cloud services and APIs. To do so, provide your user credentials to ADC by using the Google Cloud CLI.\n- Use the following command to create a credential file:```\n!gcloud auth application-default login\n```A **Sign in** dialog appears.\n- Complete the dialog to grant Colab Enterprise access.After you sign in, your credentials are stored in the [local  credential file used by ADC](/docs/authentication/application-default-credentials#personal) . This file is stored on your runtime's VM.\nWhen you provide user credentials to create a local ADC file, you should be aware of the following:\n- User credentials might not work for some methods and APIs, such as the Cloud Translation API or the Cloud Vision API, without extra parameters or configuration. If you see an error message about the API not being enabled in the project, or that there is no quota project available, see [Troubleshooting your ADC setup](/docs/authentication/troubleshoot-adc) .\n- The local ADC contains your access and refresh tokens. Any user with access to your file system can use those credentials. If you no longer need these local credentials, you can revoke them by using the [gcloud auth application-default revokecommand](/sdk/gcloud/reference/auth/application-default/revoke) .\n- If your Google Account doesn't have the required Identity and Access Management (IAM) roles in your project, your code might not be able to access some resources. If this happens, someone must grant you the required roles.## Troubleshoot\nThis section shows you how to resolve issues with running code that interacts with Google Cloud services and APIs.\n### User credentials not found when running code\nThis issue occurs when you try to run code in a notebook that interacts with Google Cloud services and APIs, but you haven't granted Colab Enterprise access to your user credentials.\nThe error message might look like one of the following:\n```\nRequest had invalid authentication credentials.\nExpected OAuth 2 access token, login cookie or other valid authentication credential\n```\n```\nDefaultCredentialsError: Your default credentials were not found.\n```\nSee the following common reasons for this issue and their resolutions:\n- You didn't complete a **Sign in** dialog that appears when  you first connect to a runtime that has end-user credentials enabled.  By completing this dialog, you grant Colab Enterprise access  to your user credentials.To resolve this issue, try connecting to the runtime again and grant access.To validate that access has been granted:- Click **Account > Managed Google Account >   Data and Privacy > Third-party Apps & Services** .\n- Verify that Colab Enterprise is listed.\n- In the **Sign in** dialog (consent screen) that appears when you first connect  to a runtime that has end-user credentials enabled, you didn't select your  user account to grant Colab Enterprise access to your  user credentials.To resolve this issue:- In the [Google Cloud console](https://console.cloud.google.com/vertex-ai/colab/notebooks) ,   click your account profile image, and then click **Google Account** .\n- Click **Data & privacy** .\n- In **Data from apps and services you use** , click **Third-party apps & services** .\n- Click **Colab Enterprise** .\n- In **Colab Enterprise has some access to your Google Account** ,   click **See details** .\n- Click **Remove access** .\n- Click **Confirm** .This removes your current access settings.\n- The next time you [connect to a   runtime that has end-user credentials enabled](/colab/docs/run-code-adc#connect) , make sure to select the   correct user account when you complete the **Sign in** dialog.\n- A pop-up blocker might be preventing the Colab Enterprise **Sign in** dialog (consent screen) from appearing.To resolve this issue, enable pop-ups temporarily in your browser and try to connect to  the runtime again.\n- You aren't using a runtime with end-user credentials enabled, and you haven't provided  your user credentials to Application Default Credentials (ADC) by using the Google Cloud CLI.To resolve this issue, see [Provide your  user credentials to ADC by running code in your notebook](/colab/docs/run-code-adc#run-code) .\n## What's next\n- Learn more about [how Application Default Credentialswork](/docs/authentication/application-default-credentials) .\n- [Create a runtime template](/colab/docs/create-runtime-template) with end-user credentials enabled.", "guide": "Colab Enterprise"}