{"title": "Colab Enterprise - Use VPC Service Controls", "url": "https://cloud.google.com/colab/docs/service-controls?hl=zh-cn", "abstract": "# Colab Enterprise - Use VPC Service Controls\n# Use VPC Service Controls\nThis page describes how to use VPC Service Controls to set up a Colab Enterprise notebook within a service perimeter.\n", "content": "## Overview\nVPC Service Controls is a Google Cloud feature that lets you set up a perimeter that helps guard against data exfiltration.\nVPC Service Controls provides an extra layer of defense for Google Cloud services that is independent of the protection provided by Identity and Access Management (IAM).\nWhen you use Colab Enterprise within a service perimeter, runtimes are subject to the service perimeter. Therefore, to run notebook code that interacts with other Google APIs and services, you must add those services to the service perimeter.\nFor more information about VPC Service Controls, see [Overview of VPC Service Controls](/vpc-service-controls/docs/overview) .\n## Known limitations\n- Colab Enterprise uses Dataform for storing notebooks.To learn more about using VPC Service Controls with Dataform, see [Configure VPC Service Controls forDataform](/dataform/docs/vpc-service-controls) .\n- The Colab Enterprise UI is only accessible from the Google Cloud console. To learn about VPC Service Controls limitations for the Google Cloud console, see the [Google Cloud consolelimitations](/vpc-service-controls/docs/supported-products#console) .\n- If your service perimeter needs access to Vertex AI services, see [VPC Service Controls with Colab Enterpriselimitations](/vertex-ai/docs/general/vpc-service-controls#limitations) .\n### Required roles\nTo ensure that your user account has the necessary  permissions to use VPC Service Controls with Colab Enterprise,   ask your administrator to grant your user account the  following IAM roles on the project:\n- [Access Context Manager Editor ](https://cloud.google.com/iam/docs/understanding-roles#accesscontextmanager.policyEditor) (`roles/accesscontextmanager.policyEditor`)\n- [Colab Enterprise User ](https://cloud.google.com/iam/docs/understanding-roles#aiplatform.colabEnterpriseUser) (`roles/aiplatform.colabEnterpriseUser`)\nFor more information about granting roles, see [Manage access](/iam/docs/granting-changing-revoking-access) .\nYour administrator might also be able to give your user account  the required permissions through [custom  roles](/iam/docs/creating-custom-roles) or other [predefined  roles](/iam/docs/understanding-roles) .\nUsers assigned the Code Creator role in a project can list the names of code assets in that project by using the Dataform API or the Dataform command-line interface (CLI). In preview, non-administrators using BigQuery Studio can only see code assets that they created or that were shared with them.\nFor more information about VPC Service Controls permissions, see [Access control with IAM](/vpc-service-controls/docs/access-control) .\n## Create a service perimeter\n- [Create a service perimeter by usingVPC Service Controls](/vpc-service-controls/docs/create-service-perimeters) . This service perimeter protects the Google-managed resources of services that you specify. While creating your service perimeter, do the following:- When it's time to add projects to your service perimeter, add the project that contains your Colab Enterprise notebooks, or create notebooks in this project.\n- When it's time to add services to your service perimeter, add the following:- **Vertex AI API** (`aiplatform.googleapis.com`)\n- **Dataform API** (`dataform.googleapis.com`)\n **Note:** If you're using other services, add them. For example, you might want to use BigQuery ( `bigquery.googleapis.com` ), Cloud Storage ( `storage.googleapis.com` ), Dataproc ( `dataproc.googleapis.com` ), or other services.\nIf you have created your service perimeter without adding the projects and services you need, see [Manage serviceperimeters](/vpc-service-controls/docs/manage-service-perimeters) to learn how to update your service perimeter.## Provide access to the Colab Enterprise UI\nBecause the Colab Enterprise UI ( `colab-embedded.cloud.google.com` ) is only accessible over the internet, the Colab Enterprise UI is treated as outside of service perimeters. When you apply a service perimeter, the Google Cloud console interface for the services that you protected might become partially or fully inaccessible. For example, if you protect Colab Enterprise with the perimeter, the Colab Enterprise interface in the Google Cloud console becomes inaccessible.\n**Note:** If you remove your public IP address, your  Colab Enterprise notebooks won't be able to access  pip and other public package libraries for installation.\nTo allow access from the Google Cloud console to resources protected by a perimeter, you need to create an access level for a public IP range that includes the machines of users who want to use the Google Cloud console with protected APIs. For example, you could add the public IP range of the NAT gateway of your private network to an access level, and then assign that access level to the service perimeter.\nIf you want to limit Google Cloud console access to the perimeter to only a specific set of users, you can also add those users to an access level. In that case, only the specified users would be able to access the Google Cloud console.\n**Note:** Requests through Google Cloud console from a network that is  Private Google Access enabled, including networks implicitly enabled by  Cloud NAT, might be blocked even if the requesting source network  and target resource are in the same perimeter. This is because  Google Cloud console access through Private Google Access is not  supported by Colab Enterprise.\n## Set up VPC accessible services (optional)\nWhen you enable VPC accessible services for a perimeter, access from network endpoints inside your perimeter is limited to a set of services that you specify.\nTo learn more about how to limit access inside your perimeter to only a specific set of services, read about [VPC accessible services](/vpc-service-controls/docs/vpc-accessible-services) .\n## Use Private Google Access with your VPC network (optional)\nPrivate Google Access offers private connectivity to hosts in either a VPC network or an on-premises network that uses private IP addresses to access Google Cloud APIs and services. You can extend a VPC Service Controls service perimeter to hosts in those networks to control access to protected resources. Hosts in a VPC network must have a private IP address only (no public IP address) and be in a subnet with Private Google Access enabled. For more information, see [private connectivity from on-premisesnetworks](/vpc-service-controls/docs/private-connectivity) .\nTo ensure that you can use Private Google Access with your VPC network, you must configure some DNS records.\n### Configure your DNS entries using Cloud DNS\nColab Enterprise runtimes use several domains that a VPC network doesn't handle by default. To ensure that your VPC network correctly handles requests sent to those domains, use Cloud DNS to add DNS records. For more information about VPC routes, see [Routes](/vpc/docs/routes) .\nThis section shows you how to create a [managed zone](/dns/zones) for a domain, add a DNS entry that will route the request, and run the transaction. Repeat these steps for each of [severaldomains](#domains) that you need to handle requests for, starting with `*.aiplatform.googleapis.com` .\nIn Cloud Shell or any environment where the [Google Cloud CLI](/sdk/docs) is installed, enter the following [gcloud CLI](/sdk/gcloud) commands.\n- To create a private managed zone for one of the domains that your  VPC network needs to handle:```\n gcloud dns managed-zones create ZONE_NAME \\\n  --visibility=private \\\n  --networks=https://www.googleapis.com/compute/v1/projects/PROJECT_ID/global/networks/NETWORK_NAME \\\n  --dns-name=DNS_NAME. \\\n  --description=\"Description of your managed zone\"\n \n```Replace the following:- ``: A name for the zone to create.   You must use a separate zone for each domain. This zone name is used in   each of the following steps.\n- ``: The ID of the project that hosts   your VPC network.\n- ``: The name of the VPC   network that you created earlier.\n- ``: The part of the domain name   that comes after the`*.`. For example,`*.aiplatform.googleapis.com`has a DNS name of`aiplatform.googleapis.com`.\n- Start a transaction.```\n gcloud dns record-sets transaction start --zone=ZONE_NAME\n \n```\n- Add the following DNS A record. This reroutes traffic to  Google's restricted IP addresses.```\n gcloud dns record-sets transaction add \\\n  --name=DNS_NAME. \\\n  --type=A 199.36.153.4 199.36.153.5 199.36.153.6 199.36.153.7 \\\n  --zone=ZONE_NAME \\\n  --ttl=300\n \n```\n- Add the following DNS CNAME record to point to the A record  that you just added. This redirects all traffic matching the  domain to the IP addresses listed in the previous step.```\n gcloud dns record-sets transaction add \\\n  --name=\\*.DNS_NAME. \\\n  --type=CNAME DNS_NAME. \\\n  --zone=ZONE_NAME \\\n  --ttl=300\n \n```\n- Run the transaction.```\n gcloud dns record-sets transaction execute --zone=ZONE_NAME\n \n```\n- Repeat these steps for each of the following domains. For each  repetition, change and to the appropriate values for that  domain. Keep and the same each time. You already  completed these steps for `*.aiplatform.googleapis.com` .- `*.aiplatform.googleapis.com`\n- `*.aiplatform-notebook.googleusercontent.com`\n- `*.aiplatform-notebook.cloud.google.com`To learn more about configuring private connectivity, read [Set up private connectivity to Google APIs andservices](/vpc-service-controls/docs/set-up-private-connectivity) .\n## Allow context-aware access from outside a service perimeter using ingress rules\nYou can allow context-aware access to resources restricted by a perimeter based on client attributes. You can specify client attributes, such as identity type (service account or user), identity, device data, and network origin (IP address or VPC network).\nFor example, you can set up ingress rules to allow internet access to resources within a perimeter based on the range of IPv4 and IPv6 addresses. For more information about using ingress rules to set up context-aware access, see [Context-aware access](/vpc-service-controls/docs/context-aware-access) .\n## Configure secure data exchange using ingress and egress rules\nYou can include your project in only one service perimeter. If you want to allow communication across the perimeter boundary, set up ingress and egress rules. For example, you can specify ingress and egress rules to let projects from multiple perimeters to share logs in a separate perimeter. To learn more about secure data exchange use cases, read [secure data exchange](/vpc-service-controls/docs/secure-data-exchange) .\n## What's next\n- Learn more about [VPC Service Controls](/vpc-service-controls/docs/overview) .\n- Learn more about [Colab Enterprise runtimes](/colab/docs/runtimes) .", "guide": "Colab Enterprise"}