{"title": "Colab Enterprise - Introduction to Colab Enterprise", "url": "https://cloud.google.com/colab/docs/introduction?hl=zh-cn", "abstract": "# Colab Enterprise - Introduction to Colab Enterprise\n# Introduction to Colab Enterprise\nColab Enterprise is a collaborative, managed notebook environment with the security and compliance capabilities of Google Cloud.\n", "content": "## Share and collaborate\nColab Enterprise lets you share notebooks (IPYNB files) and collaborate with others. You can share a notebook with a single user, Google group, or Google Workspace domain. You control this access through Identity and Access Management (IAM).\nLearn how to [grant access to a notebook](/colab/docs/manage-access-notebook) .\n## Managed compute\nColab Enterprise lets you work in notebooks without having to manage infrastructure. Colab Enterprise provisions a runtime for you when you need it. If you want to, you can configure runtimes for specific needs, but Colab Enterprise starts them for you and shuts them down when you no longer need them.\n## Configurable runtimes\nUse the default runtime or configure your own by creating a runtime template. When you create a runtime template, you can choose between any available machine type, add accelerators, and specify your disk space.\nBy using runtimes that you configured, you can run code on the runtime that meets your needs at the moment. For example, you can test your code with a small dataset by using a runtime with a smaller, cost-effective machine type. Then you can use a runtime with more processing power when you need to run your code with more data.\nTo learn more, see [Runtimes and runtime templates](/colab/docs/runtimes) .\n## Integrated with Vertex AI and BigQuery\nColab Enterprise's integrations with Google Cloud services make it easier to use notebooks that interact with those services.\nColab Enterprise is a part of Vertex AI. Colab Enterprise's API methods are a subset of the Vertex AI API. This can save you time when you're managing access to Colab Enterprise resources or when you authenticate and authorize your notebook code to use Vertex AI.\nTo learn more, see the [API usage overview](/colab/docs/reference) .\nColab Enterprise is embedded within the UI of its integrated services. This lets you do work in Vertex AI and BigQuery, and then continue your work in a notebook without leaving their areas of the Google Cloud console. For example, you can create a notebook directly from the BigQuery editor, populated with a sample query to help you get started. To learn more, see BigQuery's [Introduction tonotebooks](/bigquery/docs/notebooks-introduction) .\n## Inline code completion\nColab Enterprise lets you write code with [Duet AI](/duet-ai/docs/overview) assistance. Use the inline code completion suggestions to complete coding projects faster. To learn more, see [write code with Duet AIassistance](/colab/docs/use-code-completion) .\n## Idle shutdown\n**    Experimental     ** This feature is subject to the \"Pre-GA Offerings Terms\" in the General Service Terms section   of the [Service Specific Terms](/terms/service-terms#1) .     Pre-GA features are available \"as is\" and might have limited support.    For more information, see the [launch stage descriptions](/products#product-launch-stages) .\nTo help manage costs, Colab Enterprise runtimes shut down when they're inactive for a specific time period. You can change the amount of time or turn this feature off.\nFor more information, see [Idle shutdown](/colab/docs/idle-shutdown) .\n## Run code that interacts with Google Cloud services and APIs\nBy default Colab Enterprise notebooks use your user credentials to authenticate and authorize code that interacts with other Google Cloud services.\nThis means that the notebook's code has the same level of access to Google Cloud that the user does. This makes it easier to write and run code that interacts with Google Cloud services.\nFor more information, see [Run code that interacts with Google Cloud](/colab/docs/run-code-adc) .\n## Colab Enterprise is different from Colab\nColab Enterprise is different from [Colaboratory](https://colab.google/) , which is still available. Both have specific advantages that can be helpful depending on your needs. See the main differences in the following table:\n| Component    | Colab Enterprise        | Colab               |\n|:------------------------|:------------------------------------------------|:----------------------------------------------------------------|\n| Storage     | Regional storage in Dataform     | Google Drive storage, regionalized storage not supported  |\n| Access control   | Managed by IAM         | Managed through Google Drive sharing functionality    |\n| Security and networking | Google Cloud security and network functionality | Google Drive-based security, with the internet always available |\n| Support     | Google Cloud support       | Send feedback or report a bug         |\n## Limitations\nConsider the following limitations of Colab Enterprise when planning your project:\n- The file size of uploaded notebooks is limited to 20 MB.\n- Shielded VM runtimes can't be upgraded.\nSee also [Quotas and limits](/colab/docs/quotas) .\n## What's next\n- [Create a Colab Enterprisenotebook](/colab/docs/create-console-quickstart) .\n- Learn more about [runtimes and runtime templates](/colab/docs/runtimes) .", "guide": "Colab Enterprise"}