{"title": "Colab Enterprise - Create a runtime", "url": "https://cloud.google.com/colab/docs/create-runtime?hl=zh-cn", "abstract": "# Colab Enterprise - Create a runtime\n# Create a runtime\nThis page shows you how to create a runtime in Colab Enterprise.\nYou can create a runtime to run code on a runtime that has a different configuration than the default. Runtimes are created based on a runtime template, which includes specifications like machine type and disk size.\nLearn more about [runtimes and runtime templates](/colab/docs/runtimes) .\n", "content": "## Before you begin\n### Required roles\nTo ensure that your user account has the necessary  permissions to create a runtime in Colab Enterprise,   ask your administrator to grant your user account the   Colab Enterprise Admin ( [roles/aiplatform.colabEnterpriseAdmin](/vertex-ai/docs/general/access-control#aiplatform.colabEnterpriseAdmin) ) IAM role on the project.    For more information about granting roles, see [Manage access](/iam/docs/granting-changing-revoking-access) .\nYour administrator might also be able to give your user account  the required permissions through [custom  roles](/iam/docs/creating-custom-roles) or other [predefined  roles](/iam/docs/understanding-roles) .\nUsers assigned the Code Creator role in a project can list the names of code assets in that project by using the Dataform API or the Dataform command-line interface (CLI). In preview, non-administrators using BigQuery Studio can only see code assets that they created or that were shared with them.\n## Create the runtime\nTo create a runtime:\n- In the Google Cloud console, go to  the Colab Enterprise **Runtimes** page. [Go to Runtimes](https://console.cloud.google.com/vertex-ai/colab/runtimes) \n- In the **Region** menu, select the region where you want  your runtime. It must be in the same region as the notebook that  uses it.\n- Click add_box **Create  runtime** .The **Create Vertex AI runtime** dialog appears.\n- In the **Runtime template** menu,  select a runtime template. If there aren't any runtime templates listed, [create a runtime template](/colab/docs/create-runtime-template) .\n- In the **Runtime name** field, enter a name for your runtime.\n- Click **Create** .## Runtime management\nBy default, when you create a runtime, you automatically have the required permissions to delete ( `aiplatform.googleapis.com/notebookRuntimes.delete` ) and start ( `aiplatform.googleapis.com/notebookRuntimes.start` ) that runtime.\n## Troubleshoot\nThis section shows you how to resolve issues with creating runtimes in Colab Enterprise.\n### Unable to create a runtime\nThis issue occurs when you're unable to create a runtime. See also [Unable to create a defaultruntime](#unable-to-create-default-runtime-no-template-create-permission) . The most common causes are:\nIf you are unable to create a runtime, you might have exceeded your Compute Engine runtime quota.\nColab Enterprise uses Compute Engine quota for runtimes. For more information, see the [Compute Engine quota and limits overview](/compute/quotas-limits) .\nTo resolve this issue, [request a higher quota limit](/docs/quotas/view-manage#requesting_higher_quota) .The following error occurs when you try to create a runtime.\n```\nNo available zone found for runtime RUNTIME_ID\nfor machine type MACHINE_TYPE\nwith accelerator type: ACCELERATOR. Please try again later.\n```\nThis error occurs if there are no resources available for your machine type configuration within your notebook's region.\nTo resolve this issue, try a runtime with a different machine type configuration, or try again at a later time.The following error occurs when you try to create a runtime from the default runtime template when the default runtime already exists.\n```\nFailed to create runtime\nOne click runtime already exists.\n```\nIf you try to create a runtime from a default runtime template, Colab Enterprise tries to create a default runtime. There can only be one default runtime per user, project, and region. If the default runtime already exists, Colab Enterprise is unable to create another default runtime.\nTo resolve this issue, connect to the existing default runtime or create a runtime from a non-default runtime template.### Unable to create a default runtime\nWhen Colab Enterprise creates a default runtime, it first creates a default runtime template that it uses to generate the default runtime. If you try to create a default runtime without the permissions required to create a runtime template, then Colab Enterprise can't create the default runtime.\nTo resolve this issue, ask your administrator to grant you a role that includes the `aiplatform.notebookRuntimeTemplates.create` permission.\n## What's next\n- Learn more about [runtimes and runtime templates](/colab/docs/runtimes) .\n- [Connect to your runtime](/colab/docs/connect-to-runtime) .\n- Learn how to [create a runtime template](/colab/docs/create-runtime-template) .", "guide": "Colab Enterprise"}