{"title": "Colab Enterprise - Troubleshoot Colab Enterprise", "url": "https://cloud.google.com/colab/docs/troubleshooting?hl=zh-cn", "abstract": "# Colab Enterprise - Troubleshoot Colab Enterprise\n# Troubleshoot Colab Enterprise\nThis page shows you how to resolve issues with Colab Enterprise.\n", "content": "## Unable to connect to a runtime\nThis issue occurs due to several reasons. See also [Unable to connect to a defaultruntime](#unable-to-connect-default-runtime-no-template-create-permission) . The most common causes are:\n### Browser blocks third party cookies\nThe browser that you are using is blocking a third party cookie that Colab Enterprise uses to establish an HTTPS connection with the runtime.\nTo resolve this issue, configure your browser's settings to allow the `DATALAB_TUNNEL_TOKEN` third party cookie from the domain `*.aiplatform-notebook.googleusercontent.com` .### Network blocks outbound traffic to notebook domains\nYour network's firewall rules block outbound traffic to `*.aiplatform-notebook.cloud.google.com` or `*aiplatform.googleapis.com` .\nTo resolve this issue, configure your network's firewall rules to allow outbound traffic to `*.aiplatform-notebook.cloud.google.com` and `*aiplatform.googleapis.com` .\n## Unable to connect to a default runtime\nThe following error occurs when you try to connect to a default runtime when there isn't an existing default runtime template.\n```\nFailed to connect to runtime\n```\nWhen you connect to a default runtime that hasn't been created yet, Colab Enterprise first creates a default runtime template, and then uses that default runtime template to generate the default runtime. However, if you don't have the permissions required to create a runtime template, then Colab Enterprise can't create the default runtime template nor the default runtime.\nTo resolve this issue, ask your administrator to grant you a role that includes the `aiplatform.notebookRuntimeTemplates.create` permission.\n## Unable to create a runtime\nThis issue occurs when you're unable to create a runtime. See also [Unable to create a defaultruntime](#unable-to-create-default-runtime-no-template-create-permission) . The most common causes are:\n### Insufficient quota\nIf you are unable to create a runtime, you might have exceeded your Compute Engine runtime quota.\nColab Enterprise uses Compute Engine quota for runtimes. For more information, see the [Compute Engine quota and limits overview](/compute/quotas-limits) .\nTo resolve this issue, [request a higher quota limit](/docs/quotas/view-manage#requesting_higher_quota) .### Unavailable resources\nThe following error occurs when you try to create a runtime.\n```\nNo available zone found for runtime RUNTIME_ID\nfor machine type MACHINE_TYPE\nwith accelerator type: ACCELERATOR. Please try again later.\n```\nThis error occurs if there are no resources available for your machine type configuration within your notebook's region.\nTo resolve this issue, try a runtime with a different machine type configuration, or try again at a later time.### Default runtime already exists\nThe following error occurs when you try to create a runtime from the default runtime template when the default runtime already exists.\n```\nFailed to create runtime\nOne click runtime already exists.\n```\nIf you try to create a runtime from a default runtime template, Colab Enterprise tries to create a default runtime. There can only be one default runtime per user, project, and region. If the default runtime already exists, Colab Enterprise is unable to create another default runtime.\nTo resolve this issue, connect to the existing default runtime or create a runtime from a non-default runtime template.\n## Unable to create a default runtime\nWhen Colab Enterprise creates a default runtime, it first creates a default runtime template that it uses to generate the default runtime. If you try to create a default runtime without the permissions required to create a runtime template, then Colab Enterprise can't create the default runtime.\nTo resolve this issue, ask your administrator to grant you a role that includes the `aiplatform.notebookRuntimeTemplates.create` permission.\n## User credentials not found when running code\nThis issue occurs when you try to run code in a notebook that interacts with Google Cloud services and APIs, but you haven't granted Colab Enterprise access to your user credentials.\nThe error message might look like one of the following:\n```\nRequest had invalid authentication credentials.\nExpected OAuth 2 access token, login cookie or other valid authentication credential\n```\n```\nDefaultCredentialsError: Your default credentials were not found.\n```\nSee the following common reasons for this issue and their resolutions:\n- You didn't complete a **Sign in** dialog that appears when  you first connect to a runtime that has end-user credentials enabled.  By completing this dialog, you grant Colab Enterprise access  to your user credentials.To resolve this issue, try connecting to the runtime again and grant access.To validate that access has been granted:- Click **Account > Managed Google Account >   Data and Privacy > Third-party Apps & Services** .\n- Verify that Colab Enterprise is listed.\n- In the **Sign in** dialog (consent screen) that appears when you first connect  to a runtime that has end-user credentials enabled, you didn't select your  user account to grant Colab Enterprise access to your  user credentials.To resolve this issue:- In the [Google Cloud console](https://console.cloud.google.com/vertex-ai/colab/notebooks) ,   click your account profile image, and then click **Google Account** .\n- Click **Data & privacy** .\n- In **Data from apps and services you use** , click **Third-party apps & services** .\n- Click **Colab Enterprise** .\n- In **Colab Enterprise has some access to your Google Account** ,   click **See details** .\n- Click **Remove access** .\n- Click **Confirm** .This removes your current access settings.\n- The next time you [connect to a   runtime that has end-user credentials enabled](/colab/docs/run-code-adc#connect) , make sure to select the   correct user account when you complete the **Sign in** dialog.\n- A pop-up blocker might be preventing the Colab Enterprise **Sign in** dialog (consent screen) from appearing.To resolve this issue, enable pop-ups temporarily in your browser and try to connect to  the runtime again.\n- You aren't using a runtime with end-user credentials enabled, and you haven't provided  your user credentials to Application Default Credentials (ADC) by using the Google Cloud CLI.To resolve this issue, see [Provide your  user credentials to ADC by running code in your notebook](/colab/docs/run-code-adc#run-code) .", "guide": "Colab Enterprise"}