{"title": "Cloud Text-to-Speech API - Before You Begin", "url": "https://cloud.google.com/text-to-speech/docs/before-you-begin", "abstract": "# Cloud Text-to-Speech API - Before You Begin\nText-to-Speech is an API that is powered by Google's artificial intelligence (AI) technology. You send your transcript data to Text-to-Speech in an API call, then receive natural-sounding, synthetic human speech as playable audio in response. For more information on how Text-to-Speech works, see the [basics](/text-to-speech/docs/basics) page.\nWe provide [code samples](/text-to-speech/docs/samples) that show you how to make a request to the API and receive a response. You can learn how to use these samples by following the Text-to-Speech [quickstarts](/text-to-speech/docs/quickstarts) and [how-to guides](/text-to-speech/docs/how-to) .\nThis guide walks you through the steps necessary to start sending requests to the Text-to-Speech API.\n", "content": "## Overview\nBefore you can begin using Text-to-Speech, you must enable the API in the Google Cloud Platform Console. The steps below walk you through the following actions:\n- Enable Text-to-Speech on a project.\n- Make sure billing is enabled for Text-to-Speech.\n- Set up authentication for your development environment.## Set up your Google Cloud Platform project\n- [Sign in to Google Cloud console](https://console.cloud.google.com/) \n- [Go to the project selector page](https://console.cloud.google.com/projectselector2/home/dashboard) You can either choose an existing project or create a new one. For more details about creating a project, please see the [Google Cloud Platform documentation](/resource-manager/docs/creating-managing-projects) .\n- If you create a new project, you will be prompted to link a billing account to this project. If you are using a pre-existing project, make sure that you have billing enabled. [Learn how to confirm that billing is enabled for your project](/billing/docs/how-to/modify-project) **Note:** You must enable billing to use Text-to-Speech API, however you will not be charged unless you exceed the free quota. See the [pricing](/text-to-speech/pricing) page for more details.\n- Once you have selected a project and linked it to a billing account, you can enable the Text-to-Speech API. Go to the **Search products andresources** bar at the top of the page and type in **\"speech\"** . Select the **Cloud Text-to-Speech API** from the list of results.\n- To try Text-to-Speech without linking it to your project, choose the **TRY THIS API** option. To enable the Text-to-Speech API for use with your project, click **ENABLE** .\n- Set up authentication for your development environment. For instructions, see [Set up authentication for Text-to-Speech](/text-to-speech/docs/authentication#authn-how-to) .## Disable the Text-to-Speech API\nTo disable the Text-to-Speech API, navigate to your Google Cloud Platform dashboard and click on the **Go to APIs overview** link in the **APIs** box. Click on the Text-to-Speech API, then select the **DISABLE API** button at the top of the page.\n## What's next\nLearn how to send a transcription request to the Text-to-Speech API using [client libraries](/text-to-speech/docs/create-audio-text-client-libraries) or the [command line](/text-to-speech/docs/create-audio-text-command-line) .", "guide": "Cloud Text-to-Speech API"}