{"title": "Cloud TPU - Internal IP address ranges for TPU Nodes", "url": "https://cloud.google.com/tpu/docs/internal-ip-blocks", "abstract": "# Cloud TPU - Internal IP address ranges for TPU Nodes\n# Internal IP address ranges for TPU Nodes\n**Important:** You can use this document with either the TPU VM or the TPU Node architecture. The two VM architectures are described in [System Architecture](/tpu/docs/system-architecture-tpu-vm) .\n", "content": "## TPU VM architecture\nWhen you use TPU VMs, you SSH directly into the TPU VM.\n## TPU Node architecture\nTPU Nodes run on a [peer VPC network](/vpc/docs/vpc-peering) that Google manages. When you create a TPU Node, the system automatically creates a peer connection to a [VPC network](/vpc/docs/vpc) from your project. The peer connection provides access to the TPU Node from your instances, GKE clusters, and other Cloud Platform services that run on the same VPC network.\nWhen you are writing applications to automatically create and manage TPU Nodes, you can [reserve allocated IP address ranges](/vpc/docs/configure-private-services-access#allocating-range) to automatically identify open IP address ranges on your VPC network and reserve them to be used for your TPU Nodes.\n**Note:** Cloud TPU **VPC Service Controls** can provide additional security for your Cloud TPU resources. To learn more about VPC Service Controls, see the [VPC Service Controls overview](/vpc-service-controls/docs/overview) . To learn about the limitations in using Cloud TPU with VPC Service Controls, see the [supported products and limitations](/vpc-service-controls/docs/supported-products) .\n### Automatic IP address configuration\nWhen you create a TPU VM or TPU Node using the Google Cloud Platform (GCP) [Google Cloud CLI](https://cloud.google.com/sdk/gcloud/reference/compute/tpus/) , or the [Google Cloud console](https://console.cloud.google.com/) , you do not need to specify an internal IP address or address range since the IP network address is automatically configured.\n**Note:** Internal TPU IP addresses are only accessible by principals that have access to your project.\n### Manual IP address configuration\n**Note:** You can only specify an internal IP address range for a TPU Node, not for a TPU VM.\nYou can also manually specify an internal IP address range for your TPU Node. You can use any valid address in your user-specified network or VPC internal network as long as it does not conflict with other addresses already used on that network.\nManually configured IP address ranges for TPU Nodes must meet the following requirements:\n- The IP address range must be from within the internal IP address ranges:```\n 10.0.0.0  - 10.255.255.255 (10/8 prefix)\n 172.16.0.0  - 172.31.255.255 (172.16/12 prefix)\n 192.168.0.0  - 192.168.255.255 (192.168/16 prefix)\n```\n- Your range must be one of the following formats:```\nW.X.Y.Z/N\nW.X.Y.Z\n```where:- `W,X,Y,Z`are integers in the range 0-255 with no leading zeros.\n- `/N`is an optional address range size. If you do not specify a range size Cloud TPU selects the correct range size for your TPU type.\n- Your range must have enough addresses to accommodate the size of your TPU type. If you omit the range size, Cloud TPU selects the correct range size for your TPU type. If you must specify a range size, select a range size that provides enough addresses for 1/4th the number of TPU cores in your node with at least 8 addresses at a minimum. For example, if you select a `v3-512` TPU type with 512 cores, your range must have a size of `/25` to provide 128 addresses for the TPU peer network. For both `v3-8` and `v3-32` TPU types, you must specify the minimum range size of `/29` to provide at least 8 addresses.\n- If you must select an address range, select one that does not conflict with another network resource on the network that you are using. For example, if you deploy your Cloud TPU on the \"default\" network that is created on standard Compute Engine projects, then this network will already have a subnetwork for `us-central1` using the `10.128.0.0/20` range and you cannot place any of your subnetworks inside this range. This is true for all other regions.", "guide": "Cloud TPU"}