{"title": "Cloud TPU - Storage options for Cloud TPU data", "url": "https://cloud.google.com/tpu/docs/storage-options", "abstract": "# Cloud TPU - Storage options for Cloud TPU data\n# Storage options for Cloud TPU data\nThis document describes data storage options that can be used when training models on Cloud TPU.\n", "content": "## Introduction\nCloud TPU requires data storage for:\n- dataset downloading and preprocessing\n- host input pipeline processing\n- model training input\n- model training output\nThere are five storage options for the Cloud TPU application data and training datasets:\n- The [boot disk](#vmboot-disk) for a TPU VM or TPU Node\n- A [persistent disk](#persistent-disk) attached to a TPU VM or TPU Node\n- [Cloud Storage buckets](#gcsbuckets) - [Cloud Storage FUSE](/storage/docs/gcs-fuse) \n- [Filestore file share](#fileshare) on a Compute Engine VM **Note:** The differences between TPU VMs and TPU Nodes are described in [System Architecture](/tpu/docs/system-architecture-tpu-vm) .\nFor storage cost and performance details see [Storage options](/compute/docs/disks) .\n## The boot disk for a TPU VM or TPU Node\nBy default, each Cloud TPU VM has a 100GB single boot [persistent disk](/tpu/docs/setup-persistent-disk) that contains the operating system. The boot disk can also be used to store downloaded datasets for preprocessing and model input and output data, provided the total amount doesn't exceed the available space on the boot disk.\nIf your training application requires additional storage space beyond the boot disk default, you can add one or more persistent disks to your VM or TPU VM instance. There are different procedures for adding a persistent disk to a TPU Node (a [Compute Engine VM](/compute/docs/disks/add-persistent-disk) ) or to a [TPU VM](/tpu/docs/setup-persistent-disk) .\n## A persistent disk attached to a TPU VM or TPU Node\n[Persistent disks](/compute/docs/disks/persistent-disks) are durable network storage devices that your VM instances can access like physical disks in a desktop or a server. The data on each persistent disk is distributed across several physical disks. Compute Engine manages the physical disks and the data distribution for you to ensure redundancy and optimal performance.\nPersistent disks are created independently from your virtual machine (VM) instances, so you can keep your data even after you delete your VM instances. Persistent disk performance scales automatically with size, so you can resize your existing persistent disks or add more persistent disks to an instance to meet your performance and storage space requirements.\nPersistent disks have built-in redundancy to protect your data against equipment failure and to ensure data availability through data center maintenance events. Checksums are calculated for all persistent disk operations, so we can ensure that what you read is what you wrote.\nAdditionally, you can create [snapshots](/compute/docs/disks/create-snapshots) of persistent disks to protect against data loss due to user error. Snapshots are incremental, and take only minutes to create even if you snapshot disks that are attached to running instances.\nFor more information on using persistent disks with TPU VMs, see [Add a persistent disk to a TPU VM](/tpu/docs/setup-persistent-disk) .\n## Cloud Storage buckets\n[Cloud Storage buckets](/compute/docs/disks#gcsbuckets) are the most flexible, scalable, and durable storage option for your VM instances. If your training job does not require the lower latency of persistent disks, you can store your dataset in a Cloud Storage bucket.\nThe performance of Cloud Storage buckets depends on the [storage class](/storage/docs/storage-classes) that you select and the location of the bucket relative to your instance.\nCreating your Cloud Storage bucket in the same zone as your VM instance (for TPU Nodes) or your TPU VM gives performance that is comparable to persistent disks but with higher latency and less consistent throughput characteristics.\nAll Cloud Storage buckets have built-in redundancy to protect your data against equipment failure and to ensure data availability through data center maintenance events. Checksums are calculated for all Cloud Storage operations to help ensure that what you read is what you wrote.\nUnlike persistent disks, Cloud Storage buckets are not restricted to the zone where your instance is located. Additionally, you can read and write data to a bucket from multiple instances simultaneously. For example, you can configure instances in multiple zones to read and write data in the same bucket rather than replicate the data to persistent disks in multiple zones.\nCloud Storage FUSE lets you to mount and access Cloud Storage buckets as local file systems. This allows applications to read and write objects in your bucket using standard file system semantics.\nSee the Cloud Storage [FUSE documentation](/storage/docs/gcs-fuse) for details about how Cloud Storage FUSE works and a description of how Cloud Storage FUSE operations map to Cloud Storage operations. You can find additional information about how to use Cloud Storage FUSE, such as how to install the Cloud Storage FUSE CLI and mounting buckets on [GitHub](https://github.com/GoogleCloudPlatform/gcsfuse/tree/master/docs) .\n## Filestore file share\n[Filestore file share](https://cloud.google.com/filestore) is a fully managed network attached storage (NAS) for Compute Engine. Filestore offers compatibility with existing enterprise applications and supports any NFSv3-compatible client.\nFilestore offers [low latency](/filestore/docs/performance) for file operations. For workloads that are latency sensitive, Filestore supports capacity up to 100 TB and throughput of 25 GB per second and 720K IOPS, with minimal variability in performance.\nWith Filestore, you can [mount file shares](/tpu/docs/mount-filestore) on TPU VMs.\n## What's next\n- Learn how to [add a persistent disk to your instance](/compute/docs/disks/add-persistent-disk#create_disk) .\n- Learn how to [connect your instance to a Cloud Storage bucket](/compute/docs/disks/gcs-buckets) .", "guide": "Cloud TPU"}