{"title": "Cloud TPU - Connecting to Cloud Storage Buckets", "url": "https://cloud.google.com/tpu/docs/storage-buckets", "abstract": "# Cloud TPU - Connecting to Cloud Storage Buckets\n# Connecting to Cloud Storage Buckets\nThis page introduces [Cloud Storage](/storage/docs) as an option for storing your machine learning data and training output, and describes how to give your Cloud TPU access to the data objects on Cloud Storage.\n", "content": "## Before you begin\nYou need a Cloud TPU [Service Account](https://cloud.google.com/iam/docs/service-accounts) in order to access a Cloud Storage bucket.\n**Note:** Once you set up a Service Account for your project, it stays set while the project is active; you do not have to set up the Service Account every time you run a training under the same project.\n- Create a Cloud TPU Service Account for your project.```\ngcloud beta services identity create --service tpu.googleapis.com --project $PROJECT_ID\n```The command returns a Cloud TPU Service Account with following format:```\nservice-PROJECT_NUMBER@cloud-tpu.iam.gserviceaccount.com\n``` **Important:** This command creates a [service agent](https://cloud.google.com/iam/docs/service-agents) , a special type of Google-managed service account which is not listed in your Service accounts page on the Google Cloud console.\n- Follow the instructions found in either the [Cloud TPU quickstart guide](/tpu/docs/quickstart) or the [Creating and deleting TPUs document](/tpu/docs/creating-deleting-tpus) to configure your Google Cloud project and create your Cloud TPU VM and TPU resources.## Writing data to Cloud Storage\n**Note:** Set up the Cloud Storage bucket in the same location (region) that you set up the Cloud TPU. See [Create buckets](/storage/docs/creating-buckets) for all options available for managing storage buckets.\n- Go to the Cloud Storage page on the Google Cloud console. [Go to the Cloud Storage page](https://console.cloud.google.com/storage/browser) \n- Create a new bucket, specifying the following options:- A unique name of your choosing.\n- Default storage class:`Standard`\n- Location:`us-central1`- Use the `gsutil mb` command to create a Cloud Storage bucket:```\ngsutil mb -l region gs://bucket-name/\n```where:- is the region where you created the Cloud TPU. For example: `us-central1` . Cloud TPU is available in the following regions:\n| 0        | 1   |\n|:--------------------------------|:------------|\n| Cloud TPU v2 and Preemptible v2 | us-central1 |\n| Cloud TPU v3 and Preemptible v3 | us-central1 |\n| Cloud TPU v4 and Preemptible v4 | us-central2 |\n| Cloud TPU v2 Pod    | us-central1 |\n| Cloud TPU v4 Pod    | us-central2 || 0        | 1   |\n|:--------------------------------|:-------------|\n| Cloud TPU v2 and Preemptible v2 | europe-west4 |\n| Cloud TPU v3 and Preemptible v3 | europe-west4 |\n| Cloud TPU v2 Pod    | europe-west4 |\n| Cloud TPU v3 Pod    | europe-west4 || 0        | 1   |\n|:--------------------------------|:-----------|\n| Cloud TPU v2 and Preemptible v2 | asia-east1 |\n- is the name of the bucket you want to create.\n- Use the `gsutil cp` command to write files to the Cloud Storage bucket:```\ngsutil cp -r local-data-dir gs://bucket-name\n```where is a local path to your data. For example: `$HOME/your-data`## Giving your Cloud TPU access to Cloud Storage\nYou need to give your Cloud TPU read/write access to your Cloud Storage objects. To do that, you must grant the required access to the Cloud TPU Service Account used by the Cloud TPU. Follow these steps to find the Cloud TPU Service Account and grant the necessary access:\n### Authorize the Cloud TPU Service Account\nIf you store training data on Cloud Storage, the Cloud TPU Service Account needs read and write permission on the bucket.\n- Go to the Cloud Storage browser page to view the buckets you own. [Go to the Cloud Storage browser](https://console.cloud.google.com/storage/browser) \n- Select the bucket whose ACL you want to modify.\n- Select the `Permissions` tab.\n- Select `Add` to add a new permission and type the complete Service Account name in the `New Principals` edit box.\n- If you are from this bucket, you must authorize the TPU Service Account to read from the resource. Do this by granting the Service Account the `Storage Legacy > Storage Legacy Bucket Reader` role.\n- If you are to this bucket, you must authorize the TPU Service Account to write to the resource. Do this by granting the Service Account the `Storage Legacy > Storage Legacy Bucket Writer` role.\n- If you are from this bucket, grant read permission for the Cloud TPU Service Account:```\n gsutil acl ch -u tpu-service-account:READER gs://bucket-name\n```\n- If you are to this bucket, grant write permission for the Cloud TPU Service Account:```\n gsutil acl ch -u tpu-service-account:WRITER gs://bucket-name\n```If you want to grant broader permissions instead of whitelisting access to each bucket explicitly, you can grant the Identity Access Management (IAM) Storage Admin role to the Cloud TPU Service Account.\n- Go to the IAM page for your project. [Go to IAM](https://console.cloud.google.com/iam-admin/iam) \n- Click the **+Add** button to add principals to the project.\n- Enter the names of the Cloud TPU Service Account in the **Principals** text box.\n- Click the **Roles** dropdown list.\n- Enable the following roles:- **Project > Viewer** \n- **Storage > Storage Admin** \n### Cloud Storage FUSE\nCloud Storage FUSE allows you to mount and access Cloud Storage buckets as local file systems. This allows applications to read and write objects in your bucket using standard file system semantics.\nSee the [Cloud Storage FUSE documentation](/storage/docs/gcs-fuse) for details about how Cloud Storage FUSE works and a description of how Cloud Storage FUSE operations map to Cloud Storage operations. You can find additional information about how to use Cloud Storage FUSE, such as how to install the gcsfuse CLI and mounting buckets on [GitHub.](https://github.com/GoogleCloudPlatform/gcsfuse/tree/master/docs)\n## What's next\n- For more information about creating Cloud Storage buckets and writing data to those buckets, see the [Cloud Storagedocumentation](/storage/docs/getting-started-gsutil#create) .\n- For more information about Service Accounts, see the [authentication overview](/docs/authentication) .", "guide": "Cloud TPU"}