{"title": "Cloud TPU - Set up the Cloud TPU environment", "url": "https://cloud.google.com/tpu/docs/setup-gcp-account", "abstract": "# Cloud TPU - Set up the Cloud TPU environment\n# Set up the Cloud TPU environment\nBefore you can use Cloud TPU resources to train or run inference on models, you need to do the following set up steps:\n- [Set up your Google Cloud project](#set-up-project) \n- [Set up your environment to use Cloud TPU](#set-up-env) \n- [Prepare to request a Cloud TPU](#prepare-to-request) ", "content": "## Set up your Google Cloud project\nYou must have a Google Cloud account and project to use Cloud TPU.\n- In the [Google Cloud console](https://console.cloud.google.com/) , [sign in](https://accounts.google.com/Login) to your Google Account or [sign up for a new account](https://accounts.google.com/SignUp) .\n- [Install](/sdk/docs/install) the Google Cloud CLI. The Google Cloud CLI is an interface for accessing and managing Google Cloud resources and services. **Note:** If you need to use a particular release of gcloud CLI components, install these components to ensure that relevant commands and flags are supported. For example, for alpha components, run `gcloud components install alpha` . **Note:** If you installed the gcloud CLI previously, make sure you have the latest version by running `gcloud components update` .\n- Select or create a Google Cloud project:In the [Google Cloud console](https://console.cloud.google.com/) , select or create a Cloud project from the project selector.In the Cloud Shell, set your project ID using the gcloud CLI. The project ID is the name of your project shown in the Google Cloud console.```\n$ gcloud config set project PROJECT-ID\n```\n- [Make sure that billing is enabled for your Google Cloud project](/billing/docs/how-to/verify-billing-enabled) .Billing setup is required for all Google Cloud usage. You will only be charged after you start using Google Cloud resources. For more information, see the [Cloud Billing documentation](/billing/docs) .Billing for all Cloud TPU versions usage follows the standard regional pricing shown on the [Cloud TPU pricing page](/tpu/pricing) .## Set up your environment to use Cloud TPU\nBefore requesting a Cloud TPU, you must activate the Cloud TPU API and ensure that you have permissions to manage access in your project and to create a Cloud TPU. It is also recommended that you create a user-managed service account to attach to your TPU.\n- Activate the Cloud TPU API from the Google Cloud console or using the gcloud CLI in the Cloud Shell:\n```\n$ gcloud services enable tpu.googleapis.com\n```- In the Google Cloud console, go to the Cloud TPU API page.\n [Go to the Cloud TPU API page](https://console.cloud.google.com/apis/library/tpu.googleapis.com) - Click **Enable** .- Make sure you have the following roles on your project:- [Service Account Admin](/iam/docs/understanding-roles#iam.serviceAccountAdmin) : Needed to create a service account\n- [Project IAM Admin](/iam/docs/understanding-roles#resourcemanager.projectIamAdmin) : Needed to grant a role in a project\n- [TPU Admin](/iam/docs/understanding-roles#tpu.admin) : Needed to create a TPU\nFollow the instructions in [View current access](/iam/docs/granting-changing-revoking-access#view-access) to view who has access to your project, folder, or organization. To view your own access, in the **Principal** column, find the row that has your email address. If your email address isn't in that column, then you don't have any roles. In the **Role** column for the row with your email address, check whether the list of roles includes the required roles.If you don't have a required role, [grant the role](/iam/docs/granting-changing-revoking-access#grant-single-role) or ask an administrator to do so.\n- Create a TPU service account:Service accounts allow the Cloud TPU service to access other Google Cloud services. A user-managed service account is a recommended Google Cloud practice. Attach a service account to your TPU when you create it using the `--service-account` flag.- Follow the instructions in [Create serviceaccounts](/iam/docs/service-accounts-create) to create a service account.\n- Follow the instructions in [Manage access to projects, folders, and organizations](/iam/docs/granting-changing-revoking-access) to grant your service account access to Google Cloud services that your TPU will access. The following roles are recommended so that your TPU to access commonly-used Google Cloud services.- [TPU Admin](/iam/docs/understanding-roles#tpu.admin) : Needed for full access to TPU resources\n- [Storage Admin](/iam/docs/understanding-roles#storage.admin) : Needed for accessing Cloud Storage\n- [Logs Writer](/iam/docs/understanding-roles#logging.logWriter) : Needed for writing logs with the Logging API\n- [Monitoring Metric Writer](/iam/docs/understanding-roles#monitoring.metricWriter) : Needed for writing metrics to Cloud Monitoring **Note:** If you don't specify a custom service account, your TPU uses the [default Compute Engine service account](/compute/docs/access/service-accounts#default_service_account) .## Prepare to create a Cloud TPU\nBefore creating a Cloud TPU, you must request quota. You should also consider using queued resources, as well as which parameters you want to use to configure your TPU.\n- Request quota:In order to create a Cloud TPU, your Google Cloud project must have quota for the version and size of TPU you want to create and the zone where you want to create it. For example, if you want to create a TPU v4-8 in `us-central2-b` , you would request a quota of 8 TPU v4 cores in `us-central2-b` . For more information about zones where Cloud TPU is available, see [TPU regions and zones](/tpu/docs/regions-zones) .Quota is allocated differently depending on the TPU version. Different types of quota have different availability expectations. For more information about quota allocation, quota types, and how to request quota, see [Quotas](/tpu/docs/quota) .\n- Determine if you want to use [queued resources](/tpu/docs/queued-resources) .Creating a Cloud TPU as a queued resource is a best practice. Queued resources allow you to receive capacity once it becomes available. You can specify an optional start and end time for when the request should be filled.There are different gcloud CLI commands for working with queued resources. For more information, see [Queued resources user guide](/tpu/docs/queued-resources) .\n- Determine Cloud TPU creation parameters:- **Zone** : Set the `--zone` flag to the zone where you want to create a TPU. You must have quota allocated in this zone. For more information, see [TPU regions and zones](/tpu/docs/regions-zones) .\n- **TPU configuration** : If you don't need to specify a custom topology, or you are using TPU v2 or v3, set the `--accelerator-type` flag to `v` `` `-` `` . Replace with the TPU version number you want to use. Replace with the number of TensorCores you want to use.If you want to customize the physical topology of your TPU, use the `--version` and `--topology` flags. Set the `--version` flag to the TPU version you want to use. Set the `--topology` flag to the topology you want to use.For more information about TPU configurations, including supported configurations and topology variants, see [TPU configurations](/tpu/docs/supported-tpu-configurations) .\n- **Software version** : If you are requesting a queued resource, set the `--runtime-version` flag to the name of the software version you want to use. Otherwise, use the `--version` flag. TPU software versions are available for TensorFlow, PyTorch, and JAX frameworks. For more information about supported software versions, see [TPU VM software versions](/tpu/docs/supported-tpu-configurations#tpu-vm-versions) .\n- **Service account** : Set `--service-account` to the email address of a service account, if you created one, to attach the service account to your TPU. If empty, the [default Compute Engine service account](/compute/docs/access/service-accounts#default_service_account) will be used.\n- **Quota type** : If you want to create a TPU using reserved quota, add the `--reserved` flag to your request.If you want to create a TPU using preemptible quota, and you are requesting a queued resource, add the `--best-effort` flag to your request.If you want to create a TPU using preemptible quota, and you aren't requesting a queued resource, add the `--preemptible` flag to your request.If you want to create a TPU using on-demand quota, you don't need to add any additional flags.\n- **Advanced configuration** : You can add additional flags to your request to configure your TPU. See the [gcloud compute tpus tpu-vm create documentation](/sdk/gcloud/reference/compute/tpus/tpu-vm/create) and the following sections in [Manage TPUs](/tpu/docs/managing-tpus-tpu-vm) for more information:- [Run a startup script](/tpu/docs/managing-tpus-tpu-vm#startup-scripts) \n- [Use custom network resources](/tpu/docs/managing-tpus-tpu-vm#custom-network-resources) \n- [Specify a network](/tpu/docs/managing-tpus-tpu-vm#network) \n- [Specify a subnetwork](/tpu/docs/managing-tpus-tpu-vm#subnetwork) \n- [Make IP addresses internal](/tpu/docs/managing-tpus-tpu-vm#private-google-access) \n- [Set an allocation interval for a queued resource request](/tpu/docs/queued-resources#request-queued-specified-time) \nFor examples of how to create a Cloud TPU, see [Get started](/tpu/docs/quick-starts) .\n## What's next\n- Learn how to create and manage [VM and TPU resources](/tpu/docs/managing-tpus-tpu-vm) \n- Run a [Cloud TPU quickstart](/tpu/docs/quick-starts)", "guide": "Cloud TPU"}