{"title": "Cloud TPU - Connect to a TPU VM without a public IP address", "url": "https://cloud.google.com/tpu/docs/tpu-iap", "abstract": "# Cloud TPU - Connect to a TPU VM without a public IP address\n# Connect to a TPU VM without a public IP address\nIf your organization has a `constraints/compute.vmExternalIpAccess` organization policy constraint, you need to create TPU VMs that do not have an external IP address. To connect to a TPU VM without an external IP address, you need to:\n- Enable [Private Google Access](/vpc/docs/private-google-access) for the subnet where you will create a TPU VM.\n- Grant`roles/iap.tunnelResourceAccessor`and`roles/tpu.admin`to users who will connect to the TPU VMs.\n- Create a TPU VM without a public IP address.\n- SSH into your TPU VM using`--tunnel-through-iap`.", "content": "## Enable Private Service Access\nTo use an IAP, you must enable Private Google Access which allows you to connect to VMs that do not have external IP addresses. In the following command replace with the name of the subnet where you will create the TPU VM and with the region where the TPU VM will be located.\n```\ngcloud compute networks subnets update your-subnet \\--region=your-region \\--enable-private-ip-google-access\n```\n## Grant permissions\nUsers that need to SSH into TPU VMs that do not have public IP addresses must be granted the iap.tunnelResourceAccessor role. For more information about granting a role, see [Granting an IAM Role](/iam/docs/granting-changing-revoking-access#grant-single-role) .\n## Create a TPU VM without a public IP address\nThe following command shows how to create a TPU VM with no public IP address.\n```\ngcloud compute tpus tpu-vm create tpu-vm-name \\  --zone $ZONE \\  --project your-project \\  --internal-ips \\  --version tpu-vm-tf-2.16.1-pjrt \\  --accelerator-type v2-8 \\  --subnetwork your-subnet \\\n```\n## SSH into your TPU VM using IAP tunneling\nThe following command shows how to SSH into a TPU VM using IAP tunneling.\n```\ngcloud alpha compute tpus tpu-vm ssh tpu-vm-name --tunnel-through-iap\n```", "guide": "Cloud TPU"}