{"title": "Cloud TPU - Cloud TPU Error Glossary", "url": "https://cloud.google.com/tpu/docs/troubleshooting/error_glossary", "abstract": "# Cloud TPU - Cloud TPU Error Glossary\n# Cloud TPU Error Glossary\nThis document provides a glossary of common errors with solutions from the Cloud TPU service.\n", "content": "## Invalid Accelerator Type\n### Error Message\n```\ngeneric::invalid_argument: Accelerator type v2-512 as preemptible (false) and\nreserved (false) is not available in zone us-central1-a, please contact support.\n```\n### Solution\nAn invalid parameter has been provided to the create command. The availability of an accelerator in a zone depends on 3 parameters: the type, the preemptible flag, and the reserved flag. The preemptible and reserved flags can be changed by including/excluding them in the create command.\nA TPU created with the reserved flag will use reserved capacity. Including the preemptible flag will allow the TPU to be preempted by higher priority TPUs. If neither is provided, the TPU will be on demand. It is not a valid configuration to enable both flags. See the [create command documentation](https://cloud.google.com/sdk/gcloud/reference/alpha/compute/tpus/create) for more information.\nThe accelerator types available in each zone can be found in the [TPU regions and zones documentation](https://cloud.google.com/tpu/docs/regions-zones) or they can be queried using the [accelerator-types list command](https://cloud.google.com/sdk/gcloud/reference/alpha/compute/tpus/accelerator-types/list) . Change the create command to use one of these accelerator types and try again or contact support if the problem persists.\n## Network Not Found\n### Error Message\n```\n Cloud TPU received a bad request. The field \"Network\" cannot be \"xxxx\":\n requested resource not found\n```\n### Solution\nThe Network xxxx was not found. Ensure that the Network was created and set up properly. See [https://cloud.google.com/vpc/docs/create-modify-vpc-networks](https://cloud.google.com/vpc/docs/create-modify-vpc-networks) for more information.\n## Service Account Permission Denied\n### Error Message\n```\n generic::permission_denied: Cloud TPU got permissions denied when trying to\n access the customer project. Make sure that the IAM account\n 'service-[project number]@cloud-tpu.iam.gserviceaccount.com' has the 'Cloud\n TPU API Service Agent' role by following https://cloud.google.com/iam/docs/manage-access-service-accounts\n```\n### Solution\nThis error occurs when a user attempts to create or list nodes in a project without IAM authorization. A likely cause of this issue is that the Cloud TPU API service account does not have the required role for the project. The [Manage access accounts documentation](https://cloud.google.com/iam/docs/manage-access-service-accounts) gives an overview of how to manage access. Follow the [Grant or revoke a single role](https://cloud.google.com/iam/docs/manage-access-service-accounts#single-role) steps and give the account 'service- `` @cloud-tpu.iam.gserviceaccount.com' the role of 'Cloud TPU API Service Agent' (be sure to replace `` with your project number, which can be found in the project settings in the Google Cloud console). For more information on service agents, see the [Service agents documentation](https://cloud.google.com/iam/docs/service-agents) .\n## Quota Exceeded\n### Error Message\n```\nYou have reached XXXX limit. Please request an increase for the 'YYYY' quota for\nCompute Engine API by following https://cloud.google.com/docs/quotas/view-manage#requesting_higher_quota.\n```\n### Solution\nYour project has reached a quota limit. To learn more about working with quotas, see [https://cloud.google.com/docs/quota](https://cloud.google.com/docs/quota) . This should not be confused with the [TPU quota](https://cloud.google.com/tpu/docs/quota) , which governs the usage of TPU pods.\nYou may request an increase to the appropriate limit by following the steps listed at [https://cloud.google.com/docs/quota_detail/view_manage#requesting_higher_quota](https://cloud.google.com/docs/quota_detail/view_manage#requesting_higher_quota) . On the quotas page, you may search for the quota specified by the 'YYYY' part of this message. Some quotas are split across different regions or services. The error message will indicate which one needs to be increased.\nThe 'XXXX' and 'YYYY' parts of the message may be one of the following: * HEALTH_CHECKS - 'Health checks' quota * FIREWALLS - 'Firewall rules' quota * NETWORK_ENDPOINT_GROUPS - 'Network endpoint groups' quota for this region * READ_REQUESTS - 'Read requests per minute' quota for the Compute Engine API service * OPERATION_READ_REQUESTS - 'Operation read requests per minute' quota\nThis request is typically processed within 2-3 business days. If the request is urgent, please reach out to a customer engineer or technical account manager.", "guide": "Cloud TPU"}