{"title": "Cloud TPU - Mount a Filestore instance to Cloud TPU VMs", "url": "https://cloud.google.com/tpu/docs/mount-filestore", "abstract": "# Cloud TPU - Mount a Filestore instance to Cloud TPU VMs\n# Mount a Filestore instance to \nCloud TPU VMs\nFilestore is a fully managed network attached storage (NAS) for Compute Engine. Filestore offers native compatibility with existing enterprise applications and supports any NFSv3-compatible client.\n", "content": "## Before you begin\nIn order to mount a Filestore instance on your Cloud TPU VM, you need to add a Filestore role (Cloud Filestore Editor or Cloud Filestore Viewer) to the service account associated with your Cloud TPU VM. If you don't specify a custom service account when you create a Cloud TPU VM, your Cloud TPU VM uses the default Compute Engine service account. For more information about how to specify a service account when creating a Cloud TPU VM, see [Set up the Cloud TPU environment](/tpu/docs/setup-gcp-account#prepare-to-request) . For more information about how to create a service account, see [Create service accounts](/iam/docs/service-accounts-create) .\n### Add the Filestore Editor role to a service account\nThe following instructions show you how to add the Cloud Filestore Editor role to the Compute Engine default service account. You can follow these instructions to add the Cloud Filestore Editor role to any service account. You can search and use a custom service account instead of the Compute Engine default service account in step 2.\n- Open the [IAM console](https://console.cloud.google.com/iam-admin/iam) .\n- Select the **View by principals** tab and type `Name:Compute Engine default service account` in the **Filter** field.\n- Click edit next to the service account. The IAM console displays a dialog listing the roles assigned to the Compute Engine default service account.\n- Click add to add another role.\n- Expand the **Select a role** drop down menu, type `Filestore` in the filter, and select **Cloud Filestore editor** .\n- Click **Save** to dismiss the dialog. You have added the Filestore Editor role to the Compute Engine default service account.\nFor more information about service accounts, see [Service Account Overview](/iam/docs/service-account-overview) . To learn more about IAM roles, see [Roles and permissions](/iam/docs/roles-overview) .\n### Create a Filestore instance\nCreate a Filestore instance using the instructions found in [Creating Filestore instances](/filestore/docs/creating-instances) .\n## Mount a Filestore instance on a Cloud TPU VM\nThe commands you use to mount a Filestore instance on a Cloud TPU depends on whether you are using a single Cloud TPU or a Cloud TPU Pod slice.\n### Mount a Filestore instance on a single Cloud TPU VM\n- Connect to your Cloud TPU VM using SSH.```\n      gcloud compute tpus tpu-vm ssh your-tpu-name \\        --zone=your-zone    \n```\n- Install the`nfs-common`package.```\n      sudo apt-get update --allow-releaseinfo-change \\        && sudo apt-get -y update \\        && sudo apt-get -y install nfs-common    \n```\n- Create a directory in which to mount NFS```\n      sudo mkdir -p mount-dir \\        && sudo chmod ugo+rw mount-dir    \n```\n- Find the IP address of the Filestore.```\n      gcloud filestore instances describe filestore-instance-name \\         --region filestore-region    \n```\n- Mount Filestore instance on your Cloud TPU VM onto your mount directory.```\n      sudo mount filestore-ip:file-share-name mount-dir-name    \n```\n### Mount a Filestore instance on a Cloud TPU Pod slice\nCloud TPU Pod slices are composed of 2 or more Cloud TPU VMs. The following commands use the `gcloud compute tpus tpu-vm ssh` command with the `--worker=all` and `--command` flags to run the commands on all Cloud TPU VMs at one time.\n- Install the`nfs-common`package on all Cloud TPU VMs in  your Pod slice.```\n        gcloud compute tpus tpu-vm ssh your-tpu-name \\          --project=your-gcp-project \\          --zone=your-zone \\          --worker=all \\          --command=\"sudo apt-get update --allow-releaseinfo-change && sudo apt-get -y update && sudo apt-get -y install nfs-common\"      \n```\n- Create a directory in which to mount the Filestore instance.  Replace`mount-dir-name`with a directory name of your choice.```\n      gcloud compute tpus tpu-vm ssh your-tpu-name \\        --project=your-gcp-project \\          --zone=your-zone \\          --worker=all \\          --command=\"sudo mkdir -p mount-dir-name && sudo chmod ugo+rw mount-dir-name\"      \n```\n- Find the IP address of the Filestore instance.```\n      gcloud filestore instances describe filestore-instance-name \\         --region filestore-region    \n```\n- Mount Filestore instance on your Cloud TPU VM. Replace the  following:```\n      sudo mount filestore-ip:file-share-name mount-dir    \n```## Writing data to Filestore instance\nMake sure you grant Linux read and write permissions on the directory in which you mount the Filestore instance. You can use the directory as you would your local file system.", "guide": "Cloud TPU"}