{"title": "Google Kubernetes Engine (GKE) - GKE editions", "url": "https://cloud.google.com/kubernetes-engine/docs/concepts/gke-editions", "abstract": "# Google Kubernetes Engine (GKE) - GKE editions\nGoogle Kubernetes Engine (GKE) is Google's managed [Kubernetes](https://kubernetes.io/) service that you can use to deploy and operate containerized applications using Google's infrastructure. It provides the operational power of Kubernetes while managing many of the underlying components, such as the control plane and nodes, for you.\nGKE features are available in two tiers, or editions: a [standard tier of core functionality](/kubernetes-engine/docs/concepts/kubernetes-engine-overview) available to all GKE users, and an enterprise tier that brings all the capabilities of Anthos to GKE, with an integrated user interface and powerful features for governing, managing, and operating containerized workloads at enterprise scale.\n", "content": "## Why GKE Enterprise?\nTypically, as organizations embrace cloud-native technologies like containers, container orchestration, and service meshes, they reach a point where running a single cluster is no longer sufficient. There are a variety of reasons why organizations choose to deploy multiple clusters to achieve their technical and business objectives. Some examples include separating production from non-production environments, complying with varying regulatory restrictions, or organizing services across tiers, locales, or teams. However, using multiple clusters has its own difficulties and overhead in terms of consistent configuration, security, and management - for example, manually configuring one cluster at a time is error-prone, and it can be challenging to see exactly where these errors are happening. Large enterprises are also often organizationally complex, with multiple teams needing to run, observe, and manage their workloads across multiple clusters.\nGoogle Cloud has already helped organizations solve problems like this with **Anthos** - a container platform that provides a range of features for working at enterprise scale. This platform was built around the idea of the , a logical grouping of Kubernetes clusters that can be managed together and benefit from sameness of namespaces, services, and/or identity across the clusters.\nThe principles of trust and sameness that are assumed within the fleet enable you to use a whole range of fleet-enabled features, including:\n- Configuration and policy management tools that help you work more easily at scale, automatically adding and updating the same configuration, features, and security policies consistently across your fleet.\n- Fleet-wide networking features that help you manage traffic across your entire fleet, including Multi Cluster Ingress for applications that span multiple clusters, and service mesh traffic management features.\n- Identity management features that help you consistently configure authentication for fleet workloads and users.\n- Observability features that let you monitor and troubleshoot your fleet clusters and applications, including their health, resource utilization, and security posture.\n- For microservice-based applications running in your fleet, Service Mesh provides powerful tools for application security, networking, and observability across your mesh.\n**GKE Enterprise brings these capabilities fully intoGKE** , creating an integrated container platform that makes it even easier for organizations to adopt best practices and principles that we've learned from running services at Google.\nGKE Enterprise also brings powerful new team management features. It's now simpler for platform admins to provision fleet resources for multiple teams, and give application teams their own dashboards and metrics, all scoped to their own resources and workloads.\nFor a full description of the features that power GKE Enterprise, and to find out more about whether GKE Enterprise is for you, see the [GKE Enterprise technical overview](/anthos/docs/concepts/overview) .\n## Edition features\nThe following table provides an overview of the features included in each GKE tier. For full details of available GKE Enterprise features, including enterprise features that can also be purchased without a full upgrade to GKE Enterprise, see [Deployment options](/anthos/deployment-options) .\n| Unnamed: 0    | GKE Standard edition                                                                            | GKE Enterprise edition                                                                                                                                                               |\n|:------------------------|:------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|:---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| nan      | Unmatched single-cluster scalability – up to 15,000 nodes – optimized for enterprise workloads, including database and batch processing.                                               | An integrated fully managed container platform to securely run modern applications at scale.                                                                                                                                              |\n| Features and components | Fully automated cluster lifecycle management including upgrades and backup/restore on Google Cloud Fully supported Kubernetes distributions Pod and cluster autoscaling Serverless Kubernetes experience on Autopilot Cost visibility and automated infrastructure cost optimization Automated tools for easily migrating workloads | Fully automated cluster lifecycle management including upgrades and backup/restore on Google Cloud Fully supported Kubernetes distributions Pod and cluster autoscaling Serverless Kubernetes experience on Autopilot Cost visibility and automated infrastructure cost optimization Automated tools for easily migrating workloads Managed GitOps-based configuration management Managed Service Mesh Managed Policy Controller Fleet-based team management GKE on Google Distributed Cloud, GKE on AWS and Azure Multi Cluster Ingress Multi-network support for Pods Binary Authorization Advanced vulnerability insights Connect Gateway Best practice observability metrics |\n## What's next\n- Find out how to enable GKE Enterprise for your project in [Enable GKE Enterprise](/kubernetes-engine/docs/how-to/enable-gkee) .", "guide": "Google Kubernetes Engine (GKE)"}