{"title": "Google Kubernetes Engine (GKE) - Troubleshooting Arm workloads", "url": "https://cloud.google.com/kubernetes-engine/docs/troubleshooting/arm-workloads", "abstract": "# Google Kubernetes Engine (GKE) - Troubleshooting Arm workloads\nThis page shows you how to resolve issues with Arm workloads deployed on your Google Kubernetes Engine (GKE) Autopilot or Standard clusters.\n[Cloud Customer Care](/kubernetes-engine/docs/getting-support)\n", "content": "## Pods on Arm nodes crashing\nThe following issue occurs when you deploy a Pod on an Arm node, but the container image isn't built for Arm architecture.\nTo identify the issue, do the following:\n- Get the status of your Pods:```\nkubectl get pods\n```\n- Get the logs for a crashing Pod:```\nkubectl logs POD_NAME\n```Replace `` with the name of the crashing Pod.The error message in your Pod logs is similar to the following:```\nexec ./hello-app: exec format error\n```\nTo resolve this issue, ensure that your container image supports Arm architecture. As a best practice, [build multiple architecture images](/kubernetes-engine/docs/how-to/build-multi-arch-for-arm) .\n## Pod doesn't trigger scale-up\n**Applies to:** Autopilot\nThe following issue occurs in Autopilot clusters when you attempt to deploy Arm workloads on unsupported GKE versions or unsupported Google Cloud regions.\nTo identify the issue, get your cluster event log:\n```\nkubectl get events -w\n```\nThe output is similar to the following:\n```\n117s  Normal NotTriggerScaleUp pod/hello-app2-78fc858558-pg4hz pod didn't trigger scale-up (it wouldn't fit if a new node is added): 2 node(s) didn't match Pod's node affinity/selector\n```\nTo resolve this issue, ensure that your Autopilot cluster is running GKE version 1.24.1-gke.1400 or later, and that the Google Cloud region supports Arm nodes.\n## Pods stuck in Pending state\n**Applies to:** Autopilot\nThe following issue occurs when you attempt to deploy Autopilot Pods on Arm architecture but your Google Cloud project is out of quota.\nTo identify the issue, get the event log for your cluster:\n```\nkubectl get events -w\n```\nThe output is similar to the following:\n```\n29m   Warning FailedScaleUp  pod/hello-app-7b86c88cb8-8vt2k Node scale up in zones asia-southeast1-b associated with this pod failed: GCE quota exceeded. Pod is at risk of not being scheduled.\n```\nThis event might not appear in your log as soon as you deploy your Pods.\nTo resolve this issue, try to [request a quota increase](/docs/quotas/view-manage#requesting_higher_quota) .\n## What's next\n[Cloud Customer Care](/kubernetes-engine/docs/getting-support)", "guide": "Google Kubernetes Engine (GKE)"}