{"title": "Google Kubernetes Engine (GKE) - View cost-related optimization metrics", "url": "https://cloud.google.com/kubernetes-engine/docs/how-to/cost-optimization-metrics", "abstract": "# Google Kubernetes Engine (GKE) - View cost-related optimization metrics\nThis page shows you how to view cost-related utilization metrics for your Google Kubernetes Engine (GKE) clusters. These metrics describe how effectively your GKE clusters and workloads are utilizing the Compute Engine resources you pay for.\nYou can use this information to optimize the cost-to-performance ratio of your clusters and workloads.\n", "content": "## Cost optimization metrics\nIn the **Cost Optimization** tab in the Google Cloud console, you can view the following metrics for your clusters and workloads:\n- **CPU utilization:** Displays a bar chart that shows the relationship between the following CPU metrics:- **Used** : The amount of CPU used by all containers in the cluster or workload. Calculated from the [container/cpu/core_usage_time](/monitoring/api/metrics_kubernetes#kubernetes/container/cpu/core_usage_time) metric.\n- **Requested** : The amount of CPU requested by all containers in the cluster or workload. Calculated from the [container/cpu/request_cores](/monitoring/api/metrics_kubernetes#kubernetes/container/cpu/request_cores) metric.\n- **Allocatable** : The amount of CPU allocated to all nodes in the cluster. This metric is shown on the Clusters page. Calculated from the [node/cpu/allocatable_cores](/monitoring/api/metrics_kubernetes#kubernetes/node/cpu/allocatable_cores) metric. For Autopilot clusters, there is no allocatable value because Google automatically adjusts CPU allocations.\n- **Limit** : The CPU limit for all containers in a workload. This metric is shown on the Workloads page. Calculated from the [container/cpu/limit_cores](/monitoring/api/metrics_kubernetes#kubernetes/container/cpu/limit_cores) metric.\n- **CPU hours** : The total number of core hours on all nodes in a workload or cluster within the selected timeframe. Calculated from the [node/cpu/total_cores](/monitoring/api/metrics_kubernetes#kubernetes/node/cpu/total_cores) metric (for Standard clusters) and the [container/cpu/request_cores](/monitoring/api/metrics_kubernetes#kubernetes/container/cpu/request_cores) metric (for Autopilot clusters and workloads).\n- **Memory utilization** : Displays a bar chart that shows the relationship between the following memory metrics:- **Used** : The amount of memory used by all containers in a cluster or workload. Calculated from the [container/memory/used_bytes](/monitoring/api/metrics_kubernetes#kubernetes/container/memory/used_bytes) metric.\n- **Requested** : The amount of memory requested for all containers in a cluster or workload. Calculated from the [container/memory/request_bytes](/monitoring/api/metrics_kubernetes#kubernetes/container/memory/request_bytes) metric.\n- **Allocatable** : The amount of memory allocated to all nodes in the cluster. This metric is shown on the Clusters page. Calculated from the [node/memory/allocatable_bytes](/monitoring/api/metrics_kubernetes#kubernetes/node/memory/allocatable_bytes) metric. For Autopilot clusters, there is no allocatable value because Google automatically adjusts memory allocations.\n- **Limit** : The memory limit for all containers in a workload. This metric is shown on the Workloads page. Calculated from the [container/memory/limit_bytes](/monitoring/api/metrics_kubernetes#kubernetes/container/memory/limit_bytes) metric.\n- **Memory hours** : The total amount of memory on all nodes in a workload or cluster within the selected timeframe. Calculated from the [node/memory/total_bytes](/monitoring/api/metrics_kubernetes#kubernetes/node/memory/total_bytes) metric (for clusters) and the [container/memory/requested_bytes](/monitoring/api/metrics_kubernetes#kubernetes/container/memory/requested_bytes) metric (for Autopilot clusters and workloads).## View the metrics\nTo view cost-related utilization metrics, perform the following steps in the Google Cloud console :\n- To see cluster-level metrics, go to the **Kubernetes Clusters** page. [Go to Kubernetes Clusters](https://console.cloud.google.com/kubernetes/list) To see workload-level metrics, go to the **Workloads** page. [Go to Workloads](https://console.cloud.google.com/kubernetes/workload) \n- Select the **Cost Optimization** tab.\n- Choose the timeframe over which the metrics are averaged (utilization) or accumulated (total hours). For example, 1 day, 1 month, and more. If the lifetime of the cluster or workload is less than the selected timeframe, metrics accumulated for the lifetime of cluster or workload displays. For example, you choose a timeframe of 1 day but the workload was created only 4 hours ago, so only 4 hours of metrics are displayed.\n- Hold the pointer over the utilization metric to see further details.\nCost optimization metrics will display for cluster modes as follows:\n- Standard clusters will always have used, requested and allocatable metrics visible at creation time due to the inclusion of managed GKE components in the overall calculation (kube-system namespace).\n- Autopilot clusters only display metrics when you deploy workloads with specified requests to the cluster. This is due to the [Autopilot pricing](/kubernetes-engine/pricing#autopilot_mode) model. Autopilot clusters don't show allocatable metrics because you only pay for resources requested by your running workloads.\nWorkloads deployed to Standard clusters that don't have requests or limits specified, won't show a ratio on the chart. Instead, the bar chart will represent just the workload usage metric.\nWorkloads deployed to Autopilot clusters that don't have requests or limits specified, will have [default](/kubernetes-engine/docs/concepts/autopilot-overview#default_container_resource_requests) values applied to the containers, and will show the ratios at all times.\n## What's next\n- Learn about [Best practices for running cost-optimized applications on GKE](/architecture/best-practices-for-running-cost-effective-kubernetes-applications-on-gke) .\n- Read the [Create a cost-optimized cluster in just a few clicks](/blog/products/containers-kubernetes/gke-setup-guide-automates-creation-of-cost-optimized-cluster) blog post.\n- Learn how to [view observability metrics](/kubernetes-engine/docs/how-to/view-observability-metrics) .", "guide": "Google Kubernetes Engine (GKE)"}