{"title": "Google Kubernetes Engine (GKE) - Deprecated authentication plugin for Kubernetes clients", "url": "https://cloud.google.com/kubernetes-engine/docs/deprecations/auth-plugin", "abstract": "# Google Kubernetes Engine (GKE) - Deprecated authentication plugin for Kubernetes clients\nIn Kubernetes version 1.22, the Kubernetes project deprecated the built-in authentication mechanism used by clients such as the `kubectl` command-line tool to access the Kubernetes API server. The built-in authentication mechanism is scheduled for removal in Kubernetes 1.26. For context, refer to [GitHub PR 102181](https://github.com/kubernetes/kubernetes/pull/102181) .\nThe removal doesn't affect operators that are deployed in the cluster and use Kubernetes service accounts to communicate with the API server.\n", "content": "## What should you do?\nGKE released an updated authentication plugin, `gke-gcloud-auth-plugin` . This plugin uses the [client-go Credential Plugins](https://kubernetes.io/docs/reference/access-authn-authz/authentication/#client-go-credential-plugins) framework to provide authentication tokens to communicate with GKE clusters.\nYou must install the plugin before you update your command-line clients to version 1.26 and later. If you don't install the plugin, you'll notice an error message similar to the following.\nFor instructions, refer to [Install required plugins](/kubernetes-engine/docs/how-to/cluster-access-for-kubectl#install_plugin) .\n### Example error: No auth provider found\n```\nUnable to connect to the server: getting credentials: exec: executable gke-gcloud-auth-plugin not found\npanic: no Auth Provider found for name gcp\n```\n### Example error: Executable gke-cloud-auth-plugin not found\n```\nUnable to connect to the server: getting credentials: exec: executable gke-gcloud-auth-plugin not found\nIt looks like you are trying to use a client-go credential plugin that is not installed.\nTo learn more about this feature, consult the documentation available at:\n  https://kubernetes.io/docs/reference/access-authn-authz/authentication/#client-go-credential-plugins\nInstall gke-gcloud-auth-plugin for use with kubectl by following \\\nhttps://cloud.google.com/blog/products/containers-kubernetes/kubectl-auth-changes-in-gke.\n```", "guide": "Google Kubernetes Engine (GKE)"}