{"title": "Google Kubernetes Engine (GKE) - Migrate workloads to GKE", "url": "https://cloud.google.com/kubernetes-engine/docs/concepts/migrate-workloads", "abstract": "# Google Kubernetes Engine (GKE) - Migrate workloads to GKE\nThis page lists resources to show you how to migrate your containerized applications to Google Kubernetes Engine (GKE).\nGKE provides a managed environment for deploying, managing, and scaling your containerized applications using Google Cloud infrastructure.\nGKE works with containerized applications. These are applications packaged into platform independent, isolated user-space instances, for example by using [Docker](https://www.docker.com/) .\nFor more information about migrating your containerized workloads to GKE, refer to following documents:\n- Use [Migrate containers to Google Cloud: Migrate Kubernetes to GKE](/architecture/migrating-containers-kubernetes-gke) to learn how to migrate from a self-managed Kubernetes environment to GKE.\n- Use [Migrate containers to Google Cloud: Migrate to a multi-cluster GKE environment](/architecture/migrating-containers-multi-cluster-gke) to learn how to migrate from a single-cluster GKE environment to a multi-cluster GKE environment.\n- [Migrate containers to Google Cloud: Migrate to a multi-cluster GKE environment with Multi Cluster Ingress and Multi-Cluster Service Discovery](/architecture/migrating-containers-multi-cluster-gke-ingress-services) to learn how to migrate from a single-cluster GKE environment to a multi-cluster GKE environment with minimal downtime using Multi Cluster Ingress and Multi-Cluster Service Discovery.", "content": "## Migrate for GKE\n[Migrate for GKE](/migrate/anthos/docs) is a tool to containerize existing VM-based applications to run on GKE. By taking advantage of the GKE ecosystems, Migrate for GKE provides a fast and simple way to modernized orchestration and application management without requiring access to source code or rewriting and re-architecting applications.\n### Migrate for GKE migration sources\nUse Migrate for GKE to containerize Linux and Windows VMs running on VMware, AWS, Azure, or [Compute Engine](/compute) .\nMigrate for GKE provides tools to help you determine the workload's for migration to a container. These tools output a report describing the analysis results for the VM, including a list of any issues that must be resolved before migration, and an overall fit assessment.\nFor more information, see [Using the fit assessment tool](/migrate/anthos/docs/fit-assessment)\n### Get an introduction to key Migrate for GKE concepts\nFor an introduction to the value of Migrate for GKE, as well as high-level overviews, see the following topics:\n- Open the [Migrate for GKE page](https://console.cloud.google.com/kubernetes/migrate/migrations) in the Google Cloud console.\n- Watch a set of [videos](https://www.youtube.com/playlist?list=PLIivdWyY5sqLbI6lgiwBLI6OJ94X7AjNW) that demonstrate how you can easily migrate and containerize your application.\n- For the benefits of migrating to GKE with Migrate and GKE, see [Benefits of Migrate for GKE](/migrate/anthos/docs/anthos-migrate-benefits) .\n- For more on how Migrate for GKE performs migrations, see [Architecture](/migrate/anthos/docs/architecture) .\n### Get started with a quickstart\nUse this [quickstart](/migrate/anthos/docs/migrate-vm) to migrate a simple Compute Engine VM. This introduces you to the basic steps you'd perform for most Linux migrations.\n### Complete the migration tutorial for a service and database\nUse the [Migrating a monolith VM tutorial](/migrate/anthos/docs/migrating-monolith-vm-overview-setup) , to learn how to move a service and its database from a VM to a GKE environment, with no code changes. The sample application used is [Bank of Anthos](https://github.com/GoogleCloudPlatform/bank-of-anthos) , a simulation of a retail banking service, complete with its own transaction processing network and databases.\n### What's next\n- Use [Migrating VMs to containers with Migrate to Containers](/architecture/migrating-vms-to-containers-with-migrate-for-anthos) to learn how to design and implement a migration plan for VM-based workloads to containers.\n- [Migrate for GKE product overview](/migrate/anthos) \n- [Migrate for GKE documentation](/migrate/anthos/docs)", "guide": "Google Kubernetes Engine (GKE)"}