{"title": "Google Kubernetes Engine (GKE) - Enabling and configuring OS Login in GKE", "url": "https://cloud.google.com/kubernetes-engine/docs/how-to/enable-oslogin", "abstract": "# Google Kubernetes Engine (GKE) - Enabling and configuring OS Login in GKE\nThis page documents how to enable [OS Login](/compute/docs/oslogin) and configure an organization policy to enforce OS Login for private GKE Standard mode clusters and nodes. OS Login isn't available for GKE Autopilot mode clusters because GKE manages the nodes.\nTo learn about the OS Login Service, see the [Compute Engine documentation on OS Login](/compute/docs/oslogin) .\n", "content": "## Overview\nYou can set up an [OS Login](/compute/docs/oslogin) constraint in your organization to ensure that all new projects, and the VM instances created in these new projects, have OS Login enabled. OS Login has quickly become a Google Cloud security best practice, recommending that you enforce its use through an [organization policy](/compute/docs/oslogin/manage-oslogin-in-an-org#set-org-policy) .\nThe following instructions detail how to enable OS Login using an organization policy in GKE.\n## Before you begin\nBefore you start, make sure you have performed the following tasks:\n- Enable    the Google Kubernetes Engine API.\n- [    Enable Google Kubernetes Engine API   ](https://console.cloud.google.com/flows/enableapi?apiid=container.googleapis.com) \n- If you want to use the Google Cloud CLI for this task, [install](/sdk/docs/install) and then [initialize](/sdk/docs/initializing) the  gcloud CLI. If you previously installed the gcloud CLI, get the latest  version by running`gcloud components update`. **Note:** For existing gcloud CLI  installations, make sure to set the`compute/region`and`compute/zone` [properties](/sdk/docs/properties#setting_properties) . By setting default locations,  you can avoid errors in gcloud CLI like the following:`One of [--zone, --region] must be supplied: Please specify location`.## Update existing projects to use OS Login\nBefore setting the organization policy, migrate any existing private clusters to use OS Login.\n- Update the version in all node pools in a project to a supported version:```\ngcloud container clusters upgrade CLUSTER_NAME \\    --node-pool=NODE_POOL_NAME \\    --cluster-version VERSION\n```Replace the following:- ``: the name of your existing cluster.\n- ``: the name of the node pool.\n- ``: A version compatible with OS Login, which can be versions 1.20.5 or later.\n- Enable OS Login on all existing and new VM instances by default by setting the `enable-oslogin` flag to `TRUE` . You do not need to reboot the node.```\ngcloud compute project-info add-metadata --metadata enable-oslogin=TRUE\n``` **Caution:** Enabling OS Login on instances disables metadata-based SSH key configurations on those instances. Disabling OS Login restores SSH keys that you have [configured in project or instance metadata](/compute/docs/connect/add-ssh-keys#metadata) .## Set the OS Login organization policy\nTo set the OS Login constraint at the organization level, perform the following:\n- Find your organization ID by running the following command:```\ngcloud organizations list\n```\n- Set the OS Login organization policy. Replace `` with your organization ID.```\ngcloud resource-manager org-policies enable-enforce \\    compute.requireOsLogin \\    --organization=ORGANIZATION_ID\n```\nAfter the organization policy is set, the following conditions are applied:\n- `enable-oslogin`is set to`true`in the project metadata for all new projects.\n- Update requests to set`enable-oslogin`to`false`in instance or project metadata are rejected.\n**Important:** Once you set the OS Login organization policy, unsupported clusters (old node pool versions or public clusters) in the organization will no longer be able to create new nodes. You can choose to [exclude those projects fromenforcement](/resource-manager/docs/organization-policy/creating-managing-policies#boolean_constraints) .\n## Managing node access\nOnce you have enabled the OS Login organization policy, you no longer need to manage SSH keys to make authorization decisions. OS Login moves authorization management to Identity and Access Management. To manage SSH access to nodes, use OS Login. For more details, see [Setting up OS Login](/compute/docs/instances/managing-instance-access) .\n## What's next\n- Learn about the [OS Login service](/compute/docs/oslogin) .\n- Learn to [troubleshoot OS Login](/compute/docs/oslogin/troubleshoot-os-login) .", "guide": "Google Kubernetes Engine (GKE)"}