{"title": "Google Kubernetes Engine (GKE) - Isolate the Agones controller in your GKE cluster", "url": "https://cloud.google.com/kubernetes-engine/docs/how-to/isolate-agones-controller-gke", "abstract": "# Google Kubernetes Engine (GKE) - Isolate the Agones controller in your GKE cluster\n[Agones](https://agones.dev/site/docs/overview/) is an open source library for hosting, running, and scaling dedicated game servers on Kubernetes. When you run a production deployment of Agones in your Google Kubernetes Engine (GKE) cluster, it is a [bestpractice](https://agones.dev/site/docs/guides/best-practices/#separation-of-agones-from-gameserver-nodes) to run the Agones controller in a dedicated node pool for better isolation and resiliency. This is best suited for production workloads or cost-optimized workloads.\nGKE monitors your clusters and uses the [Recommenderservice](/recommender/docs/overview) to deliver guidance for how you can optimize your usage of the platform. The for GKE identifies clusters where you should isolate the Agones controller.\nTo learn more about how to manage insights and recommendations from Recommenders, see [Optimizeyour usage of GKE with insights and recommendations](/kubernetes-engine/docs/how-to/optimize-with-recommenders) .\n", "content": "## Identify clusters where you can isolate the Agones controller\nThe insights from the identify which clusters contain an Agones controller that should be isolated in a dedicated node pool.\nTo get these insights, follow the instructions to [view insights and recommendations](/kubernetes-engine/docs/how-to/optimize-with-recommenders#view-insights-recs) using the Google Cloud console, the Google Cloud CLI, or the Recommender API with the `AGONES_DEDICATED_NODE_POOL_NEEDED` subtype.\nAfter you identify the clusters, you can [implement the recommendation to create a dedicated node pool](#create-dedicated-node-pool) .\n## How GKE Agones Recommender detects clusters\nThe Recommender generates an insight and recommendation if the following criteria are true for a GKE cluster:\n- The cluster is running an Agones controller. This is determined if any Pods have the`agones.dev/role:controller`label set.\n- The cluster has more than four nodes, which is an indicator that the cluster might be running a production workload.\n- The Agones controller is not running on the dedicated node for Agones. A dedicated node pool is considered to be one that has the following node label`agones.dev/agones-system=true`and node taint`agones.dev/agones-system=true:NoExecute`.## Implement the recommendation to create a dedicated node pool\nIf you've received an insight and recommendation for your cluster and want to use a dedicated node pool for your Agones controller, follow the instructions to [create a dedicated node pool](https://agones.dev/site/docs/installation/creating-cluster/gke/#optional-creating-a-dedicated-node-pool) where your Agones controller can be scheduled.\nThe Recommender runs once daily. If it has been less than 24 hours since you've implemented the guidance of the recommendation, you can [mark therecommendation as resolved](/kubernetes-engine/docs/how-to/optimize-with-recommenders#resolve-recommendation) .\n## What's next\n- [Optimize your usage of GKE with insights andrecommendations](/kubernetes-engine/docs/how-to/optimize-with-recommenders) \n- [Create a GKE cluster for your Agonesinstall](https://agones.dev/site/docs/installation/creating-cluster/gke/)", "guide": "Google Kubernetes Engine (GKE)"}