{"title": "Google Kubernetes Engine (GKE) - Create IAM policies", "url": "https://cloud.google.com/kubernetes-engine/docs/how-to/iam", "abstract": "# Google Kubernetes Engine (GKE) - Create IAM policies\nThis page explains how to create [Identity and Access Management (IAM)](/iam) policies for authorization in Google Kubernetes Engine (GKE).\n", "content": "## Overview\nEvery Google Cloud, GKE, and Kubernetes API call requires that the account making the request has the necessary permissions. By default, no one except you can access your project or its resources. You can use IAM to manage who can access your project and what they are allowed to do. IAM permissions work alongside [Kubernetes RBAC](/kubernetes-engine/docs/role-based-access-control) , which provides granular access controls for specific objects inside a cluster or namespace. IAM has a stronger focus on permissions at the project and organization level, though it does provide several predefined roles specific to GKE.\nTo grant users and service accounts access to your Google Cloud project, you [add them as project team members](/iam/docs/granting-changing-revoking-access) , then [assign roles](#managing) to the team members. Roles define which Google Cloud resources an account can access and which operations they can perform.\nIn GKE, you can also use IAM to manage which users and service accounts can access, and perform operations in, your clusters.\n## Before you begin\nBefore you start, make sure you have performed the following tasks:\n- Enable    the Google Kubernetes Engine API.\n- [    Enable Google Kubernetes Engine API   ](https://console.cloud.google.com/flows/enableapi?apiid=container.googleapis.com) \n- If you want to use the Google Cloud CLI for this task, [install](/sdk/docs/install) and then [initialize](/sdk/docs/initializing) the  gcloud CLI. If you previously installed the gcloud CLI, get the latest  version by running`gcloud components update`. **Note:** For existing gcloud CLI  installations, make sure to set the`compute/region`and`compute/zone` [properties](/sdk/docs/properties#setting_properties) . By setting default locations,  you can avoid errors in gcloud CLI like the following:`One of [--zone, --region] must be supplied: Please specify location`.## Interaction with Kubernetes RBAC\nKubernetes' native [role-based access control (RBAC)](/kubernetes-engine/docs/role-based-access-control) system also manages access to resources in your cluster. RBAC controls access on a cluster and namespace level, while IAM works on the project level.\nIAM and RBAC can work together. An entity must have sufficient RBAC and IAM permissions to work with resources in your cluster.\n## IAM Roles\nThe following sections describe the IAM Roles available in Google Cloud.\n### Predefined GKE Roles\nIAM provides [predefined Roles](/iam/docs/understanding-roles#predefined_roles) that grant access to specific Google Cloud resources and prevent unauthorized access to other resources.\nIAM offers the following predefined roles for GKE.\n| Role         | Title          | Description                                                              | Lowest resource |\n|:-------------------------------------|:------------------------------------------|:------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|:------------------|\n| roles/container.admin    | Kubernetes Engine Admin     | Provides access to full management of clusters and their Kubernetes API objects. To set a service account on nodes, you must also have the Service Account User role (roles/iam.serviceAccountUser) on the user-managed service account that your nodes will use. | Project   |\n| roles/container.clusterAdmin   | Kubernetes Engine Cluster Admin   | Provides access to management of clusters. To set a service account on nodes, you must also have the Service Account User role (roles/iam.serviceAccountUser) on the user-managed service account that your nodes will use.          | Project   |\n| roles/container.clusterViewer  | Kubernetes Engine Cluster Viewer   | Provides access to get and list GKE clusters.                                                      | nan    |\n| roles/container.developer   | Kubernetes Engine Developer    | Provides access to Kubernetes API objects inside clusters.                                                  | Project   |\n| roles/container.hostServiceAgentUser | Kubernetes Engine Host Service Agent User | Allows the Kubernetes Engine service account in the host project to configure shared network resources for cluster management. Also gives access to inspect the firewall rules in the host project.                | nan    |\n| roles/container.viewer    | Kubernetes Engine Viewer     | Provides read-only access to resources within GKE clusters, such as nodes, pods, and GKE API objects.                                        | Project   |\nFor a full list of the individual permissions in each role, refer to [Google Kubernetes Engine roles](/iam/docs/understanding-roles#kubernetes-engine-roles) . You can also view the permissions in each IAM role using the gcloud CLI or the Google Cloud console. For instructions, refer to [View permissions granted by IAM roles](#permissions) .\n### Basic IAM roles\nBasic IAM Roles grant users global, project-level access to all Google Cloud resources. To keep your project and clusters secure, use [predefined Roles](#predefined) whenever possible.\nTo learn more about basic roles, refer to [Basic roles](/iam/docs/understanding-roles#basic) in the IAM documentation.\n### Service Account User role\n[Service Account User](/iam/docs/service-account-permissions#user-role) grants a Google Cloud user account the permission to perform actions as though a service account were performing them.\n- Granting the `iam.serviceAccountUser` role to a user for a **project** gives the user all of the roles granted to all service accounts in the project, including service accounts that may be created in the future.\n- Granting the `iam.serviceAccountUser` role to a user for a specific service account gives a user all of the roles granted to that service account.\nThis role includes the following permissions:\n- `iam.serviceAccounts.actAs`\n- `iam.serviceAccounts.get`\n- `iam.serviceAccounts.list`\n- `resourcemanager.projects.get`\n- `resourcemanager.projects.list`\nFor more information about the ServiceAccountUser role, see [ServiceAccountUser](/iam/docs/service-account-permissions#user-role) in the IAM documentation.\nThe following command shows the syntax for granting the Service Account User role:\n```\ngcloud iam service-accounts add-iam-policy-binding \\  SA_NAME@PROJECT_ID.iam.gserviceaccount.com \\  --member=user:USER \\  --role=roles/iam.serviceAccountUser\n```\nReplace the following:\n- ``: the name of the service account.\n- ``: the ID of your Google Cloud project.\n- ``: the email address for the user.\n### Host Service Agent User role\nThe Host Service Agent User role is only used in [Shared VPC](/kubernetes-engine/docs/how-to/cluster-shared-vpc) clusters. This role includes the following permissions:\n- `compute.firewalls.get`\n- `container.hostServiceAgent.*`\n- `dns.networks.bindDNSResponsePolicy`\n- `dns.networks.bindPrivateDNSPolicy`\n- `dns.networks.bindPrivateDNSZone`\n### Custom roles\nIf [predefined roles](#predefined) don't meet your needs, you can create [custom roles](/iam/docs/understanding-custom-roles) with permissions that you define.\nTo learn how to create and assign custom roles, refer to [Creating and managing custom roles](/iam/docs/creating-custom-roles) .\n## View permissions granted by IAM roles\nYou can view the permissions granted by each Role using the gcloud CLI or the Google Cloud console.\nTo view the permissions granted by a specific role, run the following command:\n```\ngcloud iam roles describe roles/ROLE\n```\nReplace `` with any IAM role. GKE roles are prefixed with `roles/container` , such as `gcloud iam roles describe roles/container.admin` .\nTo view the permissions granted by a specific Role, perform the following steps:- Go to the **Roles** section of the **IAM & Admin** page on the Google Cloud console. [Go to IAM & Admin](https://console.cloud.google.com/iam-admin/roles) \n- To see the roles for GKE, in the **Filter table** field, enter `Kubernetes Engine` .\n- Select the role you want to view. The description of the role and a list of assigned permissions displays.## Managing IAM roles\nTo learn how to manage IAM roles and permissions for human users, refer to [Granting, changing, and revoking access to project members](/iam/docs/granting-changing-revoking-access) in the IAM documentation.\nFor , refer to [Granting roles to service accounts](/iam/docs/granting-roles-to-service-accounts) .\n## Examples\nHere are a few examples of how IAM works with GKE:\n- A new employee has joined a company. They need to be added to the Google Cloud project, but they only need to view the project's clusters and other Google Cloud resources. The project owner assigns them the project-level [Compute Viewer](/compute/docs/access/iam#compute.viewer) role. This role provides read-only access to get and list nodes, which are Compute Engine resources.\n- The employee is working in operations, and they need to update a cluster using`gcloud`or the Google Cloud console. This operation requires the`container.clusters.update`permission, so the project owner assigns them the Kubernetes Engine Cluster Admin role. The employee now has the permissions granted by both the Kubernetes Engine Cluster Admin and Compute Viewer roles.\n- The employee needs to investigate why a Deployment is having issues. They need to run`kubectl get pods`to see Pods running in the cluster. The employee already has the Compute Viewer role, which is not sufficient for listing Pods. The employee needs the Kubernetes Engine Viewer role.\n- The employee needs to create a new cluster. The project owner grants the employee the Service Account User role for the`` `-compute@developer.gserviceaccount.com`service account, so that the employee's account can access Compute Engine's default service account. This service account has the Editor role, which provides a broad set of permission.## What's next\n- [Read the access control overview](/kubernetes-engine/docs/concepts/access-control) .", "guide": "Google Kubernetes Engine (GKE)"}