{"title": "Google Kubernetes Engine (GKE) - View detailed breakdown of cluster costs", "url": "https://cloud.google.com/kubernetes-engine/docs/how-to/cost-allocations", "abstract": "# Google Kubernetes Engine (GKE) - View detailed breakdown of cluster costs\nThis page shows you how to view a breakdown of your Google Kubernetes Engine (GKE) cluster costs in [Cloud Billing BigQuery export](/billing/docs/how-to/export-data-bigquery-setup) using GKE cost allocation.\nYou can use this information to distribute the costs of a cluster to its users.\n", "content": "## Potential data volume increase\nEnabling GKE cost allocation can increase your storage and querying costs in BigQuery. The exact increase depends on the number of distinct label and namespace combinations you use across Pods and clusters.\nEnabling GKE cost allocation does not change the total cost of your GKE usage. The sum of the cost line items in your export is the same and existing queries and reports you have built on the billing export return the same values.\n## GKE cost allocation and cluster usage metering\nGKE cost allocation is different from [cluster usage metering](/kubernetes-engine/docs/how-to/cluster-usage-metering) in the following ways:\n- GKE cost allocation provides an alternative to cluster usage metering for getting cluster information.\n- GKE cost allocation calculates cluster costs in your Cloud Billing account instead of aggregating the data in a Looker Studio template.\n- GKE cost allocation lets you view a clusters cost data in the Cloud Billing Google Cloud console and in the Cloud Billing detailed export.## Before you begin\nBefore you start, make sure you have performed the following tasks:\n- Enable    the Google Kubernetes Engine API.\n- [    Enable Google Kubernetes Engine API   ](https://console.cloud.google.com/flows/enableapi?apiid=container.googleapis.com) \n- If you want to use the Google Cloud CLI for this task, [install](/sdk/docs/install) and then [initialize](/sdk/docs/initializing) the  gcloud CLI. If you previously installed the gcloud CLI, get the latest  version by running`gcloud components update`. **Note:** For existing gcloud CLI  installations, make sure to set the`compute/region`and`compute/zone` [properties](/sdk/docs/properties#setting_properties) . By setting default locations,  you can avoid errors in gcloud CLI like the following:`One of [--zone, --region] must be supplied: Please specify location`.\n- Ensure that you have completed the steps to [Export detailed usage cost data to BigQuery](/billing/docs/how-to/export-data-bigquery) . If your organization is already exporting data, you must have access to query the tables.\n### Limitations and restrictions\n- You can only view GKE cost allocation data in the Cloud Billing BigQuery detailed usage cost data export.\n- You must have Google Cloud CLI version 392.0.0 or later\n- If you enable GKE cost allocation, your billing export starts including additional line items for your GKE resources from that date. The billing export does not backfill data.\n- If you disable GKE cost allocation, your billing export stops including additional line items, but does not modify or remove previous line items that were generated while the feature was enabled.\n- GKE cost allocation data is based on resource requests, not resources consumed. To learn more about the differences between resource requests, resource limits, and resource consumption, see [Kubernetes best practices: Resource requests and limits](/blog/products/containers-kubernetes/kubernetes-best-practices-resource-requests-and-limits) .\n- GKE cost allocation supports the following resource SKU types:- Compute Engine VM Instance vCPU SKUs\n- Compute Engine VM Instance RAM SKUs\n- Compute Engine VM Instance GPU SKUs\n- Compute Engine PD Capacity SKUs\n- If a Pod has more than 50 Kubernetes labels, none of those labels will be available in the Cloud Billing section of the Google Cloud console or the Cloud Billing detailed export.\n- After you enable GKE cost allocation, it can take up to three days for data to appear in Cloud Billing.\n- GKE cost allocation includes data from Persistent Disks with the following exceptions:- Only supports`PersistentVolume`resources provisioned by the [Compute Engine persistent disk CSI driver](/kubernetes-engine/docs/how-to/persistent-volumes/gce-pd-csi-driver) or with the [gce-pd storage class](https://kubernetes.io/docs/concepts/storage/storage-classes/#gce-pd) with`ReadWriteOnce`access mode.\n- Persistent Disks with an uptime of less than 30 minutes might not be tracked. Persistent Disks with at least 30 minutes uptime are always tracked.\n## View GKE cluster costs\nWhen you enable GKE cost allocation, the cluster name and namespace of your GKE workloads appear in the `labels` field of the billing export to BigQuery:\n| Metadata       | Description                                                                         | Cluster name   | Namespace  |\n|:------------------------------------|:------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|:----------------------|:--------------|\n| Resource label key (labels.key)  | Kubernetes labels have the following format: k8s-label/${k8s-label-key}, where ${k8s-label-key} is the key of the Pod's Kubernetes label. The billing label k8s-label/${k8s-label-key} has the same value as the corresponding Kubernetes Pod label.              | goog-k8s-cluster-name | k8s-namespace |\n| Resource label value (labels.value) | If a Kubernetes label key collides with a VM label key, the Kubernetes label value overrides the VM label value. Cluster and node pool resource labels are applied to resources using the following priority from highest to lowest: Individual resource, such as instance or storage Node pool Cluster | [cluster-name]  | [namespace] |\nFor more information, see [Schema of the detailed usage cost data](/billing/docs/how-to/export-data-bigquery-tables#detailed-usage-cost-data-schema) .\nAdditionally, the following namespaces are used to track overhead and unallocated resources:\n- `kube:system-overhead`: Resources are reserved for system overhead.\n- `kube:unallocated`: Resources are neither requested by workloads nor requested for system overhead.\nIf GKE cannot determine the cost allocation for a resource, the export includes one of the following values:\n- `goog-k8s-unknown`: Cloud Billing could not process the SKU. This can occur when a new Compute Engine instance is being provisioned.\n- `goog-k8s-unsupported-sku`: GKE cost allocation does not support this SKU. Treat this the same as`<blank>`/`NULL`. There is no guarantee that a SKU is always labeled with this value.\n- `<blank>`/`NULL`: GKE cost allocation does not track this resource. This can occur when GKE cost allocation is not enabled, or the resource does not belong to a GKE managed cluster.\nCosts for Persistent Disks are tracked when the Persistent Disk's backing `PersistentVolumeClaims` are claimed by Pods. The Persistent Disk costs inherit all of the metadata, such as Pod labels and namespaces, of the claiming Pod, until their `PersistentVolumeClaims` are deleted. For `PersistentVolumeClaims` that are deleted but retain `PersistentVolumes` according to the reclaim policy, costs of the Persistent Disks are tracked as unallocated.\nLabels applied directly to `PersistentVolumeClaims` do not appear in the Cloud Billing section of the Google Cloud console or the Cloud Billing detailed export.\n### Enable GKE cost allocation\nYou can enable GKE cost allocation on a new or existing cluster using the gcloud CLI or the Google Cloud console.\n### Create a new cluster\nCreate a cluster using the `--enable-cost-allocation` flag:\n```\ngcloud container clusters create CLUSTER_NAME \\    --enable-cost-allocation \\    --region=COMPUTE_REGION\n```\nReplace the following:- ``: the name of the new cluster.\n- ``: the Compute Engine [region](/compute/docs/regions-zones#available) for your cluster. For zonal clusters, use``.\nTo enable GKE cost allocation when you create a new cluster, do the following:- Go to the **Google Kubernetes Engine** page in the Google Cloud console. [Go to Google Kubernetes Engine](https://console.cloud.google.com/kubernetes/list) \n- Click **Create** .\n- Configure your cluster.\n- From the navigation pane, under **Cluster** , click **Features** .\n- In the **Other** section, select the **Enable Cost Allocation** checkbox.\n- Configure the cluster as needed, and then click **Create** .\n### Update a cluster\nUpdate a cluster using the `--enable-cost-allocation` flag:\n```\ngcloud container clusters update CLUSTER_NAME \\    --enable-cost-allocation\n```\nReplace `` with the name of the cluster.\nTo enable GKE cost allocation on an existing cluster, do the following:- Go to the **Google Kubernetes Engine** page in the Google Cloud console. [Go to Google Kubernetes Engine](https://console.cloud.google.com/kubernetes/list) \n- Click the name of the cluster you want to modify.\n- On the **Clusters** page, in the **Features** section, clicknext to **Cost Allocation** .\n- In the **Edit Cost Allocation** dialog, select the **Enable Cost Allocation** checkbox.\n- Click **Save changes** .## Verify GKE cost allocation is enabled\nDescribe the cluster:\n```\ngcloud container clusters describe CLUSTER_NAME\n```\nThe output is similar to the following:\n```\n...\ncostManagementConfig:\n enabled: true\n...\n```\nIn this output, `costManagementConfig` indicates that GKE cost allocation is enabled.\nTo check if GKE cost allocation is enabled on an existing cluster, do the following:- Go to the **Google Kubernetes Engine** page in the Google Cloud console. [Go to Google Kubernetes Engine](https://console.cloud.google.com/kubernetes/list) \n- Click the name of the cluster you want to modify.\n- On the **Clusters** page, in the **Features** section, next to **Cost Allocation** it will show whether GKE cost allocation is enabled.\n### Filter GKE cost data\nThe following example queries show you how to filter and group your GKE costs for supported resource types by cluster name, namespace, and label.Replace `` with the name of the [dataset that you created in BigQuery](/billing/docs/how-to/export-data-bigquery-setup#create-bq-dataset) .\nThe table name is similar to `gcp_billing_export_resource_v1_<BILLING_ACCOUNT_ID>` .\n## Clean up\nTo avoid incurring charges to your Google Cloud account for the resources used in this page, disable GKE cost allocation for the cluster:\n```\ngcloud container clusters update CLUSTER_NAME \\    --no-enable-cost-allocation\n```\nYou can also [delete the cluster](/kubernetes-engine/docs/how-to/deleting-a-cluster) that you created.\n## What's next\n- View more [Example queries for Cloud Billing data export](/billing/docs/how-to/bq-examples) .\n- Learn how to [Visualize your costs with Looker Studio](/billing/docs/how-to/visualize-data) .", "guide": "Google Kubernetes Engine (GKE)"}