{"title": "Google Kubernetes Engine (GKE) - Configure GKE security posture dashboard features at fleet level", "url": "https://cloud.google.com/kubernetes-engine/docs/how-to/fleet-security-posture", "abstract": "# Google Kubernetes Engine (GKE) - Configure GKE security posture dashboard features at fleet level\nThe [Google Kubernetes Engine (GKE)security posture dashboard](/kubernetes-engine/docs/concepts/about-security-posture-dashboard) provides you with opinionated, actionable recommendations to improve your clusters' security posture. If you have [enabledGKE Enterprise](/kubernetes-engine/docs/how-to/enable-gkee) , you can enable security posture as a fleet-default configuration. This page shows you how to configure these fleet-defaults.\nYou can create fleet-level defaults for the following security posture dashboard settings:\n- Workload configuration auditing: audit the clusters and workloads in your fleet for common security configuration concerns.\n- Workload vulnerability scanning, available in the following tiers:- Workload OS vulnerability scanning (`standard`tier): scan the container OS for known vulnerabilities.\n- Advanced vulnerability insights (`enterprise`tier): scan the container OS and language packages for known vulnerabilities.To learn how to configure these settings for individual clusters, see [Automatically audit workloads for configuration issues](/kubernetes-engine/docs/how-to/protect-workload-configuration) and [Automatically scan workloads for known vulnerabilities](/kubernetes-engine/docs/how-to/security-posture-vulnerability-scanning) .\n", "content": "## Configure fleet-level defaults\nThis section describes how to configure security posture dashboard features as fleet-level defaults. Any new clusters that you register to a fleet during cluster creation have your specified security posture features enabled. You can find out about fleet default configuration in [Manage fleet-level features](/anthos/fleet-management/docs/manage-features) .\nTo configure fleet-level defaults for security posture, complete the following steps:\n- In the Google Cloud console, go to the **Feature Manager** page. [Go to Feature Manager](https://console.cloud.google.com/kubernetes/features/overview) \n- In the **Security Posture** pane, click **Configure** .\n- Review your fleet-level settings. All new clusters you register to the fleet inherit these settings.\n- Optional: To change the default settings, click **Customize fleetsettings** . In the **Customize fleet default configuration** dialog that appears, do the following:- For **Configuration audit** , choose if [configuration auditing](/kubernetes-engine/docs/concepts/about-configuration-scanning) should be enabled or disabled.\n- For **Vulnerability scanning** , select the level of [vulnerability scanning](/kubernetes-engine/docs/concepts/about-workload-vulnerability-scanning) that you want; **Disabled** , **Basic** , or **Advanced (recommended)** .\n- Click **Save** .\nIf you later disable fleet-level configuration for these features, your current workloads in existing member clusters are still scanned and you can see the security concerns on the security posture dashboard. However, any new clusters you create in that fleet won't be scanned for concerns, unless you enable the security posture features on them individually.\n- To apply the setting to new clusters, click **Configure** .\n- In the confirmation dialog, click **Confirm** .\n- Optional: Sync existing clusters to the default settings:- In the **Clusters in the fleet** list, select the clusters that you want to sync.\n- Click **Sync to fleet settings** and click **Confirm** in the confirmation dialog that appears. This operation can take a few minutes to complete.\nMake sure that you have [gcloud CLI version 455.0.0](/sdk/docs/install) or later.\n### Configure defaults for a new fleetYou can [create an empty fleet](/anthos/fleet-management/docs/fleet-creation#optional_create_an_empty_fleet) with the security posture dashboard features you want enabled.- To create a fleet with workload configuration auditing enabled, run the following command:```\ngcloud container fleet create --security-posture standard\n```\n- To create a fleet with workload vulnerability scanning enabled, run the following command:```\ngcloud container fleet create --workload-vulnerability-scanning VULNERABILITY_SCANNING_TIER\n```Replace `` with one of the following values:- `standard`: scan the container OS for known vulnerabilities.\n- `enterprise`: scan the container OS and language packages for known vulnerabilities.\n### Configure defaults for an existing fleet\n- To enable workload configuration auditing on an existing fleet, run the following command:```\ngcloud container fleet update --security-posture standard\n```\n- To enable workload vulnerability scanning on an existing fleet, run the following command:```\ngcloud container fleet update --workload-vulnerability-scanning VULNERABILITY_SCANNING_TIER\n```Replace `` with one of the following values:- `standard`: scan the container OS for known vulnerabilities.\n- `enterprise`: scan the container OS and language packages for known vulnerabilities.\n- To change workload vulnerability scanning tier on an existing fleet:- Check the existing security posture dashboard settings on a fleet:```\ngcloud container fleet describe\n```\n- Use the `update` command as described earlier with the workload scanning tier you want to change to:```\ngcloud container fleet update --workload-vulnerability-scanning VULNERABILITY_SCANNING_TIER\n```\n### Disable security posture dashboard features at fleet level\n- To disable workload configuration auditing, run the following command:```\ngcloud container fleet update --security-posture disabled\n```\n- To disable workload vulnerability scanning, run the following command:```\ngcloud container fleet update --workload-vulnerability-scanning disabled\n```\nIf you disable fleet-level configuration for these features, your current workloads in existing member clusters are still scanned and you can see the security concerns on the security posture dashboard. However, any new clusters you create in that fleet won't be scanned for concerns, unless you enable the security posture features on them individually.\n## What's next\n- Learn about the range of Google Cloud features to [secure your clusters and workloads](/kubernetes-engine/docs/concepts/security-overview) .\n- Learn how [workload configuration auditing](/kubernetes-engine/docs/concepts/about-configuration-scanning) detects common security configuration concerns.\n- Learn how [workload vulnerability scanning](/kubernetes-engine/docs/concepts/about-workload-vulnerability-scanning) scans your container OS and application language packages for security concerns.", "guide": "Google Kubernetes Engine (GKE)"}