{"title": "Google Kubernetes Engine (GKE) - Create and manage cluster and node pool labels", "url": "https://cloud.google.com/kubernetes-engine/docs/how-to/creating-managing-labels", "abstract": "# Google Kubernetes Engine (GKE) - Create and manage cluster and node pool labels\nThis page provides an overview of cluster labels and node pool labels in Google Kubernetes Engine (GKE).\n", "content": "## GKE cluster and node pool labels and Kubernetes labels\nGKE cluster and node pool labels are distinct from [labels in Kubernetes](https://kubernetes.io/docs/concepts/overview/working-with-objects/labels/) . The two labeling systems work independently and do not inherit or share labels.\nGKE cluster and node pool labels are arbitrary metadata attached to your resources that you can use to track usage and billing information.\nSeparately, in Kubernetes, the system uses labels internally to associate cluster components and resources (for example, Pods and nodes) with one another and manage resource lifecycles. You can edit Kubernetes labels with the Kubernetes API. You can also use the GKE API to edit Kubernetes labels on your nodes with [cluster creation](/sdk/gcloud/reference/container/node-pools/create#--node-labels) or with a [cluster update](/kubernetes-engine/docs/how-to/update-existing-nodepools#updating_node_labels) .\n## What are cluster labels?\nA cluster label is a key-value pair that you can assign to Google Cloud clusters. They help you organize these resources and manage your costs at scale, with the granularity you need. You can attach a label to each resource, then filter the resources based on their labels. Information about labels is forwarded to the billing system that lets you break down your billed charges by label. With built-in [billing reports](/billing/docs/how-to/reports) , you can filter and group costs by resource labels. You can also use labels to query [billing data exports](/billing/docs/how-to/bq-examples) .\n## Requirements for cluster labels\nThe cluster labels applied to a resource must meet the following requirements:\n- Each resource can have up to 64 cluster labels.\n- Each cluster label must be a key-value pair.\n- Keys have a minimum length of 1 character and a maximum length of 63 characters, and cannot be empty. Values can be empty, and have a maximum length of 63 characters.\n- Keys and values can contain only lowercase letters, numeric characters, underscores, and dashes. All characters must use UTF-8 encoding, and international characters are allowed. Keys must start with a lowercase letter or international character.\n- The key portion of a cluster label must be unique within a single resource. However, you can use the same key with multiple resources.\nThese limits apply to the key and value for each cluster label, and to the individual Google Cloud resources that have cluster labels. There is no limit on how many cluster labels you can apply across all resources within a project.\n## Common uses of cluster labels\nHere are some common use cases for cluster labels:\n- **Team or cost center cluster labels** : Add labels based on team or cost center to distinguish clusters owned by different teams (for example, `team:research` and `team:analytics` ). You can use this type of label for cost accounting or budgeting.\n- **Component cluster labels** : For example, `component:redis` , `component:frontend` , `component:ingest` , and `component:dashboard` .\n- **Environment or stage cluster labels** : For example, `environment:production` and `environment:test` .\n- **State cluster labels** : For example, `state:active` , `state:readytodelete` , and `state:archive` .\n- **Ownership cluster labels** : Used to identify the teams that are responsible for operations, for example: `team:shopping-cart` .- **Billing breakdown** : Use node pool labels to break down your billed charges by node pool. For more information, see [View detailed breakdown of cluster costs](/kubernetes-engine/docs/how-to/cost-allocations) .**Note:** Don't include sensitive information in labels, including personally identifiable information, such as an individual's name or title. Labels are not designed to handle sensitive information.\nWe don't recommend creating large numbers of unique labels, such as for timestamps or individual values for every API call. The problem with this approach is that when the values change frequently or with keys that clutter the catalog, this makes it difficult to effectively filter and report on resources.\n## Labels and tags\nLabels can be used as queryable annotations for resources, but can't be used to set conditions on policies. Tags provide a way to conditionally allow or deny policies based on whether a resource has a specific tag, by providing fine-grained control over policies. For more information, see the [Tags overview](/resource-manager/docs/tags/tags-overview) .\n## Automatically applied labels\nGKE automatically applies several labels to cluster resources.\nFor example, GKE applies labels to Compute Engine instances, persistent disks, and accelerators (TPU).\nThe following table lists the labels that GKE automatically applies to resources:\n| Label      | Applied Resources                               |\n|:--------------------------|:------------------------------------------------------------------------------------------------------------------------------------------|\n| goog-gke-node    | Compute Engine VM instance underlying a GKE node.                       |\n| goog-gke-volume   | Compute Engine persistent disk attached to a VM instance underlying a GKE node.               |\n| goog-gke-tpu    | Cloud TPU on GKE.                               |\n| goog-k8s-cluster-name  | Compute Engine VM instance and persistent disks attached to a VM instance underlying a GKE node.           |\n| goog-k8s-cluster-location | Compute Engine VM instance and persistent disks attached to a VM instance underlying a GKE node.           |\n| goog-k8s-node-pool-name | Compute Engine VM instances and their boot disks underlying a GKE node.                 |\n| goog-fleet-project  | Compute Engine VM instance and persistent disks attached to a VM instance underlying a GKE node, if the cluster is registered to a fleet. |\nDo not edit or delete reserved labels. Any changes that you make to reserved labels are reconciled automatically.\n## Label propagation\nIn GKE, . When you label a cluster, the label propagates to all of the cluster's individual resources such as nodes, instances, and persistent disks. When you label a node pool, the label propagates to all the node pool's individual resources such as instances, and persistent disks. In Standard clusters, if the cluster labels conflict with node pool labels, such as when the label key is the same but the value is different, node pool labels override cluster labels.\nAny labels you apply to your clusters or node pools propagate through a background process that runs hourly. It can take up to one hour for a label to appear on all resources associated with a given cluster. In addition, labels only propagate to Compute Engine instances and Persistent Disks that are attached to Compute Engine instances. Other resources such as workloads, forwarding rules, IP addresses, and non-attached Persistent Disks are not labeled.\nFor Standard clusters, when cluster and node pool labels are applied to Compute Engine resources, you can [manually change the resource labels](/compute/docs/labeling-resources#add_or_update_labels_to_existing_resources) without those changes being reconciled by GKE. In Autopilot clusters, you can't manually modify the labels on the Compute Engine resources because GKE manages the nodes for you. However, we recommend managing these labels through GKE. Existing labels on those Compute Engine resources will not be removed by GKE unless they conflict with the [automatically applied labels](#automatically-applied-labels) .\n## Before you begin\nBefore you start, make sure you have performed the following tasks:\n- Enable    the Google Kubernetes Engine API.\n- [    Enable Google Kubernetes Engine API   ](https://console.cloud.google.com/flows/enableapi?apiid=container.googleapis.com) \n- If you want to use the Google Cloud CLI for this task, [install](/sdk/docs/install) and then [initialize](/sdk/docs/initializing) the  gcloud CLI. If you previously installed the gcloud CLI, get the latest  version by running`gcloud components update`. **Note:** For existing gcloud CLI  installations, make sure to set the`compute/region`and`compute/zone` [properties](/sdk/docs/properties#setting_properties) . By setting default locations,  you can avoid errors in gcloud CLI like the following:`One of [--zone, --region] must be supplied: Please specify location`.## Get a label fingerprint for API requests\nYou can skip this step if you use the Google Cloud console or the gcloud CLI.\nWhen you update or add cluster labels using the GKE API, you must provide the latest cluster label fingerprint with your request to prevent any conflicts with other requests.\nTo get the latest cluster label fingerprint, run a `GET` request for the appropriate cluster. For example:\n```\nGET https://container.googleapis.com/v1/projects/myproject/zones/us-central1-f/clusters/example-cluster\n```\nThe output is similar to the following:\n```\n200 OK\n{\n \"name\": \"mycluster\",\n \"description\": \"production-cluster\",\n \"initialNodeCount\": 3,\n ...\n \"resourceLabels\": {\n \"environment\": \"production\",\n ...\n },\n \"labelFingerprint\": \"p1ty_9HoBk0=\"\n}\n```\nIn this output, the `labelFingerprint` property is the cluster label fingerprint.\n## Create a cluster with labels\nYou can create Autopilot and Standard clusters with labels by using the gcloud CLI, the Google Cloud console, or the GKE API.\nRun the following command to create an Autopilot cluster with labels:\n```\ngcloud container clusters create-auto CLUSTER_NAME \\    --labels=KEY=VALUE\n```\nOr, run the following command to create a Standard cluster with labels:\n```\ngcloud container clusters create CLUSTER_NAME \\    --labels=KEY=VALUE\n```\nReplace the following:- ``: the name of the cluster.\n- ``: the key for the label's key-value pair.\n- ``: the value for the label's key-value pair.\nTo add labels when creating your cluster, do the following:- Go to the **Google Kubernetes Engine** page in the Google Cloud console. [Go to Google Kubernetes Engine](https://console.cloud.google.com/kubernetes/list) \n- Click **Create** .\n- For **Autopilot** or **Standard** , click **Configure** .\n- Configure your cluster.\n- From the navigation pane, under **Cluster** , click **Metadata** .\n- Click **Add label** .\n- Add labels.\n- Click **Create** .\nTo include a label when creating your cluster, specify the `resourceLabels` object within the `cluster` object that you provide to [projects.zones.clusters.create](/kubernetes-engine/docs/reference/rest/v1/projects.zones.clusters/create) .\n## Add or update labels for existing clusters\nYou can add or update labels for existing Autopilot and Standard clusters using the gcloud CLI, the Google Cloud console, or the GKE API.\nRun the following command:\n```\ngcloud container clusters update CLUSTER_NAME \\    --region=COMPUTE_REGION \\    --update-labels=KEY=VALUE\n```\nReplace the following:- ``: the name of your cluster.\n- ``: the [Compute Engine region](/compute/docs/regions-zones#available) for the new cluster. For zonal Standard clusters, use`--zone=` ``.\n- ``: the key for the label's key-value pair.\n- ``: the value for the label's key-value pair.\nThe label update overwrites any existing labels on the cluster. If the cluster has existing labels that you want to keep, you must include those labels along with any new labels that you want to add.\nTo add or update labels, do the following:- Go to the **Google Kubernetes Engine** page in the Google Cloud console. [Go to Google Kubernetes Engine](https://console.cloud.google.com/kubernetes/list) \n- On the **Cluster details** page, select the checkboxes for one or more clusters that you want to modify.\n- Click sell **Labels** .\n- Add or update labels.\n- Click **Save** .\nMake a `POST` request to the cluster's [resourceLabels](/kubernetes-engine/docs/reference/rest/v1/projects.zones.clusters/resourceLabels) method with the latest [fingerprint](#fingerprint) and a full list of labels to apply.\nSimilar to metadata and tags, if the cluster has existing labels you want to keep, you must include those labels in the request along with any new labels that you want to add.\nFor example, the following snippet makes a request to the `resourceLabels` method:\n```\nPOST https://container.googleapis.com/v1/projects/myproject/zones/us-central1-f/clusters/example-cluster/resourceLabels\n{\n \"resourceLabels\": {\n \"environment\": \"production\",\n \"an-existing-tag\": \"\"\n },\n \"labelFingerprint\": \"42WmSpB8rSM=\"\n}\n```\n## Remove cluster labels\nYou can remove labels from Autopilot and Standard clusters using the gcloud CLI, the Google Cloud console, or the GKE API.\nRun the `update` command with the `--remove-labels` flag:\n```\ngcloud container clusters update CLUSTER_NAME \\    --remove-labels=KEYS\n```\nReplace the following:- ``: the name of the cluster.\n- ``: a comma separated list of keys for the labels you want to remove.\nTo remove labels, do the following:- Go to the **Google Kubernetes Engine** page in Google Cloud console. [Go to Google Kubernetes Engine](https://console.cloud.google.com/kubernetes/list) \n- In the cluster list, select the checkboxes for one or more clusters that you want to modify.\n- Click sell **Labels** .\n- Click **Delete item** next to the **Value** field for the labels that you want to delete.\n- Click **Save** .\nMake a `POST` request to the `resourceLabels` method for the appropriate cluster. Provide the current `labelsFingerprint` and an empty list of labels to remove all labels, or provide a list of labels you want to keep, omitting the labels you want to remove. For example:\n```\nRequest\nPOST https://container.googleapis.com/v1/projects/myproject/zones/us-central1-f/clusters/example-cluster/resourceLabels\n{\n \"resourceLabels\": { },\n \"labelFingerprint\": \"42WmSpB8rSM=\"\n}\n```\n## Create a Standard node pool with labels\nYou can create a node pool with labels in a Standard cluster by using the gcloud CLI, the Google Cloud console, or the GKE API.\nRun the following command:\n```\ngcloud container node-pools create NODE_POOL_NAME \\    --cluster=CLUSTER_NAME \\    --region=COMPUTE_REGION \\    --labels=KEY=VALUE\n```\nReplace the following:- ``: the name of the node pool.\n- ``: the name of the cluster.\n- ``: the Compute Engine [region](/compute/docs/regions-zones#available) for your cluster. For zonal clusters, use`--zone=` ``.\n- ``: the key for the label's key-value pair.\n- ``: the value for the label's key-value pair.\nTo include a label when creating your node pool, specify the `resourceLabels` object within the node pool object that you provide to [projects.zones.clusters.nodePools.create](/kubernetes-engine/docs/reference/rest/v1/projects.zones.clusters.nodePools/create) .\nTo add labels to new node pool, do the following:- Go to the **Google Kubernetes Engine** page in the Google Cloud console. [Go to Google Kubernetes Engine](https://console.cloud.google.com/kubernetes/list) \n- On the **Cluster details** page, click the name of the cluster you want to modify.\n- Click **Add Node Pool** .\n- Configure your new node pool.\n- From the navigation pane, click **Metadata** .\n- Click **Add label** .\n- Add labels.\n- Click **Create** .## Add or update labels for an existing node pool\nYou can add or update labels for existing node pools using the gcloud CLI, the Google Cloud console, or the GKE API.\nRun the following command:\n```\ngcloud container node-pools update NODE_POOL_NAME \\    --cluster=CLUSTER_NAME \\    --region=COMPUTE_REGION \\    --labels=KEY=VALUE\n```\nReplace the following:- ``: the name of the node pool\n- ``: the name of the cluster.\n- ``: the Compute Engine [region](/compute/docs/regions-zones#available) for your cluster. For zonal clusters, use`--zone=` ``.\n- ``: the key for the label's key-value pair.\n- ``: the value for the label's key-value pair.\nThe label update overwrites any existing labels on the node pool. If the node pool has existing labels that you want to keep, you must include those labels along with any new labels that you want to add.\nTo include a label when modifying your node pool, specify the `resourceLabels` object within the node pool object that you provide to [projects.zones.clusters.nodePools.update](/kubernetes-engine/docs/reference/rest/v1/projects.zones.clusters.nodePools/update) .\nTo add or update labels, do the following:- Go to the **Google Kubernetes Engine** page in the Google Cloud console. [Go to Google Kubernetes Engine](https://console.cloud.google.com/kubernetes/list) \n- In the cluster list, click the name of the cluster that contains the node pool that you want to modify.\n- In the **Node Pools** section, click the name of the node pool that you want to modify.\n- Click **Edit** \n- In the **Labels** section, add or update labels.\n- Click **Save** .## Remove node pool labels\nYou can remove labels from node pools using the gcloud CLI, the Google Cloud console, or the GKE API.\nRun the following command:\n```\ngcloud container node-pools update NODE_POOL_NAME \\    --cluster=CLUSTER_NAME \\    --region=COMPUTE_REGION \\    --labels=KEY=VALUE\n```\nReplace the following:- ``: the name of the node pool.\n- ``: the name of the cluster.\n- ``: the Compute Engine [region](/compute/docs/regions-zones#available) for your cluster. For zonal clusters, use`--zone=` ``.\n- ``: the key for the label's key-value pair.\n- ``: the value for the label's key-value pair.\nThe label update overwrites any existing labels on the node pool. If the node pool has existing labels that you want to keep, you must exclude any labels that you want to remove. If you want to remove all labels, use `--labels=` without any key-value pairs.\nTo include a label when modifying your node pool, specify the `resourceLabels` object within the node pool object that you provide to [projects.zones.clusters.nodePools.update](/kubernetes-engine/docs/reference/rest/v1/projects.zones.clusters.nodePools/update) . Provide an empty list of labels to remove all labels, or provide a list of labels you want to keep. Omit the labels you want to remove.\nTo remove labels from a node pool, do the following- Go to the **Google Kubernetes Engine** page in the Google Cloud console. [Go to Google Kubernetes Engine](https://console.cloud.google.com/kubernetes/list) \n- In the cluster list, click the name of the cluster that contains the node pool that you want to modify.\n- In the **Node Pools** section, click the name of the node pool that you want to modify.\n- Click **Delete item** next to the **Value** field for the labels that you want to delete.\n- Click **Save** .## What's next\n[Read the GKE overview](/kubernetes-engine/docs/concepts/kubernetes-engine-overview) .", "guide": "Google Kubernetes Engine (GKE)"}