{"title": "Google Kubernetes Engine (GKE) - Observe your traffic using GKE Dataplane V2 observability", "url": "https://cloud.google.com/kubernetes-engine/docs/how-to/observe-your-traffic", "abstract": "# Google Kubernetes Engine (GKE) - Observe your traffic using GKE Dataplane V2 observability\n**    Preview     ** This feature is subject to the \"Pre-GA Offerings Terms\" in the General Service Terms section   of the [Service Specific Terms](/terms/service-terms#1) .     Pre-GA features are available \"as is\" and might have limited support.    For more information, see the [launch stage descriptions](/products#product-launch-stages) .\nThis page shows you how to observe your traffic using GKE Dataplane V2 observability. For more information on the benefits and requirements of GKE Dataplane V2 observability, see [About GKE Dataplane V2 observability](/kubernetes-engine/docs/concepts/about-dpv2-observability) .\n", "content": "## How to use GKE Dataplane V2 observability\nStart by enabling GKE Dataplane V2 metrics with Google Cloud Managed Service for Prometheus. To create custom dashboards and set alerts similar to any of the metrics that you've been monitoring, you can use [Google Cloud Observability](/products/operations) tools such as [Cloud Monitoring Metrics Explorer](/monitoring/charts/metrics-explorer) .\nYou can also configure any third-party dashboard or tooling that uses Prometheus, including Grafana. With your GKE cluster enabled with GKE Dataplane V2 observability, you can inspect traffic with GKE Dataplane V2 observability tools.\n### Visualize metrics and Service dependencies\nYou can visualize Kubernetes traffic metrics and Service Dependencies as follows:\nTo view GKE Dataplane V2 metrics for your clusters, perform the following steps in the Google Cloud console in the Metrics Explorer:\n- Go to the **Monitoring Metrics Explorer** page.\n- Select the **Metric** under the **Query** as either the **Prometheus Target prometheus/pod_flow_egress_flows_count** or **prometheus/pod_flow_ingress_flows_count/counter** .\n- (Optional) Choose any desired filters based on **Labels** .\n- (Optional) Save the chart to a custom **Dashboard** .Use the Hubble UI to be able to determine the dependencies of the Pod and Services deployed on your cluster at a glance. Visualize the traffic flows including those reaching out to external destinations. Filter by namespaces, Kubernetes labels, and more.\nThe Hubble UI can also be used to view live flows happening on your cluster. Each live flow shows the source and destination services, destination port, Policy verdicts and timestamps.\n### Inspect traffic with GKE Dataplane V2 observability tools\nYou can capture and analyze network traffic using GKE Dataplane V2 observability tools, accessed via a private endpoint. The endpoint is exposed on an internal IP address, which you can access from within the Kubernetes cluster and the VPC within which the cluster resides.\nTo inspect network traffic metadata, use the following commands:\n```\nalias hubble=\"kubectl exec -it deployment/hubble-relay -c hubble-cli -n gke-managed-dpv2-observability -- hubble\"hubble observe\n```\n```\nalias hubble=\"kubectl exec -it deployment/hubble-relay -c hubble-cli -n kube-system -- hubble\"hubble observe\n```\nThis command inspects network traffic for the cluster.\n```\nalias hubble=\"kubectl exec -it deployment/hubble-relay -c hubble-cli -n gke-managed-dpv2-observability -- hubble\"hubble observe -f\n```\n```\nalias hubble=\"kubectl exec -it deployment/hubble-relay -c hubble-cli -n kube-system -- hubble\"hubble observe -f\n```\nThis command inspects network traffic metadata in following mode for the cluster:\n```\nalias hubble=\"kubectl exec -it deployment/hubble-relay -c hubble-cli -n gke-managed-dpv2-observability -- hubble\"hubble observe -n default\n```\n```\nalias hubble=\"kubectl exec -it deployment/hubble-relay -c hubble-cli -n kube-system -- hubble\"hubble observe -n default\n```\nThis command uses the built-in hubble-cli plugin to inspect network traffic for the default namespace in the cluster.\nTo enable `Hubble Relay` use the `--enable-dataplane-v2-flow-observability` flag.\nDuring [Preview](/products#product-launch-stages) :\n- Download authorization certificates from Google Cloud console.\n- Pass the endpoint's IP address to the open source binary version of Hubble CLI.\n- Use Hubble CLI to view the network telemetry data collected by `Hubble Relay` .\nOnce the endpoint is exposed on an internal IP address, you can access from within the Kubernetes cluster and the VPC of the cluster.\n### Analyze traffic flows\nUse the Hubble CLI to observe live traffic flow dumps with the ability to filter with Kubernetes namespaces and more.\n## What's next\n- [Configure Metrics Explorer to view Dataplane V2 metrics](/monitoring/charts/metrics-selector)", "guide": "Google Kubernetes Engine (GKE)"}