{"title": "Google Kubernetes Engine (GKE) - Create fleets to simplify multi-cluster management", "url": "https://cloud.google.com/kubernetes-engine/docs/how-to/creating-fleets", "abstract": "# Google Kubernetes Engine (GKE) - Create fleets to simplify multi-cluster management\nThis page provides an overview of how fleet creation works, with details for different cluster types. For more information about how to manually register clusters to your fleet and the prerequisites for manual registration, see our [detailed fleet creation guides](#whats_next) .\nYou can create a fleet in one of the following ways:\n- **By registering a cluster** : When you register a cluster of any type in a project that doesn't already have a fleet, a new fleet is created and the project becomes a [fleet host project](/anthos/fleet-management/docs/fleet-concepts#fleet-host-project) . At most, a project can have a single fleet. Depending on the cluster type and where it lives, registration can happen automatically at cluster creation time with registration details specified in the cluster configuration, or you might need to manually add the cluster to your fleet.\n- **By creating a named fleet** : You can [create an empty fleet](/anthos/fleet-management/docs/fleet-creation#optional_create_an_empty_fleet) before you register clusters to it.\n- **By upgrading to Google Kubernetes Engine (GKE) Enterprise edition** : When you [enable GKE Enterprise](/anthos/docs/setup/enable-gkee) from the Google Cloud console, a fleet is automatically created for your project, and by default all existing Google Cloud clusters in your project are automatically registered to that fleet. New clusters can also be registered to a fleet while creating the cluster.\nEach fleet has a name that is displayed in the Google Cloud console. By default, this is the project ID of the fleet host project with `fleet` appended. If you want a more descriptive name for your fleet, you can specify it when creating a fleet.\n", "content": "## About fleet membership\nOnce you register a cluster to a fleet, it becomes a fleet member. Because fleets can include clusters from multiple projects and environments, you must ensure that each cluster you add to your fleet has a unique name. This is sometimes referred to in commands and documentation as the cluster's . Typically, a cluster's fleet membership name is its regular cluster name, but you may need to create a new name at registration time (for example by appending or prepending a qualifier to the original cluster name) if another cluster with that name already exists in the fleet. If you attempt to register a cluster with an existing name to your fleet, registration will fail.\n### Fleet membership location\nEach fleet cluster's membership is managed by the Fleet service. The location of this service can be or , depending on how the cluster is registered to the fleet.\n- GKE clusters on Google Cloud [registered by using the Google Cloud CLI](/anthos/fleet-management/docs/register/gke#gcloud) have their membership managed by a Fleet service instance that runs in the same region as the cluster itself. This provides optimal latency for building your own high availability services, including using regional instances of some services such as the Connect gateway. Regional membership management also supports situations where, for example, you have data that cannot leave a specific region for regulatory reasons. You cannot choose to have a cluster managed from a different region.\n- GKE clusters on Google Cloud [registered by using Config Connector](/anthos/fleet-management/docs/register/gke#config-connector) can be managed by either a global or regional Fleet service.\n- All other fleet members are managed using a global Fleet service.\n**Note:** All clusters registered before January 2023 have memberships managed by the global Fleet service.\nYou cannot change a cluster's membership location while it is still a fleet member. If you have a GKE cluster with global fleet membership and want to change it to be managed from its region, you must unregister the cluster and then register it again to the same fleet using `gcloud` or Config Connector.\nTo check a cluster's membership location (for example, to use as a command parameter or if you are considering switching a cluster to regional membership), do one of the following:\n- List all your fleet members. Each cluster's membership location is shown in the `LOCATION` column of the output.```\n gcloud container fleet memberships list \\   --project=PROJECT_ID\n```\n- Run the following command to `describe` your cluster's membership, including its membership location. Replace with your cluster's membership name.```\n gcloud container fleet memberships describe MEMBERSHIP_NAME \\   --project=PROJECT_ID\n```\n### Team scopes\nA fleet member cluster can be associated with one or more team scopes within its fleet. [Team scopes](/anthos/fleet-management/docs/team-management#fleet_team_management_overview) are an enterprise fleet-level construct for associating subsets of fleet clusters with specific application teams, and can be used to enable a range of team-based features, including access control, team-scoped observability, and [sequencing cluster upgrade rollouts](/kubernetes-engine/docs/concepts/about-rollout-sequencing) .\n## GKE clusters on Google Cloud\n[GKE](/kubernetes-engine/docs/concepts/kubernetes-engine-overview) clusters on Google Cloud must be explicitly registered to add them to a fleet. To register existing clusters, you can choose between quick registration from the Clusters page in the Google Cloud console, registration from the command line with the gcloud CLI, or declarative registration using Terraform or Config Connector. You can also register new clusters during cluster creation using the Google Cloud console, gcloud CLI, or Terraform. If you have enabled GKE Enterprise, this lets you [create clusters with some fleet-level settings and features already configured for you](/anthos/fleet-management/docs/register/gke#register_a_new_cluster) . Find out more about these options in [Register a cluster on Google Cloud to your fleet](/anthos/fleet-management/docs/register/gke#register_your_cluster) .\nClusters on Google Cloud can be registered to a fleet in their current project or ( [with some extra permissions](/anthos/fleet-management/docs/register/gke#gke-cross-project) ) to a fleet in a different project.\n**Note:** If you have enabled GKE Enterprise, any clusters that are registered to the fleet will incur [GKE Enterprise charges](/kubernetes-engine/pricing) . If you have not enabled GKE Enterprise, no additional charges are incurred for registering GKE clusters and you can choose to pay separately for fleet-enabled features. See [Deployment options](/anthos/deployment-options#pricing_options_for_gke_on_google_cloud) for more details.\n## Clusters outside Google Cloud\nIf you have [enabled GKE Enterprise](/anthos/docs/setup/enable-gkee) , you can add clusters outside Google Cloud to your fleet and view and manage your clusters across different environments together. GKE clusters outside Google Cloud are mostly registered to your fleet automatically at cluster creation time, as described in the rest of this section. If you want to add third-party Kubernetes clusters to your fleet, you must [register them manually](#third-party_kubernetes_clusters_attached_clusters) .\nRegistering clusters outside Google Cloud installs the Connect Agent on the cluster to handle communication between the cluster and your Google Cloud project. You can read more about how the Connect Agent works in the [Connect Agent overview](/anthos/fleet-management/docs/connect-agent) .\n### GKE on Google Distributed Cloud (on-premises)\n[GKE on VMware](/anthos/clusters/docs/on-prem) and [GKE on Bare Metal](/anthos/clusters/docs/bare-metal) clusters are automatically registered to your chosen fleet at cluster creation time, with your fleet host project and other registration details specified in the relevant cluster configuration file. If you are using GKE on VMware, note that from version 1.13 onwards, both [admin clusters](/anthos/clusters/docs/on-prem/latest/how-to/create-admin-cluster) and [user clusters](/anthos/clusters/docs/on-prem/latest/how-to/create-user-cluster)  be registered. For versions prior to 1.13, you can optionally add registration details to [admin cluster configurations](/anthos/clusters/docs/on-prem/latest/how-to/admin-cluster-configuration-file#gkeconnect-section) if you want to manage them as part of your fleet. You can register unregistered admin clusters by updating their cluster configuration file and using `gkectl` to [update the cluster](/anthos/clusters/docs/on-prem/latest/how-to/updating-general) . GKE on VMware cannot be unregistered or manually registered.\n### GKE on other public clouds\nGKE clusters on AWS and Azure created using the [GKE Multi-Cloud API](/anthos/clusters/docs/multi-cloud) are automatically registered to your chosen fleet at cluster creation time, with your fleet host project specified when you run the relevant `gcloud cluster create` command. Because clusters created using GKE Multi-Cloud already have a project associated with them (the project where the API is enabled), you need to [do some additional setup](/anthos/clusters/docs/multi-cloud/aws/how-to/create-cluster#cross-project_registration) at cluster creation if you want to register them to a fleet in a different project. Clusters created with the GKE Multi-Cloud API cannot be unregistered or manually registered.\n### Third-party Kubernetes clusters (attached clusters)\nIf you have existing third-party Kubernetes clusters (such as EKS, AKS, or on-premises distributions) that you want to manage as fleet members, you can register these to your project fleet along with any GKE clusters. You can attach any [conformant Kubernetes cluster](https://www.cncf.io/certification/software-conformance/) that includes x86 nodes to your fleet using the GKE Multi-Cloud API. These include Amazon EKS, Azure AKS, and other CNCF-conformant clusters that meet our requirements. Any third-party clusters you register will incur a per-vCPU charge as part of your [GKE Enterprise pricing](/anthos/pricing) .\nTo register an attached cluster, see the following guides:\n- [Attach your EKS cluster](/anthos/clusters/docs/multi-cloud/attached/eks/how-to/attach-cluster) .\n- [Attach your AKS cluster](/anthos/clusters/docs/multi-cloud/attached/aks/how-to/attach-cluster) .\n- For all other cluster types, follow the instructions to [attach CNCF-conformant clusters](/anthos/clusters/docs/multi-cloud/attached/generic/how-to/attach-cluster) , paying attention to the [cluster prerequisites](/anthos/clusters/docs/multi-cloud/attached/generic/reference/cluster-prerequisites) .## Move a cluster to a different fleet\nMoving registered clusters between fleets (unregistering then reregistering) is not currently recommended, as it can result in unexpected or unwanted behavior: for example, your workloads' fleet Workload Identity will change, potentially resulting in blocked requests and outages. The recommended approach is to create a new cluster in the fleet in which you want your workloads to reside, then move your workloads from your old cluster to the new cluster.\n## (Optional) Create an empty fleet\nBy default, a new fleet is created in your fleet host project the first time you register a cluster in that project, or if you enable GKE Enterprise from the Google Cloud console. If you want to create a new named fleet before you register any clusters (for example, to [set up scopes for team access](/anthos/fleet-management/docs/team-management) ), run the following command:\n```\ngcloud alpha container fleet create --display-name=NAME [--project=FLEET_HOST_PROJECT_ID]\n```\nIf you don't specify a `display-name` , the new fleet has a default display name based on its fleet host project name.\n## View your fleets\nIf your organization has multiple fleets, you can quickly view and navigate between them in the Google Cloud console by using the **Fleet** drop-down list at the top of the GKE Enterprise navigation menu. Selecting a fleet in this list automatically switches you to its fleet host project in the Google Cloud console.\n## What's next?\n- [Before you begin](/anthos/fleet-management/docs/before-you-begin) for all cluster types.\n- Register a GKE cluster on Google Cloud:- [Prerequisites for clusters on Google Cloud](/anthos/fleet-management/docs/before-you-begin/gke) \n- [Register a cluster on Google Cloud to your fleet](/anthos/fleet-management/docs/register/gke)", "guide": "Google Kubernetes Engine (GKE)"}