{"title": "Google Kubernetes Engine (GKE) - Enable GKE Enterprise", "url": "https://cloud.google.com/kubernetes-engine/docs/how-to/enable-gkee", "abstract": "# Google Kubernetes Engine (GKE) - Enable GKE Enterprise\nThis page shows you how to enable Google Kubernetes Engine (GKE) Enterprise edition. GKE Enterprise is an enterprise tier for [GKE](/kubernetes-engine/docs) that brings all the capabilities of Anthos to GKE as part of a unified platform. To learn more about GKE Enterprise, see [Anthos and GKE Enterprise](/anthos/docs/concepts/gke-editions) .\nWhen you enable GKE Enterprise, the Anthos API is enabled in your project. To understand the charges that will apply, see [GKE pricing](/kubernetes-engine/pricing) .\n**Note:** If your project already has the GKE and Anthos APIs enabled, you don't need to do anything else to use GKE Enterprise. The GKE Enterprise console pages and features are all automatically available in your project.\n", "content": "## Before you begin\nThe instructions in this page assume that you already have GKE enabled in your chosen Google Cloud project. If not, do the following:\n## Enable GKE Enterprise from the Google Cloud console\nThis is our recommended approach for enabling GKE Enterprise in a project. It both enables GKE Enterprise and gets you started with a new [fleet](/anthos/fleet-management/docs) , with the option to enable additional enterprise features.\nTo enable GKE Enterprise from the Google Cloud console:\n- In the **Google Kubernetes Engine** page in the Google Cloud console, go to **Overview** . [Go to Overview](https://console.cloud.google.com/kubernetes/overview/) \n- Click **Learn and Enable** .\n- On the **Learn about GKE Enterprise** page, you can learn more about the platform before enabling GKE Enterprise.- To learn more about the features included with GKE Enterprise, view the details under the **Features and Benefits** tab.\n- For a side-by-side comparison of Google Kubernetes Engine (GKE) Standard edition and GKE Enterprise features, click the **Compare Plans** tab. You can also view a hypothetical monthly cost scenario for when you enable GKE Enterprise.\n- (Optional) To explore GKE Enterprise using a 90-day free trial period, select the **Start your 90-day free trial** checkbox. Note that you will still be charged Compute Engine fees during the free trial period.\n- Click **Enable GKE Enterprise** .\n- On the next page, you can optionally configure fleet settings for GKE Enterprise. The following settings are applied by default:- A new fleet is created for your project when you enable GKE Enterprise, and all clusters in your project are registered to the newly-created fleet.\n- GKE names the new fleet based on the project name.\nTo change these settings, click **Edit Fleet Name or Cluster List** .- On the **Fleet registration** page, to edit the name, enter the new name under **Fleet name** .\n- To edit the cluster list, manually select the clusters to include in the fleet.\n- Click **Save** .\n- To finalize the upgrade, click **Confirm** . This final step:- Enables all required APIs and dependencies.\n- Creates your fleet, registers your selected clusters to the fleet.\n- The **Overview** page is now refreshed, and gives you a \"big picture\" overview of your entire fleet. For more information on how to use this page, see [Use the fleet overview](/anthos/fleet-management/docs/enterprise-overview-dashboard) .## Enable GKE Enterprise from the command line\nTo enable GKE Enterprise from the command line, enable the Anthos API in your project as follows, specifying your project ID if you haven't set a default project for the Google Cloud CLI.\nWe also recommend that you enable the Fleet (GKE Hub) API, as this is required to work with fleets (enabling GKE Enterprise from the console also enables this API by default).\n```\ngcloud services enable --project=PROJECT_ID \\   anthos.googleapis.com \\   gkehub.googleapis.com\n```\nYou can also enable these APIs declaratively for your projects by using [Terraform](https://registry.terraform.io/providers/hashicorp/google/latest/docs/resources/google_project_service) .\nYou may need to enable additional APIs for your project to use enterprise features. For details, see the relevant feature guides.\n## Disable GKE Enterprise\nTo disable GKE Enterprise, disable the Anthos API for your project, following the instructions in [Disable GKE Enterprise](/anthos/docs/setup/disable-anthos) .", "guide": "Google Kubernetes Engine (GKE)"}