{"title": "Google Kubernetes Engine (GKE) - Enable access and view cluster resources by namespace", "url": "https://cloud.google.com/kubernetes-engine/docs/how-to/restrict-resources-access-by-namespace", "abstract": "# Google Kubernetes Engine (GKE) - Enable access and view cluster resources by namespace\nThis page explains how cluster or security administrators can restrict view access to cluster resources based on specific namespaces, and how users with restricted access can view these resources on the Google Cloud console.\n", "content": "## Enable namespace-restricted access to cluster resources\nAs a cluster administrator, you might want to provide restricted access to cluster resources for specific namespaces. This is a common scenario for organizations running [multi-tenant](/kubernetes-engine/docs/concepts/multitenancy-overview) Google Kubernetes Engine (GKE) clusters.\nYou can use tenant permissions to restrict user interactions with the cluster on the Google Cloud console. You grant users the [roles/container.clusterViewer](/kubernetes-engine/docs/how-to/iam#predefined) IAM permission as well as [role-based access control (RBAC) permissions](/kubernetes-engine/docs/how-to/role-based-access-control) to view resources in specific namespaces.\n**Note:** By default, the Google Cloud console expects users to have view access to all namespaces in all clusters (that is, users have the `roles/container.viewer` IAM permission). If the user only has access to specific namespaces, they should follow the steps described in [View namespace-restricted resources inthe Google Cloud console](#viewing-resources) .\nTo learn more about using namespaces, see [Organizing Kubernetes with Namespaces](https://cloud.google.com/blog/products/containers-kubernetes/kubernetes-best-practices-organizing-with-namespaces) and [Enterprise multi-tenancy best practices](/kubernetes-engine/docs/best-practices/enterprise-multitenancy#create-namespaces) .\n## View namespace-restricted resources in the Google Cloud console\nIf you have limited IAM or RBAC permissions and want to view namespace-restricted resources on the Google Cloud console, follow these steps:\n- Go to the **Workloads** page in the Google Cloud console. [Go to Workloads](https://console.cloud.google.com/kubernetes/workload/overview) \n- Click the **Namespace** drop-down list.\n- Click add **Add filter** .\n- Enter the namespace you want to access, then click **Save** .\n- Click **OK** .\nThe list will be filtered to show the selected namespace.\n## Share saved views\nYou can also save the filtered list as a named . The saved view will persist across sessions, and can be shared with other users.\nTo share a saved view, follow these steps:\n- Select the saved view from the **Saved view** drop-down list.\n- Next to the **Saved view** drop-down list, clickmore_vert, then click **Share** .\n- Clickcontent_copyto copy the URL in the **Share view** dialog. You can share this URL with other users who need access to the same cluster and namespaces.", "guide": "Google Kubernetes Engine (GKE)"}