{"title": "Google Kubernetes Engine (GKE) - About GKE Dataplane V2 observability", "url": "https://cloud.google.com/kubernetes-engine/docs/concepts/about-dpv2-observability", "abstract": "# Google Kubernetes Engine (GKE) - About GKE Dataplane V2 observability\n**    Preview     ** This feature is subject to the \"Pre-GA Offerings Terms\" in the General Service Terms section   of the [Service Specific Terms](/terms/service-terms#1) .     Pre-GA features are available \"as is\" and might have limited support.    For more information, see the [launch stage descriptions](/products#product-launch-stages) .\nGKE Dataplane V2 observability provides GKE Dataplane V2 metrics and insights into Kubernetes workloads. With GKE Dataplane V2 observability, starting with GKE versions **1.26.4-gke.500** or later or **1.27.1-gke.400** or later, you can:\n- Capture, observe, and alert on network metrics using [Google Cloud Managed Service for Prometheus](/stackdriver/docs/managed-prometheus) and [Cloud Monitoring ](/monitoring) with [Metrics Explorer](/monitoring/charts/metrics-explorer) \n- Understand traffic flows for a particular Service in a cluster\n- Understand and identify issues with the network health of a Kubernetes workload\n- Verify [Kubernetes Network Policies](https://kubernetes.io/docs/concepts/services-networking/network-policies/) \nGKE Dataplane V2 observability offers the following troubleshooting tools:\n- A Kubernetes cluster Network Topology\n- A Kubernetes Network Policy verdict table with live traffic flows and connection information\n- Command-line tooling for troubleshooting Kubernetes traffic flows\n#", "content": "## GKE Dataplane V2 metrics\nGKE Dataplane V2 metrics provide traffic flow information for the following:\n- **Traffic flows:** insights about how GKE handles flows between Pods and Services.\n- **Network policy enforcement:** information about how GKE enforces Kubernetes Network Policies.\nYou can use GKE Dataplane V2 metrics to monitor and troubleshoot Kubernetes workloads using the following tools:\n- **Google Cloud Managed Service for Prometheus** to view and analyze your GKE Dataplane V2 metrics. You can modify the Google Cloud Managed Service for Prometheus configuration to add or remove the metrics of your choice for Google Cloud Managed Service for Prometheus ingestion.\n- **Cloud Monitoring Metrics Explorer** to view Pod-level traffic flow details.\n- **Cloud Monitoring** to explore and use any metric. For example, you can create alerts that trigger when GKE Dataplane V2 metrics exceed certain thresholds.\n- **Self-managed Grafana** to visualize metrics collected by Google Cloud Managed Service for Prometheus.\nWhen you enable Google Cloud Managed Service for Prometheus:\n- GKE creates a`PodMonitoring`resource\n- GKE exposes the metrics endpoint\nTo consume metrics with Google Cloud Managed Service for Prometheus and to be able to create a `PodMonitoring` resource, you must enable Google Cloud Managed Service for Prometheus on the cluster. If you don't enable Google Cloud Managed Service for Prometheus, GKE exposes the metrics endpoint but does not create a `PodMonitoring` resource.\nWhen you enable GKE Dataplane V2 metrics for a cluster, Google Cloud Managed Service for Prometheus ingests the following GKE Dataplane V2 metrics:\n| GKE Dataplane V2 Metric          | Type  | Description      |\n|:---------------------------------------------------------------|:-----------|:----------------------------------|\n| prometheus.googleapis.com/pod_flow_egress_flows_count/counter | cumulative | Total number of flows from a Pod. |\n| prometheus.googleapis.com/pod_flow_ingress_flows_count/counter | cumulative | Total number of flows to a Pod. |\nEnabling GKE Dataplane V2 metrics opens the metrics port on each Kubernetes node.\nAdditional metrics are also available, including from the open source observability platform [Hubble](https://docs.cilium.io/en/v1.9/operations/metrics/#hubble-metrics) . By default, Google Cloud Managed Service for Prometheus doesn't ingest these additional metrics but you can configure Google Cloud Managed Service for Prometheus to collect them. To collect these metrics, [configure a PodMonitoring custom resource (CR)](/stackdriver/docs/managed-prometheus/setup-managed#gmp-pod-monitoring) .\nThe following table describes additional Hubble metrics:\n| Hubble metric     | Type  | Description            |\n|:-------------------------------|:-----------|:-----------------------------------------------------------|\n| hubble_flows_processed_total | cumulative | Total number of flows processed.       |\n| hubble_drop_total    | cumulative | Total number of flows dropped.        |\n| hubble_port_distribution_total | cumulative | Total number of flows processed aggregated by port number. |\n| hubble_tcp_flags_total   | cumulative | Total number of flows processed with given TCP flags set. |\n| hubble_icmp_total    | cumulative | Total number of ICMP flows processed.      |\n### GKE Dataplane V2 observability tools\nGKE Dataplane V2 observability provides a Managed Hubble solution with network observability and security insights for Kubernetes workloads deployed with GKE Dataplane V2.\nWhen enabled, GKE Dataplane V2 observability deploys the following components to your cluster:\n- **Hubble Relay:** a service that collects network telemetry data about your Pods from each node.\n- **Hubble CLI:** a command-line interface tool providing live traffic information within the cluster.\nYou can deploy the following component after you enable GKE Dataplane V2 observability to your cluster:\n- **Hubble UI:** a web-based tool that you can use to view and analyze the network telemetry data that is collected by Hubble Relay. You must enable GKE Dataplane V2 observability to deploy Hubble UI.## How GKE Dataplane V2 metrics and observability works\nGKE Dataplane V2 observability uses the following components and tools to collect metrics and provide insights into your network traffic:\n- GKE Dataplane V2: GKE Dataplane V2 metrics and observability use GKE Dataplane V2 datapath based on [eBPF](https://ebpf.io/what-is-ebpf/) to collect metrics about traffic flows and network policy enforcement for a Pod based on a given workload.\n- [Google Cloud Managed Service for Prometheus](/stackdriver/docs/managed-prometheus) : GKE Dataplane V2 metrics configures the Google Cloud Managed Service for Prometheus agent to ingest aggregated metrics to Google Cloud Managed Service for Prometheus, a scalable monitoring solution that can ingest and store large amounts of data that also enables you to leverage the [Google Cloud Observability](/stackdriver/docs/solutions/gke) .\n- [Hubble](https://github.com/cilium/hubble) : GKE Dataplane V2 observability uses Hubble, an open source observability project. Hubble enables network observability and security insights for Kubernetes workloads deployed with an eBPF Dataplane.Hubble flow events occur when:- A network connection is first established\n- A TCP flag is first seen, which indicates the state of the TCP connection\n- A packet is transmitted after at least five seconds have passed since the last flow event\n **Hubble metrics:** counts the number of flow events in a Kubernetes cluster that you can use to identify which Pods are communicating with each other. **Note:** Hubble flow metrics do not count the amount of data or number of packets transmitted.\n- **Enabling metrics and observability:** You can enable GKE Dataplane V2 and observability independent of each other. To enable Network topology visualization in open source Hubble UI feature, you must enable Network inspection.\n- **Autopilot clusters:** - Metrics are enabled by default\n- Observability tools are disabled by default\n- You must create the Cluster `PodMonitoring` resource to gather metrics in the Google Cloud Managed Service for Prometheus\n- **Standard clusters:** - Metrics are disabled by default\n- Observability tools are disabled by default\n- If you have Google Cloud Managed Service for Prometheus enabled, a `PodMonitoring` resource is created automatically\n- A `PodMonitoring` resource is marked as **ensure exists** . You can stop sending metrics to Google Cloud Managed Service for Prometheus by editing the `PodMonitoring` resource to disable all metrics\n### GKE Dataplane V2 observability endpoints\nGKE Dataplane V2 observability components expose the following two observability endpoints:\n- **Metrics endpoint:** an HTTP endpoint that exposes traffic metrics in Prometheus format. The `anetd` Pod exposes the metrics endpoint on each cluster node on port 9965.\n- **Flows port:** a gRPC endpoint. The `hubble-relay` Pod exposes the flows port endpoint as a Kubernetes `LoadBalancer` Service on port 443. The `hubble-relay` Pod is the backend for the Kubernetes `LoadBalancer` Service and all requests to the Kubernetes `LoadBalancer` Service are forwarded to the `hubble-relay` Pod. You can access the flow port using Hubble CLI or the Hubble UI.## Pricing\nGKE Dataplane V2 observability is a paid feature and is available without charge until general availability (GA). The following is an overview of GKE Dataplane V2 pricing:\n- **GKE Dataplane V2 metrics:** GKE Dataplane V2 metrics are enabled at the cluster level and you can enable it for free. GKE Dataplane V2 metrics are configured to be ingested into Google Cloud Managed Service for Prometheus, which has its own ingestion [cost](/stackdriver/docs/managed-prometheus#gmp-billing) .\n- **GKE Dataplane V2 observability tools:** GKE Dataplane V2 observability is enabled at the cluster level and charged per Pod per hour. GKE Dataplane V2 observability includes the UI and observability tools for monitoring and troubleshooting GKE clusters.## Limitations\n- In [Preview](/products#product-launch-stages) , GKE Dataplane V2 observability supports up to 1,000 nodes in clusters. You cannot create clusters with GKE Dataplane V2 observability and more than 1,000 nodes. If the cluster size reaches the 1,000 nodes limit, GKE Dataplane V2 observability blocks cluster creation or update. If you want to scale clusters beyond 1,000, disable GKE Dataplane V2 observability.\n- GKE Dataplane V2 observability only works in clusters with [GKE Dataplane V2](/kubernetes-engine/docs/concepts/dataplane-v2) enabled.\n- GKE Dataplane V2 metrics are similar to Hubble metrics in that they are implemented as flow-based metrics to provide connection information. These metrics do not count the amount of data nor number of packets transmitted. Given that the metrics are flow-based, they do not provide an accurate representation of the amount of data transmitted in a network flow.## What's next\n- [Set up GKE Dataplane V2 observability](/kubernetes-engine/docs/how-to/configure-dpv2-observability) \n- [Observe your traffic using GKE Dataplane V2 observability](/kubernetes-engine/docs/how-to/observe-your-traffic)", "guide": "Google Kubernetes Engine (GKE)"}