{"title": "Google Kubernetes Engine (GKE) - Identify clusters for Autopilot migration", "url": "https://cloud.google.com/kubernetes-engine/docs/how-to/identify-clusters-autopilot-migration", "abstract": "# Google Kubernetes Engine (GKE) - Identify clusters for Autopilot migration\nThis page shows you how to potentially reduce your cluster operating costs by identifying Google Kubernetes Engine (GKE) Standard clusters with underutilized nodes that would benefit from a migration to GKE Autopilot.\n", "content": "## Potential cost savings in Autopilot\nIn GKE Standard clusters, you're billed for the Compute Engine virtual machine (VM) infrastructure that backs each node, regardless of how efficiently your running workloads the compute resources. Continually managing your resource usage using efficient resource consumption methods such as is essential to run cost-efficient Standard clusters.\nIn Autopilot, you're billed for the compute resources, such as CPU or memory, that your running workloads request. This billing model removes the need for you to monitor and manage workload resource usage efficiency. For detailed pricing information, see [Autopilot mode pricing](/kubernetes-engine/pricing#autopilot-mode) .\nGKE monitors your running Standard clusters to detect node underutilization and recommends migrating to Autopilot clusters if the migration would potentially reduce your operating costs. GKE provides these recommendations through [Recommender](/recommender/docs/overview) , a service that provides insights and recommendations for using resources on Google Cloud.\n## Identify underutilized Standard clusters\nGKE generates insights and recommendations that help you to identify underutilized Standard clusters. To view these insights, use the Google Cloud console, the gcloud CLI, or the Recommender API and specify the following parameters:\n- **Recommender type:** `google.container.DiagnosisInsight`\n- **Subtype** :`CLUSTER_AUTOPILOT_OPTIMIZATION`\nFor instructions, see [View insights and recommendations](/kubernetes-engine/docs/how-to/optimize-with-recommenders#view-insights-recs) .\n## How GKE identifies clusters for potential Autopilot migration\nGKE uses the following signals to determine whether a Standard mode cluster is underutilized. The cluster must satisfy the following signal for GKE to generate an insight:\n| Signal    | Description                         | Threshold |\n|:----------------------|:---------------------------------------------------------------------------------------------------------------|:------------|\n| CPU bin-packing score | The amount of node CPU requested by running workloads as a percentage of the total available CPU on the node. | <55%  |\n### Decide whether to migrate to Autopilot\nAutopilot clusters shift node management responsibilities to GKE. Before you migrate your workloads to an Autopilot cluster, review the following resources to decide whether Autopilot fits your configurability and functionality needs:\n- [High-level comparison of cluster modes](/kubernetes-engine/docs/concepts/choose-cluster-mode) \n- [Detailed comparison of Autopilot and Standard](/kubernetes-engine/docs/resources/autopilot-standard-feature-comparison) \n- [Autopilot security overview](/kubernetes-engine/docs/concepts/autopilot-security) \n- [About GKE Autopilot](/kubernetes-engine/docs/concepts/autopilot-overview) \nIn most production environments, we recommend Autopilot clusters.\n### Limitations\nIf recent metrics from a GKE Standard cluster aren't available, you might not see an insight for that cluster.\n## Act on the recommendation\nIf you see this recommendation, contact Cloud Customer Care for more information about how your environment might benefit from a migration to Autopilot clusters. Contact your account representative or see [contact Cloud Customer Care](/contact) .\nIf you decide to migrate from Standard, check workload compatibility with Autopilot and prepare for a migration by following the guidance in [Prepare to migrate to Autopilot form Standard](/kubernetes-engine/docs/how-to/prepare-migrate-cluster-mode) .\n## What's next\n- [Optimize your usage of GKE with insights and recommendations](/kubernetes-engine/docs/how-to/optimize-with-recommenders) .", "guide": "Google Kubernetes Engine (GKE)"}