{"title": "Google Kubernetes Engine (GKE) - Alpha clusters", "url": "https://cloud.google.com/kubernetes-engine/docs/concepts/alpha-clusters", "abstract": "# Google Kubernetes Engine (GKE) - Alpha clusters\nThis page provides an overview of Kubernetes alpha features, and explains how alpha clusters work in Google Kubernetes Engine. You can [create an alpha cluster](/kubernetes-engine/docs/how-to/creating-an-alpha-cluster) or learn more [about cluster configuration choices](/kubernetes-engine/docs/concepts/types-of-clusters) .\n", "content": "## Overview\n**Warning:** Do not use Alpha clusters or alpha features for production workloads. Alpha clusters expire after thirty days and do not receive security updates. You must migrate your data from alpha clusters before they expire. GKE does not automatically save data stored on alpha clusters.\nYou can experiment with Kubernetes alpha features by creating an . Alpha clusters are short-lived clusters that run stable Kubernetes releases with all Kubernetes APIs and features enabled. Alpha clusters are designed for advanced users and early adopters to experiment with workloads that take advantage of new features before those features are production-ready. You can use Alpha clusters just like normal GKE clusters.\nAlpha clusters default to running the current default version of Kubernetes. You can [specify a different version](/kubernetes-engine/versioning-and-upgrades#specifying_cluster_version) during cluster creation. To learn which Kubernetes versions are available, refer to [Versioning and Upgrades](/kubernetes-engine/versioning-and-upgrades) and [Release Notes](/kubernetes-engine/docs/release-notes) , or run `gcloud container get-server-config` .\n### Limitations\nAlpha clusters have the following limitations:\n- Not covered by the [GKE SLA](/kubernetes-engine/sla) \n- Cannot be upgraded- Node auto-upgrade and auto-repair are disabled on alpha clusters\n- Automatically deleted after 30 days\n- Do not receive security updates\n- Not supported with Windows Server node pools.\n### Difference between alpha clusters and alpha GKE versions\nAlpha clusters do not necessarily run \"alpha\" versions of GKE. The term means that alpha APIs are enabled, both for Kubernetes and GKE, regardless of the version of Kubernetes the cluster runs. Periodically, Google offers customers the ability to test GKE versions that are not generally available, for testing and validation. These early-access versions can be run as alpha clusters or as clusters without the Kubernetes alpha APIs enabled.\n## Latest Kubernetes alpha features\nMost Kubernetes releases contain new Alpha features that you can test in alpha clusters. For a full list of Kubernetes releases and the features they include, see the [Kubernetes changelog](https://github.com/kubernetes/kubernetes/blob/master/CHANGELOG.md) .\n### About feature stages\nNew Kubernetes features are introduced in four stages: early development, alpha, beta, and stable.\nTo ensure stability and production quality, normal GKE clusters only enable features that are . Alpha features are not enabled on normal clusters because they are not production-ready or upgradeable.\nSince GKE automatically upgrades the Kubernetes control plane, enabling alpha features in production could jeopardize the reliability of the cluster if there are breaking changes in a new version.\nTo learn more about the stages of Kubernetes features, see [Alpha, Beta, and Stable Versions](https://github.com/kubernetes/community/blob/master/contributors/devel/sig-architecture/api_changes.md#alpha-beta-and-stable-versions) in the Kubernetes documentation.\nTo learn more about determining which features are enabled for a given GKE control plane version, see [Feature gates](/kubernetes-engine/docs/concepts/feature-gates) .\n## What's next\n- Learn more [about cluster configuration choices](/kubernetes-engine/docs/concepts/types-of-clusters) .\n- [Create an alpha cluster](/kubernetes-engine/docs/how-to/creating-an-alpha-cluster) .\n- [Read the GKE overview](/kubernetes-engine/docs/concepts/kubernetes-engine-overview) .", "guide": "Google Kubernetes Engine (GKE)"}