{"title": "Dataproc - Single node clusters", "url": "https://cloud.google.com/dataproc/docs/concepts/configuring-clusters/single-node-clusters", "abstract": "# Dataproc - Single node clusters\nSingle node clusters are Dataproc clusters with only one node. This single node acts as the master and worker for your Dataproc cluster. While single node clusters only have one node, most Dataproc concepts and features still apply, except those [listed below](#limitations) .\nThere are a number of situations where single node Dataproc clusters can be useful, including:\n- Trying out new versions of Spark and Hadoop or other open source components\n- Building proof-of-concept (PoC) demonstrations\n- Lightweight data science\n- Small-scale non-critical data processing\n- Education related to the Spark and Hadoop ecosystem", "content": "## Single node cluster semantics\nThe following semantics apply to single node Dataproc clusters:\n- Single node clusters are configured the same as multi node Dataproc clusters, and include services such as HDFS and YARN.\n- Single node clusters report as master nodes for [initialization actions](/dataproc/docs/concepts/configuring-clusters/init-actions) .\n- Single node clusters show 0 workers since the single node acts as both master and worker.\n- Single node clusters are given hostnames that follow the pattern`clustername-m`. You can use this hostname to SSH into or connect to a [web UI](/dataproc/docs/concepts/accessing/cluster-web-interfaces) on the node.\n- Single node clusters cannot be upgraded to multi node clusters. Once created, single node clusters are restricted to one node. Similarly, multi node clusters cannot be scaled down to single node clusters.## Limitations\n- Single node clusters are not recommended for large-scale parallel data processing. If you exceed the resources on a single node cluster, a multi node Dataproc cluster is recommended.\n- Single node clusters are not available with [high-availability](/dataproc/docs/concepts/configuring-clusters/high-availability) since there is only one node in the cluster.\n- Single node clusters cannot use [preemptible VMs](/dataproc/docs/concepts/compute/preemptible-vms) .## Creating a single node cluster\nYou can create a single node Dataproc cluster using the `gcloud` command-line tool. To create a single node cluster, pass the `--single-node` flag to the [gcloud dataproc clusters create](/sdk/gcloud/reference/dataproc/clusters/create) command.\n```\ngcloud dataproc clusters create cluster-name \\\n    --region=region \\\n    --single-node \\\n    ... other args\n```\nYou can create a single node cluster through the [Dataproc REST API](/dataproc/docs/reference/rest) using a [clusters.create](/dataproc/docs/reference/rest/v1/projects.regions.clusters/create) request. When making this request, you must:\n- Add the property`\"dataproc:dataproc.allow.zero.workers\":\"true\"`to the [SoftwareConfig](/dataproc/docs/reference/rest/v1/ClusterConfig#SoftwareConfig) of the cluster request.\n- Don't submit values for`workerConfig`and`secondaryWorkerConfig`(see [ClusterConfig](/dataproc/docs/reference/rest/v1/ClusterConfig) ).\nAn easy way to examine and construct the JSON body of a Dataproc API clusters create request is to open the Dataproc [Create a cluster](https://console.cloud.google.com/dataproc/clustersAdd) page, fill in the applicable fields, then click the **Equivalent REST** button at the bottom of the left panel to view the POST request with the completed JSON request body.\nYou can create a single node cluster by selecting \"Single Node (1 master, 0 workers)\" on the Cluster type section of the Set up cluster panel on the Dataproc [Create a cluster](https://console.cloud.google.com/dataproc/clustersAdd) page.", "guide": "Dataproc"}