{"title": "Dataproc - Dataproc Versioning", "url": "https://cloud.google.com/dataproc/docs/concepts/versioning/overview", "abstract": "# Dataproc - Dataproc Versioning\nDataproc uses images to tie together useful Google Cloud Platform connectors and Apache Spark & Apache Hadoop components into one package that can be deployed on a Dataproc cluster. These images contain the base operating system (Debian or Ubuntu) for the cluster, along with [core and optional components](/dataproc/docs/concepts/components/overview) needed to run jobs, such as Spark, Hadoop, and Hive. These images will be upgraded periodically to include new improvements and features. Dataproc versioning allows you to select sets of software versions when you create clusters.\n", "content": "## How versioning works\nWhen an image is created, it is given an [Image Version](/dataproc/docs/concepts/versioning/dataproc-versions) number in the following format:\n`version_major.version_minor.version_sub_minor-os_distribution`\nThe following OS distributions are currently maintained:\n| OS Distribution Code | OS Distribution |\n|:-----------------------|:------------------|\n| debian12    | Debian 12   |\n| debian10    | Debian 10   |\n| debian11    | Debian 11   |\n| rocky8     | Rocky Linux 8  |\n| rocky9     | Rocky Linux 9  |\n| ubuntu18    | Ubuntu 18.04 LTS |\n| ubuntu20    | Ubuntu 20.04 LTS |\n| ubuntu22    | Ubuntu 22.04 LTS |\nSee [old image versions](#old_image_versions) for previously supported OS distributions.\nThe recommended practice is to specify the `major.minor` image version for production environments or when compatibility with specific component versions is important. The sub-minor and OS distributions will be automatically set to the latest weekly release.\n## Selecting versions\nWhen you create a new Dataproc cluster, the latest available **Debian** image version will be used by default. You can select a Debian, Rocky Linux or Ubuntu image version when creating a cluster (see the [Dataproc Image version List](/dataproc/docs/concepts/versioning/dataproc-versions) ). When specifying Debian-based images, you can omit the OS Distribution Code suffix, for example by specifying `2.0` to select the `2.0-debian10` image. The OS suffix **must** be used to select a Rocky Linux or Ubuntu-based image, for example by specifying `2.0-ubuntu18` .\nWhen using the `gcloud dataproc clusters create` command, you can use the `--image-version` argument to specify an image version for the new cluster.\n **Debian image example:** \n```\ngcloud dataproc clusters create cluster-name \\\n    --image-version=2.0 \\\n    --region=region\n```\n **Ubuntu image example:** \n```\ngcloud dataproc clusters create cluster-name \\\n    --image-version=2.0-ubuntu18 \\\n    --region=region\n```\nBest practice is to omit the sub-minor version so that the latest sub-minor version is used. However, if necessary, the sub-minor version can be specified, for example, \"2.0.20\".\nYou can check your current version with the Google Cloud CLI.\n```\ngcloud dataproc clusters describe cluster-name \\\n    --region=region\n```You can specify the `SoftwareConfig` [imageVersion](/dataproc/docs/reference/rest/v1/ClusterConfig#SoftwareConfig) field as part of a [cluster.create](/dataproc/docs/reference/rest/v1/projects.regions.clusters/create) API request.\n **Example** \n```\nPOST /v1/projects/project-id/regions/us-central1/clusters/\n{\n \"projectId\": \"project-id\",\n \"clusterName\": \"example-cluster\",\n \"config\": {\n \"configBucket\": \"\",\n \"gceClusterConfig\": {\n  \"subnetworkUri\": \"default\",\n  \"zoneUri\": \"us-central1-b\"\n },\n \"masterConfig\": {\n  ...\n  }\n },\n \"workerConfig\": {\n  ...\n  }\n },\n \"softwareConfig\": {\n  \"imageVersion\": \"2.0\"\n }\n }\n}\n \n```Open the Dataproc [Create a cluster](https://console.cloud.google.com/dataproc/clustersAdd) page. The Set up cluster panel is selected. The Image Type and Version field in the Versioning section shows the image that will be used when creating  the cluster. The image release date is also shown. Initially, the default  image, the latest available Debian version, is shown as selected.  Click CHANGE to display a lists of available images. You can select a  standard or [custom image](/dataproc/docs/guides/dataproc-images) to use for your cluster.\n## When new versions are created\nNew **major** versions will be created periodically to incorporate one or more of the following:\n- Major releases for:- Spark, Hadoop, and other Big Data components\n- Google Cloud connectors\n- Major changes or updates to Dataproc functionality\nNew **preview** versions (with a `-RC` suffix) are released prior to the release of a new major version:\n- Preview images are not intended for use in production workloads.\n- Preview image component versions might be upgraded to the latest available component version in the post-preview GA image version.\nNew **minor** versions will be created periodically to incorporate one or more of the following:\n- Minor releases and updates for:- Spark, Hadoop, and other Big Data components\n- Google Cloud connectors\n- Minor changes or updates to Dataproc functionality\nWhen a new minor version is created, its Debian image becomes the default for the major version, and represents the latest release of the major version.\nNew * versions will be created periodically to incorporate one or more of the following:\n- Patches or fixes for a component in the image\n- Component sub-minor version upgrades## Image Version and Dataproc support\nMinor image versions are supported for 24 months after initial GA (General Availability) release. During this period, clusters using these image versions are eligible for support (to receive fixes, recreate your cluster using the latest supported sub-minor image version). After the support window has closed, clusters using the image versions are not eligible for support.\n## Old Image Versions\n### Previously supported OS distributions\nThe following OS distributions were previously supported:\n| OS Distribution Code | OS Distribution | Last Patched (End of support) |\n|:-----------------------|:------------------|:--------------------------------|\n| debian9    | Debian 9   | July 10, 2020     |\n| deb8     | Debian 8   | October 26, 2018    |\n## Image Versions without explicit OS distribution\nPrior to August 16, 2018, image versions were built with Debian 8, and omitted the OS Distribution Code. They are specified in the following format:\n`version_major.version_minor.version_sub_minor`\n### 0.1 and 0.2\nImage versions released as alpha or beta releases prior to Dataproc version `1.0` general availability are not subject to the [Dataproc support policy](#image_version_and_support) .\n## Important notes about versioning\n- Image Versions are bundles of core components, such as Spark, Hadoop, and Hive, which are installed on all clusters, and optional components, which can be selected for installation by the user (see [Dataproc Components](/dataproc/docs/concepts/components/overview) ).\n- Once created, running clusters are not automatically updated when new Image Versions are released.\n- You should test and validate that your applications run properly when using new Image Versions, especially new major releases.", "guide": "Dataproc"}