{"title": "Dataproc - Restartable jobs", "url": "https://cloud.google.com/dataproc/docs/concepts/jobs/restartable-jobs", "abstract": "# Dataproc - Restartable jobs\nBy default, Dataproc jobs will not automatically restart on failure. By using optional settings, you can set jobs to restart on failure. When you set a job to restart, you specify the maximum number of retries per hour (max value is 10 retries per hour) and/or the maximum number of total retries (max value is 240 total retries).\nRestarting jobs mitigates common types of job failure, including out-of-memory issues and unexpected Compute Engine virtual machine reboots. Restartable jobs are particularly useful for long-running and streaming jobs. For example, you can restart Spark streaming jobs running on Dataproc clusters to ensure that the streaming jobs are resilient.\n", "content": "## Restartable job semantics\nThe following semantics apply to reporting the success or failure of jobs:\n- A job is reported **successful** if the driver terminates with code`0`.\n- A job is reported **failed** if:- The driver terminates with a non-zero code more than 4 times in 10 minutes.\n- The driver terminates with a non-zero code, and has exceeded the`max_failures_per_hour`or the`max_failures_total`setting.\n- A job will be **restarted** if the driver exits with a non-zero code, is not thrashing, and is within the`max_failures_per_hour`and`max_failures_total`settings.## Job design considerations\n- Design your jobs to gracefully handle restarting. For example, if your job writes to a directory, your job accommodate the possibility that the directory will exist when the job is restarted.\n- Apache Spark streaming jobs that checkpoint can be restarted after failure, but they will not report Yarn status.## Creating and using restartable jobs\nYou can specify the maximum number of times a job can be restarted per hour and the maximum number of total retries when submitting the job through the gcloud CLI [gcloud](/sdk/gcloud/reference) command-line tool, the [Dataproc REST API](/dataproc/docs/reference/rest) , or the [Google Cloud console](https://console.cloud.google.com/) .\n**Example:** If you want to allow your job to retry up to 10 times, but no more than 5 times in one hour, set `max-failures-total` to 10 and `max-failures-per-hour` to 5.\nSpecify the maximum number of times a job can be restarted per hour (the max value is 10 retries per hour) and/or the maximum number of total retries (max value is 240 total retries) using the `--max-failures-per-hour` and `--max-failures-total` flags, respectively.\n```\ngcloud dataproc jobs submit job type \\\n    --region=region \\\n    --max-failures-per-hour=number \\\n    --max-failures-total=number \\\n    ... other args\n```\nSpecify the maximum number of times a job can be restarted per hour (max value is 10 retries per hour) and/or the maximum number of total retries (max value is 240 total retries) by setting the [Job.JobScheduling](/dataproc/docs/reference/rest/v1/JobScheduling) `maxFailuresPerHour` and/or `maxFailuresTotal` fields, respectively .\n **Example** \n```\nPOST /v1/projects/project-id/regions/us-central1/jobs:submit/\n{\n\"projectId\": \"project-id\",\n\"job\": {\n\"placement\": {\n \"clusterName\": \"example-cluster\"\n},\n\"reference\": {\n \"jobId\": \"cea7ae0b....\"\n},\n\"sparkJob\": {\n \"args\": [ \"1000\"\n ],\n \"mainClass\": \"org.apache.spark.examples.SparkPi\",\n \"jarFileUris\": [ \"file:///usr/lib/spark/examples/jars/spark-examples.jar\"\n ]\n},\n\"scheduling\": {\n \"maxFailuresPerHour\": 5\n \"maxFailuresTotal\": 10\n}\n}\n}\n```\nAn easy way to examine the JSON body of a Dataproc API request or response is to construct the request or select the resource to list from the appropriate Dataproc page of the Google Cloud console, then click the **Equivalent REST** button at the bottom of the page.\nYou can submit restartable jobs by specifying the **max restarts per hour** on the Dataproc [Submit a job](https://console.cloud.google.com/dataproc/jobs/jobsSubmit) page (the maximum value is 10 times per hour). Currently, the max restarts total setting is not available on the Google Cloud console.", "guide": "Dataproc"}