{"title": "Dataproc - Workflow scheduling solutions", "url": "https://cloud.google.com/dataproc/docs/concepts/workflows/workflow-schedule-solutions", "abstract": "# Dataproc - Workflow scheduling solutions\nThis section describes Google Cloud options you can use to schedule workflows.\n", "content": "## Dataproc Workflow Templates\nDataproc [Workflow templates](/dataproc/docs/concepts/workflows/overview) provide a flexible and easy-to-use mechanism for managing and executing workflows. A Workflow Template is a reusable workflow configuration. It defines a graph of jobs with information on where to run those jobs.\n## Cloud Scheduler\nCloud Scheduler is a fully managed enterprise-grade cron job scheduler. It allows you to schedule virtually any job, including batch, big data jobs, and Cloud infrastructure operations. It provides simple time-based scheduling, for example, daily or hourly, without requiring you to write code.\n**Advantages:**\n- Enables time-based instantiation of workflow templates based on familiar cron expressions\n- No code to write\nTutorial: [Workflow using Cloud Scheduler](/dataproc/docs/tutorials/workflow-scheduler)\n## Cloud Functions\nCloud Functions is a lightweight compute solution you can use to create single-purpose, stand-alone functions that respond to Cloud events without the need to manage a server or runtime environment. You can use Cloud Functions to launch Workflows in response to Pub/Sub events or file changes in Cloud Storage. You can use Cloud Functions with Cloud Scheduler for workflows that require the calculation of time-based parameters.\n**Advantages:**\n- Enables workflow instantiation in response to data events, such as new files in Cloud Storage or Pub/Sub events.\n- Minimal coding required using Dataproc [Go](https://github.com/googleapis/google-cloud-go) , [Node.js](https://github.com/googleapis/google-cloud-node) , or [Python](https://github.com/googleapis/google-cloud-python) client libraries\n- Dynamically generate workflows and workflow parameters\nTutorial: [Workflow using Cloud Functions](/dataproc/docs/tutorials/workflow-function)\n## Cloud Composer\nCloud Composer is a managed Apache Airflow service you can use to create, schedule, monitor, and manage workflows.\n**Advantages:**\n- Supports time- and event-based scheduling\n- Simplified calls to Dataproc using Operators\n- Dynamically generate workflows and workflow parameters\n- Build data flows that span multiple Google Cloud products\nTutorial: [Workflow using Cloud Composer](/dataproc/docs/tutorials/workflow-composer)", "guide": "Dataproc"}