{"title": "Dataproc - Stop and start Dataproc clusters", "url": "https://cloud.google.com/dataproc/docs/guides/dataproc-start-stop", "abstract": "# Dataproc - Stop and start Dataproc clusters\nAfter you create a cluster, you can stop it, then restart it when you need it. Stopping an idle cluster avoids incurring charges and avoids the need to delete an idle cluster, then create a cluster with the same configuration later.\n**Feature Notes:**\n- The cluster start/stop feature is only supported with the following Dataproc image versions or above:- 1.4.35-debian10/ubuntu18\n- 1.5.10-debian10/ubuntu18\n- 2.0.0-RC6-debian10/ubuntu18\n- Stopping individual cluster nodes is not recommended since the status of a stopped VM may not be in sync with cluster status, which can result in errors.", "content": "## Stopping a cluster\nStopping a cluster stops all cluster Compute Engine VMs. You do not pay for these VMs while they are stopped. However, you continue to pay for any associated cluster resources, such as [persistent disks](/dataproc/docs/concepts/compute/dataproc-pd-ssd) .\nNotes:\n- **Running operations:** If a cluster has running operations (such as update or diagnose operations), the stop request will fail.\n- **Running jobs:** If a cluster has running jobs, the stop request will succeed, the VMs will stop, and the running jobs will fail.\n- **Stop Response:** When the stop request returns a stop operation to the user or caller in the response, the cluster will be in a`STOPPING`state, and no further jobs will be allowed to be submitted (`SubmitJob`requests will fail).\n- **Autoscaling:** If you stop a cluster that has [autoscaling](/dataproc/docs/concepts/configuring-clusters/autoscaling) enabled, the Dataproc autoscaler will stop scaling the cluster. It will resume scaling the cluster once it has been started again. If you enable autoscaling on a stopped cluster, the autoscaling policy will only take effect once the cluster has been started.\n### Monitoring the stop operation\nYou can run [gcloud dataproc operations describe operation-id](/sdk/gcloud/reference/dataproc/operations/describe) to monitor the long-running cluster stop operation. You can also use the [gcloud dataproc clusters describe cluster-name](/sdk/gcloud/reference/dataproc/clusters/describe) command to monitor the transitioning of the cluster's status from `RUNNING` to `STOPPING` to `STOPPED` .\n### Limitations\n- You cannot stop:- clusters with [secondary workers](/dataproc/docs/concepts/compute/secondary-vms) \n- clusters with [local ssds](/dataproc/docs/concepts/compute/dataproc-local-ssds) \n- After a cluster is stopped, you cannot:- update the cluster\n- submit jobs to the cluster\n- access notebooks on the cluster using the [Dataproc component gateway](/dataproc/docs/concepts/accessing/dataproc-gateways) \n## Starting a cluster\n- When you start a stopped cluster, any initialization actions will not be re-run. Initialization actions are only run on cluster nodes when the cluster is created and when nodes are added when the cluster is scaled up.\n- After the start operation completes, you can immediately submit jobs to the cluster. However, execution of these jobs can be delayed (approximately 30 seconds) to allow HDFS and YARN to become operational.## Using Stop/Start\nYou can stop and start a cluster using the gcloud CLI or the Dataproc API.\n**Stop a cluster** \n```\ngcloud dataproc clusters stop cluster-name \\\n    --region=region\n```\n **Start a cluster** \n```\ngcloud dataproc clusters start cluster-name \\\n    --region=region\n``` **Stop a cluster** \nSubmit a [clusters.stop](/dataproc/docs/reference/rest/v1/projects.regions.clusters/stop) request.\n **Start a cluster** \nSubmit a [clusters.start](/dataproc/docs/reference/rest/v1/projects.regions.clusters/start) request.Click the cluster name from the Dataproc [Clusters](https://console.cloud.google.com/dataproc/clusters) page in the Google Cloud console, then click STOP to stop and START to start the cluster.", "guide": "Dataproc"}