{"title": "Dataproc - Dataproc Hub Overview", "url": "https://cloud.google.com/dataproc/docs/tutorials/dataproc-hub-overview", "abstract": "# Dataproc - Dataproc Hub Overview\nDataproc Hub and  Vertex AI Workbench user-managed notebooks are  deprecated. On January 30, 2025, support for user-managed notebooks  will end and the ability to create user-managed notebooks instances  will be removed. For alternative notebook solutions  on Google Cloud, see:- [Install  the Jupyter component on your Dataproc cluster](/dataproc/docs/concepts/components/jupyter#install_jupyter) .\n- [Create  a Dataproc-enabled  Vertex AI Workbench instance](/vertex-ai/docs/workbench/instances/create-dataproc-enabled) .\nThe Dataproc Hub lets you to take advantage of Vertex AI Workbench and Dataproc to run interactive ML and data processing tasks at scale using Jupyter notebooks and the Hadoop and Spark ecosystem.\nDataproc Hub notebooks are administrator-curated, single-user notebooks running on a Dataproc JupyterLab cluster created and running in the user's project.\n- Dataproc Hub leverages JupyterHub to:- Bring consistency across the organization by enabling administrators to create a curated list of notebook templates for different groups of data and ML users.\n- Accelerate notebook creation by providing data and ML users with pre-configured environments that match their software and hardware requirements.\n- Dataproc Hub provides separate interfaces for administrators and users:- Administrators use the **Dataproc→Workbench→User-Managed Notebooks** page in the Google Cloud console to create Dataproc Hub instances. Each hub instance contains a predefined set of notebook environments defined by YAML cluster configuration files.\n- Data and ML users use the Notebooks→Instances UI in the Google Cloud console to select a predefined notebook environment to spawn a notebook server on their Dataproc cluster.- Users without console access can access the Dataproc Hub instance to spawn a Dataproc cluster from their web browser by using a Dataproc Hub instance URL provided by the administrator.If the organization does not define and implement separate notebook administrative and user roles, instead of using Dataproc Hub to configure and spawn a Jupyter notebook cluster, users can [install the Jupyter component on their cluster](/dataproc/docs/concepts/components/jupyter) .\n- Dataproc Hub use cases:- Data and ML users are organized in groups with common software and hardware requirements (users can be placed in multiple groups)\n- Restricted Dataproc console access: Users do not have access to Dataproc in the Google Cloud console\n- Dataproc Hub features:- Predefined user environments\n- Cluster and notebook isolation: members of a group are not provided easy access to clusters and notebooks of members in other groups\n", "content": "## For more information\n- Admins: [Configure Dataproc Hub](/dataproc/docs/tutorials/dataproc-hub-admins) \n- Users: [Use Dataproc Hub](/dataproc/docs/tutorials/dataproc-hub-users)", "guide": "Dataproc"}