{"title": "Dialogflow - Intent matching", "url": "https://cloud.google.com/dialogflow/es/docs/intents-matching", "abstract": "# Dialogflow - Intent matching\nWhen an end-user writes or says something, referred to as an , Dialogflow compares the expression to the [training phrases](/dialogflow/docs/intents-training-phrases) for each intent to find the best match. Matching an intent is also known as . This document describes the factors used to match an intent.\n", "content": "## Matching algorithms\nDialogflow uses two algorithms to match intents: and . Dialogflow simultaneously attempts both algorithms and chooses the best result.\n**Note:** ML matching can be [disabled for an intent](/dialogflow/docs/intents-settings#disable-ml) , but this is rarely a good option.\nThe following table lists the pros and cons of these algorithms:\n| Algorithm     | Pros                       | Cons                                          |\n|:----------------------------|:----------------------------------------------------------------------------------------------|:----------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| Rule-based grammar matching | Accurate with a small or large number of training phrase examples.Models are updated quickly. | Does not support the automated expansion entity option.                              |\n| ML matching     | Accurate with a large number of training phrase examples.Matching is fast.     | Inaccurate with a small number of training phrase examples.Models are updated slowly.Less accurate than grammar matching for agents with training phrases in template mode. |\n## Intent detection confidence\nWhen searching for a matching intent, Dialogflow scores potential matches with an , also known as the . These values range from 0.0 (completely uncertain) to 1.0 (completely certain). Without taking the other factors described in this document into account, once intents are scored, there are three possible outcomes:\n- If the highest scoring intent has a confidence score greater than or equal to the [ML Classification Threshold](/dialogflow/docs/agents-settings#ml) setting, it is returned as a match.\n- If no intents meet the threshold, a [fallback intent](/dialogflow/docs/intents-default#fallback) is matched.\n- If no intents meet the threshold and no fallback intent is defined, no intent is matched.## Intent priority\nYou can set [priorities](/dialogflow/docs/intents-settings#priority) for intents. When two or more intents match the same end-user expression with similar confidence scores, priority is used to select the best match. Otherwise, the confidence score for intent matching is more important than priority.\n## Knowledge connectors\n[Knowledge connectors](/dialogflow/docs/knowledge-connectors) complement defined intents. They parse (for example, FAQs) to find information related to end-user expressions.\nIf a defined intent and a knowledge document are both potential matches, the match confidence of each and the [knowledge results preference](/dialogflow/docs/knowledge-connectors#settings) are used to determine which match is the selected match.\n## Context\nWhile [contexts](/dialogflow/docs/contexts-overview) are active, Dialogflow is more likely to match intents that are configured with [input contexts](/dialogflow/docs/contexts-input-output#input_contexts) that correspond to the currently active contexts.\n## Fallback intents\n[Fallback intents](/dialogflow/docs/intents-default#fallback) have the lowest priority for intent matching.", "guide": "Dialogflow"}