{"title": "Dialogflow - Training", "url": "https://cloud.google.com/dialogflow/cx/docs/concept/training", "abstract": "# Dialogflow - Training\nWhen your agent is trained, Dialogflow uses your training data to build machine learning models specifically for your agent. Each flow of your agent has its own model. This training data primarily consists of intents, intent training phrases, and entities referenced in a flow; which are effectively used as machine learning data labels. However, agent models are built using parameter prompt responses, state handlers, agent settings, and many other pieces of data associated with your agent.\nWhenever you change your agent, you should ensure that the agent is trained before attempting to use it. Depending on your agent settings, training may occur automatically or manually.\nWhen training is initiated by the console, the [task indicator](/dialogflow/cx/docs/concept/console#task) provides status for the tasks.\n", "content": "## Draft flow automatic training\n[ML settings](/dialogflow/cx/docs/concept/agent#settings-ml) allow you to select either a **Standard NLU** or **Advanced NLU** NLU type. The standard NLU type has a setting to enable or disable automatic training. The advanced NLU type does not support automatic training.\nIf you have disabled automatic training, or the NLU type does not support automatic training, you must execute [manual training](#draft-manual) after you have completed updates.\n## Draft flow manual training\nTo manually train a flow from the console, click the **Train NLU** button in the [ML settings](/dialogflow/cx/docs/concept/agent#settings-ml) .\nTo manually train a flow with the API, call the `train` method for the `Flow` type.## Flow version automatic training\nWhenever a new [flow version](/dialogflow/cx/docs/concept/version) is created, the new flow version is automatically trained.\nTo create a new flow version from the console, click the **Create** button on the [Version panel](/dialogflow/cx/docs/concept/version#manage-versions) .\nTo create a new flow version with the API, call the `create` method for the `Version` type.", "guide": "Dialogflow"}