{"title": "Dialogflow - Search", "url": "https://cloud.google.com/dialogflow/cx/docs/concept/search", "abstract": "# Dialogflow - Search\nThe search feature allows you to search, filter, and access the core resources within an agent. You can filter your search results by the following resources:\n- Flows\n- Pages\n- Intents\n- Entity types\n- Route groups\n- Webhooks\nTo search for a resource:\n- Open the [Dialogflow CX Console](https://dialogflow.cloud.google.com/cx/projects) .\n- Choose your GCP project.\n- Select your agent.\n- Click the search icon in the top menu bar.\n- In the search bar, enter the keyword for the resource you are searching for. You can search for a resource by one of its properties, such as ID, display name, text response, conditional response, or custom payload. Optionally, you can filter the results by type of resource from the dropdown menu.As you type, a dropdown menu provides a limited number of results. Click on a result to go to the editing panel of that resource.- You can also click **Search references** for a result to display all resources that reference the resource you're searching for. For example, if enter the keyword`store`and click **Search references** for the`store.location`intent in the results menu, the search results show all resources that reference the`store.location`intent.\n- Press the key or click the search icon to view the full list of search results.\nFor more granular filter options, click the **Show search options** dropdown menu in the search bar.\n- Select a type of resource to filter by.\n- Under **Reference Filters** , select the **AND** or **OR** matching rule.\n- Add one or more rules to search for resources by other resources they reference, or by their properties. For example, to search for all pages with the trigger intent `store.hours` , and where the display name contains `store` :- For the first rule, select **Intent** from the dropdown menu and enter `store.hours` in the text box.\n- Click **Add Rule (AND)** .\n- For the second rule, select **Display Name** from the dropdown menu and enter `store` in the text box.\n- Click **Search** ", "content": ".", "guide": "Dialogflow"}