{"title": "Dialogflow - Fuzzy matching", "url": "https://cloud.google.com/dialogflow/es/docs/entities-fuzzy", "abstract": "# Dialogflow - Fuzzy matching\nBy default, entity matching requires an exact match for one of the entity entries. This works well for single-word entity entry values and synonyms but may present a problem for multi-word values and synonyms. For example, consider a entity that should be matched for the following end-user expression parts:\n- \"ball\"\n- \"red ball\"\n- \"ball red\"\n- \"small ball\"\n- \"ball small\"\n- \"small red ball\"\n- \"small ball red\"\n- \"red small ball\"\n- \"red ball small\"\n- \"ball small red\"\n- \"ball red small\"\nFor a match to occur, you normally need to define an entity entry value and synonyms for each of these permutations. However, with fuzzy matching enabled, the ordering of the words in a value or synonym does not matter. The following will trigger a match for all of the examples above:\n- \"ball\"\n- \"red ball\"\n- \"small ball\"\n- \"small red ball\"", "content": "## Where to find this data\nWhen building an agent, it is most common to use the Dialogflow ES Console ( [visit documentation](/dialogflow/docs/console) , [open console](https://dialogflow.cloud.google.com) ). The instructions below focus on using the console. To access entity data:\n- Go to the [Dialogflow ES Console](https://dialogflow.cloud.google.com) .\n- Select an agent.\n- Select **Entities** in the left sidebar menu.\nIf you are building an agent using the API instead of the console, see the [EntityTypes reference](/dialogflow/docs/reference/common-types#entitytypes) . The API field names are similar to the console field names. The instructions below highlight any important differences between the console and the API.\n## Create a fuzzy matching entity\nTo create a fuzzy matching entity:\n- Open an existing entity or create a new one.\n- Check **Fuzzy matching** .\n- Enter one or more entries in the table.\n- Click **Save** .\nIf you are using the API to create or update entities, set the `enable_fuzzy_extraction` field to true for the `EntityType` .\n## Limitations\nThe following limitations apply:\n- Fuzzy matching cannot be enabled for [regexp entities](/dialogflow/docs/entities-regexp) . These features are mutually exclusive.\n- Fuzzy matching should not be enabled for entities which are used to match strict values like IDs, national identification numbers, and so on.## Partial matches\nWhen you define synonyms that contain multiple words, Dialogflow will attempt to match end-user input to the closest matching synonym, which may include partial matches. For example, if you define a synonym as \"cold brew coffee\", and the end-user input is \"cold coffee\", the associated entity will be matched unless there is a better match.\n## Spell correction\nWhen end-user input could be considered a misspelling of an entity synonym, the associated entity may be matched. For example, if you define a synonym as \"lumber\", and the end-user input is \"number\", the associated entity may be matched.", "guide": "Dialogflow"}