{"title": "Dialogflow - Versions and environments", "url": "https://cloud.google.com/dialogflow/es/docs/agents-versions", "abstract": "# Dialogflow - Versions and environments\nYou can create multiple versions of your agent and publish them to separate environments.\nWhen you edit an agent, you are editing the . At any point, you can save the draft agent as an , which is an immutable snapshot of your agent.\nWhen you save the draft agent, it is published to the . When you create agent versions, you can publish them to . You can create a variety of custom environments for:\n- testing\n- development\n- production\n- etc.", "content": "## Production traffic\n### Always use agent versions for production traffic\nA draft agent is updated every time a developer on your team makes a change. It is easy to break a draft agent unintentionally, especially if multiple people have write access to the agent. In addition, a recently edited draft agent may be inconsistent with the trained model, because training may have a delay or require manual execution.\nYou should always use agent versions for your production traffic. Draft agents should be tested before promoting them to production versions, and you can rollback to a previous version if any problems are discovered.\n### Consider possible agent errors while changing versions\nIf you change an agent version in your production environment while sessions are active, it may cause agent errors for some active sessions. These errors may happen if the previous and new versions are inconsistent with each other in a way that disrupts session state. Due to this, you should plan to change versions during down-time or off-peak hours.\n## Publish a version in a new environment\nTo publish an agent draft to a version and create a custom environment:\n- Go to the [Dialogflow ES Console](https://dialogflow.cloud.google.com) .\n- Select your agent near the top of the left sidebar menu.\n- Click the settingsbutton next to the agent name.\n- Click the **Environments** tab.\n- Click **Publish a version** .\n- Add an optional description and click **Next** .\n- Select **+New Environment** . **Note:** You can create an agent version without publishing it by selecting **Create version without publishing** from the environment menu.\n- Enter an environment name.\n- Choose the fulfillment method for the environment.\n- Select Text-to-speech settings for the environment.\n- Click **Publish** .\n- The environment information is now listed in the **Custom environments** section.\n- Call the`create`method for the [Version type](/dialogflow/es/docs/reference/common-types#versions) to create a new agent version.\n- Call the`create`method for the [Environment type](/dialogflow/es/docs/reference/common-types#environments) to create a new environment. Provide the agent version you just created to the`agentVersion`field.## Revert an environment to a previous version\nYou can revert an environment to a previous agent version:\n- Click an environment in the **Custom environments** section.\n- The environment settings dialog opens.\n- Click the optionbutton for a previously published version in the **Publishing History** section.\n- Click **Revert to this version** .\n- The publishing history will be updated.\nCall the `patch` / `update` method for the [Environment type](/dialogflow/es/docs/reference/common-types#environments) to update an environment. Provide the agent version you previously created to the `agentVersion` field.\n## Load a previous version to draft\nLoading a previous version to draft overwrites the draft agent in the default environment with a selected agent version.\n**Caution:** Loading a previous version to draft will negate all recent changes to draft and can't be undone. You may want to save the draft to a version before taking these steps.\nTo load a previous version to draft:\n- Go to the [Dialogflow ES Console](https://dialogflow.cloud.google.com) .\n- Select your agent near the top of the left sidebar menu.\n- Click the settingsbutton next to the agent name.\n- Click the **Environments** tab.\n- Click **View all versions** in the **Draft** section.\n- Click the optionbutton for a version that you want to load to draft.\n- Click **Load to Draft** .\n- Click **Yes, I'm sure** .\n- Reload any open console browser tabs, so they are refreshed with the latest agent data.\nCall the `patch` / `update` method for the [Environment type](/dialogflow/es/docs/reference/common-types#environments) with the following inputs:- Use`-`as the environment ID to specify the default environment.\n- Set`allowLoadToDraftAndDiscardChanges`to true.\n- For the`agentVersion`field, supply the agent version that will overwrite the draft agent.## Export a version\nTo export a version, you need to [load it to draft](#load-to-draft) first, then [export the agent](/dialogflow/es/docs/agents-settings#export) .\n## Test your agent in an environment\nYou can use the API to test your agent in any of your custom environments. Call the [detect intent](/dialogflow/docs/quick/api) method, but alter the endpoint URL by inserting `environments/environment-name/users/-/` between `agent` and `sessions` .\nFor example, the following endpoint uses the \"development\" environment with an unspecified user:\n```\n\"https://dialogflow.googleapis.com/v2/projects/my-project-id/agent/environments/development/users/-/sessions/123456789:detectIntent\"\n```\n## Environment-specific settings\nFulfillment and text-to-speech are configured by the environment, so the agent will use the environment's settings for these features.\nFor more information about how data is applied at various levels, see [agent application levels](/dialogflow/es/docs/data-level) .\n## Google Assistant\nIf you are using [Actions on Google release environments](https://developers.google.com/assistant/console/releases) , see the versioning limitations for the [Dialogflow fulfillment library](/dialogflow/docs/fulfillment-inline-editor#library) .\n## Mega agent\nSee [how versions and environments work in mega agents](/dialogflow/es/docs/agents-mega#versions) .\n## Limitations\nThe following limitations apply:\n- Maximum number of environments per agent: 10\n- Maximum number of versions per agent: 1000", "guide": "Dialogflow"}