{"title": "Dialogflow - System entities", "url": "https://cloud.google.com/dialogflow/cx/docs/concept/entity-system", "abstract": "# Dialogflow - System entities\nDialogflow provides many to extract common types from end-user expressions. For example, the `@sys.color` type can be used to extract values like \"red\" or \"blue\". You can see the full list of system entities in the [System entity reference](/dialogflow/cx/docs/reference/system-entities) .\nFor most applications, the values provided by system entities work well. However, your application may need to add additional values for system entities. For example, you may want to add \"blue-green\" to the list of values for `@sys.color` . Some system entities can be extended for this purpose. The [System entity reference](/dialogflow/cx/docs/reference/system-entities) lists the system entities that can be extended.\nSystem entity support differs for [languages](/dialogflow/cx/docs/reference/language) and [regions](/dialogflow/cx/docs/concept/region) . See the [system entity limitations](/dialogflow/cx/docs/reference/system-entities#limits) for details.\n", "content": "## Extend a system entity\nTo extend a system entity:\n- Use the system entity in one of your [parameters](/dialogflow/docs/intents-actions-parameters) .\n- Select the **Manage** tab.\n- Click **Entity Types** .\n- Select the **System** tab for system entities.\n- The system entities currently used by your agent are listed. Entities shown in a grey font color are not extendable, and entities shown in a normal font color are extendable.\n- You can select an extendable entity and update the extended values.\n- Provide entity entries using the values you want to extend the entity with.\nCreating system entity extensions is similar to how you create [custom entities](/dialogflow/cx/docs/concept/entity-custom) . Provide the name of the system entity you wish to extend, and provide the values you want to extend it with. If you attempt to extend a system entity that is not extendable, you will receive an error.", "guide": "Dialogflow"}