{"title": "Dialogflow - Generative features overview", "url": "https://cloud.google.com/dialogflow/cx/docs/concept/generative", "abstract": "# Dialogflow - Generative features overview\nDialogflow now provides a set of generative conversational features built on Dialogflow and [Vertex AI](/vertex-ai/docs) .\nWith these features, you can now use large language models (LLMs) to parse and comprehend content, generate agent responses, and control conversation flow. This can significantly reduce agent design time and improve agent quality.\n**Note:** Over the coming months, the Dialogflow console and [Vertex AI Search and Conversation](/generative-ai-app-builder/docs/introduction) console will be merging some of these generative features.\nThe following is an overview of these features:\n| X     | Item                                                                                            |\n|:--------------------|:---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| Generative agents | Generative agents provide a new way for creating Dialogflow CX virtual agents using LLMs. Rather than defining flows, pages, intents, and transitions; you provide natural language instructions and structured data. This can significantly reduce the virtual agent creation and maintenance time, and enable brand new types of conversational experiences for your business. |\n| Data store agents | Data store agents parse and comprehend your public or private content (website, internal documents, and so on). Once this information is indexed, your agent can answer questions and have conversations about the content. You just need to provide the content.                            |\n| Generators   | Generators are used to generate agent responses. Rather than providing the agent response for a fulfillment, you provide a LLM prompt that can handle many scenarios including conversation summarization, question answering, customer information retrieval, and escalation to a human.                      |\n| Generative fallback | Generative fallback is used to generate agent responses when end-user input does not match an intent. You can enable generative fallback on no-match event handlers by providing a LLM prompt to generate the response.                                       |\n", "content": "## Pricing\nFor pricing, see [Vertex AI Search and Conversation](/generative-ai-app-builder/pricing) .", "guide": "Dialogflow"}