{"title": "Dialogflow - System entities", "url": "https://cloud.google.com/dialogflow/es/docs/entities-system", "abstract": "# Dialogflow - System entities\nDialogflow provides many to extract common types from end-user expressions. For example, the `@sys.color` type can be used to extract values like \"red\" or \"blue\". You can see the full list of system entities in the [System entity reference](/dialogflow/docs/reference/system-entities) .\nFor most applications, the values provided by system entities work well. However, your application may need to add additional values for system entities. For example, you may want to add \"blue-green\" to the list of values for `@sys.color` . Some system entities can be extended for this purpose. The [System entity reference](/dialogflow/docs/reference/system-entities) lists the system entities that can be extended. The remaining sections of this document describe how to extend system entities.\nSystem entity support differs for each language. See the [system entity limitations](/dialogflow/es/docs/reference/system-entities#limits) for details.\n", "content": "## Where to find this data\nWhen building an agent, it is most common to use the Dialogflow ES Console ( [visit documentation](/dialogflow/docs/console) , [open console](https://dialogflow.cloud.google.com) ). The instructions below focus on using the console. To access system entity data for your agent:\n- Go to the [Dialogflow ES Console](https://dialogflow.cloud.google.com) .\n- Select an agent.\n- Select **Entities** in the left sidebar menu.\n- Select the **System** tab for system entities.\nIf you are building an agent using the API instead of the console, see the [EntityTypes reference](/dialogflow/docs/reference/common-types#entitytypes) . The API field names are similar to the console field names. The instructions below highlight any important differences between the console and the API.\n## Extend a system entity from the entities page\nFrom the entities page, you can view system entities used by your agent and extend them by following these steps:\n- Use the system entity in one of your [parameters](/dialogflow/docs/intents-actions-parameters) .\n- Select **Entities** in the left sidebar menu.\n- Select the **System** tab for system entities.\n- The system entities currently used by your agent are listed. Entities shown in a grey font color are not extendable, and entities shown in a normal font color are extendable.\n- You can select an extendable entity and update the extended values.\n- Provide entity entries using the values you want to extend the entity with.\n## Extend a system entity with the API\nIf you are using the API to extend system entities, create system entity extensions similar to how you create [custom entities](/dialogflow/docs/entities-custom) . Provide the name of the system entity you wish to extend, and provide the values you want to extend it with. If you attempt to extend a system entity that is not extendable, you will receive an error.\n## Extend a system entity while annotating a training phrase\nFrom the intent page's training phrase section, you can extend a system entity while [annotating a training phrase](/dialogflow/docs/intents-training-phrases#annotation) . If you manually annotate a training phrase part with an extendable system entity that does not include the selected value, you will be prompted to add this value to the system entity.", "guide": "Dialogflow"}