{"title": "Dialogflow - Access control", "url": "https://cloud.google.com/dialogflow/cx/docs/concept/access-control", "abstract": "# Dialogflow - Access control\nIt is common for multiple team members to [collaborate on building an agent](/dialogflow/cx/docs/concept/agent-collaboration) and for services to access the agent. Using , you can control access and permissions granted to [principals](/docs/authentication#principal) .\nYou can configure access using the Dialogflow CX Console ( [visit documentation](/dialogflow/cx/docs/concept/console) , [open console](https://dialogflow.cloud.google.com/cx/projects) ) or by using the Google Cloud console ( [visit documentation](https://support.google.com/cloud/answer/3465889?ref_topic=3340599) , [open console](https://console.cloud.google.com/) ) with [Identity and Access Management (IAM)](/iam/docs) . The Google Cloud console is used to grant [IAM roles](#iam-roles) to principals, while the Dialogflow Console is used to grant to principals. Dialogflow agent roles are convenient [predefined roles](https://cloud.google.com/iam/docs/understanding-roles#role_types) defined by Dialogflow that restrict access to one agent or the child resources of a specific agent.\nThere are some situations in which you must use the Google Cloud console:\n- [IAM Project Owner role](#iam-roles) is by default granted to the user that created the project that owns the agent. This owner has full access to all agents in the project. If you want to change the project owner, you need to use the Google Cloud console.\n- Only agent-level access can be configured through the Dialogflow CX Console. If you want to configure project-level access, you need to use the Google Cloud console.\n- A subset of IAM roles have corresponding Dialogflow agent roles. If you want to grant a project-level or agent-level role that does not exist on the Dialogflow CX Console, you need to use the Google Cloud console.\n- If you are creating a [data store agent](/dialogflow/cx/docs/concept/data-store-agent) with the [Vertex AI Conversation user interface](/generative-ai-app-builder/docs/agent-intro) , you need to use the Google Cloud console.\nIf you are using the API, you may also have one or more applications that send requests to an agent. In this case, you can control access with [service accounts](/dialogflow/cx/docs/quick/setup#auth) .\n", "content": "## Control access with the Dialogflow CX Console\nThe Dialogflow CX Console allows you to apply convenient agent roles configured for agent-level sharing. These roles correlate to IAM roles with [IAM conditions](/iam/docs/conditions-overview) that limit access to the specific agent or a subset of child resources of the agent.\nTo access agent roles configuration from the Dialogflow CX Console, you must be granted the [Project IAM Admin role](#iam-roles) for the associated project. This role is granted from the Google Cloud console.\n**Note:** The Dialogflow CX Console will only show principals with these specific roles and agent-specific conditions. If you have used the Google Cloud console to add principals with any roles or conditions, they will not appear in the Dialogflow CX Console.\n| Dialogflow agent role | Summary                                        | IAM Role         |\n|:------------------------|:----------------------------------------------------------------------------------------------------------------------------------------------------------------------|:-------------------------------------------|\n| Admin     | Provides full access to create, update, query, detect intent, and delete the agent from the console or API.               | Dialogflow > Dialogflow API Admin   |\n| Reader     | Provides read access to query (not detect intent) the agent from the console or API.                     | Dialogflow > Dialogflow API Reader   |\n| Client     | Provides access to detect intent from the console or API.                            | Dialogflow > Dialogflow API Client   |\n| Intent Admin   | Provides access to create, update, delete, or query the intents of an agent from the console or API.                 | Dialogflow > Dialogflow Intent Admin  |\n| Entity Type Admin  | Provides access to create, update, delete, or query the entity types of an agent from the console or API.                | Dialogflow > Dialogflow Entity Type Admin |\n| Webhook Admin   | Provides access to create, update, delete, or query the webhooks of an agent from the console or API.                 | Dialogflow > Dialogflow Webhook Admin  |\n| Test Case Admin   | Provides access to create, update, delete, or query the test cases of an agent from the console or API.                | Dialogflow > Dialogflow Test Case Admin |\n| Flow editor    | Provides access to update, query a specific flow, and create, update, delete, or query the flow resources (pages, route groups and versions) from the console or API. | Dialogflow > Dialogflow Flow editor  |\n| Environment editor  | Provides access to update, query a specific environment, and create, update, delete, or query the environment resources (experiments) from the console or API.  | Dialogflow > Dialogflow Environment editor |\nSharing options are found in the agent's settings. To open the agent sharing settings:\n- Open the [Dialogflow CX Console](https://dialogflow.cloud.google.com/cx/projects) .\n- Choose your Google Cloud project.\n- Select your agent.\n- Click **Agent Settings** .\n- Click the **Share** tab.\n### Add a principal\n- Click **Add** .\n- Enter the email address for the user, group or service account.\n- Select **User** , **Group** or **Service Account** for the email type.\n- The **Dialogflow Reader** role is added by default, which is required for the users to access the Dialogflow CX Console.\n- Click **Add role** under **Assign roles** .\n- Select a role type under **Type** .\n- For the **Flow Editor** and **Environment Editor** roles, select specific flows or environments or keep the default **All** option.\n- Optionally, set the expiration date for the role.\n- Click **Save** .\n### Change principal roles\n- Click the principal in the list.\n- Update roles for this principal in the pop-up.\n- Click **Save** .\n### Remove a principal\n- Find the principal in the list.\n- Click the deletebutton for the principal.\n- Click **Ok** .\n**Note:** After you apply principal role changes, there may be a delay before the changes take effect.\n## Control access with the Google Cloud console\nYou can control access with [IAM](/iam/docs) settings. See the [IAM quickstart](/iam/docs/grant-role-console) for detailed instructions on adding, editing, and removing permissions.\nTo access the settings below, open the [IAM](https://console.cloud.google.com/iam-admin/iam) page in the Google Cloud console.\n### Add a user or service account to the project\nYou can provide permissions to either users or service accounts by granting them roles on your Google Cloud project. Users are added by providing their email address. Service accounts are also added by providing their associated email address. You need to add service accounts when you want to use one service account for multiple projects. To find the email address associated with your service account, see the IAM [Service Accounts](https://console.cloud.google.com/iam-admin/serviceaccounts) page in the Google Cloud console.\nTo add a principal:\n- Click the addaddbutton at the top of the page.\n- Enter the principal's email address.\n- Select a role.\n- Click **Save** .\n### Change permissions\n- Click the editeditbutton for the principal.\n- Select a different role.\n- Click **Save** .\n### Remove a principal\n- Click the deletedeletebutton for the principal.\n### Add a condition to restrict access to one agent\nWhen adding or editing a principal, you can create an [IAM condition](/iam/docs/conditions-overview) that restricts access to one agent.\n**Note:** Please grant agent roles to user emails for CX console access directly in the Dialogflow CX console.\nFor example:\n```\n{    \"expression\": \"resource.name.startsWith(\\\"projects/PROJECT_ID/locations/REGION_ID/agents/AGENT_ID\\\")\",    \"title\": \"For Dialogflow Agent AGENT_ID\"}\n```\nThis condition gives you basic access to a specific agent. For example, a service account with this condition can only call the Dialogflow API to access the agent specified in the condition for the project, but not other agents in the project.\nTo add this condition to a role granted to a principal:\n- Select a principal.\n- Click the editeditbutton for the principal.\n- Click **Add condition** .\n- In the **Title** field, enter`For Dialogflow Agent AGENT_ID`and replace AGENT_ID with your agent ID.\n- You may add any description.\n- Select the **Condition Editor** to create your condition.\n- Add the expression`resource.name.startsWith(\"projects/PROJECT_ID/locations/REGION_ID/agents/AGENT_ID\")`, replacing AGENT_ID with your agent ID and PROJECT_ID with your project ID.\n- Click **Save** .## IAM roles\nThe following table lists common IAM roles relevant to Dialogflow CX. Permission summaries in the table use the following terms:\n- **Full access** : Permission to modify access, create, delete, edit, and read any resource.\n- **Edit access** : Permission to create, delete, edit, and read any resource.\n- **Session access** : Permission to call methods for runtime-only resources during a conversation like detecting intent, updating context, updating session entities, or Agent Assist conversation interactions.\n- **Read access** : Permission to read any resource.\n**Note:** In order to modify access for an agent, you need a role that provides **full access** to the agent. In order to delete an agent, you need a role that provides **full access** or **edit access** to the agent.\n**Note:** The [console simulator](/dialogflow/cx/docs/concept/console#simulator) calls the detectIntent API method during a conversation. This method performs a write on the session state. In order to use the console or call the API's detectIntent/streamingDetectIntent methods, you need a role that provides **full access** , **edit access** , or **session access** .\n| IAM role          | Permission Summary                                                                      | Permission Detail       |\n|:---------------------------------------------|:----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|:--------------------------------------------|\n| Project > Owner        | Grant to project owners that need full access to all Google Cloud and Dialogflow resources: Full access to all Google Cloud project resources using Google Cloud console or APIs. Full access to agents using the Dialogflow Console. Can detect intent using API.          | See IAM basic role definitions.   |\n| Project > Editor        | Grant to project editors that need edit access to all Google Cloud and Dialogflow resources: Edit access to all Google Cloud project resources using Google Cloud console or APIs. Edit access to agents using the Dialogflow Console. Can detect intent using API.          | See IAM basic role definitions.   |\n| Project > Viewer        | Grant to project viewers that need read access to all Google Cloud and Dialogflow resources: Read access to all Google Cloud project resources using Google Cloud console or APIs. Read access to agents using the Dialogflow Console or API, cannot use the simulator. Cannot detect intent using API. | See IAM basic role definitions.   |\n| Project > IAM Admin       | Grant to project IAM admins that need edit access to Dialogflow agent roles configuration.                                                    | See IAM resource manager role definitions. |\n| Project > Browser       | Grant to project browsers that need read access to browse the hierarchy for a project, including the folder, organization, and IAM policy: Read access to Google Cloud project hierarchy. No access to agents using the Dialogflow Console. Cannot detect intent using API.       | See IAM project role definitions.   |\n| Dialogflow > Dialogflow API Admin   | Grant to Dialogflow API admins that need full access to Dialogflow-specific resources: Full access to all Dialogflow resources using Google Cloud console or APIs. Full access to agents using the Dialogflow Console. Can detect intent using API.              | See Dialogflow IAM role definitions.  |\n| Dialogflow > Dialogflow API Client   | Grant to Dialogflow API clients that perform detect intent calls using the API: Session access to runtime Dialogflow resources using Dialogflow simulator or API. Limited access to agents using the Dialogflow Console. Can detect intent using API.             | See Dialogflow IAM role definitions.  |\n| Dialogflow > Dialogflow Console Agent Editor | Grant to Dialogflow CX Console editors that edit existing agents: Full access to all Dialogflow resources using Google Cloud console. Edit access to most agent data using the Dialogflow Console. Can detect intent using API.                  | See Dialogflow IAM role definitions.  |\n| Dialogflow > Dialogflow API Reader   | Grant to Dialogflow API clients that perform Dialogflow-specific read-only calls using the API: Read access to all Dialogflow resources using Google Cloud console or APIs. Read access to agents using the Dialogflow Console, cannot use the simulator. Cannot detect intent using API.    | See Dialogflow IAM role definitions.  |\n| Discovery Engine Admin      | Grant to users that create data store agents with the Vertex AI Conversation user interface.                                                   | See Other role definitions.    |\n## OAuth\nIf you are using Google client libraries to access Dialogflow, you do not need to use [OAuth](https://developers.google.com/identity/protocols/oauth2) directly, because these libraries handle the implementation for you. However, if you are implementing your own client, you may need to implement your own OAuth flow. Access to the Dialogflow API requires one of the following OAuth scopes:\n- `https://www.googleapis.com/auth/cloud-platform`(access to all project resources)\n- `https://www.googleapis.com/auth/dialogflow`(access to Dialogflow resources)## Requests that involve Cloud Storage access\nSome Dialogflow requests access objects in [Cloud Storage](/storage/docs) for reading or writing data. When you call one of these requests, Dialogflow accesses the Cloud Storage data on the caller's behalf. This means that your request authentication must have permissions to access Dialogflow as well as the Cloud Storage objects.\nWhen using a Google client library and IAM roles, see the [Cloud Storage access control guide](/storage/docs/access-control) for information on Cloud Storage roles.\nWhen implementing your own client and using [OAuth](#oauth) , you must use the following OAuth scope:\n- `https://www.googleapis.com/auth/cloud-platform`(access to all project resources)", "guide": "Dialogflow"}