{"title": "Dialogflow - Examples", "url": "https://cloud.google.com/dialogflow/vertex/docs/concept/examples", "abstract": "# Dialogflow - Examples\n**    Preview     ** This product or feature is subject to the \"Pre-GA Offerings Terms\" in the General Service Terms section   of the [Service Specific Terms](/terms/service-terms#1) .     Pre-GA products and features are available \"as is\" and might have limited support.    For more information, see the [launch stage descriptions](/products#product-launch-stages) .\nEach playbook should have one or more examples. These examples are sample conversations between an end-user and the playbook agent, including the dialogue and actions performed by the playbook agent. These are effectively [few-shot prompt examples](/vertex-ai/docs/generative-ai/learn/introduction-prompt-design#include-examples) for the LLM.\nThe console provides an interface for you to enter actions.\n", "content": "## Multilingual playbook agents\nIf you want your playbook agent to handle multiple languages, your examples should use each of the languages.\n## Example input summary and output summary\nIn addition to input and output parameters, playbooks support receiving an **input summary** and emitting an **output summary** for exchanging information with other playbooks. Summaries are helpful for passing abstract contextual information between playbooks, while parameters are more helpful for passing structured, well defined fields between playbooks. Parameters are the only way to exchange data between flows and playbooks.\nAdd relevant input summaries to examples to condition the playbook to adjust its actions based on the input summaries at runtime. Add output summaries including relevant, accurate details about the example conversation to show the playbook what details are important to summarize.\n**Note:** Examples for the [default playbook](/dialogflow/vertex/docs/concept/playbooks#default)  **may not** define input parameters or an input summary. The default playbook serves as an entrypoint for user conversations, so it has no way to receive input parameters.\n## Example state\nAt a given point in the conversation, a playbook will be in one of the following states:\n- `OK`: The playbook successfully achieved its goal and control will now transfer to the parent playbook.\n- `CANCELLED`: The user decided not to proceed with the goal assigned to the playbook. The control will now transfer to the parent playbook.\n- `FAILED`: The playbook cannot proceed with the goal due to some error (e.g. tool returns 500 error). The session will end with status fail.\n- `ESCALATED`: The playbook decided that it cannot achieve the goal and needs to escalate the situation to a human. The session will end with status escalated.\n- `PENDING`: The conversation is still continuing within the playbook.\nThe top-level example and its playbook invocations should be denoted with a state which corresponds to the playbook they are referencing.\n## Selection strategy\nSelection strategy controls whether or not each example is included in the playbook's prompt.\n- `DEFAULT`: the example may be omitted if the prompt nears the token limit.\n- `STATIC`: the example is always included.\n- `NEVER`: the example is never included in the prompt. The example will have no effect whatsoever on the playbook's performance.\n**Note:** Selection strategy 'Never' may be useful for temporarily excluding an example for testing to understand its effects on the playbook's performance.", "guide": "Dialogflow"}