{"title": "Dialogflow - Legacy Analytics", "url": "https://cloud.google.com/dialogflow/cx/docs/concept/analytics-legacy", "abstract": "# Dialogflow - Legacy Analytics\nThe Dialogflow CX Console provides an analytics panel that shows various agent request and response data statistics. This data helps you assess how your agent is being used in production and may be used to improve your agent.\nYou can select from multiple data views and filter by time range. The statistics shown on all charts are computed hourly.\n", "content": "## Open the analytics panel\nTo open the analytics panel:\n- Go to the [Dialogflow CX Console](https://dialogflow.cloud.google.com/cx/projects) .\n- Choose your project.\n- Select your agent.\n- Select the **Manage** tab.\n- Click **Analytics** .\n- Using the link near the top, you can also access the [New Analytics](/dialogflow/cx/docs/concept/analytics) .## Common metric definitions\nThe following metrics are displayed on multiple charts:\n- **Interactions** :include detect intent request counts via direct API calls and indirect calls via integrations.\n- **Sessions** :are determined by the session ID provided to interactions. You must create unique session IDs for this metric to be meaningful. For each hour on the x-axis, themetric shows a count of active sessions during that hour. If a session crosses an hour boundary, it will be counted for each hour it is active. Therefore, the sum of all hourly session values on a chart may be larger than the total number of actual sessions during the entire time period.## Overview view\nThe **Overview** view is at the top of the analytics panel.\nThis view has controls for the time period and time zone, which are applied to all content in the panel.\nThe following summary metrics are also shown:\n- **Usage (session count)** : Total number of sessions in the selected time period.\n- **Engagement (total interaction count)** : Total number of interactions in the selected time period.\n- **Path (average duration minutes)** : Average duration of the audio sessions in the selected time period.\n- **Back-end (error code %)** : Percentage of interactions that do not have OK status in the selected time period.\nFor each summary metric, a percent increase or decrease is shown. This shows the change in the metric since the same-sized time period just before the selected time period.\n## Usage view\nThe **Usage** view shows session count for the selected time period. You can select the following tabs to filter the data:\n- **Overall** : Shows all sessions.\n- **Speech-to-text** : Shows sessions that used speech-to-text.\n- **Text-to-speech** : Shows sessions that used text-to-speech.\n- **Per language** : Charts sessions per language.## Engagement view\nThe **Engagement** view shows interaction count for the selected time period.\n- **Overall** : Shows all interactions.\n- **Average per session** : Shows the average interaction count per session.\n- **Speech-to-text** : Shows interactions that used speech-to-text.\n- **Text-to-speech** : Shows interactions that used text-to-speech.\n- **Per language** : Charts interactions per language.## Understanding view\nThe **Understanding** view shows aggregate metrics at the intent, page and flow level. The level is selected with the drop-down.\n- **Unhandled message** : The percentage of no-match interactions where end-user input did not match any intents for handlers that are in scope and did not satisfy any form parameters.\n- **Sessions** : Session count for the selected level.\n- **Interactions** : Interaction count for the selected level.\n- **Exit %** : The percentage of sessions that ended with a flow, page, or intent match during the selected time period.## Path view\nThe **Path** view's **Session path** tab graphs page nodes with connecting page path lines. The page path lines in this graph show the frequencies as found in complete paths taken by common sessions for the agent. One page node may appear multiple times if it is matched in multiple paths or multiple times in a single path. You can interact with this chart by clicking page nodes to expand them.\nHovering your mouse over a page node shows a popup with metrics for the page:\n- **Sessions followed this path prefix** : The count and percentage of sessions that followed the path up to the page node.\n- **Ended at this point** : The percentage of sessions that ended on the path up to the page node.\nThe **Average duration** tab shows the hourly average duration of audio sessions.\n## Back-end session count\nThe **Back-end session count** view shows sessions by integrations and webhooks.\n## Back-end interaction count\nThe **Back-end interaction count** view shows interactions by status codes, interactions and webhooks.\n## Limitations\nThe following limitations apply:\n- It can take up to a day for data to appear in analytics.", "guide": "Dialogflow"}