{"title": "Dialogflow - Custom entities", "url": "https://cloud.google.com/dialogflow/es/docs/entities-custom", "abstract": "# Dialogflow - Custom entities\nYou can create custom entities for matching data specific to your agent. For example, you could define a `vegetable` entity type that can match the types of vegetables available for purchase with a grocery store agent.\n**Note:** When building your agent, it's best to define your entities prior to adding [training phrases](/dialogflow/docs/intents-training-phrases) to your intents. The console will automatically annotate your training phrases with existing entities. However, if you create entities after training phrases, you can manually annotate the phrases.\n", "content": "## Where to find this data\nWhen building an agent, it is most common to use the Dialogflow ES Console ( [visit documentation](/dialogflow/docs/console) , [open console](https://dialogflow.cloud.google.com) ). The instructions below focus on using the console. To access custom entity data:\n- Go to the [Dialogflow ES Console](https://dialogflow.cloud.google.com) .\n- Select an agent.\n- Select **Entities** in the left sidebar menu.\n- Select the **Custom** tab for custom entities.\nIf you are building an agent using the API instead of the console, see the [EntityTypes reference](/dialogflow/docs/reference/common-types#entitytypes) . The API field names are similar to the console field names. The instructions below highlight any important differences between the console and the API.\n## Create custom entities\nTo create a custom [map entity](/dialogflow/docs/entities-options#map) :\n- Click **Create entity** .\n- Enter a name for the entity.\n- Note that **Define synonyms** is already checked.\n- Click the first row and provide a reference value in the left column.\n- Click the next column or press **Enter** and provide synonyms.\n- Continue adding rows for other entity entries.\n- Click **Save** .\n## Batch operations\nYou can move, copy, or delete multiple entities using batch operations:\n- **Copy** : Copies selected entities to the target agent.\n- **Move** : Moves selected entities to the target agent.\n- **Delete** : Permanently deletes the selected entities. This cannot be undone.\nThe following additional options are prompted for copy and move operations:\n- **Copy related entities** : Moves or copies entities used in [composite entities](/dialogflow/docs/entities-options#comp) .\n- **Overwrite entities** : Overwrites entities with the same name.\nTo copy, move, or delete multiple entities:\n- Hover you mouse over the list and select one or more entities. This reveals the batch options.\n- Choose the desired action.\n- Select the desired options in the dialog.\n- Click **Start** .## Limitations\nThe following limitations apply:\n- Custom entity type names are unique for each agent. Entity type names should start with a letter and can contain the following:`A-Z`,`a-z`,`0-9`,`_`(underscore),`-`(dash). Entity reference and synonym values have no such limitation.", "guide": "Dialogflow"}