{"title": "Dialogflow - Greeting prebuilt component", "url": "https://cloud.google.com/dialogflow/cx/docs/concept/prebuilt-component/greeting", "abstract": "# Dialogflow - Greeting prebuilt component\nThe greeting [prebuilt component](/dialogflow/cx/docs/concept/prebuilt-component) retrieves the caller's phone number ( [ANI](https://en.wikipedia.org/wiki/Automatic_number_identification) ), if available. If the phone number is retrieved, the component does a soft-authentication using the phone number, validating it against registered phone numbers. The agent then greets the end-user with a personalized message based on their account information.\n", "content": "## Limitations\nIn addition to the [common prebuilt component limitations](/dialogflow/cx/docs/concept/prebuilt-component#limits) , this prebuilt component has the following limitations:\n- The component assumes that the customer phone numbers are maintained in a CRM (Customer Relationship Management) system or other service.\n- Existing customers using an alternate phone number to contact will not be authenticated by this component.## Sample dialogs\nThe following sample dialogs demonstrate common scenarios handled by this prebuilt component. The sample dialogs demonstrate behavior when the component is called via telephony, which triggers the Default Welcome Intent and the first agent response at the start of the conversation.\n### Authenticated end-user\nEnd-user is identified based on the calling number and receives a personalized greeting message.\n| User input | Agent response                               |\n|-------------:|:-----------------------------------------------------------------------------------------------------------------------------------------|\n|   nan | Hi [Caller First Name]. Thank you for contacting [Company Name], we are committed to your financial health. How may we assist you today? |\n### Unidentified end-user\nEnd-user's calling number is not identified and end-user is greeted with the standard greeting message.\n| User input | Agent response                         |\n|-------------:|:-----------------------------------------------------------------------------------------------------------------|\n|   nan | Thank you for contacting [Company Name], we are committed to your financial health. How may we assist you today? |\n## Naming conventions\nThis prebuilt component uses the following naming conventions:\n| Feature | Format            | Example           |\n|:----------|:------------------------------------------------------|:-------------------------------------------------|\n| Flow  | [Component Name]          | Greeting           |\n| Parameter | [param_name]           | ani_auth           |\n| Webhook | prebuilt_components_[component_name]:[webhook_action] | prebuilt_components_greeting:get_account_details |\n## Input parameters\nInput parameters are parameters that are used to configure certain behaviors of the component. The parameters will be used by one or more conditions within the flow to determine how the component should behave. Flow-scoped parameters must be set on the start page of the component as described below. Session-scoped parameters may be set either by a calling flow, or on the start page of this component.\nThis prebuilt component accepts the following input parameters:\n| Parameter Name  | Description                    | Input Format |\n|:-------------------|:----------------------------------------------------------------------------------------|:---------------|\n| $flow.company_name | Captures the name of the company which will be used dynamically in the Greeting prompt. | string   |\n## Output parameters\nOutput parameters are session parameters that will remain active after exiting the component. These parameters contain important information collected by the component. This prebuilt component provides values for the following output parameters:\n| Parameter Name | Description                                               | Output Format |\n|:-----------------|:-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|:----------------|\n| ani_auth   | This parameter captures the result of ANI based authentication. By default, the value is false.                          | boolean   |\n| auth_level  | Indicates the authentication level of the caller. By default, the value is null. -1 indicates that the user was not authenticated by their ANI. 0 indicates that the ANI authentication was a success. | integer   |\n## Basic setup\nTo set up this prebuilt component:\n- [Import the prebuilt component](/dialogflow/cx/docs/concept/prebuilt-component#import) .\n- Configure the provided [flexible webhook](/dialogflow/cx/docs/concept/webhook#flexible) with your external services, see Webhook setup below.## Webhook setup\nIn order to use this component, you will need to configure the included [flexible webhooks](/dialogflow/cx/docs/concept/webhook#flexible) to retrieve needed information from your external services.\n### Get account details\nThe `prebuilt_components_greeting:get_account_details` webhook is used by the component to identify the caller using their ANI. If the phone number of the caller exists in the configured external service, then the relevant information to personalize the experience is retrieved, including caller name and email.\nThe following parameters are provided by the component as inputs to the API request.\n| Parameter Name | Description     | Output Format |\n|:-----------------|:----------------------------|:----------------|\n| phone_number  | Caller's phone number (ANI) | integer   |\nThe following parameters are pulled from the API response to be used by the component.\n| Parameter Name | Description              | Output Format |\n|:-----------------|:----------------------------------------------------------------|:----------------|\n| user_first_name | End-user's first name, used to provide a personalized greeting. | string   |### Complete\nYour agent and its webhook should now be set up and ready to test.", "guide": "Dialogflow"}