{"title": "Dialogflow - Call companion", "url": "https://cloud.google.com/dialogflow/cx/docs/concept/call-companion", "abstract": "# Dialogflow - Call companion\n**    Preview     ** This product or feature is subject to the \"Pre-GA Offerings Terms\" in the General Service Terms section   of the [Service Specific Terms](/terms/service-terms#1) .     Pre-GA products and features are available \"as is\" and might have limited support.    For more information, see the [launch stage descriptions](/products#product-launch-stages) .\nCall companion provides an interactive visual interface that end-users can access on their mobile phone during a voice call with your agent. This visual interface is meant to supplement the call, not replace it. With this interface, a user can provide text input, be shown images, and view the call transcript in real time. The user can choose to interact with your agent via the voice call or call companion; either can be used at any point during the call.\nThis feature includes a built-in SMS gateway. To initiate the mobile interface, Dialogflow sends an SMS message to the user's phone. This message is sent once during a conversation. The user is prompted to click a link in the message, which takes them to a Dialogflow hosted web page.\n**Note:** You are responsible for providing any notice and obtaining any consent required to send SMS messages to end-users. This can be achieved by incoprorating consent related questions in the agent design before sending the SMS or via your organization's public documents/policies.\nSample use cases:\n- Input complex information such as name, address, email address, pin numbers, credit card numbers, bank account numbers, and so on.\n- Troubleshooting where sharing an indicative image can help the customer with following the remediation steps.\n- Showing clickable menu options.", "content": "## Limitations\nThe following limitations apply:\n- Call companion's built-in SMS functionality currently only works with [Dialogflow Phone Gateway](/dialogflow/cx/docs/concept/integration/phone-gateway) . Dialogflow Phone Gateway limitations apply. To use call companion with a different telephony system or to use a custom setup for SMS gateway, please reach out to your Google account team.\n- In the preview stage, there is only a single phone number provisioned for the built-in SMS functionality. This will be shared across all Dialogflow users for this feature, but you can add your company name to the SMS.\n- Currently, call companion only supports text input, clickable chips and image output as interactive and [rich content](#rich-content) .\n- The number of concurrent calls using call companion cannot exceed 1000 for a single project.## Use call companion\nTo use call companion:\n- Go to the [Dialogflow CX Console](https://dialogflow.cloud.google.com/cx/projects) .\n- Choose your Google Cloud project.\n- Select your agent.\n- Select the **Manage** tab.\n- Click **Integrations** in the left sidebar menu.\n- Enable call companion:- For a new telephony integration: Follow the steps to enable [Dialogflow Phone Gateway](/dialogflow/cx/docs/concept/integration/phone-gateway) , and check the **Enable call companion** option for a new conversation profile.\n- For an existing telephony integration: On the **Manage** tab, click **Integrations** , then click **Manage** for CX Phone Gateway. Click on the phone number you want to enable call companion for. Check the **Enable call companion** option in the conversation profile settings.\n- Configure call companion:- To add your company name to the built-in SMS, go to the agent settings, enter your company name on the **Multimodal** tab, and click **Save** .\n- To trigger call companion at the beginning of a call, check **Automatically trigger call companion at the start of the conversation** on the **Multimodal** tab. Alternatively, you can enable the **Send Call Companion SMS** option under **Call companion settings** in the Default Welcome Intent route in the Default Start Flow. Checking or unchecking the former automatically enables or disables the latter.\n- To trigger call companion at a later conversation turn, enable the **Send Call Companion SMS** option under **Call companion settings** for any fulfillment within your agent. If enabled in multiple fulfillments, the SMS is sent for whichever fulfillment is triggered first.\n- To add an introductory message to let the user know about call companion and the SMS sent, add a response [fulfillment](https://cloud.google.com/dialogflow/cx/docs/concept/fulfillment) for the same fulfillment or page where you have enabled the call companion SMS. If you are using the automatic trigger option, you add this introductory message to the Default welcome intent route on the Default Start Page. This introductory message can be something like \"Hi there. To interact with the call visually, click on the link I have sent you via SMS\".\n- (Optional) Add [rich content](#rich-content) .\n- Now test call companion by calling the Dialogflow Phone Gateway number for which you have enabled call companion.## Rich content\nYou can add custom payloads that are specific to call companion in [fulfillments](/dialogflow/cx/docs/concept/fulfillment) where you want to display rich elements in the call companion web page.\nTo do this:\n- Click **Add dialogue option** .\n- Select **Custom payload** .\n- Click **Select template** . You will see a list of predefined templates for call companion rich elements.\n- Select the required template and update it as per your use case. Note that only the fields present in the predefined templates are supported.## Agent design recommendations\nThe following recommendations apply to call companion:\n- For turns requiring interactive end-user input (text input, chip tapping, and so on), adjust the [no speech timeout](/dialogflow/cx/docs/concept/agent#settings-speech) on the page, flow, or agent level to allow the user enough time to input the required content. You may want to create special pages with page-level timeouts where the end-user may need more time to interact with call companion.\n- If you want to provide different agent responses for voice and call companion text (for example, the virtual agent may speak a short introductory sentence, but you want the corresponding call companion text to show a more verbose text), you can set the voice response as [output audio text](/dialogflow/cx/docs/concept/fulfillment#tts) and the call companion response as the **Text** response. When you are using the Dialogflow Phone Gateway, it will only use the output audio text for voice output and will only use the text response for the call companion transcript.\n- The link sent to the end-user's phone includes your Cloud project ID. Make sure that this ID does not contain any sensitive information that you do not want to be made public.## Call companion logs\nYou can view call companion logs in [Cloud logging](/dialogflow/cx/docs/concept/logging) and [Conversation history](/dialogflow/cx/docs/concept/conversation-history) .\n## Parameter redaction\nCall companion respects the [parameter redaction](/dialogflow/cx/docs/concept/parameter#redact) settings. While the call companion web page is open, an end-user can see these parameter values in the call transcript as they are provided. If the page is initially loaded or reloaded after parameters are provided, the values are shown as redacted.", "guide": "Dialogflow"}