{"title": "Dialogflow - Financial services steering prebuilt component", "url": "https://cloud.google.com/dialogflow/cx/docs/concept/prebuilt-component/financial-services-steering", "abstract": "# Dialogflow - Financial services steering prebuilt component\nThis [prebuilt component](/dialogflow/cx/docs/concept/prebuilt-component) identifies the end-user's intent and routes them to the appropriate topic within the financial services (FSI) domain. When the relevant topic is identified, the component transitions to an empty placeholder [flow](/dialogflow/cx/docs/concept/flow) with the name of the identified topic. Placeholder flows may be customized to take actions including [live agent handoff](/dialogflow/cx/docs/concept/fulfillment#handoff) , transition to a prebuilt component, or transition to another Dialogflow resource such as a [page](/dialogflow/cx/docs/concept/page) or flow.\n", "content": "## Sample utterances\nThe following sample utterances demonstrate common topics handled by this prebuilt component.\n### Account balance\nThis topic covers questions about account balances, including:\n### Account statement\nThis topic covers questions about account statements, including:\n### Arrange appointment\nThis topic covers questions about making appointments, including:\n### Credit card enrollment\nThis topic covers questions about enrolling for new credit cards, including:\n### Credit card statement\nThis topic covers questions about credit card statements, including:\n### Disputes\nThis topic covers questions about registering disputes and claims, including:\n### Feedback\nThis topic covers questions about customer feedback, including:\n### Locked card\nThis topic covers questions about locking and unlocking cards, including:\n### Lost or stolen card\nThis topic covers questions about lost or stolen cards, including:\n### Make a payment\nThis topic covers questions about making payments, including:\n### Open account\nThis topic covers questions about opening new bank accounts, including:\n### Transaction history\nThis topic covers questions about transaction history for savings accounts, including:\n## Naming conventions\nThis prebuilt component uses the following naming conventions:\n| Feature     | Format            | Example           |\n|:--------------------------|:---------------------------------------------------|:---------------------------------------------------|\n| Flow      | [Component Name]         | Financial Services Steering      |\n| Component Specific Intent | prebuilt_components_[component_name]_[intent_name] | prebuilt_components_fsi_steering_account_statement |\n## Basic setup\nTo set up this prebuilt component:\n- [Import the prebuilt component](/dialogflow/cx/docs/concept/prebuilt-component#import) .\n### Complete\nYour agent should now be set up and ready to test.", "guide": "Dialogflow"}