{"title": "Dialogflow - Conversation history", "url": "https://cloud.google.com/dialogflow/cx/docs/concept/conversation-history", "abstract": "# Dialogflow - Conversation history\nThe conversation history tool provides an interface for browsing and analyzing actual production conversations between your agent and end-users. This can be useful to evaluate the functional performance of your agent or to debug issues.\nFlow and page analysis helps you understand traffic and escalations through the flow graph of an agent. This enables agent builders to analyze traffic flow (high and low traffic paths), discover issue hotspots (for example, to pinpoint high escalations), and drill down to the specific pages and intents causing issues. Flow and page analysis can be used along with conversation history filters, to allow for maximum flexibility in studying a relevant subset of traffic.\n", "content": "## Limitations\nLoading the Flow Analysis Table and Flow Analysis Graph views can be slow for large agents. To improve load times, use an intent filter and a one week date range.\nAt most 500 turns will be logged for each conversation.\n## Permissions required\nUsing this tool requires the **dialogflow.conversations** permission. This permission can be added to a [custom role](/iam/docs/creating-custom-roles) . It is also available in the [Admin role](/dialogflow/cx/docs/concept/access-control#df-console) , as well as [other Dialogflow roles](/iam/docs/understanding-roles#dialogflow-roles) .\n## Enable and disable conversation history\nThe conversation history tool uses data from interaction logs. You can enable and disable conversation history with the [Enable interaction logging](/dialogflow/cx/docs/concept/agent#settings-general) agent setting.\nYou can also control how long data is retained by using the `retention_window_days` [security setting](/dialogflow/cx/docs/concept/security-settings) .\n## Browsing the conversation history\nTo use the conversation history tool:\n- Open the [Dialogflow CX Console](https://dialogflow.cloud.google.com/cx/projects) .\n- Choose your project.\n- Select your agent.\n- Select the **Manage** tab.\n- Click **Conversation History** .\n- Conversations are listed in a table.\n- Optionally apply filters using the **filter** control above the table.\n- Select one of the tabs, each of which are described below.## Conversations\nConversations are shown in two views: conversation summary view and conversation details view.\n### Conversation summary view\nThe conversation summary view lists all conversations. The following metadata is provided for each conversation:\n| X    | Item                                                 |\n|:----------------|:-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| Conversation ID | An identifier for the conversation                                          |\n| Duration  | Duration of the conversation                                           |\n| Turns   | The number of conversational turns                                          |\n| Channel   | Either chat (text), voice, or undetermined (no end-user input has been provided to the conversation yet)                        |\n| Language  | The language for the conversation                                          |\n| Environment  | The agent's environment                                            |\n| Start time  | Start time for the conversation                                          |\n| Flags   | May be set to Live Agent Handoff (if conversation escalated to a human agent) or Abandoned (if end-user left the incomplete conversation) or TU,TD (if answer in the conversation got end-user rating) |\nYou can filter the results by metadata (except environment and duration) and the following additional filter options:\n| X      | Item                           |\n|:-------------------------|:--------------------------------------------------------------------------------------------------------------|\n| Intent     | The provided intent was matched at some point in the conversation            |\n| No Match     | Some subset of conversational turns resulted in an intent no-match           |\n| Flow      | The provided flow is the final active flow at the end of some conversation turn        |\n| Page      | The provided page is the final active page at the end of some conversation turn        |\n| Is Live Agent Handoff | The Live Agent Handoff flag is set                   |\n| Is Abandoned    | The Abandoned flag is set                      |\n| Conversation ID   | A specific conversation is chosen                    |\n| Start Time    | A date range is provided                      |\n| Agent Utterance   | The provided text is a substring of an utterance that was used by the agent at some point in the conversation |\n| User Utterance   | The provided text is a substring of an utterance that was used by the user at some point in the conversation |\n| Has Thumbs Up Feedback | Thumbs Up feedback provided for a response in the conversation, the TU flag is set       |\n| Has Thumbs Down Feedback | Thumbs Down feedback provided for a response in the conversation, the TD flag is set       |### Conversation details view\nYou can browse the turn-by-turn view of a specific conversation in the conversation details view. Each conversational turn provides the end-user message, the agent message, and the following metadata:\n| X   | Item            |\n|:-----------|:----------------------------------------------------|\n| Intent  | An intent display name that was matched or No Match |\n| Page  | The final active page name       |\n| Flow  | The final active flow name       |\n| Parameters | Parameters collected during the conversational turn |### Example use case\nThe tool can be used to identify agent issues that result in escalations to a human agent. From the conversation summary view, you can apply the **Is Live Agent Handoff** filter for **Yes** . Examine some of these conversations and try to find common patterns. For example, you may find that in most of the conversations, there is a no-match flag for turns on a specific page. This would indicate that an intent route needs to be created, or that an existing intent route is not in scope when it needs to be.\n## Flow analysis table\nThe **Flow Analysis - Table** tab is used to analyze traffic and exits in flows and pages in tabular form.\nThe following metrics are shown:\n| X    | Item                                       |\n|:-----------------|:---------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| Flow name  | Flow name for each flow in your agent                               |\n| Relative traffic | The number of conversations that went through this flow                          |\n| Escalation rate | The percentage of conversations that result in a request for human escalation out of all conversations that went through this flow        |\n| Exit rate  | The percentage of conversations that ended after this flow or transitioned to SESSION_END from this flow, out of all conversations that went through this flow |\nClicking the list list_alt button opens a sample of relevant conversations for the row. You can read through the samples to better understand specific and nuanced issues. For example, you can examine why escalations are happening. To view the full details of a sample, click the **Conversation details** link.\nClicking **Detailed Stats** for a flow opens the traffic stats for flows. This shows flow transition stats from and to the selected flow.\nThe following metrics are shown:\n| X    | Item               |\n|:--------------|:-------------------------------------------------------------|\n| Next Flow  | Stats for transitions from selected flow to another flow  |\n| Previous Flow | Stats for transitions from another flow to the selected flow |\nClicking any flow row drills down into the pages that compromise that flow.\nThe following metrics are shown:\n| X    | Item                                         |\n|:-----------------|:------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| Relative Traffic | The number of conversations that visited this page.                              |\n| Escalation rate | The percentage of conversations that result in a request for human escalation out of all conversations that visited this page           |\n| Exit rate  | The percentage of conversations that exit the flow or exit the session (END_SESSION) directly after visiting this page, out of all conversations that visited this page |\n| No Match rate | The percentage of conversations that resulted in no-match out of all conversations that visited this page                |\nClicking **Detailed Stats** for a page opens the traffic stats for pages. This shows page transition stats from and to the selected page.\nThe following metrics are shown:\n| X    | Item               |\n|:--------------|:-------------------------------------------------------------|\n| Intent  | Stats for intent matches for the page      |\n| Next Page  | Stats for transitions from selected page to another page  |\n| Previous Page | Stats for transitions from another page to the selected page |\n## Flow analysis graph\nThe **Flow Analysis - Graph** tab is used to analyze traffic and exits in flows and pages in graph form.\nClicking on any flow drills down into the traffic for the pages within the flow.\nYou can use the zoom slider to vary the level of detail that you see on the graph. Low volume paths are dropped from the visualization at lower settings. Even at higher settings, very low volume paths are always hidden.\nMetrics are color-coded to easily find high severity issues.\nClicking the list list_alt button shows relevant conversations.\nClicking on any flow takes you to the pages within that flow. Here you get more overlay metrics: relative traffic, no match rate, escalation rate, and exit rate.", "guide": "Dialogflow"}