{"title": "Dialogflow - Enhanced speech models", "url": "https://cloud.google.com/dialogflow/es/docs/speech-enhanced-models", "abstract": "# Dialogflow - Enhanced speech models\n**    Beta     ** This product or feature is subject to the \"Pre-GA Offerings Terms\" in the General Service Terms section   of the [Service Specific Terms](/terms/service-terms#1) .     Pre-GA products and features are available \"as is\" and might have limited support.    For more information, see the [launch stage descriptions](/products#product-launch-stages) .\nGoogle works continuously to improve its products, including the use of customer data to refine those products. To help Dialogflow to better suit your needs, you can opt into the Dialogflow Data Logging program. The program allows Google to improve the quality of Dialogflow by using customer data for speech recognition improvements, model training, and testing.\nWhen you opt in, you receive access to a special set of machine learning models for speech recognition. Google creates and improves these enhanced models based upon data collected through data logging. For example, if you send a request specifying a phone call model, Dialogflow uses an enhanced phone call model to process the request. Using the enhanced model, Dialogflow can more accurately recognize speech captured from a phone call and therefore produce a more accurate transcription of the audio data.\n", "content": "## Limitations\nThe following limitations apply:\n- Enhanced speech models only support the following languages:- English (en)\n- English - US (en-US)\n- This feature is currently only available to users of a paid [edition](/dialogflow/docs/editions) .\n- There is currently only one enhanced model, which is used for processing phone call audio.## Data Privacy and Security\nWhen you opt into the program, Google does not log all of your data; Google only uses the data sent to Dialogflow on the project with data logging enabled. You can continue to use other Google Cloud projects without data logging enabled, sending your transcription requests to Dialogflow for those projects with Google using your data only as needed to provide the service.\nYou continue to maintain full ownership of all data that you upload to a project with data logging enabled. However, Google retains ownership of the actual models trained from that data. For more details about the terms and conditions for data logging, see the [terms for data logging](/dialogflow/docs/data-logging-terms) .\nOnly a limited set of authorized Google employees have access to your data collected by data logging. Google uses this data solely to train and improve Google products and services. Google does not use your data or any personally identifiable information contained in your collected data to target products, services, or advertising towards you, your users, or your customers.\n**Note:** Your data collected through data logging enjoys the same level of security as all other Google Cloud services. The Google security model is an end-to-end process, built over 15 years of experience and focused on keeping customers safe on Google applications like Gmail, Search and other Apps.\nFor more information about Google's security policies, see [the Google Cloud security whitepaper](/security/whitepaper) .\n## Enable and disable data logging\nTo enable enhanced speech models, you must enable speech data logging. See the [Speech data logging](/dialogflow/es/docs/data-logging) document for instructions on enabling and disabling data logging.", "guide": "Dialogflow"}