{"title": "Dialogflow - Default intents", "url": "https://cloud.google.com/dialogflow/es/docs/intents-default", "abstract": "# Dialogflow - Default intents\nTwo intents are created automatically when you create an agent:\n- **Default welcome intent** : matched when an end-user begins a conversation with your agent.\n- **Default fallback intent** : matched when your agent doesn't match an end-user input to any other intents.\n**Note:** You can delete the default intents, but it is normally best to keep them and customize them for your agent.\n", "content": "## Default welcome intent\nThe default welcome intent is matched when an end-user begins a conversation with your agent. It should return a response that lets end-users know what your agent does or what end-users can say to begin a conversation. You should customize the pre-populated intent responses for your agent.\nThe default welcome intent is matched in one of two ways:\n- One of its training phrases are matched, which are pre-populated with common greetings, like \"hello\".\n- This intent has a [welcome event](/dialogflow/docs/events-platform#welcome_events) attached to it, which is triggered when the end-user begins a conversation with your agent via a supported [integration](/dialogflow/docs/integrations) .\n**Note:** The default welcome intent includes various greeting training phrases in all languages, however these training phrases are not used for invocation by Google Assistant. See the Google Assistant [invocation](https://developers.google.com/assistant/discovery) documentation for more information.\n## Default fallback intent\nThe default fallback intent is matched when your agent doesn't match an end-user input to any other intents.\nThis intent is not matched if an audio input doesn't contain any transcribed speech.\nThis intent is automatically configured with a variety of static text responses, like \"I didn't get that. Can you say it again?\".\nYou can customize fallback intents by changing the pre-populated text responses or by adding negative examples.\nYou can also create additional fallback intents:\n- Go to the [Dialogflow ES Console](https://dialogflow.cloud.google.com) .\n- Select an agent.\n- Select **Intents** in the left sidebar menu.\n- Click the optionbutton at the top of the intents page.\n- Select **Create Fallback Intent** .\n### Fallback intent responses\nYou can change the pre-populated text responses, but they should communicate to the end-user that their input was not recognized.\n**Note:** You can have multiple fallback intents with [contexts](/dialogflow/docs/contexts-overview) to customize fallback responses.\n### Negative examples\nYou can add training phrases to fallback intents that act as . There may be cases where end-user expressions have a slight resemblance to your training phrases, but you do not want these expressions to match any normal intents.\nFor example, a room booking service may have a training phrase like \"I'd like to book a room\". If the end-user wants to purchase a book about rooms, they may say \"I'd like to buy a book about rooms.\" To ensure that the end-user expression does not match your intent, you can add that phrase as a negative example.", "guide": "Dialogflow"}