{"title": "Dialogflow - Access control", "url": "https://cloud.google.com/dialogflow/es/docs/access-control", "abstract": "# Dialogflow - Access control\nIt is common for multiple team members to collaborate on building an agent and for services to access the agent. Using , you can control access and permissions granted to [principals](/docs/authentication#principal) .\n**Note:** Developers should avoid working on the same agent at the same time. This can cause conflicts when saving and training the agent.\nIf you are using the API, you may also have one or more applications that send requests to an agent. In this case, you can control access with [service accounts](/dialogflow/docs/quick/setup#auth) .\nYou can control access using either [Identity and Access Management (IAM)](/iam/docs) or the [Dialogflow Console](/dialogflow/docs/console) . There are some situations in which you must use the Google Cloud console:\n- The Dialogflow Console provides the Agent Admin (IAM Project Owner) role to the user that created the agent. If you want to change the Admin, add multiple Admins for one agent, or remove Admins for an agent, you need to use the Google Cloud console.\n- If you have integrations with other Google Cloud resources, like Cloud Functions, and you don't want to grant full project access to an application, you must assign the Dialogflow API roles (Admin, Client, or Reader) in the Google Cloud console for IAM.\n- A subset of IAM roles have corresponding Dialogflow Console roles. If you want to grant a role that does not exist on the Dialogflow Console, you need to use the Google Cloud console.", "content": "## Roles\nThe following table lists common roles relevant to Dialogflow. Permission summaries in the table use the following terms:\n- **Full access** : Permission to modify access, create, delete, edit, and read any resource.\n- **Edit access** : Permission to create, delete, edit, and read any resource.\n- **Session access** : Permission to call methods for runtime-only resources during a conversation like detecting intent, updating context, updating session entities, or Agent Assist conversation interactions. This access provides a subset of permissions found in full and edit access.\n- **Read access** : Permission to read any resource.\n**Note:** In order to modify access for an agent, you need a role that provides **full access** to the agent. In order to delete an agent with the console, you need a role that provides **full access** to the agent. In order to delete an agent with the API, you need a role that provides **full access** or **edit access** to the agent.\n**Note:** The [console simulator](/dialogflow/es/docs/console#simulator) calls the detectIntent API method during a conversation. This method performs a write on the session state. In order to use the console or call the API's detectIntent/streamingDetectIntent methods, you need a role that provides **full access** , **edit access** , or **session access** .\n| Dialogflow Console role | IAM role          | Permission Summary                                                                             | Permission Detail      |\n|:--------------------------|:---------------------------------------------|:--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|:--------------------------------------|\n| Admin      | Project > Owner        | Grant to project owners that need full access to all Google Cloud and Dialogflow resources: Full access to all Google Cloud project resources using Google Cloud console or APIs. Full access to agents using the Dialogflow Console. Can detect intent using API. Can change agent edition in the Dialogflow Console or using API. | See IAM basic role definitions.  |\n| Developer     | Project > Editor        | Grant to project editors that need edit access to all Google Cloud and Dialogflow resources: Edit access to all Google Cloud project resources using Google Cloud console or APIs. Edit access to agents using the Dialogflow Console. Can detect intent using API.                 | See IAM basic role definitions.  |\n| Reviewer     | Project > Viewer        | Grant to project viewers that need read access to all Google Cloud and Dialogflow resources: Read access to all Google Cloud project resources using Google Cloud console or APIs. Read access to agents using the Dialogflow Console or API, cannot use the simulator. Cannot detect intent using API.        | See IAM basic role definitions.  |\n| nan      | Project > Browser       | Grant to project browsers that need read access to browse the hierarchy for a project, including the folder, organization, and IAM policy: Read access to Google Cloud project hierarchy. No access to agents using the Dialogflow Console. Cannot detect intent using API.              | See IAM project role definitions. |\n| nan      | Dialogflow > Dialogflow API Admin   | Grant to Dialogflow API admins that need full access to Dialogflow-specific resources: Full access to all Dialogflow resources using Google Cloud console or APIs. Read access to agents using the Dialogflow Console. Can detect intent using API.                     | See Dialogflow IAM role definitions. |\n| nan      | Dialogflow > Dialogflow API Client   | Grant to Dialogflow API clients that perform detect intent calls using the API: Session access to runtime Dialogflow resources using Dialogflow simulator or API. Limited access to agents using the Dialogflow Console. Can detect intent using API.                    | See Dialogflow IAM role definitions. |\n| nan      | Dialogflow > Dialogflow Console Agent Editor | Grant to Dialogflow Console editors that edit existing agents: Full access to all Dialogflow resources using Google Cloud console. Edit access to most agent data using the Dialogflow Console. Cannot access Inline Editor for Cloud Functions or Google Assistant integration. Can detect intent using API.      | See Dialogflow IAM role definitions. |\n| nan      | Dialogflow > Dialogflow API Reader   | Grant to Dialogflow API clients that perform Dialogflow-specific read-only calls using the API: Read access to all Dialogflow resources using Google Cloud console or APIs. Read access to agents using the Dialogflow Console, cannot use the simulator. Cannot detect intent using API.           | See Dialogflow IAM role definitions. |\n## Control access with the Google Cloud console\nYou can control access with [IAM](/iam/docs) settings. See the [IAM quickstart](/iam/docs/grant-role-console) for detailed instructions on adding, editing, and removing permissions.\nTo access the settings below, open the [IAM](https://console.cloud.google.com/iam-admin/iam) page in the Google Cloud console.\n### Add a user or service account to the project\nYou can provide permissions to either users or service accounts by granting them roles on your Google Cloud project. Users are added by providing their email address. Service accounts are also added by providing their associated email address. You need to add service account members when you want to use one service account for multiple projects and agents. To find the email address associated with your service account, see the IAM [Service Accounts](https://console.cloud.google.com/iam-admin/serviceaccounts) page in the Google Cloud console.\nTo add a member:\n- Click the addaddbutton at the top of the page.\n- Enter the member's email address.\n- Select a role.\n- Click **Save** .\n### Change permissions\n- Click the editeditbutton for the member.\n- Select a different role.\n- Click **Save** .\n### Remove a member\n- Click the deletedeletebutton for the member.## Control access with the Dialogflow Console\nSharing options are found in the agent's settings. To open the agent sharing settings:\n- Go to the [Dialogflow ES Console](https://dialogflow.cloud.google.com) .\n- Select your agent near the top of the left sidebar menu.\n- Click the settingssettingsbutton next to the agent name.\n- Click the **Share** tab. If you do not see the **Share** tab, it is because you do not have the required Agent Admin role.### Add a user\n- Enter the user's email address under **Invite New People** .\n- Select a role.\n- Click **Add** .\n- Click **Save** .\n### Change permissions\n- Find the user in the list.\n- Select a different role.\n- Click **Save** .\n### Remove a user\n- Find the user in the list. **Note:** If a user is listed with a prefix of `deleted:user:` , this user has been removed from your organization. The Dialogflow console cannot remove this user. You must [use the Cloud Console](#gcp-console) to remove this user.\n- Click the delete clear button for the user.\n- Click **Save** .\n**Note:** After you grant or change permissions, there may be a delay before the changes take effect.\n## Automatically created service accounts\nWhen you create and work with your agent, Dialogflow creates some [Google-managed service accounts](/iam/docs/service-account-types#google-managed) automatically.\nTo see these service accounts, enable the **Include Google-provided role grants** option on the [IAM page](https://console.cloud.google.com/iam-admin/iam) .\nYou should not delete, edit, or download keys for any of these service accounts, nor should you use these service accounts to make direct API calls. They are used only by the Dialogflow service to connect to a variety of Google Cloud services used by your agent. You may need to refer to these service accounts by email when configuring certain Dialogflow features.\nThe following table describes some of these service accounts:\n| IAM email form             | Purpose                      |\n|:------------------------------------------------------------------|:---------------------------------------------------------------------------------------------|\n| service-project-number @gcp-sa-dialogflow.iam.gserviceaccount.com | Used to connect your agent to the services that handle integration traffic.     |\n| firebase-adminsdk-alphanum @project-id.iam.gserviceaccount.com | Used to connect your agent to the services that handle Google Assistant integration traffic. |\n| project-id @appspot.gserviceaccount.com       | Used to connect your agent to the services that handle Google Assistant integration traffic. |\n## Transfer admin role\nIn order to transfer the admin role of an agent, the existing admin needs to [follow steps](#gcp-add) above to add a new admin. Once the new admin accepts the granted role, it is safe to remove the old admin.\nIf the existing admin no longer works at your organization, and you need the admin role transferred to another employee, you have two options:\n- An administrator of the [organization](/resource-manager/docs/cloud-platform-resource-hierarchy) associated with the agent's project has permissions to modify the agent admin.\n- If you have read permissions for the agent, you can export the agent and import to an agent where the desired employee is admin. This may create downtime for a live production agent while the agent is migrated and any integrations are updated.## OAuth\nIf you are using Google client libraries to access Dialogflow, you do not need to use [OAuth](https://developers.google.com/identity/protocols/oauth2) directly, because these libraries handle the implementation for you. However, if you are implementing your own client, you may need to implement your own OAuth flow. Access to the Dialogflow API requires one of the following OAuth scopes:\n- `https://www.googleapis.com/auth/cloud-platform`(access to all project resources)\n- `https://www.googleapis.com/auth/dialogflow`(access to Dialogflow resources)## Requests that involve Cloud Storage access\nSome Dialogflow requests access objects in [Cloud Storage](/storage/docs) for reading or writing data. When you call one of these requests, Dialogflow accesses the Cloud Storage data on the caller's behalf. This means that your request authentication must have permissions to access Dialogflow as well as the Cloud Storage objects.\nWhen using a Google client library and IAM roles, see the [Cloud Storage access control guide](/storage/docs/access-control) for information on Cloud Storage roles.\nWhen implementing your own client and using [OAuth](#oauth) , you must use the following OAuth scope:\n- `https://www.googleapis.com/auth/cloud-platform`(access to all project resources)", "guide": "Dialogflow"}