{"title": "Dialogflow - Using multiple projects", "url": "https://cloud.google.com/dialogflow/es/docs/multi-project", "abstract": "# Dialogflow - Using multiple projects\nIn some cases, you might need to create multiple Google Cloud projects to use Dialogflow:\n- You might find it useful to create one project for authentication, quotas, and billing, and additional projects for [agent](/dialogflow/es/docs/agents-overview) data.\n- Each project can have [at most](/dialogflow/quotas#count_limits) one agent per [region](/dialogflow/es/docs/how/region) . If you need multiple agents in the same region, then multiple projects are required.", "content": "## Consumer and resource projects\nWhen you make calls to the API, you typically provide [service account keys for authentication](/dialogflow/es/docs/quick/setup#auth) . Each service account is owned by a specific project, but service accounts might be [provided roles to access resources for other projects](/dialogflow/es/docs/access-control#gcp-console) . The project associated with the service account you provide for an API call is referred to as the .\nWhen you make calls to the API, your request specifies the agent's project. This project is referred to as the .\nFor example, in the following REST curl request, the project associated with `AGENT_ID` is the resource project, and the project associated with the service account used to generate `TOKEN` is the consumer project:\n```\ncurl -X GET\n -H \"Authorization: Bearer TOKEN\"\n \"https://dialogflow.googleapis.com/v2/projects/PROJECT_ID/agent/AGENT_ID\"\n```\nOne project can play the role of both consumer and resource project. Agent data, charges, and quotas are associated only with this project.\nWhen consumer and resource projects are two different projects, charges, quota constraints, agent information, and a requirement to enable the API are applicable to either or both projects. The following table shows the association for an API call with two projects:\n| Description                    | Consumer project (service account project) | Resource project (agent project) | Notes                          |\n|:-------------------------------------------------------------------------------------------|:---------------------------------------------|:-----------------------------------|:------------------------------------------------------------------------------------------------------------|\n| Project that charges are incurred for              | ✔           | nan        | nan                           |\n| Project that is bound to quotas               | ✔           | nan        | nan                           |\n| Project that contains the agent that determines the Trial or Essentials Dialogflow edition | ✔           | nan        | If your consumer project doesn't have an agent, create an empty agent to upgrade to the Essentials edition. |\n| Project that contains all agent data and the Trial or Essentials Dialogflow edition  | nan           | ✔         | nan                           |\n| Projects for which you must enable the Dialogflow API          | ✔           | ✔         | The Dialogflow API must be enabled for both project types.             |\n| Project that shows API usage on the Cloud console API dashboard       | ✔           | nan        | nan                           |", "guide": "Dialogflow"}