{"title": "Dialogflow - Training phrases", "url": "https://cloud.google.com/dialogflow/es/docs/intents-training-phrases", "abstract": "# Dialogflow - Training phrases\n**Note:** There are many important best practices for training phrases described in the [agent design best practices guide](/dialogflow/es/docs/agents-design#machine_learning_and_training) .\nare example phrases for what end-users might type or say, referred to as . For each intent, you create many training phrases. When an end-user expression resembles one of these phrases, Dialogflow matches the intent.\nFor example, the training phrase \"I want pizza\" trains your agent to recognize end-user expressions that are similar to that phrase, like \"Get a pizza\" or \"Order pizza\".\nYou don't have to define every possible example, because Dialogflow's built-in machine learning expands on your list with other, similar phrases. You should create at least 10-20 (depending on complexity of intent) training phrases, so your agent can recognize a variety of end-user expressions. For example, if you want your intent to recognize an end-user's expression about their favorite color, you could define the following training phrases:\n- \"I like red\"\n- \"My favorite color is yellow\"\n- \"black\"\n- \"Blue is my favorite\"\n- ...", "content": "## Where to find this data\nWhen building an agent, it is most common to use the Dialogflow ES Console ( [visit documentation](/dialogflow/docs/console) , [open console](https://dialogflow.cloud.google.com) ). The instructions below focus on using the console. To access training phrase data:\n- Go to the [Dialogflow ES Console](https://dialogflow.cloud.google.com) .\n- Select an agent.\n- Select **Intents** in the left sidebar menu.\n- Select an intent.\n- Scroll down to the **Training phrases** section.\nIf you are building an agent using the API instead of the console, see the [Intents reference](/dialogflow/docs/reference/common-types#intents) . The API field names are similar to the console field names. The instructions below highlight any important differences between the console and the API.\n## Add training phrases\nTo add training phrases to an intent:\n- Click the text field that shows \"Add user expression\".\n- Type your training phrases and press the`Enter`key after each.## Annotate training phrases\n**Note:** There are many important best practices for training phrase annotations described in the [agent design best practices guide](/dialogflow/es/docs/agents-design#machine_learning_and_training) .\n[parameters](/dialogflow/docs/intents-actions-parameters#params)\n[entity type](/dialogflow/docs/entities-overview)\nWhen building an agent, you control how data is extracted by parts of your training phrases and configuring the associated parameters.\nFor example, consider a training phrase like \"What is the forecast tomorrow for Tokyo?\" You should annotate \"tomorrow\" with a `date` parameter and \"Tokyo\" with a `location` parameter. When you annotate parts of a training phrase, Dialogflow recognizes that these parts are just examples of actual values that will be provided by end-users at runtime. For an end-user expression like \"What is the forecast on Friday for Sydney?\", Dialogflow would extract the `date` parameter from \"Friday\" and the `location` parameter from \"Sydney\".\nWhen building an agent with the console, most annotations are automatically created for you when you add training phrases that contain parts that can be matched to an existing [entity type](/dialogflow/docs/entities-overview) . These parts are highlighted in the console. You can edit these annotations and parameters as needed.\nTo manually annotate a training phrase with the console:\n- Select the part of the training phrase that you want to annotate.\n- Select the desired entity type from the list.\n- A parameter is created for you in the parameter table below.\n- Click the **Save** button and wait until the **Agent Training** dialog indicates that training is complete.\nWhen building an agent with the API, you must annotate training phrases and configure parameters manually. See the `TrainingPhrase` and `Parameter` types in the [Intents reference](/dialogflow/docs/reference/common-types#intents) . The `Part.alias` field associates training phrase annotations with particular parameters.\n## Implicit entities created by training phrases\n**Note:** You should define entities explicitly, rather than rely on implicitly defined custom entity values.\nMost custom entities are defined explicitly by creating entity types and adding entity entries. However, custom entities may also contain implicit values. This happens when you [annotate text of a training phrase](#annotation) , where the annotated text is not a value defined by the selected entity type. The annotated text becomes an entity reference value for the implicitly added entity entry. If the entity type is a map entity, the text also becomes a synonym for the entity entry.\n## Example and template modes\n**Caution:** Template mode is deprecated. Always use example mode for new training phrases.\nEach training phrase can be in one of two modes:\n- **Example mode** : Indicated byto the left of the training phrase. Training phrases in example mode are written in natural language and are annotated for parameter extraction.\n- **Template mode** : Indicated byto the left of the training phrase. Training phrases in template mode contain direct references to entity types.", "guide": "Dialogflow"}