{"title": "Dialogflow - Analytics", "url": "https://cloud.google.com/dialogflow/es/docs/analytics", "abstract": "# Dialogflow - Analytics\nThe Dialogflow Console provides an analytics page that shows various agent request and response data statistics. This data helps you assess how your agent is being used in production and may be used to improve your agent.\nYou can select from multiple data views and filter by time range. The statistics shown on all charts are computed hourly. For most views, only successful request data for the V2 API are included.\n", "content": "## Open the analytics page\nTo open the analytics page:\n- Go to the [Dialogflow ES Console](https://dialogflow.cloud.google.com) .\n- Select an agent.\n- Click **Analytics** in the left sidebar menu.\n- Choose the **New** tab at the top of the page to select the new user interface described in this guide. You can also go back to the **Legacy** UI if you prefer that.## Common metrics\nThe following common metrics are displayed on multiple chart types:\n- **Interactions** : For most views,include detect intent request counts via direct API calls and indirect calls via integrations (except for Google Assistant).\n- **Sessions** :are determined by the session ID provided to interactions. You must create unique session IDs for this metric to be meaningful. For each hour on the x-axis, themetric shows a count of active sessions during that hour. If a session crosses an hour boundary, it will be counted for each hour it is active. Therefore, the sum of all hourly session values on a chart may be larger than the total number of actual sessions during the entire time period.\n- **Exit %** : The percentage of sessions that ended with an intent during the selected time range.## Views\nThere are multiple views that you can select on the analytics page. Each view differs by the type of data, the data filter, or the chart type. The following subsections describe each view.\n### Overall view\nThis view charts session and interaction counts for all requests.\n### Status codes view\nThis view charts interaction counts for all requests by status code. This includes all V2 API requests, whether successful or not. Hovering your mouse over a data point shows a popup with individual status code counts at that point. For example:\n- **OK** \n- **PERMISSION_DENIED** \n- **INTERNAL** \n- **DEADLINE EXCEEDED** \n### Integrations view\nThis view charts session and interaction counts for all requests (except Google Assistant) by [integration type](/dialogflow/docs/integrations) . Hovering your mouse over a data point shows a popup with integration-specific counts at that point. API calls are shown as \"api\".\n### Webhook view\nThis view charts session and interaction counts for all requests by number of requests with and without [webhook calls](/dialogflow/docs/fulfillment-webhook) . Hovering your mouse over a data point shows a popup with individual counts at that point:\n- **Webhook called** \n- **Webhook not called** \n### Languages view\nThis view charts session and interaction counts for all requests by [language](/dialogflow/docs/agents-multilingual) . Hovering your mouse over a data point shows a popup with language-specific counts at that point.\n### Knowledge view\nThis view charts session and interaction counts for [knowledge request](/dialogflow/docs/knowledge-connectors) by knowledge result data. Hovering your mouse over a data point shows a popup with individual counts at that point:\n- **Knowledge had result** \n- **Knowledge was used** \n- **Knowledge had primary result** \n### Sentiment view\nThis view charts session and interaction counts for sentiment requests by sentiment result data. Hovering your mouse over a data point shows a popup with individual counts at that point.\n### Speech view\nThis view charts session and interaction counts for speech requests by speech-to-text and text-to-speech. Hovering your mouse over a data point shows a popup with individual counts at that point:\n- **Speech to text** \n- **Text to speech** \n### Intents view\nThis view shows a table of [common metric values](#metrics) for all requests by intent.\n### Intent path view\nThis view graphs with connecting . Each intent in your agent has one node. Each intent path line shows a frequency value for how often one intent follows another intent in sessions for the selected time period. The **session start** node has intent path lines to the initial intent matches. Each intent node has a frequency value inside its node box that shows how often the intent ended a session for the selected time period. For example, consider that you have three intents: **A** , **B** , and **C** :\n- If **A** is always the first intent matched in a session, the chart will show a 100% intent path line from **session start** to **A** .\n- If **B** is matched 30% of the time that **A** was matched in the previous interaction in the session, the chart will show a 30% intent path line from **A** to **B** .\n- If **C** is matched 70% of the time that **A** was matched in the previous interaction in the session, the chart will show a 70% intent path line from **A** to **C** .\n- If 40% of sessions end by matching **C** , the **C** intent node box will contain a 40% value.\nHovering your mouse over an intent node shows a popup with metrics for the intent:\n- **Sessions start with this intent** : The count and percentage of sessions that started with this intent.\n- **Interactions matched this intent** : The count and percentage of interactions that matched this intent.\n- **Sessions end with this intent** : The count and percentage of sessions that ended with this intent.\nHovering your mouse over an intent path value or session start node also shows additional information.\n### Session path view\nSimilar to the intent path view, this view graphs with connecting . However, the intent path lines in this view show the frequencies as found in taken by common sessions for the agent. One intent node may appear multiple times if it is matched in multiple paths or multiple times in a single path. You can interact with this chart by clicking intent nodes to expand them.\nHovering your mouse over an intent node shows a popup with metrics for the intent:\n- **Sessions followed this path prefix** : The count and percentage of sessions that followed the path up to the intent node.\n- **Ended at this point** : The percentage of sessions that ended on the path up to the intent node.## Additional data from Stackdriver\nIn addition to the data provided by the analytics page, you can query for other types of data using Stackdriver. See:\n- [tag_consumed_api](https://cloud.google.com/monitoring/api/resources#tag_consumed_api) \n- [Creating a Dashboard with Stackdriver SLI Monitoring Metrics](https://medium.com/google-cloud/creating-a-dashboard-with-stackdriver-sli-monitoring-metrics-eaf6d19386de) ## Limitations\nThe following limitations apply:\n- [Google Assistant integration](/dialogflow/es/docs/integrations/aog) data is not supported.\n- It can take up to a day for data to appear in analytics.", "guide": "Dialogflow"}