{"title": "Dialogflow - Retail fraud and dispute prebuilt component", "url": "https://cloud.google.com/dialogflow/cx/docs/concept/prebuilt-component/fraud-and-dispute-retail?hl=zh-cn", "abstract": "# Dialogflow - Retail fraud and dispute prebuilt component\nThe retail fraud and dispute [prebuilt component](/dialogflow/cx/docs/concept/prebuilt-component) checks a user's authentication level. Once the user has been authenticated, the component provides information about the user's most recent or past orders. The user may then submit a dispute related to an order or product. This component uses the [Retail authentication](/dialogflow/cx/docs/concept/prebuilt-component/authentication-retail) prebuilt component to authenticate users. The component also uses [Generators](/dialogflow/cx/docs/concept/generative/generators) for post-call summarization.\n", "content": "## Limitations\nIn addition to the [common prebuilt component limitations](/dialogflow/cx/docs/concept/prebuilt-component#limits) , this prebuilt component has the following limitations:\n- This component does not encrypt any data.## Sample dialogs\nThe following sample dialogs demonstrate common scenarios handled by this prebuilt component. The sample dialogs demonstrate behavior when the component is called using telephony, which triggers the Default Welcome Intent and the first agent response at the start of the conversation.\n### Dispute for individual product\nEnd-user has not been previously authenticated. The agent collects details about previous orders to verify the user's identity. Once the user has been authenticated, the agent collects information about the dispute including dispute reason and the specific product the user would like to dispute. After collecting required details, the agent then submits the dispute and provides the user with the confirmation number.\n| User input | Agent response                                                                  |\n|:-------------|:--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| nan   | Hello John. In order to verify yourself, we'll need your order ID, transaction date, and amount before filing your fraud or dispute case.                                    |\n| nan   | Could you please provide the last 5 digits of your order ID?                                                       |\n| 12345  | nan                                                                     |\n| nan   | The last five digits of the order ID that we got are 12345, is that correct?                                                   |\n| yes   | nan                                                                     |\n| nan   | Great, we are done collecting the order ID. Please provide your date of order. Please say your order month, followed by your order day, and then your order year.                              |\n| 2023-10-12 | nan                                                                     |\n| nan   | Okay, your order date is October 12, 2023, is that correct?                                                       |\n| yes   | nan                                                                     |\n| nan   | Great, we have collected your order date. Please tell us the dollar amount of your order. For example, if your order transaction amount was $100.30, say \"100\".                              |\n| 97   | nan                                                                     |\n| nan   | Okay, your order transaction amount is $97, is that correct?                                                       |\n| yes   | nan                                                                     |\n| nan   | Please specify the nature of fraud or dispute you want to report. You may say something like: payments or billing, product, returns & refund, data security or privacy concern, delivery or shipping, packaging, or say \"others\".              |\n| product  | nan                                                                     |\n| nan   | Thank you for letting us know. To confirm, the reason for fraud or dispute is product. Is this correct?                                            |\n| yes   | nan                                                                     |\n| nan   | Please tell us whether the selected issue is related to an entire order, an individual product, or any other concerns.                                        |\n| product  | nan                                                                     |\n| nan   | Are you calling about your most recent order number ending with 12345 containing 2 lamp, 1 shirt and 1 other product placed on 2023-11-10 at 06:00 PM?                                |\n| yes   | nan                                                                     |\n| nan   | We've found some products in your order. Please tell us which product you would like to report. Product 1: Google lamp, Product 2: Google shirt, Product 3: Google jeans. Please say or enter the product number of the item you want to select, or say \"next\" to show more products. |\n| 3   | nan                                                                     |\n| nan   | To verify, you are interested in raising fraud or dispute case for the Google jeans. Is this correct?                                             |\n| yes   | nan                                                                     |\n| nan   | In a few words, please tell us the detailed reason for this fraud or dispute.                                                   |\n| poor quality | nan                                                                     |\n| nan   | To confirm, the fraud or dispute reason provided is poor quality. Is this correct?                                                 |\n| yes   | nan                                                                     |\n| nan   | Thanks for the confirmation. We have raised a ticket to our Fraud or Dispute team. You should hear from them shortly. Your ticket number is 6595513. Would you like to hear the confirmation number again?                   |\n| yes   | nan                                                                     |\n| nan   | Your ticket number is 6595513. Would you like us to send a confirmation message containing the ticket number?                                           |\n| yes   | nan                                                                     |\n| nan   | Would you like to receive your confirmation message via your registered phone or email?                                                |\n| phone  | nan                                                                     |\n| nan   | Just to confirm, would you like to receive the confirmation message on your phone? Please say yes or no.                                            |\n| yes   | nan                                                                     |\n| nan   | Thanks. A confirmation message has been sent to your registered phone. This may take some time. Do you wish to raise fraud or dispute ticket for another order?                              |\n| no   | nan                                                                     |\n| nan   | Thank you for calling us. Our team will follow up on your ticket.                                                      |\n## Naming conventions\nThis prebuilt component uses the following naming conventions:\n| Feature  | Format            | Example               |\n|:------------|:------------------------------------------------------|:-----------------------------------------------------------------|\n| Flow  | [Component Name]          | Fraud and Dispute            |\n| Entity Type | prebuilt_components_[component_name]_[entity_type] | prebuilt_components_product_dispute_reason      |\n| Webhook  | prebuilt_components_[component_name]:[webhook_action] | prebuilt_components_fraud_and_dispute_order:get_security_answers |\n## Input parameters\nInput parameters are parameters that are used to configure certain behaviors of the component. The parameters will be used by one or more conditions within the flow to determine how the component should behave. Flow-scoped parameters must be set on the start page of the component. Session-scoped parameters may be set either by a calling flow, or on the start page of this component.\nThis prebuilt component accepts the following input parameters:\n| Parameter Name      | Description                                                                | Input Format |\n|:------------------------------------|:-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|:---------------|\n| $session.params.phone_number  | (optional) User's local phone number, without the country code, used to identify the user.                                            | string   |\n| $session.params.all_recent_order_id | (optional) This parameter lists order IDs associated with the authenticated user, sorted by the order placement date in descending order. The first element of the array represents the most recent order. If a user has no orders, the value of this parameter is null. | List (string) |\n| $session.params.email    | (optional) The email registered with the account.                                                      | string   |\n| $session.params.user_first_name  | (optional) User's first name, used to greet and confirm ownership of the account.                                              | string   |\nThis prebuilt component allows the following optional parameters to configure the behavior of the component, including retries.\n| Parameter Name       | Description                                            | Format |\n|:----------------------------------------|:------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|:---------|\n| $flow.max_retry_another_account_counter | Specifies the number of retries allowed when selecting whether to continue with an alternate account. The default value is 2.                | integer |\n| $flow.max_retry_telephone_number  | Specifies the number of retries allowed when providing a registered telephone number. The default value is 2.                    | integer |\n| $flow.max_retry_order_number   | Specifies the number of retries allowed when providing the last five digits of an order number. The default value is 2.                 | integer |\n| $flow.max_retry_another_order   | Specifies the number of retries allowed when selecting another order for return in cases where the order ID is not found or the order is not eligible for return. The default value is 2. | integer |\n| $flow.max_retry_select_order_number  | Specifies the number of retries allowed when providing the full order number in cases where multiple orders share the same last five digits. The default value is 2.      | integer |\n| $flow.max_product_display_counter  | Specifies the maximum number of products to present in a single turn. The default value is 2.                        | integer |\n| $flow.max_product_display    | Specifies the maximum number of products to present over the entire conversation. The default value is 9.                     | integer |\n| $flow.max_retry_product_number_counter | Specifies the maximum number of retries allowed when selecting a product to return. The default value is 2.                    | integer |\n| $flow.max_product_report_confirm  | Specifies the maximum number of retries allowed when confirming the selected product. The default value is 2.                    | integer |\n| $flow.max_retry_dispute_reason   | Specifies the number of retries allowed when confirming the reason for dispute. The default value is 2.                     | integer |\n## Output parameters\nOutput parameters are session parameters that will remain active after exiting the component. These parameters contain important information collected by the component. This prebuilt component provides values for the following output parameters:\n| Parameter Name  | Description                                                                                                                                                                           | Output Format |\n|:--------------------|:-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|:----------------|\n| phone_number  | User's local phone number, without the country code, used to identify the user.                                                                                                                                                          | string   |\n| all_recent_order_id | This parameter lists order IDs associated with the authenticated user, sorted by the order placement date in descending order. The first element of the array represents the most recent order. If a user has no orders, the value of this parameter is null.                                                                                                               | List (string) |\n| email    | The email registered with the account.                                                                                                                                                                     | string   |\n| user_first_name  | User's first name, used to greet and confirm ownership of the account.                                                                                                                                                             | string   |\n| dispute_ticket_id | Ticket ID for the submitted dispute.                                                                                                                                                                     | string   |\n| transfer_reason  | This parameter indicates the reason the flow exited, if it was not successful. The returned value is one of: agent: the end-user requested a human agent at some point during the conversation. denial_of_information: the end-user declined to share information requested by the component. max_no_input: the conversation reached the maximum number of retries for no-input events. See no-input built-in events. max_no_match: the conversation reached the maximum number of retries for no-match events. See no-match built-in events. webhook_error: a webhook error occurred. See webhook.error built-in event. webhook_not_found: a webhook URL was unreachable. See webhook.error.not-found built-in event. | string   |\n## Generators\nThis component uses [Generators](/dialogflow/cx/docs/concept/generative/generators) to enable specific parts of the conversation.\n### Summarization\nThe `Summarization` generator is used to generate a post-call summary describing the conversation handled by the component.\n## Basic setup\nTo set up this prebuilt component:\n- [Import the prebuilt component](/dialogflow/cx/docs/concept/prebuilt-component#import) .\n- Configure the provided [flexible webhooks](/dialogflow/cx/docs/concept/webhook#flexible) with configuration describing your Dialogflow-external services, see Webhook setup.## Webhook setup\nIn order to use this component, you will need to configure the included [flexible webhooks](/dialogflow/cx/docs/concept/webhook#flexible) to retrieve needed information from your external services.\n### Authentication\nIf you have not previously configured external services required for authentication, you will need to configure them to enable authentication of users for this component. See [Verify user details webhook setup](/dialogflow/cx/docs/concept/prebuilt-component/authentication-retail#verify-user-details) for detailed instructions to set up the `prebuilt_components_retail_authentication:verify_user_details` webhook.\n### Get order details\nThe `prebuilt_components_fraud_and_dispute_order:get_order_details` webhook is used by the component to retrieve order details for a specified order.\nThe following parameters are provided by the component as inputs to the API request.\n| Parameter Name | Description      | Input Format |\n|:-----------------|:----------------------------------|:---------------|\n| $flow.order_id | Order ID to retrieve details for. | string   |\nThe following parameters are pulled from the API response to be used by the component.\n| Parameter Name   | Description            | Output Format |\n|:-----------------------|:---------------------------------------------------------|:----------------|\n| order_date    | Date the order was placed, in YYYY-MM-DD format.   | string   |\n| order_time    | Time the order was placed, in HH:MM format.    | string   |\n| order_product_count | The number of unique products within an order.   | integer   |\n| order_amount   | Dollar amount for the order.        | integer   |\n| order_payment_mode  | Indicates the payment mode used when placing the order. | string   |\n| all_product_id   | List of product IDs for all products within the order. | List (string) |\n| all_product_name  | List of product names for all products within the order. | List (string) |\n| all_product_brand_name | List of brand names for all products within the order. | List (string) |\n| all_product_quantity | List of quantities for all products within the order. | List (string) |### Get duplicate order details\nThe `prebuilt_components_retail_services:get_duplicate_order_details` webhook is used by the component to retrieve detailed information in order to distinguish between orders when multiple order numbers have the same last five digits.\nThe following parameters are provided by the component as inputs to the API request.\n| Parameter Name   | Description                       | Input Format |\n|:-------------------------|:------------------------------------------------------------------------------------------------------|:---------------|\n| $flow.duplicate_order_id | List containing the last five digits of order numbers shared between one or more orders for the user. | List (string) |\nThe following parameters are pulled from the API response to be used by the component.\n| Parameter Name | Description                                            | Output Format |\n|:-----------------|:-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|:----------------|\n| all_order_date | List of order dates for duplicate orders with the specified last five digits in YYYY-MM-DD format. Each element in this array corresponds to the same element in the all_order_time array. | List (string) |\n| all_order_time | List of order times for duplicate orders with the specified last five digits in HH:MM format. Each element in this array corresponds to the same element in the all_order_date array.  | List (string) |### Post reporting details\nThe `prebuilt_components_fraud_and_dispute_order:post_reporting_details` webhook is used by the component to submit a fraud or dispute ticket.\nThe following parameters are provided by the component as inputs to the API request.\n| Parameter Name       | Description                             | Input Format |\n|:------------------------------------------|:-----------------------------------------------------------------------------------------------------------------------------|:---------------|\n| $session.params.phone_number    | User's local phone number, without the country code, used to identify the user.            | string   |\n| $flow.order_id       | Order ID to submit a ticket for.                        | string   |\n| $flow.dispute_product_id     | Product ID that the user wants to file a dispute for.                  | string   |\n| $flow.order_product_dispute_reason  | Dispute reasons for the disputed product. Valid values are defined by the prebuilt_components_product_dispute_reason entity. | string   |\n| $flow.order_product_dispute_reason_other | If the user selected \"others\" as the dispute reason, this contains the specific dispute reason the user has provided.  | string   |\n| $flow.order_product_dispute_reason_detail | Detailed dispute reason.                          | string   |\nThe following parameters are pulled from the API response to be used by the component.\n| Parameter Name      | Description       | Output Format |\n|:------------------------------------|:-------------------------------------|:----------------|\n| order_product_dispute_ticket_number | Ticket ID for the submitted dispute. | string   |### Send message\nThe `prebuilt_components_fraud_and_dispute_order:send_message` webhook is used by the component to send confirmation details about the dispute to a user.\nThe following parameters are provided by the component as inputs to the API request.\n| Parameter Name       | Description                                       | Input Format |\n|:------------------------------------------|:-----------------------------------------------------------------------------------------------------------------------------------------------------------------------|:---------------|\n| $session.params.phone_number    | User's local phone number, without the country code, used to identify the user.                      | string   |\n| $flow.order_product_dispute_ticket_number | Confirmation number for the submitted dispute.                               | string   |\n| $flow.confirmation_channel    | The specific channel to send information to. Valid values are defined by the prebuilt_components_channel_email_phone entity. By default phone and email are supported. | string   |### Complete\nYour agent and its webhooks should now be set up and ready to test.", "guide": "Dialogflow"}