{"title": "Dialogflow - History", "url": "https://cloud.google.com/dialogflow/es/docs/history", "abstract": "# Dialogflow - History\nWith the History tool, you can browse and delete [interaction logs](/dialogflow/es/docs/interaction-logging) for your agent. These logs are grouped by conversation and are shown in reverse chronological order.\n", "content": "## Open a conversation\nTo open a conversation:\n- Open the [Dialogflow ES Console](https://dialogflow.cloud.google.com) .\n- Select your agent near the top of the left sidebar menu.\n- Click **History** in the left sidebar menu. If you do not see this option, ensure you have enabled [interaction logs](/dialogflow/es/docs/interaction-logging) .\n- Optionally click **All platforms** to filter by integration platform.\n- Optionally click **All conversations** to filter by conversations that did not match an intent.\n- Optionally select a time range filter.\n- Click a conversation to expand it and show individual messages.## Delete a conversation\nTo delete a conversation, open the conversation and click the delete button. If you want to delete a specific message within a conversation, you can do this from the [Training view of the Training tool](/dialogflow/es/docs/training#training-view) .\n## Errors and troubleshooting\nInteractions that had issues with intent matching show a warning icon in yellow. To fix issues with intent matching, add training phrases to intents that should have been matched for the conversation.\nInteractions that had webhook errors show a warning icon in red. To fix webhook errors, inspect the logs in Cloud logging to determine the cause.\nWhen you click the option icon for an interaction, you see options for troubleshooting:\n- **View logs in Stackdriver** : This takes you to the associated logs in [Cloud logging](/dialogflow/es/docs/logging) . If you have disabled the [Log interactions to Google Cloud](/dialogflow/es/docs/agents-settings#general) setting, this option will not be available.\n- **Go to intent** : This takes you directly to the intent that was matched. If no intent was matched, this option is not available.\n- **Raw interaction log** : This opens the JSON representation of the interaction request.", "guide": "Dialogflow"}