{"title": "Dialogflow - Analytics", "url": "https://cloud.google.com/dialogflow/cx/docs/concept/analytics", "abstract": "# Dialogflow - Analytics\nThe Dialogflow Console provides an analytics panel that shows various views for tracking agent performance data. For example, you can track escalations, pages with many no-matches, and webhooks with many failures. You can filter each view by date range. All statistics shown are computed hourly.\nUsing these analytics views, you can understand your agent performance through different conversation paths and take corrective action to improve performance.\n", "content": "## Limitations\nFor large agents, analytics data may take time to load.\n## Enable interaction logging\nThe analytics tool uses data from interaction logs. You can enable and disable this logging with the [Enable interaction logging](/dialogflow/cx/docs/concept/agent#settings-general) agent setting.\n## Open the analytics panel\nTo open the analytics panel:\n- Go to the [Dialogflow CX Console](https://dialogflow.cloud.google.com/cx/projects) .\n- Choose your project.\n- Select your agent.\n- Select the **Manage** tab.\n- Click **Analytics** .\n- Using the link near the top, you can also access [Legacy Analytics](/dialogflow/cx/docs/concept/analytics-legacy) .## Conversation outcomes\nThis view shows the counts of certain conversation outcomes as a time series chart.\nThe following metrics are shown:\n| X     | Item                |\n|:-------------------|:------------------------------------------------------------------|\n| End Interaction | The number of conversations that were abandoned.     |\n| Live Agent Handoff | The number of conversations where human escalation was requested. |\n| Other    | The number of conversations not accounted for in other metrics. |\n## Intent escalations\nThis view shows a table of intents with the highest number of human escalations. It also shows an escalation trend for a selected intent as a time series chart. If you have labeled certain intents as [head intent](/dialogflow/cx/docs/concept/intent#head) , then you can restrict the view to these intents only.\nThe following metrics are shown:\n| X      | Item                              |\n|:----------------------|:---------------------------------------------------------------------------------------------------------------------------|\n| Sessions    | Total number of sessions that the intent was detected in.                 |\n| Escalation rate  | Percentage of sessions that requested human escalation.                 |\n| Turns     | The number of conversational turns the intent was detected in. Each conversation may have multiple matches for one intent. |\n| Head Intent Escalated | Percentage of escalation requests for sessions in which the intent was the final head intent.        |\n## Troubleshooting\nThe troubleshooting section contains multiple types of views that help debug common issues with flows and pages.\n### Missing transitions\nThis view provides pages in tabular form, where an existing intent should have matched but doesn't due to missing routes.\nThe following metrics are shown:\n| X   | Item                 |\n|:------------|:------------------------------------------------------------------------|\n| Intent Name | The intent name that would have matched if it were in scope.   |\n| Turns  | The number of conversational turns that should have matched the intent. |### Pages with no-matches\nThis view provides pages in tabular form, sorted by no-match rates.\nThe following metrics are shown:\n| X    | Item                   |\n|:---------------|:-------------------------------------------------------------------------------|\n| No Match rate | Percentage of total conversation turns that resulted in no-match for the page. |\n| No Match turns | The total number of conversation turns that resulted in no-match for the page. |### Pages with no responses\nThis view provides pages in tabular form, where the pages resulted in no agent response.\nThe following metrics are shown:\n| X    | Item               |\n|:----------------|:---------------------------------------------------------------|\n| Empty responses | The number of interactions on the page with no agent response. |\n## Webhook errors\nThis view provides webhook errors in tabular form. You can organize the list by:\n- **By name** : Organized by webhook name.\n- **By tag** : Organized by webhook tags.\n| X    | Item            |\n|:----------------|:---------------------------------------------------|\n| Calls   | The number of webhook invocations.     |\n| Failures  | The number of webhook failures excluding timeouts. |\n| Timeout rate | Percentage of webhook invocations that timed out. |\n| Average latency | Average latency of the webhook invocation.   |", "guide": "Dialogflow"}