{"title": "Dialogflow - Customer-managed encryption keys (CMEK)", "url": "https://cloud.google.com/dialogflow/cx/docs/concept/cmek", "abstract": "# Dialogflow - Customer-managed encryption keys (CMEK)\n**Note:** This is a limited access feature. In order to use CMEK, you must contact your Google account team to request access.\nBy default, Google Cloud automatically encrypts data using encryption keys managed by Google. If you have specific compliance or regulatory requirements related to the keys that protect your data, you can use customer-managed encryption keys (CMEK).\nFor more information about CMEK, see [the CMEK guide](/kms/docs/cmek) in the Cloud Key Management Service (KMS) documentation.\n", "content": "## Protected data\nAll Dialogflow CX agent [data-at-rest](https://en.wikipedia.org/wiki/Data_at_rest) can be protected with CMEKs.\n## Limitations\n- Currently, [Analytics](/dialogflow/cx/docs/concept/analytics) is disabled for agents with CMEK enabled.\n- Currently, key rotation is not supported for [data store agents](/dialogflow/cx/docs/concept/generative/data-store-agent) . Dialogflow CX agents without data stores do support key rotation. Re-encryption of previously encrypted data with a new key version is not supported in either scenario.\n- The [global](/dialogflow/cx/docs/concept/region#avail) location is not supported.\n- One key should be used per project location.\n- In order to [restore an agent](/dialogflow/cx/docs/concept/agent#export) with CMEK enabled, you must choose the Cloud Storage option.\n- Existing resources in non-CMEK integrated projects cannot be CMEK integrated retroactively. Instead, it is recommended that resources be exported and restored in a new project for CMEK.## Create keys\nTo create keys, you use the KMS service. For instructions, see [Creating symmetric keys](/kms/docs/creating-keys) . When creating or choosing a key, you must configure the following:\n- Be sure to select the [location](/dialogflow/cx/docs/how/region) that you use for your agent, otherwise, requests will fail.\n- Dialogflow does not support key rotation. When you create the key, the rotation period has to be set to **Never** .## Configure an agent to use your keys\nWhen you create an agent, you can specify the agent [location](/dialogflow/cx/docs/how/region) and whether the agent will use a Google-managed or customer-managed key. Select your key at this time.\n**Warning:** You cannot change encryption key settings for a location once it has been specified. In order to change a location, you must create a new project with the selected location and [import](/dialogflow/cx/docs/concept/agent#export) existing agents to the new project.\n## Configure your service account or user account\n- Create the CCAI CMEK Service account for your project with Google Cloud CLI. For more information, see [gcloud services identity documentation](https://cloud.google.com/sdk/gcloud/reference/beta/services/identity/create) .```\ngcloud beta services identity create --service=dialogflow.googleapis.com --project=PROJECT_ID\n```The service account will be created. It won't be returned in the create response, but will have the following format:```\nservice-PROJECT_NUMBER@gcp-sa-ccai-cmek.iam.gserviceaccount.com\n```\n- Grant the CCAI CMEK Service account the [Cloud KMS CryptoKey Encrypter/Decrypter](/kms/docs/reference/permissions-and-roles#cloudkms.cryptoKeyEncrypterDecrypter) role to ensure that the service has permissions to encrypt and decrypt with your key.```\ngcloud kms keys add-iam-policy-binding KMS_KEY_ID \\--project=PROJECT_ID \\--location=LOCATION_ID \\--keyring=KMS_KEY_RING \\--member=serviceAccount:service-PROJECT_NUMBER@gcp-sa-ccai-cmek.iam.gserviceaccount.com \\--role=roles/cloudkms.cryptoKeyEncrypterDecrypter\n```", "guide": "Dialogflow"}