{"title": "Dialogflow - Training", "url": "https://cloud.google.com/dialogflow/es/docs/training", "abstract": "# Dialogflow - Training\nWhen your agent is trained, Dialogflow uses your training data to build machine learning models specifically for your agent. This training data primarily consists of intents, intent training phrases, and entities referenced in an agent; which are effectively used as machine learning data labels. However, agent models are built using parameter prompt responses, agent settings, and many other pieces of data associated with your agent.\nWhenever you change your agent, you should ensure that the agent is trained before attempting to use it. Depending on your agent settings, training may occur automatically or manually.\nYou can also use the [Training Tool](#tool) to analyze, import, and export actual conversation data, and to improve your training data.\n", "content": "## Draft agent automatic training\nBy default, agent training for a [draft agent](/dialogflow/es/docs/agents-versions) is executed automatically every time you update and save the agent from the console. Popup dialogs will display the status of this training.\nHowever, updating your agent with the API does not trigger automatic training.\n## Draft agent manual training\nYou can update agent [ML settings](/dialogflow/es/docs/agents-settings#ml) to disable automatic training for a draft agent.\nIf your agent has more than 780 intents, or if you have disabled the automatic training setting, you must manually execute training.\nTo manually train an agent from the console, click the **Train** button in the ML settings.\nTo manually train an agent with the API, call the `train` method on the [Agent](/dialogflow/docs/reference/common-types#agents) type.\n**Note:** After [restore or import](https://cloud.google.com/dialogflow/es/docs/agents-settings#export) , the agent is retrained, even if the automatic training is disabled.\n## Agent version automatic training\nWhenever a new [agent version](/dialogflow/es/docs/agents-versions) is created, the new agent version is automatically trained.\nTo create a new agent version from the console, click the **Publish a version** button on the Environments tab.\nTo create a new agent version with the API, call the `create` method for the [Version type](/dialogflow/es/docs/reference/common-types#versions) to create a new agent version.\n## Training Tool\nThe Training Tool is used to review end-users inputs sent to your agent and to improve your training data. Using the tool, you can:\n- Review actual end-users inputs and the intents that are matched for each conversational turn with the current agent model.\n- Add the end-user expressions from these conversations to the training phrases of the matched intents, different intents, or fallback intents.\n- Import end-user expressions you have prepared or captured from actual conversations.\nThe tool uses [agent history](/dialogflow/docs/history) data to load conversations, so [interaction logging](/dialogflow/docs/agents-settings#general) must be enabled to use the tool. The Training Tool only shows end-user expressions. To view both agent and end-user conversation data, see the more complete agent history.\nTo open the Training Tool:\n- Go to the [Dialogflow ES Console](https://dialogflow.cloud.google.com) .\n- Select your agent near the top of the left sidebar menu.\n- Click **Training** in the left sidebar menu.\n### Conversation list\nWhen you open the tool, it shows the conversation list. This is a list of recent conversations in reverse chronological order. Each row in the list provides a summary of a conversation. The following table describes each of the UI elements:\n| UI Element | Description                               |\n|:-------------|:------------------------------------------------------------------------------------------------------------------------------------|\n| Conversation | The first end-user expression in the conversation.                     |\n| Date   | The date that the conversation occurred or was imported.                   |\n| refresh  | When a conversation is used to update training data (as described below), the status indicator for the row shows a green checkmark. |\n### Training view\nWhen you click a row in the conversation list, it opens the conversation in training view. The training view shows a list of conversational turns and provides controls to add this data to your training data.\n**Note:** You don't have to worry about duplicate training phrases. If you add training phrases that already exist to an intent, Dialogflow will merge them into one example.\nWhen you edit the displayed data or click a task button on the right, you create training data update tasks that get queued for saving. Once you are done creating tasks, click the **Approve** button to execute all queued tasks. Once approved, you should [manually train your agent](#draft-manual) .\nThe following table describes each of the UI elements:\n| UI Element | Description                                             |\n|:-------------|:--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| Date   | The date that the conversation occurred or was imported.                                 |\n| Requests  | The number of rows for the conversation.                                     |\n| No Match  | The number of rows for which no intent is matched.                                   |\n| User Says | The end-user expression for the row.                                      |\n| Intent  | The intent for this row matched with the current agent model. You can click the link to change the associated intent to a new or existing intent.           |\n| check  | Queues a task to add the end-user expression for the row as a training phrase to the currently selected intent. The icon turns green when a task is queued.         |\n| block  | Queues a task to add the end-user expression for the row as a training phrase to the default fallback intent. This creates a negative example. The icon turns orange when a task is queued. |\n| delete  | Queues a task to delete the row. The icon turns red when a task is queued.                             |\n| Approve  | Executes queued tasks for all rows.                                       |\n### Annotations\nWhen looking at a conversation in training view, end-user expressions show matched entities as highlighted [annotations](/dialogflow/docs/intents-training-phrases#annotation) . To add or edit an annotation:\n- Click an annotation or select the words you want to annotate.\n- Choose an existing entity from the menu.### Import conversations\nYou can import conversation data files you have prepared or captured to the Training Tool. Importing conversations can be used to improve an existing agent. To upload a conversation, click the **Upload** button at the top of the page. Then, you can analyze this data for adding to training data as described above.\nThe following describes the file content format, its limitations, and the results:\n- Each uploaded file results in a single conversation in the Training Tool.\n- Requests are not sent to the detect intent API, therefore, no contexts are activated and no intents are matched.\n- A single text file or a zip archive that can contain up to 10 text files.\n- One upload cannot exceed 3 MB.\n- The files should only contain end-user expressions delimited by newlines.\n- Ideally, files should only include data that is useful as training phrases.\n- The order of the end-user expressions is not important.\nHere is an example file:\n```\nI want information about my account.\nWhat is my checking account balance?\nHow do I transfer money to my savings account?\n```\n### Limitations\n- The Training Tool is only available for the`global` [region](/dialogflow/es/docs/how/region) .\n- The Training Tool does not take the [ML Classification Threshold](/dialogflow/es/docs/agents-settings#ml) setting into consideration for intent matching. You may see different intents matched at runtime and in the Training tool, even if the agent model has not changed.\n- End-user inputs containing [required](/dialogflow/es/docs/intents-actions-parameters#required) parameter values may not match to the expected intents in the Training tool, while matching correctly at runtime. This may happen in the following situations:- There are no annotated training phrases in that intent.\n- The input significantly differs from the training phrases.\n## Best practices\n### Use the Training Tool at various stages of development\nUse the Training Tool at various stages of agent development, and refine your training data at each stage:\n- Before your agent is released to production, test it with a small group of users.\n- Shortly after your agent is released to production, examine if real conversations are behaving as expected.\n- Whenever significant changes are made to your agent, check that the new changes are behaving as expected.\n- Run the tool periodically for production agents, to perform regular analysis.\n### Import quality data\nThe following can often be useful sources of data:\n- Logs of conversations with human customer service agents.\n- Online customer support conversations (email, forums, FAQs).\n- Customer questions on social media.\nYou should avoid the following types of data:\n- Long-form, non-conversational end-user expressions.\n- End-user expressions that are not relevant to any of the intents in your agent.\n- Logs of things not said by end-users (for example, responses from customer service agents).", "guide": "Dialogflow"}