{"title": "Dialogflow - Sessions", "url": "https://cloud.google.com/dialogflow/cx/docs/concept/session", "abstract": "# Dialogflow - Sessions\nA session represents a conversation between a Dialogflow agent and an end-user. You create a session at the beginning of a conversation and use it for each turn of the conversation. Once the conversation has ended, you discontinue using the session.\nYou should not use the same session for concurrent conversations with different end-users. A session remains active and its data is stored for 30 minutes after the last request is sent for the session.\nEach session is determined unique by a session ID generated by your system. You create a new session by providing a new session ID in a detect intent request and other session methods. A session ID is a string of at most 36 bytes in size. Your system is responsible for generating unique session IDs. They can be random numbers, hashed end-user identifiers, or any other values that are convenient for you to generate.\nCheck the [Regionalization](/dialogflow/cx/docs/how/region) documentation for information about the Location ID value in the session name.\n", "content": "## Long-lasting sessions\nBy default, Dialogflow maintains the session data for 30 minutes. There are two ways to extend the lifetime of the sessions:\n- **(Preferred)** Set session TTL using`QueryParameters.session_ttl`. The maximum allowed value is 24 hours.\n- You can revive the previous session state by setting `QueryParameters.current_page` and `QueryParameters.parameters` in `DetectIntentRequest` .An example workflow looks like:- End-user talks with the agent under session A.\n- Your code records the state associated with session A returned in the API response, namely`QueryResult.current_page`and`QueryResult.parameters`.\n- End-user stops interacting with the agent after 50 minutes.\n- End-user talks with the agent again.\n- Your code sends the end-user input, together with the previously recorded`QueryParameters.current_page`and`QueryParameters.parameters`in the request, to detect intent with the previous session state. You do not need to use the same session ID as used by session A.\n **Note:** [Handler call stack](/dialogflow/cx/docs/concept/handler#call-stack) will **not** be revived with this approach.## References\nFor information on session pricing, see the [pricing page](/dialogflow/pricing) .\nFor more information on sessions:", "guide": "Dialogflow"}