{"title": "Live Stream API - Configure private services access", "url": "https://cloud.google.com/livestream/docs/how-to/vpc/configure-private-services-access", "abstract": "# Live Stream API - Configure private services access\nPrivate services access is a secure, private connection between your Google Cloud virtual private cloud (VPC) network and Google-managed or third-party services. It enables VM instances in your VPC network to communicate with these services using internal IP addresses, without exposing traffic to the public internet.\n", "content": "## Before you begin\nTo establish a private connection, complete the following prerequisites:\n- You must have an [existing VPC network](/vpc/docs/create-modify-vpc-networks#create-custom-network) that you can use to connect to the service producer's network. VM instances must use this VPC network to connect to services over a private connection.\n- Follow the steps on the Live Stream API [Before you begin](/livestream/docs/how-to/before-you-begin) page to create a properly-configured Google Cloud project (or choose an existing project).## Enable private services access for the Live Stream API\nThe general process for configuring private services access is provided in the [Virtual Private Cloud documentation](/vpc/docs/configure-private-services-access) . This page adapts the process to the Live Stream API.\n- [Install and configure the Google Cloud CLI](/sdk/docs/install-sdk) . **Note:** If you've installed the Google Cloud CLI previously, make sure you have the latest version by running `gcloud components update` .\n- Enable the Service Networking API.Execute the  following  command:\n- To get the permissions that you need to set up a private connection, ask your administrator to grant you the [Compute Engine Network Admin](/iam/docs/understanding-roles#compute.networkAdmin) ( `roles/compute.networkAdmin` ) IAM role on the Google Cloud project in which the VPC network resides. For more information about granting roles, see [Manage access](/iam/docs/granting-changing-revoking-access) .The required permissions are also available through [custom roles](/iam/docs/creating-custom-roles) or other [predefined roles](/iam/docs/understanding-roles) .\n- In the VPC network, allocate a named IP range using the `addresses create` command as shown in the following examples.To specify an address range and a prefix length, which is also the subnet mask, use the `addresses` and `prefix-length` flags. For example, to allocate the CIDR block 192.168.0.0/13, specify `192.168.0.0` for the address and `13` for the prefix length.Before using any of the command data below, make the following replacements:- ``: a name for the  allocated range, such as`my-allocated-range`\n- ``: a description for the range, such as`allocated for my-service`\n- ``: the name of your VPC network, such  as`my-vpc-network`\nExecute the  following  command:You should receive a response similar to the following:\n```\nCreated [https://www.googleapis.com/compute/v1/projects/PROJECT_ID/global/addresses/RESERVED_RANGE_NAME].\n```\nTo only specify a prefix length, use the `prefix-length` flag. When you omit the address range, Google Cloud automatically selects an unused address range in your VPC network. The following example selects an unused IP address range with a 13-bit prefix length.Before using any of the command data below, make the following replacements:- ``: a name for the  allocated range, such as`my-allocated-range`\n- ``: a description for the range, such as`allocated for my-service`\n- ``: the name of your VPC network, such  as`my-vpc-network`\nExecute the  following  command:You should receive a response similar to the following:\n```\nCreated [https://www.googleapis.com/compute/v1/projects/PROJECT_ID/global/addresses/RESERVED_RANGE_NAME].\n```\nThe preceding example creates a private connection to Google so that the VM instances in the provided VPC network (for example, `my-vpc-network` ) can use private services access to reach Google services that support it.The Live Stream API requires the allocation of a CIDR/13 block per region. If you are planning to use the Live Stream API in multiple regions, allocate a larger block. The following table describes the recommended block size to allocate depending on the number of regions:| Number of regions | value for the prefix-length flag |\n|:--------------------|-----------------------------------:|\n| 1     |         13 |\n| 2     |         12 |\n| 3-4     |         11 |\n| 5-8     |         10 |\n| 7-16    |         9 |\n- Create a private connection between the service producer network and your VPC network:- Create a private connection.Before using any of the command data below, make the following replacements:- ``: the name of the  allocated range you created in the previous step\n- ``: the name of your VPC network\n- ``: the Google Cloud project ID of the project that contains your VPC network\nExecute the  following  command:You should receive a response similar to the following:\n```\nOperation \"operations/OPERATION_ID\" finished successfully.\n```\nThis command creates a long-running operation (LRO).\n- If the command succeeds, skip to the next step. Otherwise, check the operation status.Before using any of the command data below, make the following replacements:- ``: the ID of the operation returned in  the previous step\nExecute the  following  command:You should receive a response similar to the following:\n```\nOperation \"operations/OPERATION_ID\" finished successfully.\n```\n **Note:** You can specify more than one allocated range when you create a private connection. For example, if a range has been exhausted, you can assign additional allocated ranges. The service will use IP addresses from all of the provided ranges in the order that you specified.\n- (Optional) If you are using VPC Service Controls, you need to enable VPC-SC for the private connection you just created.Before using any of the command data below, make the following replacements:- ``: the name of your VPC network\nExecute the  following  command:You should receive a response similar to the following:\n```\nOperation \"operations/OPERATION_ID\" finished successfully.\n```- (Optional) If you have an on-premises network connected to your VPC, you can configure the peering connection so that on-premises hosts can communicate with the service producer's network. For more information, see [on-premises host troubleshooting](/vpc/docs/configure-private-services-access#on-prem) .", "guide": "Live Stream API"}