{"title": "Live Stream API - Troubleshoot", "url": "https://cloud.google.com/livestream/docs/troubleshooting", "abstract": "# Live Stream API - Troubleshoot\nThis page shows you how to resolve issues with the Live Stream API. The errors shown on this page are specific to the Live Stream API. For information on generic errors across Google APIs, see the Cloud APIs [Errors](/apis/design/errors) page.\n", "content": "## Input stream rejected\nIf your encoder sends an input stream to an input endpoint, but the connection keeps getting rejected, check for these possible issues:\n### Invalid input endpoint URI\nAn error occurs if your encoder sends an input stream to an invalid input endpoint URI.\nTo resolve this issue, check if your encoder is configured to send the input stream to an input endpoint URI with the [correct IP address and STREAM-ID](/livestream/docs/reference/rest/v1/projects.locations.inputs#Input.FIELDS.uri) .\n### Input is not attached to a channel\nAn error occurs if your encoder sends an input stream to an input endpoint URI that is not attached to a channel.\nTo resolve this issue, [create a new channel](/livestream/docs/how-to/create-channels#create_channel) with the input endpoint. To check if an input endpoint has been successfully attached to the channel, [get the channel details](/livestream/docs/how-to/create-channels#get_channel_details) and look for the name of the input endpoint in the `inputAttachments` field.\n### Inactive channel\nAn error occurs if your encoder sends an input stream to a channel that is not running.\nTo resolve this issue, [check the status](/livestream/docs/how-to/create-channels#get_channel_details) of the channel to make sure its `streamingState` is `AWAITING_INPUT` . If the `streamingState` of the channel is `STOPPED` , [start the channel](/livestream/docs/how-to/create-channels#start_channel) .\n### Another encoder already connected with the same input endpoint\nAn error occurs if multiple encoders attempt to send input streams to the same input endpoint. Only one connection is accepted at a time per input endpoint URI.\nTo resolve this issue, [check if the channel](/livestream/docs/how-to/create-channels#get_channel_details) is already in `STREAMING` state. If so, you have the following options:\n- Create a separate input endpoint and channel for the second input stream.\n- Stop the first input stream before sending another one to the same input endpoint.\n### Encoder IP address is not in the allowed IP ranges\nAn error occurs if your encoder sends an input stream from an IP address outside the specified IP ranges configured for an input endpoint.\nTo resolve this issue, [get the details](/livestream/docs/how-to/create-input-endpoints#get_input_endpoint_details) for an input endpoint and check the [securityRules](/livestream/docs/reference/rest/v1/projects.locations.inputs#securityrule) field. If there are specified `ipRanges` , make sure your encoder has a valid IP address in those IP ranges.\n## Missing output files in the Cloud Storage bucket\nIf your encoder is successfully sending an input stream to the input endpoint, but no output files appear in the Cloud Storage bucket, check for these possible issues:\n### Incorrect Cloud Storage bucket\nOutput files may be missing if you are checking the wrong Cloud Storage bucket.\nTo resolve this issue, [get the channel details](/livestream/docs/how-to/create-channels#get_channel_details) for your live stream. Check the `output.uri` field for the correct Cloud Storage bucket URI.\n### Invalid input video/audio codecs\nOutput files may be missing if your encoder is sending invalid video or audio codecs.\nTo resolve this issue, make sure your encoder is only sending H264 video and AAC audio codecs.\n### Cloud Storage permission denied\nBy default, the Live Stream API creates a service account that can access Cloud Storage buckets in the same Google Cloud project that hosts the Live Stream API resources. Output files may be missing if this service account loses permission to access the Cloud Storage bucket.\nTo resolve this issue, make sure the service account has sufficient permissions. The creation of output files may fail for the following reasons:\n- The output Cloud Storage bucket is in a different Google Cloud project from Live Stream API resources such as the channel and input endpoint.\n- The default permissions are revoked from the service account.\nSee [Access to Cloud Storage](/livestream/docs/access-control#access_to_gcs) for more information.\n### Missing audio tracks\nOutput files may be missing if your encoder sends an input stream with missing audio tracks. The video pipeline waits for all audio tracks to arrive before processing begins.\nTo resolve this issue, [get the channel details](/livestream/docs/how-to/create-channels#get_channel_details) for your live stream. Make sure your encoder is sending all audio tracks configured in the `ElementaryStream.audioStream.mapping` ( [AudioMapping](/livestream/docs/reference/rest/v1/projects.locations.channels#audiomapping) ) field.", "guide": "Live Stream API"}