{"title": "Google Cloud Observability - Using microservice dashboards", "url": "https://cloud.google.com/stackdriver/docs/solutions/slo-monitoring/ui/svc-dashboard", "abstract": "# Google Cloud Observability - Using microservice dashboards\nThis page describes how to view and use the dashboard associated with a service.\nEach service in your project has its own dashboard. The dashboard gives you observability into many aspects of the service and how it is performing, including logs, performance metrics, and the status of alerting policies.\nYou can bring up the dashboard for a service as follows:\n- For an existing service, click on the name of the service in the inventory table on the **Services Overview** page. For more information, see [Viewing your microservices](/stackdriver/docs/solutions/slo-monitoring/ui/svc-overview#svc-overview) .\n- After successfully defining a new custom service, click **View servicedashboard** . See [Defining a service](/stackdriver/docs/solutions/slo-monitoring/ui/define-svc) for more information.", "content": "## Dashboard structure\nThe per-service dashboards in Cloud Monitoring have the same general structure.\n- For all service types, the dashboard includes the following:- Service details: provides identifying information for the service.\n- Alerting information: describes how your alerting policies are behaving.\n- Current SLO status: describes how your services are performing against their service-level objectives (SLOs).\n- Logging information: displays recent log entries in Cloud Logging for this service.\n **Note:** For Anthos Service Mesh services, the service dashboards are Anthos Service Mesh dashboards, not Monitoring dashboards. The Anthos Service Mesh dashboards show the same information, but the layout is different. For information on per-service information in Anthos Service Mesh, see [Monitoring a specific service](/service-mesh/docs/observability/explore-dashboard#monitoring_a_specific_service) .\n- For GKE-based services, the dashboard also includes the following:- Metrics: displays charts for a selection of metrics related to your service.\n- Entity details: lists information about the GKE entity on which the service is based.\n## Service details\nThe **Service details** pane displays the ID, type, and labels associated with the service. The following screenshot shows an example from an App Engine service:\n## Alerts timeline\nThe **Alerts timeline** pane shows the history of any SLO-based alerting policies that have recently fired. When an alerting policy fires, it raises an incident. The following screenshot shows the incidents raised by firing alerts for the last day:\nThe colored bands show the duration of the incident. To see more information about an incident, hover over the colored band. A card appears that identifies the alerting policy, indicates when the alerting policy fired, and shows the current status of the incident. Clicking **Alert details** on the card takes you to the **Incident details** page in Cloud Monitoring. For more information on this page, see [Incidents](/monitoring/alerts/incidents-events) .\nThe default display period is one hour. To change the display period, select a different value in the **Time Span** selector.\nTo remove the alerting timeline from the display, click **Hide timeline** .\n## Current SLO status\nThe **Current status** pane shows the status of each SLO defined for the service. The following screenshot shows the current status of a service with two SLOs:\nEach SLO appears as a row in a table with the following columns:\n- **Status** indicates if the service is meeting the SLO or not.\n- **Objective** briefly describes the performance goal of the SLO.\n- **Type** describes the service-level indicator (SLI) used in the SLO.\n- **Alerts firing** displays the ratio of firing alerting policies to the total count of alerting policies.\n- **Error budget** shows the percentage of the error budget remaining.\n- **More options** shows configuration changes you can make to the service, like creating an alerting policy.\n- **Show more** expands the current row to show more details about the performance of the SLO.\nThe **Current status** pane also includes a **Create an SLO** button. A service can have multiple SLOs. For information on creating SLOs, see [Creating an SLO](/stackdriver/docs/solutions/slo-monitoring/ui/create-slo) .\n### Status details\nClicking **Show more** expands the status row to show more details about the SLO:\nAfter you click **Show more** , the original entry is replaced by a color-coded bar that shows the status the SLO. The bar includes the display name and type of the SLO, and includes **Edit** and **Delete** buttons for changing or deleting the SLO configuration.\nTo return to the status summary view, click **Show less** .\nThe expanded details also includes status indicators for the following:\n- Current value of the service-level indicator.\n- Status and value of remaining error budget.\n- Status of any alerting policies for this SLO.\nThese indicators are tabs, and selecting each tab changes the rest of the details display. By default, the **Service-level indicator** tab is selected, which presents a chart of the performance of the SLI over time against the SLO threshold. The previous screenshot includes that chart.\n### Error-budget tab\nClick the **Error budget** tab to see a chart showing the consumption of the error budget over time.\nFor each compliance period that the SLI doesn't meet the performance threshold for the SLO, some of the error budget is consumed. The details depend on the types of the SLO and the compliance period; see [Error budgets](/stackdriver/docs/solutions/slo-monitoring#defn-error-budget) and [Trajectory of error budgets](/stackdriver/docs/solutions/slo-monitoring#trajectory) for more information.\nWhen the error budget for the compliance period is exhausted, your service is failing to meet the SLO.\n**Note:** You want to know that your error budget is being depleted before it is exhausted. You can use an alerting poilcy to monitor the rate at which the error budget is being depleted so you know when the error budget is likely to be exhausted before the end of the compliance period.\n### Alerts tab\nClick on the **Alerts firing** tab to see the number of open incidents and status of the alerting policy, and to define additional alerting polices:\nClick **View policy** to go to the **Policy details** page for the alerting policy associated with this SLO.\nThe **Policy details** displays a chart that shows you the rate at which your service is consuming its error budget. When you create an alerting policy, you set a threshold based on the size of the error budget and the length of the compliance period. The threshold is an estimate of the rate at which the error budget can be consumed without exhausting it before the end of the compliance period, and the alertng policy warns you when you exceed that rate.\nFor more information on how these alerting policies work, see [Alerting onyour burn rate](/stackdriver/docs/solutions/slo-monitoring/alerting-on-budget-burn-rate) ; for information on creating an alerting policy, see [Creating an alerting policy](/stackdriver/docs/solutions/slo-monitoring/ui/create-alert) .\n## Logs\nThe **Logs** pane shows the log entries written by this service to Cloud Logging. The following screenshot shows an example:\nTo analyze log entries, click **Open in Logs Explorer** , part of Cloud Logging. For more information, see [View logs by using the Logs Explorer](/logging/docs/view/logs-explorer-interface) .\n## Metrics\n**For GKE-based services only.**\nThe **Metrics** pane shows charts for a selection of the metrics written by the service. The set of available metrics depends on the type of entity the service represents. The following screenshot shows the default charts for a service based on a Kubernetes cluster:\nEach chart has a toolbar with the following buttons:\n- **Legend toggle** displays a legend below the chart. For information on chart legends, see [Configure legends](/monitoring/charts/working-with-legends) .\n- **Full screen** displays the chart in full-screen mode.\n- **More options** displays a menu with the following choices:- **Download PNG** saves an image of the chart in PNG format.\n- **View in Metrics Explorer** opens the chart in Metrics Explorer, where you can change the data displayed by the chart and the display characteristics of the chart. For more information, see [Metrics Explorer](/monitoring/charts/metrics-explorer) .For general information on Monitoring charts, see [Add dashboard widgets](/monitoring/charts) .\n### Other charts\nFor a cluster, the **Metrics** panel shows charts for CPU consumption in the cluster by default. You can view a different set of charts by selecting a different set of metrics from the metrics menu. The following screenshot shows the menu for a cluster-based service:\nThis menu shows the categories of metrics available for this service: container, pod, and network. Each of these categories contains a number of metric types with charts available on this pane.\nThe **Metrics** pane for the example service initially shows the charts for the container's CPU consumption, but there are also charts for the container's ephemeral storage, memory, and other metrics. Additionally, charts are available for pod and node metrics.\nClick **Help** for details about the metrics available on the charts. The chart choices on this menu correspond to metric types from the [list of Kubernetes metrics](/monitoring/api/metrics_kubernetes#kubernetes) .\n## Entity details\n**For GKE-based services only.**\nThe **Kubernetes entity details** pane shows information about the GKE entities associated with this service. The information displayed depends on the type of entity the service represents. The following screenshot shows some of the entities in a service based on a Kubernetes cluster:\nEach row in the table also has a **More options** button that brings up a menu of other ways to view information about this entity:\n- View the Google Kubernetes Engine dashboard. For more information on this dashboard, see [GKE dashboards](/kubernetes-engine/docs/concepts/dashboards#dashboards) in the Google Kubernetes Engine documentation.\n- View the log entries written by this service in the Logs Explorer. For more information, see [View logs by using the Logs Explorer](/logging/docs/view/logs-explorer-interface) .", "guide": "Google Cloud Observability"}