{"title": "Google Cloud Observability - Import Grafana dashboards into Cloud Monitoring", "url": "https://cloud.google.com/stackdriver/docs/managed-prometheus/import-grafana-dashboards", "abstract": "# Google Cloud Observability - Import Grafana dashboards into Cloud Monitoring\nCloud Monitoring provides an importer that you can use to import dashboard files in the [Grafana](https://grafana.com/) JSON format into Cloud Monitoring. This document describes how to use the importer to convert Grafana dashboards and optionally upload them to your Google Cloud project.\nYou can use the importer to convert Grafana dashboards and upload them to Cloud Monitoring as a single operation, or you can perform the conversion and upload steps separately. You might choose this approach if you want to edit the converted dashboards before uploading them.\nThe importer converts dashboard files in the JSON format used by Grafana into the JSON format used by Cloud Monitoring. A converted dashboard might differ from the original Grafana dashboard. If a Grafana dashboard uses features that are not available in Cloud Monitoring dashboards, then those aspects of the Grafana dashboard are not converted. These differences are listed in the conversion output. The importer is only designed to handle dashboards that use PromQL expressions and Prometheus data sources. Dashboards that use other forms of querying or data sources might not import successfully.\nFor information about importing Prometheus alerts into Cloud Monitoring, see [Migrate alerting rules and receivers from Prometheus](/monitoring/promql/promql-migrate) .\n", "content": "## Before you begin\nBefore you can install and run the dashboard importer, you must do the following:\n- Use an environment that supports [Bash](https://www.gnu.org/software/bash/) shell scripts.\n- Have or [install Git](https://git-scm.com/) .\n- Have or [install Node.js](https://nodejs.org/en/download) , version 20.4.1 or newer.\n- Have or [install the Google Cloud CLI](/sdk/docs/install-sdk) . If you already have the gcloud CLI installed, ensure that you have the latest version by running the [gcloud components update](/sdk/gcloud/reference/components/update) command.## Obtain the dashboard importer\nThe dashboard importer is stored in the [monitoring-dashboard-samplesGitHub repository](https://github.com/GoogleCloudPlatform/monitoring-dashboard-samples/tree/master/scripts/dashboard-importer) . To get the importer, do the following:\n- Clone the repository:```\ngit clone https://github.com/GoogleCloudPlatform/monitoring-dashboard-samples\n```\n- Change to the directory for the dashboard importer:```\ncd monitoring-dashboard-samples/scripts/dashboard-importer\n```\nThe dashboard importer includes the following scripts:\n- `import.sh` , which converts dashboards and optionally uploads the converted dashboards to Cloud Monitoring.\n- `upload.sh` , which uploads the converted dashboards—or any Monitoring dashboards—to Cloud Monitoring. The `import.sh` script calls this script to do the upload.\nWhen you use the `import.sh` script, you must specify the location of the Grafana dashboards to convert. The importer creates a directory that contains the converted dashboards and other information. The following sections describe these directories.\n### Grafana dashboards to convert\nYou can use the dashboard importer to convert one or more dashboards at a time by specifying a path to the dashboards files.\n- You can specify the path to a directory that contains dashboards. Only files in the directory that have the `.json` extension are processed.\n- You can specify the path to a single JSON file. The filename must have the `.json` extension.\n### Converted dashboards and other information\nWhen the importer runs the first time, it creates a `reports` subdirectory. Every time you run the importer, you get a new output directory under the `reports` directory, named by the date and time. The name of the output directory has the following structure: `reports/` `` `/` ``\nFor each invocation of the importer, the output directory contains the following:\n- A file or files with the same names as the original Grafana dashboards, but now in Cloud Monitoring JSON format.\n- A`report.json`file, which records the following information for each converted dashboard:- The name and location of the Grafana dashboard file that was converted.\n- The name and location of the converted Monitoring dashboard file.\n- Notices about any features in the Grafana dashboard that have no corresponding feature in Cloud Monitoring and therefore couldn't be included in the converted dashboard.\n- Any errors that occurred in the conversion.If you have uploaded the dashboards, the report directory also includes an `upload_` `` `.txt` file, which includes the URL to which the dashboard was uploaded.\n## Import Grafana dashboards\nTo convert Grafana dashboards and upload them to Cloud Monitoring, use the `import.sh` script:\n```\n./import.sh PATH_TO_DIRECTORY_OR_FILE PROJECT_ID\n```\nThis script does the following:\n- Converts dashboards in``from the JSON format used by Grafana into the JSON format used by Cloud Monitoring.\n- Uploads the converted dashboards into your Google Cloud project by using the Google Cloud CLI.If you have not authenticated to the gcloud CLI, then run the [gcloud auth login](/sdk/gcloud/reference/auth/login) command before running the `import.sh` script.\nYou can import all the Grafana dashboards in a directory, or you can specify a single dashboard in the directory to import.\n- To import all the dashboards in the `` directory into the Google Cloud project, specify the directory, relative to the importer directory, and the destination project ID when invoking the script:```\n./import.sh GRAFANA_DASHBOARDS_DIR PROJECT_ID\n```\n- To convert only the `` `.json` dashboard in the `` directory, include the dashboard filename, relative to the importer directory, when invoking the script:```\n./import.sh GRAFANA_DASHBOARDS_DIR/MY_GRAFANA_DASHBOARD.json PROJECT_ID\n```\nThe dashboard importer includes a sample Grafana dashboard as `examples/k8s_cluster_example.json` . The following command imports that dashboard into the specified project:\n```\n./import.sh examples/k8s_cluster_example.json PROJECT_ID\n```\nWhen invoked with the `my-project-test-1` , the output resembles the following:\n```\nConverting: Kubernetes Cluster Overview\n✓ Kubernetes Cluster Overview converted successfully\nConversion of examples/k8s_cluster_example.json complete. Conversion Report located at: reports/2023-9-28/22:14:57/report.json\nTo upload these dashboard(s) manually, you can run:\n./upload.sh reports/2023-9-28/22:14:57/ <PROJECT_ID>\nConversion Complete. Proceeding to uploading...\nNow running: ./upload.sh reports/2023-9-28/22:14:57/ my-project-test-1\nUploading 1 dashboard(s) from a directory with the following args:\nDirectory: reports/2023-9-28/22:14:57/\nProject: my-project-test-1\nThe following are your dashboards:\n- k8s_cluster_example.json\n```\nAfter the `import.sh` script has created the output directory and converted the dashboards, but before it uploads the converted dashboards to your project, it prompts you for confirmation. Enter `y` , and the script uploads the dashboard and prints the URL for the new dashboard:\n```\nWould you like to continue? (y/n) y\n✓ k8s_cluster_example.json successfully uploaded:\nhttps://console.cloud.google.com/monitoring/dashboards/builder/9c341ef8-cfef-4bdd-98d5-821571c520ef?project=my-project-test-1\nUpload log created in reports/2023-9-28/22:14:57/upload_22:14:57.txt\nNeed to troubleshoot? Please visit:\nhttps://github.com/GoogleCloudPlatform/monitoring-dashboard-samples/tree/master/scripts/dashboard-importer/README.md#troubleshooting\n```\n## Convert Grafana dashboards without uploading\nIf you want to inspect or edit the converted dashboards before uploading them, then omit the value when invoking the `import.sh` script:\n```\n./import.sh PATH_TO_DIRECTORY_OR_FILE\n```\nThe importer converts the dashboards as described in [Import Grafana dashboards](#grafanadb-convert-import) but does not upload the converted dashboards to Cloud Monitoring.\nYou can run the upload step later, by using the `upload.sh` script manually.\n## Upload dashboards manually\nTo manually upload dashboards in Cloud Monitoring JSON format, use the `upload.sh` script.\n```\n ./upload.sh PATH_TO_DIRECTORY_OR_FILE PROJECT_ID\n```\nThe `upload.sh` script uses the Google Cloud CLI to upload the JSON files. If you have not authenticated to the gcloud CLI, then run the [gcloud auth login](/sdk/gcloud/reference/auth/login) command before running the `upload.sh` script.\n- To upload all the dashboards in a `reports/` `` `/` `` directory, specify the directory, relative to the importer directory, and the destination project ID when invoking the script:```\n./upload.sh reports/YYYY-M-D/HH:MM:SS PROJECT_ID\n```When uploading all dashboards from a directory, the script prompts you to continue or exit before uploading the dashboards.\n- To upload a specific dashboard in a `reports/` `` `/` `` directory, specify the directory and filename, relative to the importer directory, and the destination project ID when invoking the script:```\n./upload.sh reports/YYYY-M-D/HH:MM:SS/MY_MONITORING_DASHBOARD.json PROJECT_ID\n```When uploading a single dashboard from a directory, the script runs without prompting you before uploading the dashboards.\nFor example, the following command uploads a dashboard stored in a `reports` subdirectory to the Google Cloud project `my-project-test-1` :\n```\n./upload.sh reports/2023-9-26/22:48:31/k8s_cluster_example.json my-project-test-1\nUploading json file: k8s_cluster_example.json to project: my-project-test-1...\n✓ k8s_cluster_example.json successfully uploaded:\nhttps://console.cloud.google.com/monitoring/dashboards/builder/25956d9a-93e2-410c-ada1-ec6872cb6665?project=my-project-test-1\n```\n## Troubleshooting\nWe occasionally publish small updates and bug fixes to the tool. Before attempting further troubleshooting, first try fixing the issue by using `git pull` to pull down the latest version of the repository and then importing again.\nFor information about problems with the converted dashboards, such as charts not showing data, see the importer's [README](https://github.com/GoogleCloudPlatform/monitoring-dashboard-samples/tree/master/scripts/dashboard-importer/README.md#troubleshooting) file.\n## What's next\n- [Create and manage custom dashboards](/monitoring/charts/dashboards) \n- [View the source code and READMEfile](https://github.com/GoogleCloudPlatform/monitoring-dashboard-samples/tree/master/scripts/dashboard-importer) for the dashboard importer\n- [Migrate alerting rules and receivers from Prometheus](/monitoring/promql/promql-migrate) \n- [View and manage metric usage](/monitoring/docs/metrics-management)", "guide": "Google Cloud Observability"}