{"title": "Google Cloud Observability - Using Google Cloud platform and service metrics", "url": "https://cloud.google.com/stackdriver/docs/solutions/slo-monitoring/sli-metrics/platform-svc-metrics", "abstract": "# Google Cloud Observability - Using Google Cloud platform and service metrics\nApplications hosted in Google Cloud that take advantage of services beyond core infrastructure benefit from the observability capabilities built into these services, such as automatic integration with Cloud Monitoring and Cloud Logging.\nThis section reviews some of the services available in Google Cloud to host request-response and data-processing applications and describes how to use the Monitoring metrics exposed by them as SLIs. It then provides implementation examples and additional resources.\nGoogle Cloud services are grouped into the following types:\n- Request-response services, in which customers explicitly ask a service to do some work and wait for the work to be successfully completed. These services include the following:- Cloud Endpoints\n- Cloud Run\n- Cloud Functions\n- App Engine\n- Google Kubernetes Engine, including Istio on Google Kubernetes Engine\nFor information on implementing SLIs for these services, see [Request-response services](/stackdriver/docs/solutions/slo-monitoring/sli-metrics/req-resp-metrics) .\n- Data storage and retrieval services, which store or provide data as the response to a request. These services include the following:- Cloud Storage\n- Bigtable\n- Spanner\n- Datastore\nFor information on implementing SLIs for these services, see [Data storage and retrieval services](/stackdriver/docs/solutions/slo-monitoring/sli-metrics/data-storage-metrics) .\n- Data-processing services, which process data provided by customers and return the result of that processing, either as the result of a request or as a continual feed. These services include the following:- Dataflow\n- Dataproc\nFor information on implementing SLIs for these services, see [Data-processing services](/stackdriver/docs/solutions/slo-monitoring/sli-metrics/data-proc-metrics) ", "content": ".", "guide": "Google Cloud Observability"}