{"title": "Google Cloud Observability - Viewing your microservices", "url": "https://cloud.google.com/stackdriver/docs/solutions/slo-monitoring/ui/svc-overview", "abstract": "# Google Cloud Observability - Viewing your microservices\nCloud Monitoring provides a dashboard that summarizes all your services, the **Services Overview** dashboard. The **Services Overview** dashboard is also the entry point for other service-monitoring tasks.\nThis page describes the summary information on the **ServicesOverview** dashboard of the Google Cloud console. From this dashboard, you can do the following:\n- See the status of your services, and drill down into any one for additional details.\n- Modify the configuration of services:- For services on Anthos Service Mesh, Istio on Google Kubernetes Engine, and App Engine, you can define service-level objectives (SLOs) using standard availability and latency metrics.\n- For custom services, you can do the following:- Create new custom services.\n- Identify metrics to act as service-level indicators (SLIs).\n- Define SLOs based on those SLIs.\n- Set up alerting policies to notify you when performance does not meet the SLOs.\nFor information on configuration tasks, see the following:- [Defining a custom service](/stackdriver/docs/solutions/slo-monitoring/ui/define-svc) .\n- [Creating an SLO](/stackdriver/docs/solutions/slo-monitoring/ui/create-slo) .\n- [Creating an SLO-based alerting policy](/stackdriver/docs/solutions/slo-monitoring/ui/create-alert) .You can also use the Monitoring API to manage services programmatically. For more information, see [Using the API](/stackdriver/docs/solutions/slo-monitoring/api/api-structures) .\n", "content": "## Before you begin\nTo understand service monitoring, you need to be familiar with concepts like service-level indicators (SLIs), SLOs, error budgets, and SLO-based alerting policies. These concepts are described on other pages, for example:\n- For an introduction to SLIs, SLOs and error budgets, see [Concepts inservice monitoring](/stackdriver/docs/solutions/slo-monitoring) .\n- For an introduction to SLO-based alerting policies, see [Alerting on your burn rate](/stackdriver/docs/solutions/slo-monitoring/alerting-on-budget-burn-rate) .## Services Overview dashboard\nThe **Services Overview** dashboard provides a summary view of all the services in your project, including basic information about the health of those services.\nIn the navigation panel of the Google Cloud console, select **Monitoring** , and then select **SLOs** :\n[Go to SLOs](https://console.cloud.google.com/monitoring/services)\nIf you have not yet created any services, then the **Services Overview** provides a welcome message and an empty list of services:\nAfter you have created services, the **Services Overview** page includes the following information:\n- A **Current status** summary that displays an overview of the status of of your services. This region is described in [Summary of services](/stackdriver/docs/solutions/slo-monitoring/ui/svc-overview#svc-summary) .\n- An inventory table, **Services** , that displays information about each service. By default, the table shows all services, but you can filter the table so that it shows particular groups of services. The information in this table is described in [Inventory table](/stackdriver/docs/solutions/slo-monitoring/ui/svc-overview#svc-inventory) .\n- A **Supported Services** list that classifies your defined services into categories. You can use this list to limit what is displayed in the the **Services** table. When you select a service type in the list, the table shows only the services of that type.\n### Summary of services\nThe summary card displays the number of services and provides information about their health and configuration:\nThe information displayed on the summary card includes the following:\n- The number of services found.\n- A timestamp indicating when the summary information was collected.\n- The number of services with SLO alerts firing.\n- The number of services out of SLO budget.\n- Services with additional configuration options available.\nIf there are services with firing SLO alerts or exhausted error budgets, the summary card displays a count and provides a **Show services** option for those services. Clicking **Show services** filters the inventory table so that it shows only the affected services.\nIf there are services without defined SLOs or alerting policies, the summary card describes them and provides a **Show Services** option. Clicking **Show Services** filters the inventory table so that it shows only those services. The summary card then provides a **Learn more** option that describes SLOs or alerting policies.\nIf you have GKE entities with no associated custom services, the summary card provides a **Define Service** option. For more information, see [Defining a microservice](/stackdriver/docs/solutions/slo-monitoring/ui/define-svc) .\n### Inventory table\nThe **Services Overview** inventory table includes a row for each service, as shown in the following screenshot:\nThe inventory table provides the following information for each service listed in the table:\n- **Name** : The display name of the service.Clicking on the name of a service brings up a dashboard for that service. For more information, see [Using microservice dashboards](/stackdriver/docs/solutions/slo-monitoring/ui/svc-dashboard) .\n- **Type** : One of the following values:- `Istio`: an automatically detected Istio on Google Kubernetes Engine or Anthos Service Mesh service.\n- `App Engine`: an automatically detected App Engine service.\n- `Custom`: a GKE service.\n- **SLOs out of error budget** : The ratio of out-of-budget SLOs to the total SLO count. Services with out-of-budget SLOs are also badged to make them stand out in the table.\n- **SLOs with firing alert** : The ratio of alerting policies that are firing to the total count of alerting policies. Services with firing policies are also badged to make them stand out in the table.\n- **Labels** : Information about the service. The types of information displayed varies with the type of service.\n- **More options** : Lists changes you can make to the service. The choices depend on the service type:- **Edit display name** : available for all service types.\n- **Delete service** : available only for custom services.By default, the inventory table includes all the services in your project, but you can filter the table to reduce the number of entries. You can filter the table from options on the summary card as described in [Summary ofservices](/stackdriver/docs/solutions/slo-monitoring/ui/svc-overview#svc-summary) , or you can filter the table directly.\n### Filtering the inventory table\nYou can filter the inventory table in the following ways:\n- By clicking one of the service-type entries in the **Supported Services** list.\n- By clicking one of the **Show services** options in the summary card, as described in [Summary of services](/stackdriver/docs/solutions/slo-monitoring/ui/svc-overview#svc-summary) .\n- By manually adding filters to the inventory table.\nTo manually add a filter to the inventory table, do the following:\n- Click **Filter** . A list of filter options is displayed:- **Name** : filter by SLO name.\n- **Type** : filter by SLO type.\n- **Labels** : filter by value of service labels.\n- **SLO count** : filter by number of SLOs configured.\n- **SLO alerts policies count** : filter by number of SLO-based alerting policies configured.\n- Choose one of the options off the filter list. The chosen option appears in the filter bar.How you complete the filter varies with the option you select:- If you select **Type** , you then get a list of the available service types. Select a type from the list.\n- If you select **Name** or **Labels** , then click next to the text in the filter bar and start typing. Values that match are provided on a list. Select a value from the list.\n- If you select **SLO count** or **SLO alert policies count** , you then get a list of comparison operators to choose from.- Select an operator.\n- Click next to the operator and enter a comparison value.The completed filter is replaced by a filter chip. For example, the following chip filters for services that have 2 or fewer SLO-based alerting policies configured: \nYou can add multiple filters by repeating this process. After you add one filter, the filter-options menu also includes an `OR` option for evaluating the filters. By default, services must meet a logical `AND` of all the filters to appear on the table.\nTo remove a filter, click the on the filter chip.\n## What's next?\nFor information on service-configuration tasks, see the following:\n- [Defining a custom service](/stackdriver/docs/solutions/slo-monitoring/ui/define-svc) .\n- [Creating an SLO](/stackdriver/docs/solutions/slo-monitoring/ui/create-slo) .\n- [Creating an SLO-based alerting policy](/stackdriver/docs/solutions/slo-monitoring/ui/create-alert) .\nFor information on per-service dashboards, see [Using microservice dashboards](/stackdriver/docs/solutions/slo-monitoring/ui/svc-dashboard) .", "guide": "Google Cloud Observability"}