{"title": "Recommender - Insights", "url": "https://cloud.google.com/recommender/docs/insights/using-insights", "abstract": "# Recommender - Insights\n# Insights\nRecommender uses machine learning to provide detailed and high quality . Insights are findings that you can use to proactively focus on important patterns in resource usage. You can use insights independently from recommendations. Some insights link to [recommendations](/recommender/docs/key-concepts#recommendations) and provide evidence for the associated recommendations.\nThis page describes key concepts for interpreting and using insights.\n", "content": "## Insight types\nEach insight has a specific . Insight types are specific to a single Google Cloud product and resource type. A single product can have multiple insight types, where each provides a different type of insight for a different resource.\nEach insight type has a unique insight type ID that identifies the service internally. You use the insight type ID when interacting with insights using the Recommender [gcloud commands](/sdk/gcloud/reference/recommender) , or the [REST](/recommender/docs/reference/rest) or [RPC](/recommender/docs/reference/rpc) APIs.\nFor more information, see [Insight types](/recommender/docs/insights/insight-types) .\n## Insights\nAn is a machine-generated finding that may be linked to one or more recommendations. An insight has the following core attributes:\n- [Name](#name) \n- [Description](#description) \n- [Insight Subtype](#insight_subtype) \n- [Content](#content) \n- [Category](#category) \n- [Target Resources](#target_resources) \n- [State Info](#state_info) \n- [Etag](#etag) \n- [Severity](#severity) \n- [Last Refresh Time](#last_refresh_time) \n- [Observation Period](#observation_period) \n- [Recommendation reference](#recommendation_reference) \n### Name\nThe insight name is stored in the `name` field of the Insight entity. It has the following format:\n```\nprojects/TARGET_PROJECT_ID/locations/LOCATION/insightTypes/INSIGHT_TYPE_ID/insights/INSIGHT_ID\n```\nwhere:\n- is the ID of the project where the insight was generated.\n- is the Google Cloud [location](/compute/docs/regions-zones) where resources associated with the insight are located (for example,`global`or`us-central1-a`)\n- is the fully-qualified insight type ID (for example,`google.compute.firewall.Insight`)\n- is a unique ID for the insight\n### Description\nThis is human-readable summary of the insight. It is only available in English.\n### Insight Subtype\nEach insight type may support multiple subtypes. The content schema is stable for a given subtype.\n### Content\nStructured fields that include insight details. Content schema is determined by insight type and subtype. For example, `\"grantedPermissionsCount\": \"1000\"`\n### Category\nSimilar to [impacts](/recommender/docs/key-concepts#impact) for recommendations, there are categories for insights:\n- `COST`\n- `SECURITY`\n- `PERFORMANCE`\n### Target Resources\nFully qualified resource names of the Google Cloud resources the insight is targeting.\n### State Info\nInsights go through multiple state transitions after they are proposed:\n- `ACTIVE`, which means that the insight has been generated, but no actions have been taken in response. Content for active insights is updated when the underlying data changes. Active insights can be marked`DISMISSED`OR`ACCEPTED`.\n- `ACCEPTED`, which means that some action has been taken based on the insight. Insights become accepted when an associated recommendation has been marked`CLAIMED`,`SUCCEEDED`, or`FAILED`. Insights can also be accepted directly. Content for accepted insights is immutable. Accepted insights are retained for 90 days from the time of the state change.\n- `DISMISSED`, which means that the insight has been dismissed without taking any action based on it. Content for dismissed insights is updated when the underlying data changes.When directly marking an insight ACCEPTED, you can include additional metadata about the operation with state metadata. The metadata is specified as `key:value` pairs. Updates to the state metadata field overwrite any existing state metadata.\n### Etag\nAn is a unique fingerprint that identifies the current state of an insight. Each time the insight changes, a new etag value is assigned. In order to change insight state, you must provide the etag of the existing insight. This makes sure that any operations are performed only if the insight has not changed since you last retrieved it.\n### Severity\nA [severity](/recommender/docs/reference/rest/v1/billingAccounts.locations.insightTypes.insights#severity) for an insight indicates the likelihood of one of the following [impacts](/recommender/docs/key-concepts#impact) :\n- An outage (for a performance impact)\n- A compromise (for a security impact)\n- An overspend (for a cost impact)\n- A mismanagement (for a manageability impact)\nThis field comes with values `CRITICAL` , `HIGH` , `MEDIUM` , and `LOW` with `LOW` set as the default severity. Each [insight type](/recommender/docs/insights/insight-types) can have its own severity strategy defined.\n### Last Refresh Time\nThe last refresh time indicates the freshness of the data used to generate the insight.\n### Observation Period\nObservation period is the time period leading up to the insight. The source data used to generate the insight ends at `last_refresh_time` and begins at `last_refresh_time` minus `observation_period` .\n### Recommendation reference\nReference to an associated [recommendation](/recommender/docs/key-concepts#recommendations) . References link insights with their associated recommendations. This field is empty when there are no recommendations derived from the insight.", "guide": "Recommender"}