{"title": "Recommender - Apply, dismiss, or restore recommendations", "url": "https://cloud.google.com/recommender/docs/recommendation-hub/apply-dismiss-restore-recommendations", "abstract": "# Recommender - Apply, dismiss, or restore recommendations\n# Apply, dismiss, or restore recommendations\n**    Preview    — Recommendation Hub ** This feature is subject to the \"Pre-GA Offerings Terms\" in the General Service Terms section   of the [Service Specific Terms](/terms/service-terms#1) .     Pre-GA features are available \"as is\" and might have limited support.    For more information, see the [launch stage descriptions](/products#product-launch-stages) .\nYou can apply, dismiss or restore a recommendation from the Recommendation Hub.\n", "content": "## Before you begin\nEnsure that you have the [necessary roles and permissions](/recommender/docs/recommendation-hub/find-recommnedation-hub#before_you_begin) to view recommendations.\n## Apply recommendations\n**Warning:** Before applying recommendations in the Google Cloud console or using the API, ensure that impacts are assessed by a reviewer. The reviewer should have the knowledge to assess impacts identified in recommendations, as well as impacts specific to your infrastructure and business. Applying recommendations without proper assessment could result in unexpected changes, such as issues with system performance, poor reliability, or loss of required permissions. If you choose to apply recommendations without human review, ensure that you have set up a rollback process before making any changes.\nDepending on the Google Cloud service, you can apply some recommendations from Recommendation Hub. For recommendations that are supported, the **Apply** button is shown in the recommendation details panel:\nSome recommendations might be applied instantly, while others may take more time to complete. Note that some recommendations might not be directly applicable in the details panel. Follow the instructions listed in the details panel to apply them.\n## Dismiss a recommendation\nDismissing a recommendation prevents it from being shown in the [Recommendation Hub](/recommender/docs/recommendation-hub/getting-started) dashboard and list views for the current project. Additionally, to protect the underlying resources, after you dismiss a recommendation, it cannot be applied from Recommendation Hub or the [Recommender API](/recommender/docs/using-api) .\nTo dismiss a recommendation, select the recommendation and click **Dismiss** :\n## Restore a recommendation\nRestoring a recommendation that you dismissed marks the recommendation as active. Active recommendations will show in the Recommendation Hub dashboard and category page.\nPerform the following steps to restore a recommendation:\n- Go to the **Applied and dismissed** page. This recommendations table displays all applied and dismissed recommendations from the last 90 days.- To see only applied recommendations, use the table to filter for \"applied\" recommendations.\n- To see only dismissed recommendations, use the table to filter for \"dismissed\" recommendations.\n- Next to the recommendation you want to restore, click **RESTORE** .\n- Verify the information on the confirmation screen. If you are sure it is the recommendation and resource type you want to restore, click **RESTORE** .\nFor information about changing the state of recommendations, refer to the documentation for the appropriate [recommender](/recommender/docs/recommenders) , or for the appropriate [insight type](/recommender/docs/insights/insight-types) .\n## What's next\n- [Share recommendations](/recommender/docs/recommendation-hub/share-recommendations) \n- [Export recommendations to BigQuery](/recommender/docs/bq-export/export-recommendations-to-bq)", "guide": "Recommender"}