{"title": "Recommender - What is Active Assist", "url": "https://cloud.google.com/recommender/docs/whatis-activeassist", "abstract": "# Recommender - What is Active Assist\n# What is Active Assist\nActive Assist refers to the portfolio of tools used in Google Cloud to generate recommendations and insights to help you optimize your Google Cloud projects. This includes recommenders that generate recommendations and insights and analysis tools.\n", "content": "## Recommenders and Recommendations\nRecommenders generate recommendations that fall into six value categories that can help you optimize your cloud in a variety of ways.\nSee [Recommendations](/recommender/docs/key-concepts#recommendations) and [Recommenders](/recommender/docs/overview) for a detailed explanation of these concepts.\n## Granting permissions to view and update recommendations and insights\nEach [recommender](/recommender/docs/recommenders) and [insight type](/insights/insight-types) has specific roles and permissions to control access to its recommendations and insights. In order to enable users to review and assess these recommendations and insights, they will include some metadata about resources. Granting these permissions provides users with a partial view of the resource's metadata. This partial view of data is particularly important to consider if you are using custom roles to grant permissions.\nFor example, the Identity and Access Management recommender provides recommendations about permissions. Members that have the `recommender.iamPolicyRecommendations.get` and `recommender.iamPolicyRecommendations.list` permissions can also see information about your IAM policy bindings.\nEnsure that you have the [necessary roles and permissions](/recommender/docs/recommendation-hub/find-recommnedation-hub#before_you_begin) to view recommendations.\n## Manage recommendations and insights\nYou can find your recommendations and insights in Recommendation Hub.\nYou can choose to apply or dismiss the recommendations. Some recommendations can be applied automatically, while other recommendations require additional steps to complete. Any additional steps will appear in the details panel.\n## Finding your recommendations\nYou can find your recommendations using the Google Cloud console or using the command line interface.\n[View your recommendations](https://console.cloud.google.com/home/recommendations)\nYou can also find recommendations in context on select product pages.\nCertain recommendations such as the IAM Recommendation require different levels of permissions to view. For more information, see the guide for the specific Recommendation that you are looking for.\n## Applying recommendations\nBefore applying recommendations, ensure that they are reviewed by someone who can properly assess the impacts of changes.\nRecommender provides information on direct [impacts](/recommender/docs/key-concepts#impact) in areas such as cost, performance, or security. Recommendation reviewers should have a holistic understanding of your infrastructure and processes so that other business-specific impacts are considered.\n**Warning:** Before applying recommendations in the Google Cloud console or using the API, ensure that impacts are assessed by a reviewer. The reviewer should have the knowledge to assess impacts identified in recommendations, as well as impacts specific to your infrastructure and business. Applying recommendations without proper assessment could result in unexpected changes, such as issues with system performance, poor reliability, or loss of required permissions. If you choose to apply recommendations without human review, ensure that you have set up a rollback process before making any changes.\n## Get started with recommendations\nRecommendations are an easy way to optimize your cloud to help you maintain a secure and cost effective workspace. Use the [Recommendation Hub quickstart guide](/recommender/docs/quickstart-recommendation-hub) to get started with the Recommendation Hub.\nAlternatively, you can follow the [In Context quickstart guide](/recommender/docs/quickstart-incontext) to find recommendations directly in your service pages. Recommendations can also be reviewed and applied or dismissed using the [gCloud CL or REST API](/recommender/docs/using-api) .\n## Intelligence Centers and Tools\nActive Assist offers intelligent tools that helps you proactively monitor and manage your cloud. We offer tools such as the Network Intelligence Center and Policy Simulator to simplify and automate your management experience on Google Cloud. Read the following documentation pages for more information on how our products can help you optimize your cloud experience.\n- [Network Intelligence Centers](/network-intelligence-center/docs) \n- [Policy Simulator](/iam/docs/simulating-access) \n- [Policy Analyzer](/asset-inventory/docs/analyzing-iam-policy) \n- [Policy Troubleshooter](/iam/docs/troubleshooting-access) \n- [Firewall Insights](/network-intelligence-center/docs/firewall-insights/how-to/using-firewall-insights)", "guide": "Recommender"}