{"title": "Recommender - Find and apply recommendations with the Recommendation Hub", "url": "https://cloud.google.com/recommender/docs/quickstart-recommendation-hub", "abstract": "# Recommender - Find and apply recommendations with the Recommendation Hub\n# Find and apply recommendations with the Recommendation Hub\n**    Preview    — Recommendation Hub ** This feature is subject to the \"Pre-GA Offerings Terms\" in the General Service Terms section   of the [Service Specific Terms](/terms/service-terms#1) .     Pre-GA features are available \"as is\" and might have limited support.    For more information, see the [launch stage descriptions](/products#product-launch-stages) .\nThis page shows you how to use Recommendation Hub to find and apply [recommendations](/recommender/docs/key-concepts#recommendations) .\n", "content": "## Before you begin\nFor this quickstart, you need a Google Cloud project.\n- Go to the Google Cloud console.\n- Select a Google Cloud project, folder, or organization.You can only see recommendations at an organization or folder level if you have permissions for that organization or folder, regardless of your permissions for folders or projects within it.\n- Ensure you have sufficient Identity and Access Management (IAM) permissions to view the project's recommendations. If you don't have sufficient permission, you might not be able to view some recommendations, and the Recommendation Hub might appear empty. Grant or request the [Recommender Viewer Role](/iam/docs/understanding-roles#recommender.viewer) or see [recommenders](/recommender/docs/recommenders) for permissions for each recommendation.\n**Note:** If you are starting with a new project, you won't see any recommendations.\n## Find recommendations in Recommendation Hub\n- Navigate to Recommendation Hub. [Go to Recommendation Hub](https://console.cloud.google.com/home/recommendations) This page displays an overview of all recommendations by categorized by value pillar (Cost, Security, Performance, Reliability, Management, and Sustainability). **Note:** If you have sufficient permissions and your Recommendation Hub is still empty, you may have no active services that have Recommenders or your services may not have been in use long enough to generate recommendations.\n- Select the **All recommendations** tab.This page displays a table of every recommendation that you can filter, sort, and share. You can explore recommendations in detail, see what resources are affected, and what impact applying a recommendation might have. ## Apply and dismiss recommendations in Recommendation Hub\n- In the Recommendation column, click the recommendation you want to learn more about. A details panel opens that shows the observation that led to the recommendation, as well as relevant data that might help you decide whether to apply or dismiss it.\n- Apply or dismiss recommendations that you have permission to using the apply or dismiss buttons. Note that some recommendations might not be directly applicable in the details panel. Follow the instructions listed in the details panel to apply them.\n**Warning:** Before applying recommendations in the Google Cloud console or using the API, ensure that impacts are assessed by a reviewer. The reviewer should have the knowledge to assess impacts identified in recommendations, as well as impacts specific to your infrastructure and business. Applying recommendations without proper assessment could result in unexpected changes, such as issues with system performance, poor reliability, or loss of required permissions. If you choose to apply recommendations without human review, ensure that you have set up a rollback process before making any changes.\n### Restore dismissed recommendations\nThe [Applied and dismissed page](https://console.cloud.google.com/active-assist/applied-dismissed) contains a record of all of the recommendations you have applied or dismissed.\nYou can only restore a recommendation that has the status Dismissed. To restore a dismissed recommendation, click **RESTORE** in the restore column.\n## Other ways to apply recommendations\nYou can also [find and apply recommendations in service pages](/recommender/docs/quickstart-incontext) or [using the API](/recommender/docs/using-api) .\n## What's next\n- [Finding and applying recommendations in context](/recommender/docs/quickstart-incontext) \n- [Enabling the API](/recommender/docs/enabling) \n- [Using the API](/recommender/docs/using-api) \n- [Export recommendations to BigQuery](/recommender/docs/bq-export/export-recommendations-to-bq)", "guide": "Recommender"}