{"title": "Recommender - Quickstart: Find and apply recommendations in context", "url": "https://cloud.google.com/recommender/docs/quickstart-incontext", "abstract": "# Recommender - Quickstart: Find and apply recommendations in context\n# Quickstart: Find and apply recommendations in context\nLearn how to find and apply [recommendations](/recommender/docs/key-concepts#recommendations) in Google Cloud service pages.\n", "content": "## Before you begin\nFor this quickstart, you need a Google Cloud project with a virtual machine running on Compute Engine.\n- Go to the Google Cloud console.\n- Select your Google Cloud project. If you don't have a Google Cloud project, create a new project.\n- Ensure you have sufficient Identity and Access Management (IAM) permissions to view the project's recommendations. If you don have sufficient permission, you might not be able to view some recommendations in detail. Refer to the [IAM](/asset-inventory/docs/analyzing-iam-policy) guide for more information.\n**Note:** If you're starting with a new project, you may not see any recommendations. You might use the concepts taught in this quickstart for other recommendations in the future as well.\n## Finding VM resource recommendations in context\nIn this guide, we will use Compute Engine to find recommendations to reduce VM resource costs. Use the next section to find a full list of products with recommendations available in context.\n- Navigate to the VM Instances dashboard in Compute Engine. [Go to VM Instances](https://console.cloud.google.com/compute/instances) \n- Find the recommendation column under the Recommendation header in the table. \n**Note:** You might not have any recommendations in this table. If you don't see any recommendations available, check the [Active Assist](/recommender/docs/reference/recommenders) documentation to see what other products you might have recommendations for.\n## Applying Recommendations\nThis process might look different for some recommendations, which require you to visit product pages and make the changes there. However, the process is largely the same and can be applied to most recommendations.\n- Click the recommendation under the Recommendation header in the table to open the detail panel \n- Click on the name of a recommendation in the Recommendation column to view the detail panel. \n- Click apply.\n**Warning:** Before applying recommendations in the Google Cloud console or using the API, ensure that impacts are assessed by a reviewer. The reviewer should have the knowledge to assess impacts identified in recommendations, as well as impacts specific to your infrastructure and business. Applying recommendations without proper assessment could result in unexpected changes, such as issues with system performance, poor reliability, or loss of required permissions. If you choose to apply recommendations without human review, ensure that you have set up a rollback process before making any changes.\n## Recommendations that you can find in context\nNot every recommendation can be found in context. The following Google Cloud services have recommendations in context:\n- [Cloud SQL](/sql/docs/mysql/using-ood-recommender) \n- [Cloud Billing](/docs/cuds-recommender) \n- [Cloud Run](/run/docs/recommender) \n- [IAM](/iam/docs/recommender-overview) \n- [Virtual Machine Instances](/compute/docs/instances/viewing-and-applying-idle-vm-recommendations) \n- [Virtual Machine type](/compute/docs/instances/apply-machine-type-recommendations-for-instances) \n- [Virtual Machine Groups](/compute/docs/instance-groups/apply-machine-type-recommendations-managed-instance-groups) \n- [Instance Groups](/compute/docs/instance-groups/apply-machine-type-recommendations-managed-instance-groups) \n- [Google Maps Platform](/recommender/docs/gmp-project-management-recommender) ## Other ways to apply recommendations\nYou can also use the Recommendation Hub to find a centralized collection of recommendations available to you.\n- [Finding and applying recommendations in the Recommendation Hub](/recommender/docs/quickstart-recommendation-hub) \nYou can also batch process recommendations using the Google Cloud CLI or REST API. To learn more, refer to the following guide:\n- [Using the API - Recommendations](/recommender/docs/using-api) ## What's next\n- [Finding and applying recommendations in the Recommendation Hub](/recommender/docs/quickstart-recommendation-hub) \n- [Enabling the API](/recommender/docs/enabling) \n- [Using the API](/recommender/docs/using-api) \n- [Export recommendations to BigQuery](/recommender/docs/bq-export/export-recommendations-to-bq)", "guide": "Recommender"}