{"title": "Recommender - Understanding how cost savings are calculated in recommendations", "url": "https://cloud.google.com/recommender/docs/understand-cost-recs", "abstract": "# Recommender - Understanding how cost savings are calculated in recommendations\n# Understanding how cost savings are calculated in recommendations\n", "content": "## Overview\nActive Assist [cost optimization recommendations](/recommender/docs/recommenders) help Google Cloud users optimize their cloud deployment cost such as by identifying waste (idle resources), highlighting over-provisioned resources, and optimizing pricing models. In each of those cost optimization recommendations, you can typically find an estimated cost saving amount, if you were to decide and take the suggested action. This document provides information on how those cost saving estimates are calculated, based on the contract type you may have with Google Cloud and your specific role and permissions.\nIf your Cloud Billing Account is associated with a custom pricing contract and if you have the [required permissions to view costs and usage](/billing/docs/how-to/pricing-table#full-permissions) , the cost optimization recommendations that are visible to you will reflect your custom contract pricing (based on your historical costs) in the cost saving calculation. Without permissions to see costs and usage, the cost savings presented in those recommendations will be calculated by using the [list pricing](/pricing/list) .\nThis cost saving calculation methodology applies to all Active Assist recommendations surfaces, [Cloud Console](/cloud-console) , [BigQuery Export](/recommender/docs/bq-export/export-recommendations-to-bq) , and [Recommender](/recommender/docs/overview) .\n**Note:** The cost savings calculations in the recommendations, whether based on your historical costs or list pricing, are estimates based on past usage and don't take into consideration credits or any additional discounts. The cost saving estimates are intended to help customers compare and prioritize cost saving recommendations.\n## Fields in the UI, API, BigQuery Export\nBased on your permissions, you will see different values in the PricingType field.\n| 0  | 1                         |\n|:-------|:---------------------------------------------------------------------------------------------------|\n| List | Cost savings calculation is based on list pricing             |\n| Custom | Cost savings calculation is based on your custom contract pricing (based on your historical costs) |\n## Permissions required to see cost recommendations with custom contractual pricing\nTo view your cost recommendations reflecting custom contract pricing (based on your historical costs), you need a role that includes the following permissions, depending on the scope of the recommendation.\n- `` ` [billing.resourceCosts.get](/billing/docs/how-to/custom-roles#payment_information) ` to view costs and usage for a project. This is applicable to recommendations that are scoped at the project level - the vast majority of cost recommendations fall into this category. To gain this permission, ask your administrator to grant you the above permission for the projects you need.\n- `` ` [billing.accounts.getSpendingInformation](/billing/docs/how-to/custom-roles#payment_information) ` to view costs and usage for a billing account. This is applicable to recommendations that are scoped at the Billing Account level, for example [Committed use discount recommender](/docs/cuds-recommender) . To gain this permission, ask your administrator to grant you one of the following [Cloud Billing IAM](/billing/docs/how-to/billing-access) roles on your Cloud Billing account:- Billing Account Administrator\n- Billing Account Costs Manager\n- Billing Account Viewer\n## What's next\n- [Active Assist recommenders](/recommender/docs/recommenders) \n- [Cloud Billing access control & permissions](/billing/docs/how-to/billing-access) \n- [Create Custom Roles for Billing](/billing/docs/how-to/custom-roles)", "guide": "Recommender"}