{"title": "Recommender - Opt out of data processing", "url": "https://cloud.google.com/recommender/docs/opt-out", "abstract": "# Recommender - Opt out of data processing\n# Opt out of data processing\nGoogle Cloud collects data when customers use its services. This data does not include customer data. Google Cloud uses the data it collects to provide insights and recommendations in [Recommender](/recommender/docs) and specific reports in the Google Cloud console. These insights, recommendations, and reports help you use Google Cloud services more securely and efficiently.\nAt any time, you can stop the processing of this data for the purpose of providing these recommendations. You can also view any personal data used to generate these recommendations. To learn how to view personal data, refer to the [export data documentation](/recommender/docs/transparency-and-control-center/exporting-data) .\nBy default, Google Cloud processes data and generates insights and recommendations for all organizations and projects. To opt out of insights and recommendations for an organization or project, you must have one of the following Identity and Access Management (IAM) roles on the organization or project:\n- Owner (`roles/owner`)\n- Data Processing Controls Resource Admin (`roles/dataprocessing.admin`), or an equivalent custom IAM role\n**Note:** Starting or stopping recommendations can take up to 3 business days.\nTo opt out of insights and recommendations, or to prevent specific services from consuming logs, follow these steps:\n- In the Google Cloud console, go to the **Privacy & Security** page. [Go to the Privacy & Security page](https://console.cloud.google.com/iam-admin/privacy) \n- Click on the **Transparency & control** tab.\n- In the **Organization** or **Billing account** tabs, select all data processing groups you want to stop, then click the **Disable** button next to the table heading. The selected groups' data will no longer be processed for insights and recommendations", "content": ".", "guide": "Recommender"}