{"title": "Recommender - Data export in Transparency and Control Center", "url": "https://cloud.google.com/recommender/docs/transparency-and-control-center/exporting-data", "abstract": "# Recommender - Data export in Transparency and Control Center\n# Data export in Transparency and Control Center\n", "content": "## Overview\nTransparency and Control Center uses [BigQuery](/bigquery-transfer/docs/introduction) to export data for specific data processing groups at either the project or organization level. To export data for the remaining recommendations, refer to the [documentation for each recommender](/recommender/docs/recommenders) .\n## Required permissions\nTo manage data source exports, you must have the following Identity and Access Management (IAM) role on the project or organization:\n- Data Processing Controls Resource Admin (`roles/dataprocessing.admin`), or an equivalent custom IAM role\nAdditionally, you must have the following IAM role on the project you will be exporting to:\n- BigQuery Admin (`roles/bigquery.admin`)\n**Note:** For more information about roles, refer to [Understanding roles](/iam/docs/understanding-roles) and [Granting, changing, and revoking access](https://cloud.google.com/iam/docs/granting-changing-revoking-access) .\n## Export data from Transparency and Control Center\nTo export data from Transparency and Control Center, complete the following steps:\n- In the Google Cloud console, go to the **Privacy & Security** page. [Go to the Privacy & Security page](https://console.cloud.google.com/iam-admin/privacy) \n- Click **Transparency & control** .\n- In the **Data processing group** table, click a group's name to see its details page.\n- On the details page, find the data source you want to transfer and click **Create transfer** .\nIn the panel displayed, you can select a destination project, schedule a recurring transfer, and adjust notification options. When finished, your transfer settings are visible on the data processing group's details page.", "guide": "Recommender"}