{"title": "Recommender - Recommendation Hub dashboard overview", "url": "https://cloud.google.com/recommender/docs/recommendation-hub/dashboard-overview", "abstract": "# Recommender - Recommendation Hub dashboard overview\n# Recommendation Hub dashboard overview\n**    Preview    — Recommendation Hub ** This feature is subject to the \"Pre-GA Offerings Terms\" in the General Service Terms section   of the [Service Specific Terms](/terms/service-terms#1) .     Pre-GA features are available \"as is\" and might have limited support.    For more information, see the [launch stage descriptions](/products#product-launch-stages) .\nThe dashboard provides an overview of active recommendations and quick links to view recommendations by Value Pillar, such as Cost, Security, Performance, Reliability, Manageability, and Sustainability. This page explains the different areas of the Recommendation Hub dashboard.\n", "content": "## Before you begin\nEnsure that you have the [necessary roles and permissions](/recommender/docs/recommendation-hub/find-recommnedation-hub#before_you_begin) to view recommendations.\n## Purview\nThe Purview picker (or project selector) on the top navigation bar lets you know what organization, folder, or project you are working in. You can change the scope of the Recommendation Hub by using the Purview picker. For more information, see [Adjust the scope of your recommendations](/recommender/docs/recommendation-hub/adjust-scope) .\n## All recommendations\nThis table shows you the number of active recommendations in each category and a total of all the active recommendations in your selected scope. The number of recommendations depends on which permissions you have in your role and may differ from other people in your team. You can click any category name to go to its recommendation page.\n## Top ways to save money\nThis table shows you the top five recommendations by savings. The savings shown in this table represent the total savings of that recommendation type that is available to you in your selected scope. You can click the recommendation name to go to a table filtered for the recommendation type to see all the similar recommendations.\n## Intelligence Centers\nIn addition to the Recommendation Hub, Google Cloud provides other useful intelligence centers to help manage your cloud. You can find these in the Intelligence Centers card.\n## Learn\nThe Learn card provides helpful resources for working with recommendations. The product tour is a tutorial that shows you some helpful features in the Recommendation Hub while the documentation provides deep dives into common topics to help you better understand your recommendations.", "guide": "Recommender"}