{"title": "IAM - Help secure IAM with VPC Service Controls", "url": "https://cloud.google.com/iam/docs/secure-iam-vpc-sc", "abstract": "# IAM - Help secure IAM with VPC Service Controls\nWith VPC Service Controls, you can create , which are boundaries around your Google Cloud resources. You can then define security policies that help prevent access to supported services from outside of the perimeter. For more information about VPC Service Controls, see the [VPC Service Controlsoverview](/vpc-service-controls/docs/overview) .\nYou can use VPC Service Controls to help secure the following IAM-related APIs:\n- IAM API\n- Security Token Service API", "content": "## Help secure the IAM API\n**    Beta    — Using VPC Service Controls with IAM ** This feature is subject to the \"Pre-GA Offerings Terms\" in the General Service Terms section   of the [Service Specific Terms](/terms/service-terms#1) .     Pre-GA features are available \"as is\" and might have limited support.    For more information, see the [launch stage descriptions](/products#product-launch-stages) .\nYou can help secure your Identity and Access Management (IAM) resources by using VPC Service Controls. IAM resources include the following:\n- Custom roles\n- Service account keys\n- Service accounts\n- Workload identity pools\n### How VPC Service Controls works with IAM\nWhen you restrict IAM with a perimeter, only actions that use the IAM API are restricted. These actions include managing custom IAM roles, managing workload identity pools, and managing service accounts and keys. The perimeter restrict workforce pools actions because workforce pools are organization-level resources.\nThe perimeter around IAM restrict access management (that is, getting or setting IAM policies) for resources owned by other services, like Resource Manager projects, folders, and organizations or Compute Engine virtual machine instances. To restrict access management for these resources, create a perimeter that restricts the service that owns the resources. For a list of resources that accept IAM policies and the services that own them, see [Resource types that accept allowpolicies](/iam/docs/resource-types-with-policies) .\nAdditionally, the perimeter restrict actions that use other APIs, including the following:\n- IAM Policy Simulator API\n- IAM Policy Troubleshooter API\n- Security Token Service API\n- Service Account Credentials API (including the legacy`signBlob`and`signJwt`methods in the IAM API)\nFor more details about how VPC Service Controls works with IAM, see the [IAM entry in theVPC Service Controls supported products table](/vpc-service-controls/docs/supported-products#table_iam) .\n## Help secure the Security Token Service API\nYou can help secure token exchanges by using VPC Service Controls.\n**Note:** VPC Service Controls only restricts token exchanges if the [audience](/iam/docs/reference/sts/rest/v1/TopLevel/token#body.request_body.FIELDS.audience) in the request is a project-level resource. For example, it does not restrict requests for [downscoped tokens](/iam/docs/downscoping-short-lived-credentials) , because those requests have no audience.\nWhen you restrict the Security Token Service API with a perimeter, only the following entities can exchange tokens:\n- Resources within the same perimeter as the workload identity pool you're using to exchange the token\n- Principals with the attributes defined in the service perimeter\nFor more details about how VPC Service Controls works with IAM, see the [Security Token Service entry in theVPC Service Controls supported products table](/vpc-service-controls/docs/supported-products#table_sts) .\n## What's next\n- Learn how to [create a service perimeter](/vpc-service-controls/docs/create-service-perimeters) .", "guide": "IAM"}