{"title": "IAM - Delete workforce identity federation users and their data", "url": "https://cloud.google.com/iam/docs/workforce-delete-user-data", "abstract": "# IAM - Delete workforce identity federation users and their data\nThis guide shows you how to delete workforce users (also known as principals) and data that they exclusively own, collectively \"users and data\". To learn more about how Google Cloud deletes data, see [Data deletion on Google Cloud](/docs/security/deletion) .\n", "content": "## Delete workforce identity federation user data\n**Caution:** Deleting users also deletes all of their data on Google Cloud.\nTo delete workforce users and data, you must initiate a delete request with a user resource ID that is formatted as follows:\n```\nprincipal://iam.googleapis.com/locations/LOCATION/workforcePools/WORKFORCE_POOL_ID/subject/SUBJECT_ID\n```\nThe stages in the data-deletion pipeline are as follows:\n**Stage-1: Soft-deletion state:** After you initiate a delete request, the users and data are immediately marked for deletion and enter a 30-day soft- deletion state. In that state, the data can be deleted at anytime. After it is deleted, it cannot be accessed unless it is first recovered. You can recover data that is in this state.\n**Stage-2: Purged state:** Users and data that remain deleted longer than 30 days are in the purged state, meaning they are permanently deleted. After the data enters the purged state, the user identifier can be reused and assigned to another user. This is because the identifier is processed as a new entity in Identity and Access Management (IAM). From the time an initial deletion request is made, it can take up to two months, including the 30-day grace period, to completely purge data from all systems.\n### Required permissions\nThis section details the IAM roles or permissions required to perform delete and undelete operations.\nThe permissions are as follows:\n- `iam.googleapis.com/workforcePoolSubjects.delete`\n- `iam.googleapis.com/workforcePoolSubjects.undelete`\nThese permissions are included in the Workforce Pool Admin role ( `roles/iam.workforcePoolAdmin` ).\n### Delete users and data\nTo delete users and data, do the following:\nExecute the following command:\n```\ngcloud iam workforce-pools subjects delete \\    SUBJECT_ID \\    --workforce-pool=WORKFORCE_POOL_ID \\    --location=global\n```\nReplace the following:- ``: the user resource ID to delete.\n- ``: the workforce pool ID.\n### Undelete users and data\nDuring the soft-deletion or pre-purge deletion phase, you can undo a user deletion.\nTo undelete a user, do the following:\nTo undo a user deletion, execute the following command:\n```\ngcloud iam workforce-pools subjects undelete SUBJECT_ID \\    --workforce-pool=WORKFORCE_POOL_ID \\    --location=global\n```\nReplace the following:- ``: the user resource ID for which to undo a previous delete.\n- ``: the workforce pool ID.", "guide": "IAM"}