{"title": "IAM - Identities for users", "url": "https://cloud.google.com/iam/docs/user-identities", "abstract": "# IAM - Identities for users\nThis page describes the ways that you can configure identities for users in your organization so that they can access Google Cloud. It doesn't discuss the identities that your customers use to authenticate to your application. To learn about how to authenticate customers to your application, see the [Identity Platformdocumentation](/identity-platform/docs) , which discusses customer identity and access management (CIAM).\nFor users to access Google Cloud, they need an identity that Google Cloud can recognize. There are several ways to configure identities so that Google Cloud can recognize them:\n- Create [Cloud Identity or Google Workspace accounts](#google-accounts) \n- Set up one of the following federated identity strategies:- [Federation using Cloud Identity or Google Workspace](#synced-federation) \n- [Workforce identity federation](#workforce) \n", "content": "## Cloud Identity or Google Workspace accounts\nYou can use Cloud Identity or Google Workspace to create [managed user accounts](/architecture/identity/overview-google-authentication#managed_user_account) . These accounts are called because you control their lifecycle and configuration. Users with these accounts can authenticate to Google Cloud and be authorized to use Google Cloud resources.\nCloud Identity and Google Workspace share a common technical platform. Both products offer similar features for managing users, groups, and authentication.\nOnly Cloud Identity or Google Workspace managed Super Admin accounts can invite users with unmanaged [consumer accounts](/architecture/identity/overview-google-authentication#consumer_account) to transfer their consumer accounts to managed accounts.\nTo get started with Cloud Identity or Google Workspace, you can do the following:\n- To learn more about using Cloud Identity and Google Workspace to create identities for your users, see [Google for organizations](/architecture/identity/overview-google-authentication#google_for_organizations) .\n- Learn how to [set up Cloud Identity](https://support.google.com/cloudidentity/topic/7555414) .\n- Learn how to [set up Google Workspace](https://support.google.com/a/answer/6365252) .## Federated user identities\nYou can federate identities to allow users to use their existing identity and credentials to sign in to Google services. There are several methods to federate identities in Google Cloud.\n### Federation using Cloud Identity or Google Workspace\nWhen you federate identities with Cloud Identity or Google Workspace, users aren't prompted to enter a password when they try to access Google services. Instead, you can redirect them to an [externalidentity provider (IdP)](/architecture/identity/reference-architectures#using_an_external_idp) to authenticate.\nTo use this type of identity federation, a user must have an [externalidentity](/architecture/identity/overview-google-authentication#external_identities) in the external IdP and a corresponding Google Account in Cloud Identity or Google Workspace, typically with the same email address. You can keep these accounts synchronized by using a tool like [Google Cloud Directory Sync (GCDS)](https://tools.google.com/dlpage/dirsync/) or by provisioning accounts using an [external authoritativesource](/architecture/identity/overview-google-authentication#external_authoritative_source) . For example, you could set up account provisioning with [Azure AD](/architecture/identity/federating-gcp-with-azure-active-directory) or [Active Directory](/architecture/identity/federating-gcp-with-active-directory-introduction) .\nTo learn more about federation using Cloud Identity or Google Workspace, see [Single sign-on](/architecture/identity/single-sign-on) .\n### Workforce identity federation\nWorkforce identity federation lets you use an external identity provider (IdP) to authenticate and authorize a workforce—a group of , such as employees, partners, and contractors—using IAM, so that the users can access Google Cloud services. With workforce identity federation you don't need to synchronize user identities from your existing IdP to Google Cloud identities, as you would with Cloud Identity's [Google Cloud Directory Sync(GCDS)](https://tools.google.com/dlpage/dirsync/) . Workforce identity federation extends Google Cloud's identity capabilities to support syncless, attribute-based single sign-on.\nTo learn more about workforce identity federation, see [Workforce identityfederation overview](/iam/docs/workforce-identity-federation) .\n## What's next\n- Learn about the ways to [authenticate to Google APIs with usercredentials](/docs/authentication#user-accounts) .\n- Learn how to [grant users access to resources](/iam/docs/granting-changing-revoking-access) .", "guide": "IAM"}