{"title": "IAM - Grant an IAM role by using the Google Cloud console", "url": "https://cloud.google.com/iam/docs/grant-role-console", "abstract": "# IAM - Grant an IAM role by using the Google Cloud console\n# Grant an IAM role by using the Google Cloud console\nLearn how to use the Google Cloud console to grant IAM roles to principals at the project level.\n **Note:** If you're getting started with Google Cloud, you can grant the appropriate IAM roles to your organization administrator groups as part of the [Google Cloud setup process](/docs/enterprise/setup-checklist) .\nSee the following video for a quick walkthrough:\n [](https://www.youtube.com/watch?v=Sdt-i-Q7tyA) To follow step-by-step guidance for this task directly in the Google Cloud console, click **Guide me** :\n [Guide me](https://console.cloud.google.com/iam-admin/iam?walkthrough_id=iam--quickstart) ", "content": "## Before you begin\n### Create a Google Cloud projectFor this quickstart, you need a new Google Cloud project.\n **Warning:** If you use an existing project, then completing this quickstart will enable some users to access resources in that project.- In the Google Cloud console, go to the project selector page. [Go to project selector](https://console.cloud.google.com/projectselector2/home/dashboard) \n- To begin creating a   Google Cloud project, click **Create project** .\n- Name your project. Make a note of your generated project ID.\n- Edit the other fields as needed.\n- To create the project, click **Create** .\n### Ensure that you have the required roles\n- Make sure that you have the following role or roles on the project:      Project IAM Admin\n### Enable the APIsEnable the IAM and Resource Manager APIs.\n [Enable the APIs](https://console.cloud.google.com/flows/enableapi?apiid=iam.googleapis.com,cloudresourcemanager.googleapis.com&redirect=https://console.cloud.google.com) ## Grant an IAM roleGrant a principal the Logs Viewer role on the project.- In the Google Cloud console, go to the **IAM** page. [Go to IAM](https://console.cloud.google.com/iam-admin/iam?supportedpurview=project) \n- Select your new project.\n- Click person_add **Grant access** .\n- Enter an identifier for the principal. For example, `my-user@example.com` .\n- From the **Select a role** drop-down menu, search for **Logs Viewer** , then click **Logs Viewer** .\n- Click **Save** .\n- Verify that the principal and the corresponding role are listed in the IAM page.\nYou have successfully granted an IAM role to a principal.## Observe the effects of IAM rolesVerify that the principal you granted a role to can access the expected Google Cloud console pages by doing the following:- Send the following URL to the principal to whom you granted the role in the preceding step:```\nhttps://console.cloud.google.com/logs?project=PROJECT_ID\n```This URL takes the principal to the **Logs Explorer** page for your project.\n- Verify that the principal is able to access and view the URL.\nIf the principal tries to access a different Google Cloud console page that they don't have access to, they see an error message.\n [](None) ## Grant additional roles to the same principalGrant the principal the App Engine Viewer role in addition to their Logs Viewer role.- In the Google Cloud console, go to the **IAM** page. [Go to IAM](https://console.cloud.google.com/iam-admin/iam) \n- Locate the row that contains the principal to whom you want to grant another role, and click **Edit principal** edit in that row.\n- In the **Edit permissions** pane, click **Add another role** .\n- From the **Select a role** drop-down menu, search for **App Engine Viewer** , then click **App Engine Viewer** . Click **Save** .\n- Click **Save** .\nThe principal now has a second IAM role.\n [](None) ## Revoke IAM rolesRevoke the roles you granted to the principal in the preceding steps by doing the following:- Locate the row that contains the principal that you granted roles to and click **Edit principal** edit in that row.\n- In the **Edit permissions** pane, click the delete icon next to the Logs Viewer and App Engine Viewer roles.\n- Click **Save** .\nYou have now removed the principal from both of the roles. If they try to view the **Logs Explorer** page, they see the following error message:\n`You don't have permissions to view logs.`## Clean upTo avoid incurring charges to your Google Cloud account for   the resources used on this page, follow these steps.\nClean up by deleting the project that you created for this quickstart.- **Caution** : Deleting a project has the following effects:- **Everything in the project is deleted.** If you used an existing project for  the tasks in this document, when you delete it, you also delete any other work you've  done in the project.\n- **Custom project IDs are lost.** When you created this project, you might have created a custom project ID that you want to use in  the future. To preserve the URLs that use the project ID, such as an`appspot.com`URL, delete selected resources inside the project instead of deleting the whole project.\nIf you plan to explore multiple architectures, tutorials, or quickstarts, reusing projects  can help you avoid exceeding project quota limits.\n- In the Google Cloud console, go to the **Manage resources** page. [Go to Manage resources](https://console.cloud.google.com/iam-admin/projects) \n- In the project list, select the project that you  want to delete, and then click **Delete** .\n- In the dialog, type the project ID, and then click **Shut down** to delete the project.\n## What's next\n- [Learn the basics](/iam/docs/overview) of IAM.\n- Review the [list of all IAM roles](/iam/docs/understanding-roles) .\n- Find out how to [manage access with IAM](/iam/docs/granting-changing-revoking-access) .", "guide": "IAM"}