{"title": "IAM - Troubleshoot allow and deny policies", "url": "https://cloud.google.com/iam/docs/troubleshoot-policies", "abstract": "# IAM - Troubleshoot allow and deny policies\nThere are several methods you can use to troubleshoot Identity and Access Management (IAM) allow and deny policies.\n", "content": "## Use Policy Troubleshooter\nIf you need to troubleshoot access for a specific principal, use Policy Troubleshooter for IAM.\nTo learn how to use Policy Troubleshooter to troubleshoot IAM allow and deny policies, see [Troubleshootingaccess](/policy-intelligence/docs/troubleshoot-access) .\n## View all allow and deny policies that apply to a resource\nIn Google Cloud, the following IAM policies affect access to a resource:\n- The resource's allow policy\n- The resource's deny policies, if any\n- The allow policies of the resource's parent project, folder, and  organization, if any\n- The deny policies of the resource's parent project, folder, and organization,  if any\nThe allow and deny policies of parent projects, folders, and organizations affect access to a resource because of [policy inheritance](/iam/docs/policies#inheritance) . When you attach an allow or deny policy to a project, folder, or organization, that policy also applies for all resources inside that project, folder, or organization.\nFor example, if a deny policy for an organization says that a principal can't use a specific permission, then the principal can't use that permission for any resource within the organization. This rule applies even if the folders and projects within that organization have more permissive deny policies, or allow policies that give the principal the permission.\nSimilarly, if an allow policy for a project gives a principal a specific permission, then the principal has that permission for any resource within the project, provided that they aren't denied that permission.\nThe union of all of these policies is called the or .\nIn Google Cloud, you can get a list of all of the IAM policies that affect access to a project by using the `gcloud beta projects get-ancestors-iam-policy` command with the `--include-deny` flag. Together, these policies make up the applicable policy for the project. You can investigate each policy to see how it affects the principal's access.\nBefore using any of the command data below, make the following replacements:- ``: Your Google Cloud project ID. Project IDs are alphanumeric strings, like`my-project`.\nExecute the [gcloud beta projects get-ancestors-iam-policy](/sdk/gcloud/reference/beta/projects/get-ancestors-iam-policy) command:\nThe response contains the allow and deny policies for the project; any folders that are ancestors of the project; and the organization. The following example shows allow policies for the organization `1234567890123` and the project `my-project` , as well as a deny policy for the project `my-project` :\n```\n[ {\n \"id\": \"1234567890123\",\n \"policy\": {\n  \"bindings\": [  {\n   \"members\": [   \"group:cloud-admins@example.com\"\n   ],\n   \"role\": \"roles/iam.denyAdmin\"\n  },\n  {\n   \"members\": [   \"user:raha@example.com\"\n   ],\n   \"role\": \"roles/iam.serviceAccountAdmin\"\n  }\n  ],\n  \"etag\": \"BwXW6Eab7TI=\",\n  \"version\": 1\n },\n \"type\": \"organization\"\n },\n {\n \"id\": \"my-project\",\n \"policy\": {\n  \"bindings\": [  {\n   \"members\": [   \"group:cloud-admins@example.com\"\n   ],\n   \"role\": \"roles/owner\"\n  }\n  ],\n  \"etag\": \"BwXXjOM7L6M=\",\n  \"type\": \"project\"\n }\n },\n {\n \"id\": \"my-project\",\n \"policy\": {\n  \"createTime\": \"2022-02-14T21:46:35.865279Z\",\n  \"displayName\": \"My deny policy\",\n  \"etag\": \"MTgyMzg2ODcwNTEyMjMxMTM3Mjg=\",\n  \"kind\": \"DenyPolicy\",\n  \"name\": \"policies/cloudresourcemanager.googleapis.com%2Fprojects%2F123456789012/denypolicies/my-deny-policy\",\n  \"rules\": [  {\n   \"denyRule\": {\n   \"deniedPermissions\": [    \"iam.googleapis.com/serviceAccounts.create\"\n   ],\n   \"deniedPrincipals\": [    \"principal://goog/subject/raha@example.com\"\n   ]\n   },\n   \"description\": \"Prevent service account creation\"\n  }\n  ],\n  \"uid\": \"c83e3dc3-d8a6-6f51-4018-814e9f200b05\",\n  \"updateTime\": \"2022-02-14T21:46:35.865279Z\"\n },\n \"type\": \"project\"\n }\n]\n```\nIn this example, the user `raha@example.com` is granted the Service Account Admin role ( `roles/iam.serviceAccountAdmin` ) on the organization, but the project has a deny policy that prevents `raha@example.com` from using the permission `iam.googleapis.com/serviceAccounts.create` . As a result, if `raha@example.com` tries to create a service account in the project `my-project` , the request will be denied.\nIn some cases, you might only need to view the effective allow policy for a resource—for example, if your organization doesn't use deny policies. In these cases, you can use the following methods to view the effective allow policy:\n- View the resource's IAM allow policy in the Google Cloud console. The Google Cloud console automatically shows each resource's effective policy.To learn how to view a resource's IAM allow policy in the Google Cloud console, see [View current access](/iam/docs/granting-changing-revoking-access#view-access) .\n- Use the Cloud Asset API to get the resource's effective allow policy. To learn more, see [Viewing effective IAM policies](/asset-inventory/docs/view-effective-iam-policies) .## Search allow policies\nIf you need to locate a specific role binding in an allow policy, you can search the allow policy.\nCloud Asset Inventory lets you search allow policies for role bindings that match the specified parameters. You can use a variety of search parameters, including the following:\n- Resource type\n- Principal type\n- Role\n- Project\n- Folder\n- Organization\nFor more information, see [Searching IAM allow policies](/asset-inventory/docs/searching-iam-policies) .", "guide": "IAM"}