{"title": "IAM - Managed workload identities overview", "url": "https://cloud.google.com/iam/docs/managed-workload-identity", "abstract": "# IAM - Managed workload identities overview\n**Preview** This feature is subject to the \"Pre-GA Offerings Terms\" in the General Service Terms section of the [Service Specific Terms](/terms/service-terms#1) . Pre-GA features are available \"as is\" and might have limited support. For more information, see the [launch stage descriptions](/products#product-launch-stages) .For information about access to this release, see the [access request page](https://forms.gle/KC1Lq77gMn3kTtWDA) .\nManaged workload identities let you bind strongly attested identities to your Compute Engine workloads. Google Cloud provisions X.509 credentials issued from [Certificate Authority Service](/certificate-authority-service) that can be used to reliably authenticate your workload with other workloads over [mutual TLS (mTLS)](/beyondcorp-enterprise/docs/understand-mtls) authentication.\nTo achieve this interoperability, managed workload identities are based on [Secure Production Identity Framework For Everyone(SPIFFE)](https://spiffe.io/docs/latest/spiffe-about/spiffe-concepts/) , which defines a framework and set of standards for identifying and securing communications between workloads. In SPIFFE, a managed workload identity is represented using the format `spiffe://` `` `.global.` `` `.workload.id.goog/ns/` `` `/sa/` `` .\nAlthough managed workload identities can be used for authentication to other workloads, they cannot be used for authenticating to Google Cloud APIs.\n", "content": "## Resource hierarchy\nManaged workload identities are defined within a , which acts as a trust boundary for all identities within the pool. The workload identity pool forms the trust domain component of the managed workload identity's SPIFFE identifier. We recommend creating a new pool for each logical environment in your organization, such as development, staging, or production.\nWithin a workload identity pool, managed workload identities are organized into administrative boundaries called . Namespaces help you organize and grant access to related workload identities.\nYou must allow your workload to use a managed workload identity using an before the workload can be issued credentials for the managed workload identity. Workload attestation policies let you define which workload can be issued a credential for a managed workload identity based on the workload's verifiable attributes, such as project ID or resource name. A workload attestation policy ensures that only trusted workloads can use the managed identity.\nYou can authorize a workload to use a managed workload identity based on the service account that is [attached](/iam/docs/attach-service-accounts) to the workload.\n## What's next\n- [Configure managed workload identity authentication](/iam/docs/create-managed-workload-identities) .\n- Learn more about [using managed workload identities with Compute Engineworkloads](/compute/docs/access/authenticate-workloads-over-mtls) .", "guide": "IAM"}