{"title": "Cloud Shell - Deploy a Cloud Run app by using Cloud Shell", "url": "https://cloud.google.com/shell/docs/deploy-cloud-run-app", "abstract": "# Cloud Shell - Deploy a Cloud Run app by using Cloud Shell\n# Deploy a Cloud Run app by using Cloud Shell\nLearn how to set up and deploy a sample Hello World application to Cloud Run and view the status of your live service's resources.To follow step-by-step guidance for this task directly in the Cloud Shell Editor, click **Guide me** :\n [Guide me](https://ide.cloud.google.com/?walkthrough_tutorial_url=https%3A%2F%2Fwalkthroughs.googleusercontent.com%2Fcontent%2Fcloud_run_quickstart_index%2Fcloud_run_quickstart_index.md) ", "content": "## Before you begin\n## Create an application\n- [Launch the Cloud Shell Editor](https://ide.cloud.google.com) .\n- From the Cloud Code status bar, select **New Application** .\n- Choose **Cloud Run application** as your preferred application type.\n- From the list of sample applications (Node.js, Python with Flask and Django frameworks, Java, Go), choose a Hello World app.For example, choosing `Python (Flask): Hello World` creates a starter Python (Flask) Hello World app.\n- Select a folder as your application location and then click **Create New Application** .Cloud Shell Editor loads the application in a new workspace. After the workspace loads, your app is accessible in the explorer view.\n## Deploy to Cloud RunTo deploy your application to Cloud Run, follow these steps:- Open the command palette (press`Ctrl`/`Cmd`+`Shift`+`P`or click **View** > **Command Palette** ) and then run the **Deploy to Cloud Run** command. This brings up the Cloud Run Deploy UI.\n- If prompted, authorize Cloud Code to make Google Cloud API calls.\n- Set your Google Cloud project.\n- If prompted, enable the Cloud Run API by clicking **Enable APIs** .\n- In the Deploy to Cloud Run dialog, select a pre-existing service or create a new one.\n- If you're creating a new service, choose **Cloud Run (fully managed)** under Deployment Platform.\n- Choose a region to deploy to.\n- For Authentication, select **Allow unauthenticated invocations** to make this a public service.\n- After you define your preferred settings, you can click **Deploy** .Cloud Code builds your image, pushes it to the registry, and deploys your app to Cloud Run. Your service is now live!\n- View your running service by following the URL displayed in your Cloud Run: Deploy dialog.\n## Edit your serviceTo edit your application, follow these steps:- With the Explorer view, find the`app.py`file that implements the service behavior.\n- Change the message \"It's running!\" to a message of your choosing.\n- After you make this change, choose the **Deploy to Cloud Run** command using the Command Palette.\n- Check that the service you just created is selected in Service Settings.\n- Click **Deploy** .\n- After your application finishes building and deploying, you can refresh your service to see your updated message.\n## View logsYou can also view logs from your deployed application with the Log Viewer that comes with Cloud Code.\nTo view logs, follow these steps:- Click **Cloud\nCode** and then expand the **Cloud Run** section.\n- Right-click your Cloud Run service and then click **View logs** .\n- Refresh your app in the browser, and see the new logs generated by clicking the Logs refresh button.\n## Clean upTo avoid incurring charges to your Google Cloud account for   the resources used on this page, follow these steps.\nTo delete your project:- Go to the Projects page in the Google Cloud console: [Go to the Projects page](https://console.cloud.google.com/project) \n- Select the project you created for this quickstart and then click **Delete** .This shuts down the project and schedules it for deletion.\nIf you're using a pre-existing project and would like to delete resources you created for this quickstart:- **Container image:** While Cloud Run doesn't charge when a service isn't in use, you might still be [charged for storing the container image in Container Registry](/container-registry/pricing) . To delete your image, open the Container Registry page, expand the repository that contain s your image, select your image, click **Delete** , and then click **Delete** . [Open the Container Registry page](https://console.cloud.google.com/gcr) \n- **Cloud Run service:** To delete a Cloud Run service, from the Cloud Run page in the Google Cloud console, select the service you'd like to delete, click **Delete** , and then click **Delete** . [Open the Cloud Run page](https://console.cloud.google.com/run) \n## What's next\n- Discover the variety of features that the [Cloud Shell Editor interface](/shell/docs/editor-overview) has to offer.\n- Learn how to [configure Cloud Shell](/shell/docs/configuring-cloud-shell) to customize your experience.", "guide": "Cloud Shell"}