{"title": "Cloud Shell - Use accessibility features of Cloud Shell", "url": "https://cloud.google.com/shell/docs/using-cloud-shell-accessibility-features", "abstract": "# Cloud Shell - Use accessibility features of Cloud Shell\nThis page outlines Cloud Shell accessibility features.\nFor more information about Google Cloud accessibility resources, see [Google Cloud accessibility](/docs/accessibility) . For additional information about enabling screen reader features in the Google Cloud CLI, see [Enabling accessibility features](/sdk/docs/enabling-accessibility-features) .\n", "content": "## Keyboard navigation in Cloud Shell\nTo navigate and customize the Cloud Shell, use the following keyboard shortcuts:\n- If you use JAWS, pressto toggle the virtual cursor on and off.\n- To navigate to the next focusable element on the page, press.## Cloud Shell Terminal accessibility features\nTo navigate and customize the Cloud Shell Terminal, use the following features:\n- To scroll up when using the terminal, press.\n- To scroll down when using the terminal, press.\n- In the terminal, Cloud Shell captures Tab key presses. To switch to navigation with the Tab key, press. To capture Tab key presses again, pressin the terminal.\n- When using the terminal, Cloud Shell uses an input element to capture key presses. Screen readers normally announce the empty contents of this input when not navigating to individual terminal rows. To read the current terminal row to screen readers while using the terminal, press.## Customize color themes and font sizes in Cloud Shell\n- To change your Cloud Shell Editor theme, see [Customizing your Cloud Shell Editor themes](/shell/docs/themes) .\n- To change Cloud Shell Terminal settings, go to **Settings\n> Terminal Preferences** .- To change the font size in the terminal, select **Text Size** and choose between **Smallest** , **Small** , **Medium** , **Large** , and **Largest** .\n- To change the font in the terminal, select **Font** and choose the font that you prefer.\n- To change the terminal theme, select **Color Themes** and choose the theme that you prefer.\n## Recommended browsers and screen readers\nBased on your operating system, use the following screen readers with these recommended browsers:\n| Operating system | Screen reader | Browser      |\n|:-------------------|:----------------|:-------------------------------|\n| Microsoft Windows | NVDA or JAWS | Mozilla Firefox Chrome Browser |\n| macOS    | VoiceOver  | Chrome Browser     |\n| Chrome OS   | ChromeVox  | Chrome Browser     |\n| iOS    | VoiceOver  | N/A (mobile app)    |\n| Android   | TalkBack  | N/A (mobile app)    |", "guide": "Cloud Shell"}