{"title": "Cloud Shell - Quotas and limits", "url": "https://cloud.google.com/shell/docs/quotas-limits", "abstract": "# Cloud Shell - Quotas and limits\nThis document lists the and that apply to Cloud Shell.\nA quota restricts how much of a shared Google Cloud resource your Google Cloud project can use, including hardware, software, and network components. Therefore, quotas are a part of a system that does the following:\n- Monitors your use or consumption of Google Cloud products and services.\n- Restricts your consumption of those resources, for reasons that include ensuring fairness and reducing spikes in usage.\n- Maintains configurations that automatically enforce prescribed restrictions.\n- Provides a means to request or make changes to the quota.\nIn most cases, when a quota is exceeded, the system immediately blocks access to the relevant Google resource, and the task that you're trying to perform fails. In most cases, quotas apply to each Google Cloud project and are shared across all applications and IP addresses that use that Google Cloud project.\nThere are also on Cloud Shell resources. These limits are unrelated to the quota system. Limits cannot be changed unless otherwise stated.\nTo increase or decrease most quotas, use the Google Cloud console. For more information, see [Request a higher quota](/docs/quotas/view-manage#requesting_higher_quota) .\n", "content": "## Usage quotas\nThe default weekly Cloud Shell quota is 50 hours.\n### Viewing your weekly Cloud Shell quota\nIf you reach your quota, you'll need to wait until the date and time specified before you can use Cloud Shell again or check with your Cloud Shell administrator to increase your quota.\nTo view your weekly quota:\n- Click **Session information** and then click **Usage quota** . A dialog appears and displays the hours remaining in your quota, the total number of hours in your quota, and the date and time that the quota resets.\n### Request a quota increase\nCloud Shell quota increases must go through a customer support request and cannot be updated using the Google Cloud console. To request a quota increase, contact [Cloud Customer Care](/support) (not Billing).\nIf your quota increase request requires approval, you can expect to receive an email from Google Cloud acknowledging receipt of your request. You can respond to this email if you need further assistance. Cloud Customer Care processes your request, typically within 2-3 business days, and then sends you a second email notifying you whether the quota increase was approved or denied. The email provides the effective date of the increase, if applicable.\nFor more about the quota increase process, see [About quota increase requests](/docs/quota#about_increase_requests) .\n### Cloud Shell inactivity\n**Warning:** If you delete your `$HOME` directory, or if you don't access Cloud Shell for 120 days, Cloud Shell automatically deletes your `$HOME` directory and can't recover your files. You'll receive an email notification before this occurs.\nTo prevent your `$HOME` directory from being deleted due to inactivity for 120 days, start a session. For sensitive data you want to store long term, consider a different solution on [Cloud Storage](/products/storage) .\n### Non-interactive usage\nCloud Shell is intended for interactive use only. Non-interactive sessions are ended automatically after one hour. Cloud Shell sessions are capped at 12 hours, after which sessions automatically terminate. You can start a new session immediately after.\n### Restoring a session after a service limit violation\nIf your session is terminated or can't be established because you exceeded a service limit, Cloud Shell displays an error with a link to a form that allows you to appeal the limit violation. Click the feedback link and submit the form with more information about the tasks you were performing before your session was terminated.\n**Warning:** Violating the [Terms of Service](/terms) will result in Cloud Shell being disabled for your account.This constitutes activity that adversely impacts Google Cloud services, other customers' or their end users' use of services, or the Google network used to provide these services. Coin mining and network scanning using Cloud Shell are strictly prohibited.\n## Limitations and restrictions\n### Custom installed software packages and persistence\nThe virtual machine instance that backs your Cloud Shell session isn't permanently allocated to a Cloud Shell session and terminates if the session is inactive for 20 minutes. After the instance is terminated, any modifications that you made to it outside your `$HOME` are lost.\nTo have your configurations persist across sessions, consider [customizing your environment](/shell/docs/configuring-cloud-shell#environment_customization_script) .\n### Users younger than 18 or whose age is unknown\nCloud Shell isn't available to users younger than 18 or whose age is unknown. By default, Google Workspace for Education blocks access to Cloud Shell for all users. If your institution has students older than 18 who you want to have access to age-restricted services including Cloud Shell, see [Control access to Google services by age](https://support.google.com/a/answer/10651918#zippy=%2Cservices-not-available-to-users-under) for steps to identify users who are 18 years or older.\n### Cloud Shell Editor extensions\nCloud Shell Editor does not support the installation of custom editor extensions. However, the Cloud Shell Editor comes with a set of essential extensions already installed and kept up-to-date.\n### .bashrc content\nCloud Shell can produce errors if the `.bashrc` file is modified or deleted. The `.bashrc` file must contain the following lines:\n```\n if [ -f \"/google/devshell/bashrc.google\" ]; then\n source \"/google/devshell/bashrc.google\"\n fi\n```\n### gcloud output formatting\nBy default, Cloud Shell enables [gcloud accessibility features](/sdk/docs/enabling-accessibility-features) . With accessibility features enabled, `gcloud` table output is rendered as a flattened list of items.\nTo restore the default behavior of boxed tables for many commands, append the following command to the end of your `$HOME/.bashrc` file:\n```\n  gcloud config set accessibility/screen_reader false\n```\n### Slow connection performance\nConnecting to a Cloud Shell for the first time involves creating your home disk and can currently take up to 25 seconds. Subsequent connections to existing virtual machine instances take about five seconds. However, if you haven't used Cloud Shell for a week, connection performance will be slower since the home directory is restored from an archive.\nCloud Shell also offers [Ephemeral mode](/shell/docs/using-cloud-shell#choosing_ephemeral_mode) which is the Cloud Shell experience without persistent disk storage. Ephemeral mode offers faster connection performance but all the files you create in your session are lost on session end.\n### Browser support\nCloud Shell supports the latest versions of Google Chrome, Mozilla Firefox, Microsoft Edge, Microsoft Internet Explorer 11+, and Apple Safari 8+. Safari in private browser mode is not supported.\n### Private browsing and disabled third-party cookies\nThe Cloud Shell Editor can't load in Cloud Shell if third-party cookies are disabled. Some browsers have third-party cookies disabled by default and most browsers' Incognito or Private Browser modes block these cookies as well.\nWith third-party cookies disabled, you can still use the Cloud Shell Editor in its own window by clicking the **Open in New Window** button accessible when you open an editor session .\nAlternatively, you can navigate to port 970 using the Web Preview .\n**Tip:** If you're using Google Chrome, you can enable third-party cookies by clicking the Third-party cookie blocking icon in your address bar , selecting **Site not working?** , clicking **Allow cookies** , and reloading your page.\n### Disk storage\nCloud Shell provisions 5 GB of free [persistent disk storage](/compute/docs/disks/persistent-disks) mounted as your `$HOME` directory on the virtual machine instance. This storage is on a per-user basis and is available across projects. All files you store in your home directory, including installed software, scripts, and user configuration files like `.bashrc` and `.vimrc` , persist between sessions and count towards the 5 GB limit.\nIf you encounter a `no space left on device` error, free up space by removing files from your home directory using the Cloud Shell terminal. Use the `du -hs $(ls -A)` command to see the space each file uses within each sub-directory. Consider removing those that are no longer needed or take up a large chunk of storage.\n**Note:** If you don't access Cloud Shell regularly, the `$HOME` directory persistent storage may be recycled. You receive an email notification before this occurs. Starting a Cloud Shell session prevents the persistent storage from being recycled.\n## What's next\n- [Learn about the Cloud Shell VM](/shell/docs/how-cloud-shell-works) \n- [Start Cloud Shell](/shell/docs/using-cloud-shell)", "guide": "Cloud Shell"}