{"title": "Cloud Shell - Use Cloud Shell with the gcloud CLI", "url": "https://cloud.google.com/shell/docs/using-cloud-shell-with-gcloud-cli", "abstract": "# Cloud Shell - Use Cloud Shell with the gcloud CLI\nIf you have the [gcloud CLI installed](/sdk/install) , you can interact with Cloud Shell from your terminal and use it as a sandbox and a portable development environment. This provides the convenience of working with Cloud Shell resources, whether to quickly test an operation or use an IDE of your choice to edit a file saved on your Cloud Shell instance from your local desktop.\n", "content": "## Use gcloud cloud-shell\nThe current `gcloud cloud-shell` command group offering provides the following functionality:\n- Establishing an interactive SSH session with Cloud Shell using [gcloud cloud-shell ssh](/sdk/gcloud/reference/cloud-shell/ssh) .\n- Copy files between your local and Cloud Shell machine via [scp](/sdk/gcloud/reference/cloud-shell/scp) .\n- Mount your Cloud Shell directory to your local file system via [sshfs](/sdk/gcloud/reference/cloud-shell/get-mount-command) .\nFor more detail, see the reference documentation for [gcloud cloud-shell](/sdk/gcloud/reference/cloud-shell) .\n**Note:** To propagate your credentials to your Cloud Shell when starting it from the Google Cloud CLI, use the [--authorize-session](/sdk/gcloud/reference/cloud-shell/ssh#--authorize-session) flag when running the `gcloud cloud-shell ssh` command.\n## Example workflow\nTo illustrate the workings of `gcloud cloud-shell` , here is an example of how you can use these commands in practice:\n- Start a SSH session:```\ngcloud cloud-shell ssh\n```\n- Copy a file, `data.txt` , from Cloud Shell to your local machine:```\ngcloud cloud-shell scp cloudshell:~/data.txt localhost:~data.txt\n```\n- If you're using Mac or Linux, you can mount your Cloud Shell home directory onto your local file system after installing [sshfs](https://github.com/libfuse/sshfs) .This allows you to edit the files in your Cloud Shell home directory using your choice of local tools. All the data in your remotely mounted file system is stored on a [Persistent Disk](/persistent-disk) and stored across sessions.```\ngcloud cloud-shell get-mount-command ~/my-cloud-shell\n```", "guide": "Cloud Shell"}