{"title": "Cloud Shell - Launch Cloud Shell", "url": "https://cloud.google.com/shell/docs/launching-cloud-shell", "abstract": "# Cloud Shell - Launch Cloud Shell\nA Cloud Shell session can be launched in different ways to best fit your use case.\n", "content": "## Launch from the Google Cloud console\nTo launch a Cloud Shell session from the Google Cloud console, click **Activate Cloud Shell** in the [Google Cloud console](http://console.cloud.google.com) . This launches a session in the bottom pane of Google Cloud console.\nYou can also transfer this session to a full screen experience by clicking **Open in new window** .\n## Launch a standalone session\nIf you'd prefer a standalone session, you can launch a Cloud Shell session with [shell.cloud.google.com](https://shell.cloud.google.com) . The Cloud Shell terminal and Cloud Shell Editor are automatically started for you.\nTo open just the Cloud Shell Editor, you can use [ide.cloud.google.com](https://ide.cloud.google.com) . You can still access the Cloud Shell terminal at any time using the Open terminal button in the Cloud Shell menu bar.\n## Launch from documentation\nThis button launches the Cloud Shell as a panel at the bottom of your current page. You can then experiment with the product you're reading about while keeping the product's documentation in context.\nThe Cloud Shell terminal comes with the gcloud CLI, Docker, Terraform, and [other command-line utilities](/shell/docs/how-cloud-shell-works#tools) preinstalled and automatically authenticates you with your Google credentials, so you can use the terminal to run sample code in the documentation. This means that you can enable and experiment with Cloud APIs, start long-running operations, and manage your Google Cloud resources from the command line without leaving documentation.\n## Launch with an Open in Cloud Shell link\nIf you'd like your users to experiment with your project or code samples without having to download the gcloud CLI or installing dependencies, use the [Open in Cloud Shell](/shell/docs/open-in-cloud-shell) (OiCS) feature. This feature allows you to construct and publish a URL that automatically performs certain actions upon Cloud Shell launch, such as cloning a Git repository or opening a tutorial. This option has the added advantage of allowing you to customize the launched Cloud Shell experience by supporting the inclusion of URL parameters when crafting an OiCS link.\n## Launch and connect locally to Cloud Shell with the gcloud CLI\nIf you'd like to interact with and connect to your Cloud Shell environment using a local command-line, you'll need to [install the gcloud CLI](/sdk/install) . Using the gcloud CLI, specifically the [gcloud cloud-shell](/sdk/gcloud/reference/cloud-shell) command group, you can copy files between your local machine and Cloud Shell environment and establish an interactive SSH session with Cloud Shell.", "guide": "Cloud Shell"}