{"title": "Cloud Shell - Deploy an App Engine app by using Cloud Shell", "url": "https://cloud.google.com/shell/docs/deploy-app-engine-app", "abstract": "# Cloud Shell - Deploy an App Engine app by using Cloud Shell\n# Deploy an App Engine app by using Cloud Shell\nThis page outlines how to quickly deploy an App Engine app from a sample application using Cloud Shell.", "content": "## Before you begin\n## Deploy an application\n- At the top of the Google Cloud console window, click **Activate Cloud Shell** :This launches Cloud Shell session in a frame at the bottom of the [Google Cloud console](http://console.cloud.google.com) .\n- Clone a sample app and run it locally in the Cloud Shell session using the App Engine development server:```\ngit clone https://github.com/GoogleCloudPlatform/appengine-guestbook-python \\&& cd appengine-guestbook-python \\&& dev_appserver.py ./app.yaml\n```\n- To connect to the development server, click **Web Preview** and then choose **Preview on port 8080** .Cloud Shell opens the preview URL on its proxy service in a new browser window.\n- To open the code editor, click from the Cloud Shell menu to edit your cloned app.\n- Change the text in `index.html` :In the code editor, double-click `index.html` to open the file for edit and then change the text in `index.html` from to You'll see your change in Cloud Shell's output. To see the changes, refresh your previewed app.\n- Stop the development server:After you've previewed the App Engine app, to stop the development server, press `Ctrl` + `C` in your Cloud Shell session.\n- Initialize your App Engine app:Create an App Engine app tied to your project, if you haven't already, and choose its region:```\ngcloud app create --project=[YOUR_PROJECT_NAME]\n```\n- Deploy the app to App Engine:```\ngcloud app deploy ./index.yaml ./app.yaml\n```\n- Open your application in your web browser. The URL is `https://<PROJECT_ID>.<REGION-ID>.r.appspot.com/` .Deployment could take a few minutes to complete. If the application is not fully deployed, an error message is displayed in the web browser. Refresh the browser to see the deployed application.\n- To avoid unnecessary billing, disable your app:To disable the app you just deployed, go to App Engine in Google Cloud console and select **Settings** > **Application Settings** > **Disable Application** .\n## What's next\n- [Choose an App Engine environment](/appengine/docs/the-appengine-environments)", "guide": "Cloud Shell"}