{"title": "Cloud Shell - Work with Kubernetes", "url": "https://cloud.google.com/shell/docs/kubernetes", "abstract": "# Cloud Shell - Work with Kubernetes\nCloud Code comes with end-to-end Kubernetes support, helping you create a new application from sample applications, customize and develop the application, and deploy and preview your finished app. Cloud Code also offers run-ready samples, out-of-the-box configuration snippets, and a tailored debugging experience.\n", "content": "## Interactive tutorial\nThe interactive tutorial walks you through creating a Kubernetes Hello World application from a sample application, testing and debugging the app locally, creating a Google Kubernetes Engine cluster, and deploying and previewing your app.\nTo begin, click the following button to open Cloud Shell and launch the tutorial:\n[](https://ide.cloud.google.com/?walkthrough_tutorial_url=https%3A%2F%2Fwalkthroughs.googleusercontent.com%2Fcontent%2Fgke_cloud_code_create_app%2Fgke_cloud_code_create_app.md)\n## Kubernetes development with Cloud Code\nBeyond the tutorial, Cloud Shell has a lot to offer for Kubernetes development. Here's a snapshot of what Cloud Shell with integrated Cloud Code comes with:\n- Support for Go, Node.js, Python, Java, and .NET\n- Fully functional run and debug-ready starter applications\n- Easy creation and editing of configuration files with sample applications, out-of-the-box snippets, and context-based completions\n- One-click deploy of your applications from your browser\n- 'Watch' mode to allow continuous building and real-time editing of your live application, helping you maintain a tight development inner loop\n- Automatic port-forwarding and resource cleanup on application termination\n- Debugging and logging support for applications running on Kubernetes clusters\n- Cluster creation and management\n- Support for minikube\nFor a detailed look at developing Kubernetes applications with Cloud Code in Cloud Shell, see the [Kubernetes overview](/code/docs/shell/k8s-overview#working-with-kubernetes) .", "guide": "Cloud Shell"}