{"title": "Cloud Shell - Use Cloud Shell", "url": "https://cloud.google.com/shell/docs/using-cloud-shell", "abstract": "# Cloud Shell - Use Cloud Shell\nThis page describes how to start and set up a new Cloud Shell session.\n", "content": "## Start a new session\nClick **Activate Cloud Shell** at the top of the Google Cloud console.\nA Cloud Shell session opens inside a new frame at the bottom of the Google Cloud console and displays a command-line prompt. It can take a few seconds for the session to be initialized.\n### Use the terminal\nCloud Shell provides command-line access to the virtual machine instance in a terminal window that opens in the Google Cloud console.\nIn addition to accessing the [Google Cloud CLI](/sdk/gcloud) and other utilities from the command line, you can use the `cloudshell` command to launch tutorials, open the Cloud Shell Editor, and download files.\nRefer to the guide on using the [Cloud Shell Terminal](/shell/docs/use-cloud-shell-terminal) for more details.\n### Use the Cloud Shell Editor\nThe built-in code editor provides the convenience of viewing and editing files in the same environment where projects are built and deployed. Launch the Cloud Shell Editor by clicking **Open Editor** on the toolbar of the Cloud Shell window.\nFor more information, see [Cloud Shell Editor interface overview](/shell/docs/editor-overview) .\n### Choose ephemeral mode\nBy default, Cloud Shell provisions 5 GB of free persistent disk storage on your temporarily allocated virtual machine. This is your `$HOME` directory. When you use the default Cloud Shell experience, the files in your home directory persist between sessions.\nIf you do not need persistent storage, use Cloud Shell in ephemeral mode. In ephemeral mode, you can get started with Cloud Shell faster because there is less set up and there is no disk attachment or archive. However, this means that all the files you create during your ephemeral mode session are deleted with the VM when the session ends.\nTo choose ephemeral mode, append `ephemeral=true` to the `https://shell.cloud.google.com` URL. For example: `https://shell.cloud.google.com/?ephemeral=true` .\nThis does not work for `https://console.cloud.google.com` URLs.\nAlternatively, you can open the Cloud Shell **More** menu, select **Ephemeralmode** , and click **Save** .\nTo set ephemeral mode as your Cloud Shell default, enable **Alwaysstart Cloud Shell in ephemeral mode** before you click **Save** .\n### Adjust the display window\nTo adjust the display window:\n- Click **Hide** or **Restore** to hide or restore the session display.\n- Click **Open Session in New Window** to detach the session as a new window.\n- To close the detached window and re-open the session in the Google Cloud console, click **Activate Cloud Shell** at the top of the Google Cloud console window.\n- To toggle between themes, click **Settings** and then click **Switch to Light Theme** or **Switch to Dark Theme** .## What's next\nNow that you're familiar with configuring Cloud Shell, you can start to use the [pre-installed tools and commands](/shell/docs/how-cloud-shell-works#tools) from the command line. You can also install additional tools in your [home directory](/shell/docs/how-cloud-shell-works#persistent_disk_storage) in persistent disk storage as needed.\n- [Learn how to use web preview](/shell/docs/using-web-preview) \n- [Explore examples of things you can do in Cloud Shell](/shell/docs/quickstart)", "guide": "Cloud Shell"}