{"title": "Docs - Implement logging and detective controls", "url": "https://cloud.google.com/architecture/framework/security/logging-detection", "abstract": "# Docs - Implement logging and detective controls\nLast reviewed 2023-08-08 UTC\nThis document in the [Google Cloud Architecture Framework](/architecture/framework) provides best practices for implementing logging and detective controls.\nDetective controls use telemetry to detect misconfigurations, vulnerabilities, and potentially malicious activity in a cloud environment. Google Cloud lets you create tailored monitoring and detective controls for your environment. This section describes these additional features and recommendations for their use.\n", "content": "## Monitor network performance\n[Network Intelligence Center](/network-intelligence-center/docs) gives you visibility into how your network topology and architecture are performing. You can get detailed insights into network performance and then use that information to optimize your deployment by eliminating bottlenecks on your services. [Connectivity Tests](/network-intelligence-center/docs/connectivity-tests/concepts/overview) provides you with insights into the firewall rules and policies that are applied to the network path.\n## Monitor and prevent data exfiltration\nData exfiltration is a key concern for organizations. Typically, it occurs when an authorized person extracts data from a secured system and then shares that data with an unauthorized party or moves it to an insecure system.\nGoogle Cloud provides several features and tools that help you detect and prevent data exfiltration. For more information, see [Preventing data exfiltration](/security/data-loss-prevention/preventing-data-exfiltration) .\n## Centralize your monitoring\n[Security Command Center](/security-command-center/docs) provides visibility into the resources that you have in Google Cloud and into their security state. Security Command Center helps you prevent, detect, and respond to threats. It provides a centralized dashboard that you can use to help identify security misconfigurations in virtual machines, in networks, in applications, and in storage buckets. You can address these issues before they result in business damage or loss. The built-in capabilities of Security Command Center can reveal suspicious activity in your Cloud Logging security logs or indicate compromised virtual machines.\nYou can respond to threats by following actionable recommendations or by exporting logs to your [SIEM](https://wikipedia.org/wiki/Security_information_and_event_management) system for further investigation. For information about using a SIEM system with Google Cloud, see [Security log analytics in Google Cloud](/architecture/exporting-stackdriver-logging-for-security-and-access-analytics) .\nSecurity Command Center also provides multiple detectors that help you analyze the security of your infrastructure. These detectors include the following:\n- [Event Threat Detection](/security-command-center/docs/concepts-event-threat-detection-overview) \n- [Security Health Analytics (SHA)](/security-command-center/docs/how-to-use-security-health-analytics) \n- [Sensitive Actions Service](/security-command-center/docs/how-to-use-sensitive-actions) \nOther Google Cloud services, such as [Google Cloud Armor logs](/armor/docs/cscc-findings) , also provide findings for display in Security Command Center.\nEnable the services that you need for your workloads, and then only monitor and analyze important data. For more information about enabling logging on services, see the [enable logs](/architecture/exporting-stackdriver-logging-for-security-and-access-analytics#enable_logs) section in Security log analytics in Google Cloud.\n## Monitor for threats\n[Event Threat Detection](/security-command-center/docs/concepts-event-threat-detection-overview) is an optional managed service of Security Command Center Premium that detects threats in your log stream. By using Event Threat Detection, you can detect high-risk and costly threats such as malware, cryptomining, unauthorized access to Google Cloud resources, DDoS attacks, and brute-force SSH attacks. Using the tool's features to distill volumes of log data, your security teams can quickly identify high-risk incidents and focus on remediation.\nTo help detect potentially compromised user accounts in your organization, use the [Sensitive Actions Cloud Platform logs](/logging/docs/api/platform-logs#sensitive_actions_service) to identify when sensitive actions are taken and to confirm that valid users took those actions for valid purposes. A is an action, such as the addition of a highly privileged role, that could be damaging to your business if a malicious actor took the action. Use Cloud Logging to [view](/logging/docs/view/logs-explorer-summary) , [monitor](/logging/docs/alerting/monitoring-logs) , and [query](/logging/docs/view/logging-query-language) the Sensitive Actions Cloud Platform logs. You can also view the sensitive action log entries with the [Sensitive Actions Service](/security-command-center/docs/concepts-sensitive-actions-overview) , a built-in service of [Security Command Center](/security-command-center/docs) Premium.\n[Chronicle](/chronicle/docs/overview) can store and analyze all of your security data centrally. To help you see the entire span of an attack, Chronicle can map logs into a common model, enrich them, and then link them together into timelines. Furthermore, you can use Chronicle to create detection rules, set up indicators of compromise (IoC) matching, and perform threat-hunting activities. You write your detection rules in the [YARA-L language](/chronicle/docs/detection/yara-l-2-0-overview) . For sample threat detection rules in YARA-L, see the [Community Security Analytics (CSA)](https://github.com/GoogleCloudPlatform/security-analytics) repository. In addition to writing your own rules, you can take advantage of [curated detections](/chronicle/docs/detection/curated-detections) in Chronicle. These curated detections are a set of predefined and managed YARA-L rules that can help you identify threats.\nAnother option to centralizing your logs for security analysis, audit, and investigation is to use [BigQuery](/bigquery/docs) . In BigQuery, you monitor common threats or misconfigurations by using SQL queries (such as those in the CSA repository) to analyze permission changes, provisioning activity, workload usage, data access, and network activity. For more information about security log analytics in BigQuery from setup through analysis, see [Security log analytics in Google Cloud](/architecture/exporting-stackdriver-logging-for-security-and-access-analytics) .\nThe following diagram shows how to centralize your monitoring by using both the built-in threat detection capabilities of Security Command Center and the threat detection that you do in BigQuery, Chronicle, or a third-party SIEM.\nAs shown in the diagram, there are variety of security data sources that you should monitor. These data sources include logs from Cloud Logging, asset changes from Cloud Asset Inventory, Google Workspace logs, or events from hypervisor or a guest kernel. The diagram shows that you can use Security Command Center to monitor these data sources. This monitoring occurs automatically provided that you've enabled the appropriate features and threat detectors in Security Command Center. The diagram shows that you can also monitor for threats by exporting security data and Security Command Center findings to an analytics tool such as BigQuery, Chronicle, or a third-party SIEM. In your analytics tool, the diagram shows that you can perform further analysis and investigation by using and extending queries and rules like those available in CSA.\n## What's next\nLearn more about logging and detection with the following resources:\n- [Cloud Logging](/logging) \n- [Introducing Chronicle Detect from Google Cloud](/blog/products/identity-security/introducing-chronicle-detect-from-google-cloud) \n- [Build a collaborative incident management process](/architecture/framework/reliability/build-incident-management-process)", "guide": "Docs"}