{"title": "Docs - Installing F5 BIG-IP ADC for GKE on VMware using manual load balancing", "url": "https://cloud.google.com/architecture/partners/installing-f5-big-ip-adc-for-gke-on-prem-using-manual-load-balancing?hl=zh-cn", "abstract": "# Docs - Installing F5 BIG-IP ADC for GKE on VMware using manual load balancing\nLast reviewed 2022-08-25 UTC\nBy Gregory Coward, Solution Architect,\n [F5 Networks](https://www.f5.com/) This tutorial shows how to set up the [F5 BIG-IP](https://www.f5.com/products/big-ip-services) Application Delivery Controller (ADC) before you [integrate with GKE on VMware ](/anthos/clusters/docs/on-prem) using the [manual load-balancing mode on GKE on VMware](/anthos/clusters/docs/on-prem/how-to/manual-load-balance) . If you're interested in installing F5 BIG-IP ADC on GKE on VMware to automatically provision L4 load-balancing services, see [Installing F5 BIG-IP ADC for GKE on VMware](/solutions/partners/installing-f5-big-ip-adc-for-gke-on-prem) .\nF5 is a leading provider of ADC services. The F5 BIG-IP platform provides various services to help you enhance the security, availability, and performance of your apps. These services include, L7 load balancing, network firewalling, [web application firewalling(WAF)](https://wikipedia.org/wiki/Web_application_firewall) , DNS services, and more. For GKE on VMware, BIG-IP provides external access and L3/4 load-balancing services.\n#", "content": "## When to choose manual load-balancer modeWhen deployed in integrated mode, [GKE Enterprise](/anthos) uses a version of [F5 container ingress services](https://clouddocs.f5.com/containers/v2/kubernetes/) (CIS) to automatically provision L4 load-balancing services on the BIG-IP platform. CIS continues to monitor and update BIG-IP when the GKE on VMware cluster is modified. However, CIS comes with limitations.\nAt the time of publication, you cannot add L7 services such as [F5 Advanced WAF](https://www.f5.com/products/security/advanced-waf) or Access Policy Manager ( [F5 APM](https://www.f5.com/products/security/access-policy-manager) ) to the virtual IP address endpoints when the environment is deployed using the integrated mode. This limitation is due to the nature of CIS. Any modifications made to the BIG-IP partitons are overwritten by the CIS controller when it's updated.\nBy deploying the GKE on VMware environment using the manual load-balancer mode, on the other hand, you create the required virtual servers and related BIG-IP resources prior to deploying GKE on VMware. This type of deployment lets you customize and secure the BIG-IP hosted environment endpoints. The trade-off is that as the environment changes, for example when cluster node instances are added or removed, you need to manually update the BIG-IP.## Objectives\n- Learn about the BIG-IP architecture.\n- Configure the BIG-IP for GKE on VMware external endpoints.\n- Create virtual servers.\n## CostsIn this document, you use the following billable components of Google Cloud:- [GKE Enterprise](/anthos/pricing) \nTo generate a cost estimate based on your projected usage,  use the [pricing calculator](/products/calculator) . ## Before you begin\n- Obtain an F5 BIG-IP Application Delivery Controller and license. The F5 BIG-IP ADC is available in various hardware platforms and virtual editions. Regardless of the platform you use, the solution is supported, and the following configuration process is applicable.There are three types of licenses for F5 BIG-IP.| License type   | Production      | Evaluation      | Demonstration     |\n|:-----------------------|:-------------------------------|:--------------------------------|:--------------------------------|\n| Expiration date  | No        | Yes, 45 days     | Yes, 30 days     |\n| Throughput limitations | Up to 40 Gbps on GKE on VMware | 25 Mbps - 10 Gbps    | 1 Mbps       |\n| Use case    | Production      | Proof of concept, demonstration | Proof of concept, demonstration |- If you have a production license, you can use that license.\n- For the purpose of this tutorial, you can [request a free trial license key](https://www.f5.com/trials) .\n- If your throughput requirements are greater than 1 Mbps provided by the trial license, you can request an evaluation license from F5:- [Request a BIG-IP evaluation license](https://www.google.com/url?sa=D&q=https%3A%2F%2Ff5.com%2Fproducts%2Ftrials%2Fbig-ip-evaluation-request%2Fpopup%2Ftrue%3Fsbtitle%3DBIG-IP%2BEvaluation%2BTrial%2BRequest%26utm_source%3Df5com%26utm_medium%3Dweb%26utm_campaign%3Dhtb-trial-page) .\n- [Send email to F5 to request a BIG-IP evaluation license](mailto:googleteam@f5.com) .\n- If the BIG-IP system contains an evaluation or demonstration license, the BIG-IP system stops processing traffic when the license expires.\n- [Activate a license key for BIG-IP](https://www.f5.com/products/get-f5) .\n- Make sure your environment meets the following minimum system requirements:- 8 vCPUs that aren't shared between other hosts on that system\n- 16 GB memory that isn't shared between other hosts on that system## ArchitectureThere are two common scenarios to deploy BIG-IP ADC to GKE on VMware clusters. Because the BIG-IP acts as a proxy for external access to the clusters, it's common to deploy a BIG-IP with three or more interfaces, as illustrated in the following diagram.In the preceding diagram, separate interfaces serve internal and external facing traffic independently. This architecture provides better visibility for monitoring and troubleshooting, and increased throughput.While this configuration isn't considered a best practice, if you're integrating into an existing environment with a pre-defined network architecture, you might need this type of configuration.## Setting up your environment\n- [Follow the instructions to set up BIG-IP virtual edition deployed on VMware ESXi 6.5](https://techdocs.f5.com/kb/en-us/products/big-ip_ltm/manuals/product/bigip-ve-setup-vmware-esxi-13-1-0/3.html) .The OVF template requires configuring four interfaces. The fourth interface is designated for HA heartbeat traffic between BIG-IP pairs. For this three-arm deployment, assign the internal network `gke-node` .\n- After the VM boots, use the F5 BIG-IP's [Setup utility](https://techdocs.f5.com/kb/en-us/products/big-ip_ltm/manuals/product/bigip-system-initial-configuration-11-6-0.html) for initial configuration. The setup utility walks you through the following configuration tasks:- From a network accessible workstation on which you configured the`gke-mgmt`interface, go to the following URL`https://` ``, where``is the address you configured for your device.\n- When prompted, enter the default username as`admin`and the password as`admin`.\n- Click **Log in** .\n- To install a license, in the **Base Registration Key** field, enter your key. The type of license dictates the BIG-IP's services and bandwidth limits.\n- To enhance performance when working with GKE clusters, set the **Management (MGMT)** plane provisioning to **Large** .\n- To provide L3/4 load balancing to the GKE on VMware environment, set the **Local Traffic (LTM)** module is set to **Nominal** \n- On the **Host and User Information** page, you provide the hostname, FQDN of BIG-IP system, and update the and account passwords.\n- On the **Networking** page, you walk through configuring the BIG-IP's basic networking. The utility creates the internal, `gke-node` and external, `gke-external` interfaces, VLANs, and self-IP addresses. The 4th interface deployed by VMware is left unconfigured. \n## Additional configurationAfter the Setup utility completes, you have a functioning BIG-IP with a management plane interface attached to the `gke-mgmt` VMware network and two data plane interfaces attached to VMware networks, `gke-node` and `gke-external` .\nBefore you deploy [GKE on VMware](/anthos/clusters/docs/on-prem) , more configuration of the BIG-IP is required.- [Create an administrative partition](https://techdocs.f5.com/kb/en-us/products/big-ip_ltm/manuals/product/bigip-user-account-administration-12-0-0/3.html) for each admin and user cluster you intend to expose and access.Initially, you define two partitions: one for the admin cluster, and one for the first user cluster. Don't use cluster partitions for anything else. Each of the clusters must have a partition that is for the sole use of that cluster.\n### F5 BIG-IP account permissionsThe existing Administrator role provides enough permissions for use with GKE on VMware. For more information, see [User roles](https://techdocs.f5.com/kb/en-us/products/big-ip_ltm/manuals/product/bigip-user-account-administration-11-6-0/3.html#taskid) . You can also learn how to [create additional users](https://techdocs.f5.com/kb/en-us/products/big-ip_ltm/manuals/product/bigip-user-account-administration-13-1-0/4.html) .\n### Configuring the BIG-IP for GKE on VMware external endpointsBefore deploying GKE on VMware, you must [configure the BIG-IP with the virtual servers](/anthos/gke/docs/on-prem/how-to/manual-load-balance) , (VIPs), corresponding to the following GKE on VMware endpoints:- **Admin partition** - VIP for admin cluster control plane (port exposed:`443`)\n- VIP for admin cluster add-on (port exposed:`8443`)\n- VIP for user control plane (port exposed:`443`)\n- **User partition** - VIP for user cluster ingress controller (port exposed:`443`)\n- VIP for user cluster ingress controller (port exposed:`80`)\nPerform the following steps from both the admin and user partitions to create node objects on the BIG-IP for each host specified in the corresponding host configuration files.GKE on VMware clusters can run with one of two load-balancing modes: or . For manual mode, cluster nodes (both admin and user clusters) must be assigned [static IP addresses](/anthos/clusters/docs/on-prem/how-to/ip-block-file) . These addresses are in turn used to configure node objects on the BIG-IP system. You will create a node object for each GKE on VMware cluster node. The nodes are added to backend pools that are then associated with virtual servers.- To log in to the BIG-IP management console, go to the IP address. The address is provided during the installation.\n- Click the **Administrative partition** that you previously created.\n- Go to **Local Traffic** > **Nodes** > **Node List** .\n- Click **Create** .\n- Enter a name and IP address for each cluster host and click **Finished** .\n- Repeat these steps each admin cluster member.\n- Repeat these steps for each user cluster member, but click the **Userpartition** instead of the Administrative partition. \n### Create backend poolsYou create a backend pool for each required VIP, seven in total.- In the BIG-IP management console, click **adminpart** for the admin partiton that you previously created.\n- Go to **Local Traffic** > **Pools** > **Pool List** .\n- Click **Create** .\n- In the **Configuration** drop-down list, click **Advanced** .\n- In the **Name** field, enter`Istio-80-pool`.\n- To verify the pool member accessibility, under **Health Monitor** , click **tcp** . Optional: Because this is a manual configuration, you can also take advantage of more [advanced monitors](https://techdocs.f5.com/kb/en-us/products/big-ip_ltm/manuals/product/bigip-local-traffic-manager-monitors-reference-13-1-0.html) as appropriate for your deployment.\n- For **Action on Service Down** , click **Reject** .\n- For this tutorial, in the **Load Balancing Method** drop-down list, click **Round Robin** .\n- In the **New Members** section, click **Node List** and then select the previously created node.\n- In the **Service Port** field, enter the appropriate `nodePort` from the [gkectl configuration file](/anthos/clusters/docs/on-prem/how-to/manual-load-balance#set_aside_nodeports) .\n- Click **Add** .\n- Repeat steps 8-9 and add each cluster node instance. \n- Click **Finished** .\n- Repeat all of these steps in this section for the remaining [required admin cluster VIPs](/anthos/clusters/docs/on-prem/how-to/manual-load-balance) .\n- Repeat all of these steps in this section for each user cluster pool, except in step 1, click **userpart** instead of **adminpart** .\n### Create virtual serversYou create a total of seven virtual servers on the BIG-IP with five for the admin clusters and two for the user clusters. The virtual servers correspond to the VIPs required to deploy GKE on VMware.- In the BIG-IP management console, click the **Admin partition** that you previously created.\n- Go to **Local Traffic** > **Virtual Servers** > **Virtual Server List** .\n- Click **Create** .\n- In the **Name** field, enter`istio-ingress-80`.\n- In the **Destination Address/Mask** field, enter the IP address for the VIP. For this tutorial, use the HTTP ingress VIP in the [gkectl configuration file](/anthos/clusters/docs/on-prem/how-to/manual-load-balance) .\n- In the **Service Port** field, enter the appropriate listener port for the VIP. For this tutorial, use port `80` . There are several configuration options for enhancing your app's endpoint, such as associating protocol-specific profiles, [certificate profiles](https://techdocs.f5.com/kb/en-us/products/big-ip_ltm/manuals/product/ltm-profiles-reference-13-1-0/6.html#guid-cc146765-9237-474b-9faf-0e18a208cb23) , and [WAF policies](https://support.f5.com/csp/article/K85426947) .\n- For **Source Address Translation** click **Auto Map** .\n- For **Default Pool** select the appropriate pool that you previously created.\n- Click **Finished** .\n- Repeat these to create the remaining [required admin cluster VIPs](/anthos/clusters/docs/on-prem/how-to/manual-load-balance) .\n- Repeat these steps to create the user cluster virtual servers, but select the **User partition** .\n- [Create and download an archive of the current configuration](https://support.f5.com/csp/article/K4423) .\n## What's next\n- To further enhance the security and performance of the external-facing VIPs, consider the following:- [F5 Advanced WAF](https://www.f5.com/products/security/advanced-waf) \n- [F5 Access Policy Manager (APM)](https://www.f5.com/products/security/access-policy-manager) \n- [Caching & Compression](https://www.f5.com/products/big-ip-services/local-traffic-manager) \n- [Health monitoring](https://techdocs.f5.com/en-us/bigip-15-0-0/big-ip-local-traffic-manager-implementations/implementing-health-and-performance-monitoring.html) \n- [Intelligent application traffic management](https://www.f5.com/products/big-ip-services/local-traffic-manager) \n- Learn more about F5 [BIG-IP Application Services](https://www.f5.com/products/big-ip-services) .\n- Learn more about BIG-IP configurations and capabilities:- [Certificate profiles](https://techdocs.f5.com/kb/en-us/products/big-ip_ltm/manuals/product/ltm-profiles-reference-13-1-0/6.html#guid-cc146765-9237-474b-9faf-0e18a208cb23) \n- [WAF policies](https://support.f5.com/csp/article/K85426947) \n- Explore reference architectures, diagrams, and best practices about Google Cloud. Take a look at our [Cloud Architecture Center](/architecture) .", "guide": "Docs"}