{"title": "Docs - Connected device architectures on Google Cloud", "url": "https://cloud.google.com/architecture/connected-devices", "abstract": "# Docs - Connected device architectures on Google Cloud\nLast reviewed 2023-01-26 UTC\nTo maximize the value of data from their connected devices, organizations need to be able to perform data analysis. There are many ways for organizations to connect their devices to their analytics applications, and the benefits of specific connected device architectures can vary depending on the use case of your organization. To help guide you, this document describes a set of connected device architectures on Google Cloud. These architectures address a broad range of use cases and requirements for connected devices.\nThis document is part of a series of documents that provide information about IoT architectures on Google Cloud and about migrating from IoT Core. The other documents in this series include the following:\n- Connected device architectures on Google Cloud overview (this document).\n- [A standalone MQTT Broker](/architecture/connected-devices/mqtt-broker-architecture) : An [MQTT](https://mqtt.org/) broker provides bidirectional communication between connected devices and Google Cloud projects, and between the devices.\n- [An IoT platform architecture on Google Cloud:](/architecture/connected-devices/iot-platform-product-architecture) An IoT platform provides additional device management capabilities along with data connectivity, which is important when you deploy a large fleet of connected devices.\n- [A direct connection to Pub/Sub](/architecture/connected-devices/device-pubsub-architecture) : For data ingestion, the best choice might be for your devices to connect directly to Pub/Sub.\n- [Best practices for running an IoT backend on Google Cloud](/architecture/connected-devices/bps-running-iot-backend-securely) .\n- [Best practices for automatically provisioning and configuring edge and bare metal systems and servers](/architecture/connected-devices/best-practices-provisioning-configuring-bare-metal) .\n- [Migrate environments from IoT Core](/architecture/connected-devices/iot-core-migration) .", "content": "## Connected device architectures summary\nThis document groups connected device use cases into three categories, based on the following dimensions that you need to consider when you plan a connected device architecture:\n- **Number of devices:** It's important to consider how many devices are directly connected to your application. If your application has many end devices (such as machines, sensors, or cameras), and if these devices are connected to an intermediate gateway or other device (such as a mobile phone), it's important to identify whether those end devices must be represented and managed in your application. In some cases you might need to represent each individual device; in other cases, only the intermediate device might need to be represented.\n- **Fleet management:** Consider whether you need capabilities like device status monitoring, software and firmware updates, configuration management, and other fleet management features. These requirements help to determine your choice of application architecture.\n- **Inter-device messaging:** Device communication through your application architecture is an important factor. For example, some applications depend on communication between the connected devices through your application architecture. Other applications have data flows that occur strictly between each device and your application, with no messaging between devices.## Summary table\nUnderstanding the characteristics of your application can help you to choose the best architecture for your use case. To help guide your choice, the following table summarizes the support that each of the connected architectures that are described in this series offers:\n| Unnamed: 0  | Device support limits | Inter-device messaging | Fleet management support |\n|:------------------|:------------------------|:-------------------------|:---------------------------|\n| MQTT Broker  | Millions    | Recommended    | Not supported    |\n| IoT platform  | Millions    | Some support    | Recommended    |\n| Device to Pub/Sub | Hundreds    | Some support    | Not supported    |\n## What's next\n- Read about the best connected device architecture for your use case:- [A standalone MQTT Broker](/architecture/connected-devices/mqtt-broker-architecture) :\n- [An IoT platform architecture on Google Cloud](/architecture/connected-devices/iot-platform-product-architecture) .\n- [A direct connection to Pub/Sub](/architecture/connected-devices/device-pubsub-architecture) .\n- Learn how to connect devices and build IoT applications on Google Cloud using [Intelligent Products Essentials](/architecture/intelligent-products-essentials-architecture) .\n- Learn about practices for [automatically provisioning and configuring edge andbare metal systems and servers](/architecture/best-practices-provisioning-configuring-bare-metal) .\n- For more reference architectures, diagrams, and best practices, explore the [Cloud Architecture Center](/architecture) .", "guide": "Docs"}