{"title": "Docs - Google Cloud Architecture Framework: Reliability", "url": "https://cloud.google.com/architecture/framework/reliability", "abstract": "# Docs - Google Cloud Architecture Framework: Reliability\nLast reviewed 2023-07-18 UTC\nThis category in the [Google Cloud Architecture Framework](/architecture/framework) shows you how to architect and operate reliable services on a cloud platform. You also learn about some of the Google Cloud products and features that support reliability.\nThe Architecture Framework describes best practices, provides implementation recommendations, and explains some of the available products and services. The framework aims to help you design your Google Cloud deployment so that it best matches your business needs.\nTo run a reliable service, your architecture must include the following:\n- Measurable reliability goals, with deviations that you promptly correct.\n- Design patterns for scalability, high availability, disaster recovery, and automated change management.\n- Components that self-heal where possible, and code that includes instrumentation for observability.\n- Operational procedures that run the service with minimal manual work and cognitive load on operators, and that let you rapidly detect and mitigate failures.\nReliability is the responsibility of everyone in engineering, such as the development, product management, operations, and site reliability engineering (SRE) teams. Everyone must be accountable and understand their application's reliability targets, and risk and error budgets. Teams should be able to prioritize work appropriately and escalate priority conflicts between reliability and product feature development.\nIn the reliability category of the Architecture Framework, you learn to do the following:\n- [Understand the core reliability principles](/architecture/framework/reliability/principles) \n- [Define your reliability goals](/architecture/framework/reliability/define-goals) \n- [Define SLOs](/architecture/framework/reliability/defining-SLOs) \n- [Adopt SLOs](/architecture/framework/reliability/adopting-slos) \n- [Build observability into your infrastructure and application](/architecture/framework/reliability/observability-infrastructure-applications) \n- [Design for scale and high availability](/architecture/framework/reliability/design-scale-high-availability) \n- [Create reliable operational processes and tools](/architecture/framework/reliability/create-operational-processes-tools) \n- [Build efficient alerts](/architecture/framework/reliability/build-efficient-alerts) \n- [Build a collaborative incident management process](/architecture/framework/reliability/build-incident-management-process", "content": ")", "guide": "Docs"}