{"title": "Docs - Design your network infrastructure", "url": "https://cloud.google.com/architecture/framework/system-design/networking", "abstract": "# Docs - Design your network infrastructure\nLast reviewed 2023-05-10 UTC\nThis document in the [Google Cloud Architecture Framework](/architecture/framework) provides best practices to deploy your system based on networking design. You learn how to choose and implement [Virtual Private Cloud (VPC)](/vpc/docs) , and how to test and manage network security.\n", "content": "## Core principles\nNetworking design is critical to successful system design because it helps you optimize for performance and secure application communications with internal and external services. When you choose networking services, it's important to evaluate your application needs and evaluate how the applications will communicate with each other. For example, while some components require global services, other components might need to be geo-located in a specific region.\nGoogle's private network connects regional locations to more than 100 global network points of presence. Google Cloud uses [software-defined networking](https://www.usenix.org/system/files/conference/nsdi18/nsdi18-dalton.pdf) and distributed systems technologies to host and deliver your services around the world. Google's core element for networking within Google Cloud is the global [VPC](/vpc/docs) . VPC uses Google's global high-speed network to link your applications across regions while supporting privacy and reliability. Google ensures that your content is delivered with high throughput by using technologies like [Bottleneck Bandwidth and Round-trip propagation time (BBR)](https://cloud.google.com/blog/products/networking/tcp-bbr-congestion-control-comes-to-gcp-your-internet-just-got-faster) congestion-control intelligence.\nDeveloping your cloud networking design includes the following steps:\n- Design the workload VPC architecture. Start by identifying how many Google Cloud projects and VPC networks you require.\n- Add inter-VPC connectivity. Design how your workloads connect to other workloads in different VPC networks.\n- Design hybrid network connectivity. Design how your workload VPCs connect to on-premises and other cloud environments.\nWhen you design your Google Cloud network, consider the following:\n- A [VPC](/vpc) provides a private networking environment in the cloud for interconnecting services that are built on [Compute Engine](/compute) , [Google Kubernetes Engine (GKE)](/kubernetes-engine) , and [Serverless Computing Solutions](/serverless) . You can also use a VPC to privately access Google-managed services such as [Cloud Storage](/storage) , [BigQuery](/bigquery) , and [Cloud SQL](/sql) .\n- VPC networks, including their associated routes and firewall rules, are global resources; they aren't associated with any particular region or zone.\n- Subnets are regional resources. [Compute Engine](/compute/docs) VM instances that are deployed in different zones in the same cloud region can use IP addresses from the same subnet.\n- Traffic to and from instances can be controlled by using VPC firewall rules.\n- Network administration can be secured by using [Identity and Access Management (IAM) roles](/iam/docs/understanding-roles) .\n- VPC networks can be securely connected in hybrid environments by using [Cloud VPN](/network-connectivity/docs/vpn/concepts/overview) or [Cloud Interconnect](/network-connectivity/docs/interconnect) .\nTo see a complete list of VPC specifications, see [Specifications](/vpc/docs/vpc#specifications) .\n## Workload VPC architecture\nThis section provides best practices for designing workload VPC architectures to support your system.\n### Consider VPC network design early\nMake [VPC](/vpc) network design an early part of designing your organizational setup in Google Cloud. Organizational-level design choices can't be easily reversed later in the process. For more information, see [Best practices and reference architectures for VPC design](/architecture/best-practices-vpc-design) and [Decide the network design for your Google Cloud landing zone](/architecture/landing-zones/decide-network-design) .\n### Start with a single VPC network\nFor many use cases that include resources with common requirements, a single VPC network provides the features that you need. Single VPC networks are simple to create, maintain, and understand. For more information, see [VPC Network Specifications](/vpc/docs/vpc#specifications) .\n### Keep VPC network topology simple\nTo ensure a manageable, reliable, and well-understood architecture, keep the design of your [VPC](/vpc) network topology as simple as possible.\n### Use VPC networks in custom mode\nTo ensure that Google Cloud networking integrates seamlessly with your existing networking systems, we recommend that you use [custom mode](/vpc/docs/vpc#subnet-ranges) when you create VPC networks. Using custom mode helps you integrate Google Cloud networking into existing IP address management schemes and it lets you control which cloud regions are included in the VPC. For more information, see [VPC](/vpc) .\n## Inter-VPC connectivity\nThis section provides best practices for designing inter-VPC connectivity to support your system.\n### Choose a VPC connection method\nIf you decide to implement multiple VPC networks, you need to connect those networks. VPC networks are isolated tenant spaces within Google's [Andromeda software-defined network (SDN)](https://cloud.google.com/blog/products/networking/google-cloud-networking-in-depth-how-andromeda-2-2-enables-high-throughput-vms) . There are several ways that VPC networks can communicate with each other. Choose how you connect your network based on your bandwidth, latency, and service level agreement (SLA) requirements. To learn more about the connection options, see [Choose the VPC connection method that meets your cost, performance, and security needs](/architecture/best-practices-vpc-design#choose-method) .\n### Use Shared VPC to administer multiple working groups\nFor organizations with multiple teams, Shared VPC provides an effective tool to extend the architectural simplicity of a single VPC network across multiple working groups.\n### Use simple naming conventions\nChoose simple, intuitive, and consistent naming conventions. Doing so helps administrators and users to understand the purpose of each resource, where it's located, and how it's differentiated from other resources.\n### Use connectivity tests to verify network security\nIn the context of network security, you can use connectivity tests to verify that traffic you intend to prevent between two endpoints is blocked. To verify that traffic is blocked and why it's blocked, define a test between two endpoints and evaluate the results. For example, you might test a VPC feature that lets you define rules that support blocking traffic. For more information, see [Connectivity Tests overview](/network-intelligence-center/docs/connectivity-tests/concepts/overview) .\n### Use Private Service Connect to create private endpoints\nTo create private endpoints that let you access Google services with your own IP address scheme, use [Private Service Connect](https://codelabs.developers.google.com/codelabs/cloudnet-psc#0) . You can access the private endpoints from within your VPC and through hybrid connectivity that terminates in your VPC.\n### Secure and limit external connectivity\nLimit internet access only to those resources that need it. Resources with only a private, internal IP address can still access many Google APIs and services through [Private Google Access](/vpc/docs/private-google-access) .\n### Use Network Intelligence Center to monitor your cloud networks\n[Network Intelligence Center](/network-intelligence-center) provides a comprehensive view of your Google Cloud networks across all regions. It helps you to identify traffic and access patterns that can cause operational or security risks.\n## What's next\nLearn [best practices for storage management](/architecture/framework/system-design/storage#management) , including the following:\n- [Select a storage type](/architecture/framework/system-design/storage#storage-type) .\n- Choose [storage access patterns and workload types](/architecture/framework/system-design/storage#workload-type) .\nExplore other categories in the [Architecture Framework](/architecture/framework) such as reliability, operational excellence, and security, privacy, and compliance.", "guide": "Docs"}