{"title": "Docs - Design for environmental sustainability", "url": "https://cloud.google.com/architecture/framework/system-design/sustainability", "abstract": "# Docs - Design for environmental sustainability\nLast reviewed 2023-08-05 UTC\nThis document in the [Google Cloud Architecture Framework](/architecture/framework) summarizes how you can approach environmental sustainability for your workloads in Google Cloud. It includes information about how to minimize your carbon footprint on Google Cloud.\n", "content": "## Understand your carbon footprint\nTo understand the carbon footprint from your Google Cloud usage, use the [Carbon Footprint](/carbon-footprint) dashboard. The Carbon Footprint dashboard attributes emissions to the Google Cloud projects that you own and the cloud services that you use.\nFor more information, see [Understand your carbon footprint](/architecture/reduce-carbon-footprint#understand_your_carbon_footprint) in \"Reduce your Google Cloud carbon footprint.\"\n## Choose the most suitable cloud regions\nOne simple and effective way to reduce carbon emissions is to choose cloud regions with lower carbon emissions. To help you make this choice, Google publishes carbon data for all Google Cloud regions.\nWhen you choose a region, you might need to balance lowering emissions with other requirements, such as pricing and network latency. To help select a region, use the [Google Cloud Region Picker](https://cloud.withgoogle.com/region-picker/) .\nFor more information, see [Choose the most suitable cloud regions](/architecture/reduce-carbon-footprint#choose_the_most_suitable_cloud_regions) in \"Reduce your Google Cloud carbon footprint.\"\n## Choose the most suitable cloud services\nTo help reduce your existing carbon footprint, consider migrating your on-premises VM workloads to [Compute Engine](/compute) .\nAlso consider that many workloads don't require VMs. Often you can utilize a serverless offering instead. These managed services can optimize cloud resource usage, often automatically, which simultaneously reduces cloud costs and carbon footprint.\nFor more information, see [Choose the most suitable cloud services](/architecture/reduce-carbon-footprint#choose_the_most_suitable_cloud_services) in \"Reduce your Google Cloud carbon footprint.\"\n## Minimize idle cloud resources\nIdle resources incur unnecessary costs and emissions. Some common causes of idle resources include the following:\n- Unused active cloud resources, such as [idle VM instances](/compute/docs/instances/viewing-and-applying-idle-vm-recommendations) .\n- Over-provisioned resources, [such as larger VM instances](/compute/docs/instances/apply-machine-type-recommendations-for-instances) machine types than necessary for a workload.\n- Non-optimal architectures, such as [lift-and-shift](/architecture/migration-to-gcp-getting-started#lift_and_shift) migrations that aren't always optimized for efficiency. Consider making incremental improvements to these architectures.\nThe following are some general strategies to help minimize wasted cloud resources:\n- Identify idle or overprovisioned resources and either delete them or rightsize them.\n- Refactor your architecture to incorporate a more optimal design.\n- Migrate workloads to managed services.\nFor more information, see [Minimize idle cloud resources](/architecture/reduce-carbon-footprint#minimize_idle_cloud_resources) in \"Reduce your Google Cloud carbon footprint.\"\n## Reduce emissions for batch workloads\nRun batch workloads in regions with lower carbon emissions. For further reductions, run workloads at times that coincide with lower grid carbon intensity when possible.\nFor more information, see [Reduce emissions for batch workloads](/architecture/reduce-carbon-footprint#reduce_emissions_for_batch_workloads) in \"Reduce your Google Cloud carbon footprint.\"\n## What's next\n- Learn how to use [Carbon Footprint data](/carbon-footprint) to measure, report, and reduce your cloud carbon emissions.\n- Learn how to [reduce your Google Cloud carbon footprint](/architecture/reduce-carbon-footprint) .", "guide": "Docs"}