{"title": "Docs - Google Cloud multicloud deployment archetype", "url": "https://cloud.google.com/architecture/deployment-archetypes/multicloud", "abstract": "# Docs - Google Cloud multicloud deployment archetype\nLast reviewed 2023-11-03 UTC\nThis section of the [Google Cloud deployment archetypes](/architecture/deployment-archetypes) guide describes the multicloud deployment archetype, provides examples of use cases, and discusses design considerations.\nIn an architecture that uses the multicloud deployment archetype, some parts of the application run in Google Cloud while others are deployed in other cloud platforms.\n", "content": "## Use cases\nThe following sections provide examples of use cases for which the multicloud deployment archetype is an appropriate choice.\n**Note:** For each of these use cases, the architecture in each cloud can use the zonal, regional, multi-regional, or global deployment archetype.\n### Google Cloud as the primary site and another cloud as a DR site\nTo manage disaster recovery (DR) for mission-critical applications in Google Cloud, you can back up the data and maintain a passive replica in another cloud platform, as shown in the following diagram. If the application in Google Cloud is down, you can use the external replica to restore the application to production.### Enhancing applications with Google Cloud capabilities\nGoogle Cloud offers advanced capabilities in areas like storage, artificial intelligence (AI) and machine learning (ML), big data, and analytics. The multicloud deployment archetype lets you take advantage of these advanced capabilities in Google Cloud for applications that you want to run on other cloud platforms. The following are examples of these capabilities:\n- Low-cost, unlimited [archive storage](/storage) .\n- [AI and ML](/products/ai) applications for data generated by applications deployed in other cloud platforms.\n- Data warehousing and analytics processes using [BigQuery](/bigquery/docs/introduction) for data ingested from applications that run in other cloud platforms.\nThe following diagram shows a multicloud topology that enhances an application running on another cloud platform with advanced data-processing capabilities in Google Cloud.### More information\nFor more information about the rationale and use cases for the multicloud deployment archetype, see [Build hybrid and multicloud architectures using Google Cloud](/architecture/hybrid-multicloud-patterns) .\n## Design considerations\nWhen you build an architecture that's based on the multicloud deployment archetype, consider the following design factors.\n### Cost of redundant resources\nA multicloud architecture often costs more than an architecture where the application runs entirely in Google Cloud, due to the following factors:\n- Data might need to be stored redundantly within each cloud rather than in a single cloud. The storage and data transfer costs might be higher.\n- If an application runs in multiple cloud platforms, some of the redundant resources might be underutilized, leading to higher overall cost of the deployment.\n### Inter-cloud connectivity\nFor efficient network communication between your resources in multiple cloud platforms, you need secure and reliable cross-cloud connectivity. For example, you can use Google Cloud [Cross-Cloud Interconnect](/network-connectivity/docs/interconnect/concepts/cci-overview) to establish high-bandwidth dedicated connectivity between Google Cloud and another cloud service provider. For more information, see [Patterns for connecting other cloud service providers with Google Cloud](/architecture/patterns-for-connecting-other-csps-with-gcp) .\n### Setup effort and operational complexity\nSetting up and operating a multicloud topology requires significantly more effort than an architecture that uses only Google Cloud:\n- Security features and tools aren't standard across cloud platforms. Your security administrators need to learn the skills and knowledge that are necessary to manage security for resources distributed across all the cloud platforms that you use.\n- You need to efficiently provision and manage resources across multiple public cloud platforms. Tools like Terraform can help reduce the effort to provision and manage resources. To manage containerized multicloud applications, you can use [GKE Enterprise](/anthos) , which is a cross-cloud orchestration platform.## Example architectures\nFor examples of architectures that use the multicloud deployment archetype, see [Build hybrid and multicloud architectures using Google Cloud](/architecture/hybrid-multicloud-patterns) .", "guide": "Docs"}