{"title": "Docs - Security principles", "url": "https://cloud.google.com/architecture/framework/security/security-principles", "abstract": "# Docs - Security principles\nLast reviewed 2023-08-05 UTC\nThis document in the [Google Cloud Architecture Framework](/architecture/framework) explains core principles for running secure and compliant services on Google Cloud. Many of the security principles that you're familiar with in your on-premises environment apply to cloud environments.\n", "content": "## Build a layered security approach\nImplement security at each level in your application and infrastructure by applying a defense-in-depth approach. Use the features in each product to limit access and configure encryption where appropriate.\n## Design for secured decoupled systems\nSimplify system design to accommodate flexibility where possible, and document security requirements for each component. Incorporate a robust secured mechanism to account for resiliency and recovery.\n## Automate deployment of sensitive tasks\nTake humans out of the workstream by [automating deployment](/architecture/migration-to-google-cloud-automated-containerized-deployments) and other admin tasks.\n## Automate security monitoring\nUse automated tools to monitor your application and infrastructure. To scan your infrastructure for vulnerabilities and detect security incidents, use automated scanning in your continuous integration and continuous deployment (CI/CD) pipelines.\n## Meet the compliance requirements for your regions\nBe mindful that you might need to obfuscate or redact personally identifiable information (PII) to meet your regulatory requirements. Where possible, automate your compliance efforts. For example, use Sensitive Data Protection and Dataflow to [automate the PII redaction job](/architecture/de-identification-re-identification-pii-using-cloud-dlp) before new data is stored in the system.\n## Comply with data residency and sovereignty requirements\nYou might have internal (or external) requirements that require you to control the locations of data storage and processing. These requirements vary based on systems design objectives, industry regulatory concerns, national law, tax implications, and culture. Data residency describes where your data is stored. To help comply with data residency requirements, Google Cloud lets you control where data is stored, how data is accessed, and how it's processed.\n## Shift security left\nDevOps and deployment automation let your organization increase the velocity of delivering products. To help ensure that your products remain secure, [incorporate security processes](https://dora.dev/devops-capabilities/technical/shifting-left-on-security/) from the start of the development process. For example, you can do the following:\n- Test for security issues in code early in the deployment pipeline.\n- [Scan container images](/blog/products/identity-security/scan-for-vulnerabilities-early-to-shift-security-left-in-cicd) and the cloud infrastructure on an ongoing basis.\n- Automate detection of misconfiguration and security anti-patterns. For example, use automation to look for secrets that are hard-coded in applications or in configuration.## What's next\nLearn more about core security principles with the following resources:\n- [Manage risks with controls](/architecture/framework/security/risk-management) (next document in this series)\n- [Google Cloud enterprise foundations blueprint](/architecture/security-foundations) \n- [Google security paper](/security/overview/whitepaper) \n- [Google Infrastructure Security Design Overview](/security/infrastructure/design) \n- [Build a collaborative incident management process](/architecture/framework/reliability/build-incident-management-process) \n- [Deployable blueprints for industries](/security/best-practices#:%7E:text=Deployable%20blueprints%20for%20industries)", "guide": "Docs"}