{"title": "Docs - Google Cloud Architecture Framework: System design", "url": "https://cloud.google.com/architecture/framework/system-design", "abstract": "# Docs - Google Cloud Architecture Framework: System design\nLast reviewed 2023-08-05 UTC\nSystem design is the foundational category of the [Google Cloud Architecture Framework](/architecture/framework) . This category provides design recommendations and describes best practices and principles to help you define the architecture, components, modules, interfaces, and data on a cloud platform to satisfy your system requirements. You also learn about Google Cloud products and features that support system design.\nThe documents in the system design category assume that you understand basic system design principles. These documents don't assume that you are familiar with cloud concepts and Google Cloud products.\nFor complex cloud migration and deployment scenarios, we recommend that you use [Google Cloud consulting services](/consulting) . Our consultants provide expertise on best practices and guiding principles to help you succeed in your cloud journey. Google Cloud also has a strong ecosystem of [partners](/partners) , from large global systems integrators to partners with a deep specialization in a particular area like machine learning. We recommend that you engage Google Cloud partners to accelerate your digital transformation and improve business outcomes.\n**Note:** Before you change your production environment, we recommend that you experiment with new features or design in a sandbox environment.\nIn the system design category of the Architecture Framework, you learn to do the following:\n- [Apply core principles of system design](/architecture/framework/system-design/principles) .\n- [Select geographic regions to support your business applications](/architecture/framework/system-design/geographic-zones-regions) .\n- [Manage cloud resources](/architecture/framework/system-design/resource-management) .\n- [Choose and manage compute](/architecture/framework/system-design/compute) .\n- [Design your network infrastructure](/architecture/framework/system-design/networking) .\n- [Select and implement a storage strategy](/architecture/framework/system-design/storage) .\n- [Optimize your database](/architecture/framework/system-design/databases) .\n- [Analyze your data](/architecture/framework/system-design/data-analytics) .\n- [Implement machine learning](/architecture/framework/system-design/ai-ml) .\n- [Design your cloud workloads for sustainability](/architecture/framework/system-design/sustainability) ", "content": ".", "guide": "Docs"}