{"title": "Docs - Secure your network", "url": "https://cloud.google.com/architecture/framework/security/network-security", "abstract": "# Docs - Secure your network\nLast reviewed 2023-06-09 UTC\nThis document in the [Google Cloud Architecture Framework](/architecture/framework) provides best practices for securing your network.\nExtending your existing network to include cloud environments has many implications for security. Your on-premises approach to multi-layered defenses likely involves a distinct perimeter between the internet and your internal network. You probably protect the perimeter by using physical firewalls, routers, intrusion detection systems, and so on. Because the boundary is clearly defined, you can easily monitor for intrusions and respond accordingly.\nWhen you move to the cloud (either completely or in a hybrid approach), you move beyond your on-premises perimeter. This document describes ways that you can continue to secure your organization's data and workloads on Google Cloud. As mentioned in [Manage risks with controls](/architecture/framework/security/risk-management#manageriskscontrols) , how you set up and secure your Google Cloud network depends on your business requirements and risk appetite.\nThis section assumes that you have read the [Networking](/architecture/framework/system-design/networking) section in the [System design](/architecture/framework/system-design) category, and that you've already created a basic architecture diagram of your Google Cloud network components. For an example diagram, see [Hub-and-spoke](/architecture/security-foundations/networking#hub-spoke-network-topology) .\n", "content": "## Deploy zero trust networks\nMoving to the cloud means that your network trust model must change. Because your users and your workloads are no longer behind your on-premises perimeter, you can't use perimeter protections in the same way to create a trusted, inner network. The means that no one is trusted by default, whether they are inside or outside of your organization's network. When verifying access requests, the zero trust security model requires you to check both the user's identity and context. Unlike a VPN, you shift access controls from the network perimeter to the users and devices.\nIn Google Cloud, you can use [BeyondCorp Enterprise](/beyondcorp) as your zero trust solution. BeyondCorp Enterprise provides [threat and data protection](https://support.google.com/a/answer/10104463) and additional [access controls](/beyondcorp-enterprise/docs/access-protection) . For more information about how to set it up, see [Getting started with BeyondCorp Enterprise](/beyondcorp-enterprise/docs/apply-resources) .\nIn addition to BeyondCorp Enterprise, Google Cloud includes [Identity-Aware Proxy (IAP)](/iap) . IAP lets you extend zero trust security to your applications both within Google Cloud and on-premises. IAP uses access control policies to provide authentication and authorization for users who access your applications and resources.\n## Secure connections to your on-premises or multi-cloud environments\nMany organizations have workloads both in cloud environments and on-premises. In addition, for resiliency, some organizations use multi-cloud solutions. In these scenarios, it's critical to secure your connectivity between all of your environments.\nGoogle Cloud includes [private access methods for VMs](/vpc/docs/private-access-options) that are supported by [Cloud VPN](/network-connectivity/docs/vpn/concepts/overview) or [Cloud Interconnect](/network-connectivity/docs/interconnect/concepts/overview) , including the following:\n- Use [Cross-Cloud Interconnect](/network-connectivity/docs/interconnect/concepts/cci-overview) , as a managed service, to link your VPC networks to other [supported cloudproviders](/network-connectivity/docs/interconnect/concepts/cci-overview#supported-cloud-service-providers) over high-speed direct connections. With Cross-Cloud Interconnect, you don't have to supply your own router or work with a third-party vendor.\n- Use [Dedicated Interconnect and Partner Interconnect](/network-connectivity/docs/interconnect/concepts/overview) to link your VPC networks to your on-premises data center or to other cloud providers over high-speed direct connections.\n- Use IPsec VPNs to link your [Virtual Private Cloud (VPC) networks](/vpc/docs) to your on-premises data center or to other cloud providers.\n- Use [Private Service Connect endpoints to access published services](/vpc/docs/about-accessing-vpc-hosted-services-endpoints) that are provided by your organization or by another provider.\n- Use [Private Service Connect endpoints to let your VMs access GoogleAPIs](/vpc/docs/about-accessing-google-apis-endpoints) by using internal IP addresses. With Private Service Connect, your VMs don't have to have external IP addresses in order to access Google services.\n- If you use [GKE Enterprise](/anthos) , consider [Anthos Service Mesh egress gateways](/service-mesh/docs/security/egress-gateway-gke-tutorial) . If you're not using [GKE Enterprise](/anthos) , use a third-party option.\nFor a comparison between the products, see [Choosing a Network Connectivity product](/network-connectivity/docs/how-to/choose-product#compare-interconnect-solutions) .\n## Disable default networks\nWhen you create a new Google Cloud project, a default Google Cloud [VPC](/vpc/docs) network with [auto mode](/vpc/docs/subnets#ip-ranges) IP addresses and [pre-populated firewall rules](/vpc/docs/firewalls#more_rules_default_vpc) is automatically provisioned. For production deployments, we recommend that you [delete the default networks](/vpc/docs/create-modify-vpc-networks#deleting_a_network) in existing projects, and [disable the creation of default networks](/vpc/docs/vpc#default-network) in new projects.\nVirtual Private Cloud networks let you use any internal IP address. To avoid IP address conflicts, we recommend that you first plan your network and IP address allocation across your connected deployments and across your projects. A project allows multiple VPC networks, but it's usually a best practice to limit these networks to one per project in order to enforce access control effectively.\n## Secure your perimeter\nIn Google Cloud, you can use various methods to segment and secure your cloud perimeter, including firewalls and [VPC Service Controls](/vpc-service-controls/docs) .\nUse [Shared VPC](/vpc/docs/shared-vpc) to build a production deployment that gives you a single shared network and that isolates workloads into individual projects that can be managed by different teams. Shared VPC provides centralized deployment, management, and control of the network and network security resources across multiple projects. Shared VPC consists of host and service projects that perform the following functions:\n- A host project contains the networking and network security-related resources, such as VPC networks, subnets, firewall rules, and hybrid connectivity.\n- A service project attaches to a host project. It lets you isolate workloads and users at the project level by using Identity and Access Management (IAM), while it shares the networking resources from the centrally managed host project.\nDefine [firewall policies and rules](/firewall/docs/about-firewalls) at the organization, folder, and VPC network level. You can configure firewall rules to permit or deny traffic to or from VM instances. For examples, see [Global and regional network firewall policy examples](/firewall/docs/network-firewall-policy-examples) and [Hierarchical firewall policy examples](/firewall/docs/firewall-policies-examples) . In addition to defining rules based on IP addresses, protocols, and ports, you can manage traffic and apply firewall rules based on the [service account](/vpc/docs/firewalls#service-accounts-vs-tags) that's used by a VM instance or by using [secure tags](/firewall/docs/tags-firewalls-overview) .\nTo control the movement of data in Google services and to set up context-based perimeter security, consider VPC Service Controls. VPC Service Controls provides an extra layer of security for Google Cloud services that's independent of IAM and firewall rules and policies. For example, VPC Service Controls lets you set up perimeters between confidential and non-confidential data so that you can apply controls that help prevent data exfiltration.\nUse [Google Cloud Armor security policies](/armor/docs/security-policy-overview) to allow, deny, or redirect requests to your external Application Load Balancer at the Google Cloud edge, as close as possible to the source of incoming traffic. These policies prevent unwelcome traffic from consuming resources or entering your network.\nUse [Secure Web Proxy](/secure-web-proxy/docs/overview) to apply granular access policies to your egress web traffic and to monitor access to untrusted web services.\n## Inspect your network traffic\nYou can use Cloud IDS and Packet Mirroring to help you ensure the security and compliance of workloads running in [Compute Engine](/compute) and [Google Kubernetes Engine (GKE)](/kubernetes-engine) .\nUse [Cloud Intrusion Detection System](/ids) (currently in preview) to get visibility in to the traffic moving into and out of your VPC networks. Cloud IDS creates a Google-managed peered network that has mirrored VMs. [Palo Alto Networks threat protection technologies](https://www.paloaltonetworks.com/products/secure-the-network/subscriptions/threat-prevention) mirror and inspect the traffic. For more information, see [Cloud IDS overview](/intrusion-detection-system/docs/overview) .\n[Packet Mirroring](/vpc/docs/packet-mirroring) clones traffic of specified VM instances in your VPC network and forwards it for collection, retention, and examination. After you configure Packet Mirroring, you can use Cloud IDS or third-party tools to collect and inspect network traffic at scale. Inspecting network traffic in this way helps provide intrusion detection and application performance monitoring.\n## Use a web application firewall\nFor external web applications and services, you can enable [Google Cloud Armor](/armor/docs/cloud-armor-overview) to provide distributed denial-of-service (DDoS) protection and web application firewall (WAF) capabilities. Google Cloud Armor supports Google Cloud workloads that are exposed using external HTTP(S) load balancing, TCP Proxy load balancing, or SSL Proxy load balancing.\nGoogle Cloud Armor is offered in two service tiers, Standard and [Managed Protection Plus](/armor/docs/managed-protection-overview) . To take full advantage of advanced Google Cloud Armor capabilities, you should invest in Managed Protection Plus for your key workloads.\n## Automate infrastructure provisioning\nAutomation lets you create immutable infrastructure, which means that it can't be changed after provisioning. This measure gives your operations team a known good state, fast rollback, and troubleshooting capabilities. For automation, you can use tools such as Terraform, Jenkins, and [Cloud Build](/build/docs/overview) .\nTo help you build an environment that uses automation, Google Cloud provides a series of [security blueprints](/security/best-practices) that are in turn built on the [enterprise foundations blueprint](/architecture/security-foundations) . The security foundations blueprint provides Google's opinionated design for a secure application environment and describes step by step how to configure and deploy your Google Cloud estate. Using the instructions and the scripts that are part of the security foundations blueprint, you can configure an environment that meets our security best practices and guidelines. You can build on that blueprint with additional blueprints or design your own automation.\nFor more information about automation, see [Use a CI/CD pipeline for data-processing workflows](/architecture/cicd-pipeline-for-data-processing) .\n## Monitor your network\nMonitor your network and your traffic using telemetry.\n[VPC Flow Logs](/vpc/docs/flow-logs) and [Firewall Rules Logging](/vpc/docs/firewall-rules-logging) provide near real-time visibility into the traffic and firewall usage in your Google Cloud environment. For example, [Firewall Rules Logging](/vpc/docs/firewall-rules-logging) logs traffic to and from Compute Engine VM instances. When you combine these tools with [Cloud Logging](/logging/docs) and [Cloud Monitoring](/monitoring/docs) , you can track, alert, and visualize traffic and access patterns to improve the operational security of your deployment.\n[Firewall Insights](/network-intelligence-center/docs/firewall-insights/concepts/overview) lets you review which firewall rules matched incoming and outgoing connections and whether the connections were allowed or denied. The [shadowed rules feature](/network-intelligence-center/docs/firewall-insights/concepts/overview#shadowed-firewall-rules) helps you tune your firewall configuration by showing you which rules are never triggered because another rule is always triggered first.\nUse [Network Intelligence Center](/network-intelligence-center/docs) to see how your network topology and architecture are performing. You can get detailed insights into network performance and you can then optimize your deployment to eliminate any bottlenecks in your service. [Connectivity Tests](/network-intelligence-center/docs/connectivity-tests/concepts/overview) provide you with insights into the firewall rules and policies that are applied to the network path.\nFor more information about monitoring, see [Implement logging and detective controls](/architecture/framework/security/logging-detection) .\n## What's next\nLearn more about network security with the following resources:\n- [Implement data security](/architecture/framework/security/data-security) (next document in this series)\n- [Best practices and reference architectures for VPC design](/solutions/best-practices-vpc-design) \n- [IAM roles for administering VPC Service Controls](/vpc-service-controls/docs/access-control) \n- [Onboarding as a Security Command Center partner](/security-command-center/docs/how-to-partner-onboard) \n- [Viewing vulnerabilities and threats in Security Command Center](/security-command-center/docs/how-to-view-vulnerabilities-threats) \n- [Packet Mirroring: Visualize and protect your cloud network](/blog/products/networking/packet-mirroring-visualize-and-protect-your-cloud-network) \n- [Using Packet Mirroring for intrusion detection](/vpc/docs/packet-mirroring#enterprise_security) \n- [Using Packet Mirroring with a partner IDS solution](https://live.paloaltonetworks.com/t5/community-blogs/vm-series-now-integrates-with-gcp-packet-mirroring/ba-p/302784)", "guide": "Docs"}