{"title": "Docs - Implement privacy requirements", "url": "https://cloud.google.com/architecture/framework/security/privacy", "abstract": "# Docs - Implement privacy requirements\nLast reviewed 2023-08-08 UTC\nThis document in the [Google Cloud Architecture Framework](/architecture/framework) provides best practices for implementing privacy requirements.\nPrivacy regulations help define how you can obtain, process, store, and manage your users' data. Many privacy controls (for example, controls for cookies, session management, and obtaining user permission) are your responsibility because you own your data (including the data that you receive from your users).\nGoogle Cloud includes the following controls that promote privacy:\n- Default encryption of all data when it's at rest, when it's in transit, and while it's being processed.\n- Safeguards against insider access.\n- Support for numerous privacy regulations.\nFor more information, see [Google Cloud Privacy Commitments](/security/privacy) .\n", "content": "## Classify your confidential data\nYou must define what data is confidential and then ensure that the confidential data is properly protected. Confidential data can include credit card numbers, addresses, phone numbers, and other personal identifiable information (PII).\nUsing [Sensitive Data Protection](/dlp) , you can set up appropriate classifications. You can then tag and tokenize your data before you store it in Google Cloud. For more information, see [Automatically classify your data](/architecture/framework/security/data-security#dataautoclass) .\n## Lock down access to sensitive data\nPlace sensitive data in its own service perimeter using VPC Service Controls, and set Google Identity and Access Management (IAM) access controls for that data. Configure multi-factor authentication (MFA) for all users who require access to sensitive data.\nFor more information, see [Control movement of data across perimeters](/architecture/framework/security/app-security#controlmovement) and [Set up SSO and MFA](/architecture/framework/security/identity-access#ssomfa) .\n## Monitor for phishing attacks\nEnsure that your email system is configured to protect against phishing attacks, which are often used for fraud and malware attacks.\nIf your organization uses Gmail, you can use [advanced phishing and malware protection](https://support.google.com/a/answer/9157861) . This collection of settings provides controls to quarantine emails, defends against anomalous attachment types, and helps protect against from inbound spoofing emails. [Security Sandbox](https://support.google.com/a/answer/7676854) detects malware in attachments. Gmail is continually and automatically updated with the latest security improvements and protections to help keep your organization's email safe.\n## Extend zero trust security to your hybrid workforce\nA zero trust security model means that no one is trusted implicitly, whether they are inside or outside of your organization's network. When your IAM systems verify access requests, a zero trust security posture means that the user's identity context (for example, their IP address or location) are considered. Unlike a VPN, zero trust security shifts access controls from the network perimeter to users and their devices. Zero trust security allows users to work more securely from any location. For example, users can access your organization's resources from their laptops or mobile devices while at home.\nOn Google Cloud, you can configure [BeyondCorp Enterprise](/beyondcorp-enterprise) and [Identity-Aware Proxy (IAP)](/iap) to enable zero trust for your Google Cloud resources. If your users use Google Chrome and you enable BeyondCorp Enterprise, you can [integrate zero-trust security into your users browsers](https://support.google.com/a/answer/10104463) .\n## What's next\nLearn more about security and privacy with the following resources:\n- [Implement logging and detective controls](/architecture/framework/security/logging-detection) (next document in this series)\n- [Privacy Center](/privacy) \n- [Google Cloud Privacy Notice](/terms/cloud-privacy-notice) \n- [Privacy best practices when working with Google Cloud Support](https://support.google.com/a/answer/10985601) \n- [How Google protects your organization's security and privacy](https://support.google.com/a/answer/60762) \n- [Privacy FAQ](https://support.google.com/googlecloud/answer/6056650)", "guide": "Docs"}