{"title": "Docs - Google Cloud Architecture Framework: Performance optimization", "url": "https://cloud.google.com/architecture/framework/performance-optimization", "abstract": "# Docs - Google Cloud Architecture Framework: Performance optimization\nLast reviewed 2023-07-11 UTC\nThis category in the [Google Cloud Architecture Framework](/architecture/framework) describes the performance optimization process and best practices to optimize the performance of workloads in Google Cloud.\nThe information in this document is intended for architects, developers, and administrators who plan, design, deploy, and manage workloads in Google Cloud.\nOptimizing the performance of workloads in the cloud can help your organization operate efficiently, improve customer satisfaction, increase revenue, and reduce cost. For example, when the backend processing time of an application decreases, users experience faster response times, which can lead to higher user retention and more revenue.\nThere might be trade-offs between performance and cost. But sometimes, optimizing performance can help you reduce cost. ​​For example, autoscaling helps provide predictable performance when the load increases by ensuring that the resources aren't overloaded. Autoscaling also helps you reduce cost during periods of low load by removing unused resources.\nIn this category of the Architecture Framework, you learn to do the following:\n- [Implement the performance optimization process](/architecture/framework/performance-optimization/process) .\n- [Monitor and analyze performance](/architecture/framework/performance-optimization/monitor) .\n- [Optimize compute performance](/architecture/framework/performance-optimization/compute) .\n- [Optimize storage performance](/architecture/framework/performance-optimization/storage) .\n- [Optimize networking performance](/architecture/framework/performance-optimization/networking) .\n- [Optimize database performance](/architecture/framework/performance-optimization/databases) .\n- [Optimize analytics performance](/architecture/framework/performance-optimization/analytics) ", "content": ".", "guide": "Docs"}