{"title": "Docs - Optimize cost: Cloud operations", "url": "https://cloud.google.com/architecture/framework/cost-optimization/cloudops", "abstract": "# Docs - Optimize cost: Cloud operations\nLast reviewed 2023-06-15 UTC\nThis document in the [Google Cloud Architecture Framework](/architecture/framework) provides recommendations to help you optimize the cost of monitoring and managing your resources in Google Cloud.\nThe guidance in this section is intended for cloud users who are responsible for monitoring and controlling the usage and cost of their organization's resources in the cloud.\nGoogle Cloud Observability is a collection of managed services that you can use to monitor, troubleshoot, and improve the performance of your workloads in Google Cloud. These services include Cloud Monitoring, Cloud Logging, Error Reporting, Cloud Trace, and Cloud Profiler. One of the benefits of managed services in Google Cloud is that the services are usage-based. You pay only for what you use and by the volume of data, with free monthly data-usage allotments, and unlimited access to Google Cloud metrics and audit logs.\n", "content": "## Cloud Logging\nThe following are recommendations to help you optimize the cost of your Logging operations:\n- Filter billing reports to show Logging costs.\n- Reduce the volume of logs ingested and stored, by [excluding or filtering unnecessary log entries](/logging/docs/exclusions) .\n- Verify whether the exclusion filters are adequate by [monitoring](/monitoring/api/metrics_gcp#gcp-logging) the`billing/bytes_ingested`and`billing/monthly_bytes_ingested`metrics in the Google Cloud console.\n- Offload and [export logs to lower-cost storage](/logging/docs/routing/overview) .\n- When streaming logs from third-party applications, reduce log volumes by using the [logging agent](/logging/docs/agent) on only production instances or by configuring it to send less data.## Cloud Monitoring\nThe following are recommendations to help you optimize the cost of your Monitoring operations:\n- Optimize metrics and label usage by limiting the number of labels. Avoid labels with high cardinality. For example, if you use an IP address as a label, each IP address would have a one-item label series, resulting in numerous labels when you have many VMs.\n- Reduce the volume of detailed metrics for applications that don't require these metrics, or remove the monitoring agent, especially for nonessential environments.\n- Minimize the ingestion volume by reducing the number of custom metrics that your application sends.## Cloud Trace\nThe following are recommendations to help you optimize the cost of your Trace operations:\n- If you use Trace as an export destination for your OpenCensus traces, reduce the volume of traces that are ingested, by using the sampling feature in [OpenCensus](https://opencensus.io/tracing/sampling/) .\n- Limit the usage of Trace, and control cost by using quotas. You can enforce span quotas using the API-specific quota page in the Google Cloud console.## What's next\n- [Optimize costs for Google Cloud Observability](/architecture/stackdriver-cost-optimization) \n- Video: [Manage costs for Google Cloud Observability](https://www.youtube.com/watch?v=vgluz-Tv2qY) \n- Optimize cost for compute services, storage, databases, and networking:- [Optimize cost: Compute, containers, and serverless](/architecture/framework/cost-optimization/compute) \n- [Optimize cost: Storage](/architecture/framework/cost-optimization/storage) \n- [Optimize cost: Databases and smart analytics](/architecture/framework/cost-optimization/databases) \n- [Optimize cost: Networking](/architecture/framework/cost-optimization/networking) \n- Explore the other categories of the [Google Cloud Architecture Framework](/architecture/framework)", "guide": "Docs"}