{"title": "Docs - Building custom data integrations using Fivetran and Cloud Functions", "url": "https://cloud.google.com/architecture/partners/building-custom-data-integrations-using-fivetran-and-cloud-functions?hl=zh-cn", "abstract": "# Docs - Building custom data integrations using Fivetran and Cloud Functions\nLast reviewed 2022-11-28 UTC\nBy Charles Wang (Product Evangelist), and Brenner Heintz (Technical Product Marketing Manager), [Fivetran](https://fivetran.com/) \nThis tutorial shows you how to use the Fivetran connector for [Cloud Functions](/functions/docs) . It's intended for analysts, data scientists, and data engineers who integrate data.\nFivetran offers standardized data connectors for a wide range of business applications, event trackers, file stores, and databases, but you might not find a connector for a specific or obscure data source. The [Fivetran connector for Cloud Functions](https://console.cloud.google.com/marketplace/details/fivetran-bq-dts/google-cloud-functions?q=fivetran&id=9d0382cd-f8bc-4785-b3c5-b40039ba4211) offers you a way to augment your pipeline with custom data integrations while retaining the benefits of automated, cloud-based infrastructure.\nIn particular, the Fivetran [connector for Cloud Functions](https://fivetran.com/docs/functions/google-cloud-functions) lets you do the following:- Write your own scripts to extract and process data from API endpoints and files.\n- Host the scripts on a serverless computing platform.\n- Schedule automatic syncing and deduplication.\nThis tutorial assumes you have a working knowledge of the following:- API endpoints\n- Python 3.10 or later\n- `.json`\n- BigQuery\n", "content": "## ArchitectureThe following diagram illustrates the architecture of the Fivetran connector for Cloud Functions.\n \nWith this configuration, unsupported applications and custom file formats can supplement the usual suite of standardized connectors for business applications, databases, files, and event trackers. Instead of a direct connection to the data pipeline, unsupported applications and file formats must be ingested by using custom code that you write and maintain.## Objectives\n- Get credentials for the data source, Yelp Business Search.\n- Create a Cloud Storage bucket.\n- Create a Cloud Function.\n- Create a BigQuery dataset.\n- Set up the Cloud Functions connector on Fivetran.\n## CostsIn this document, you use the following billable components of Google Cloud:- [Cloud Storage](/storage/pricing) \n- [Cloud Functions](/functions/pricing) \n- [BigQuery](/bigquery/pricing) The [Fivetran free trial](https://fivetran.com/signup) lasts 14 days. [Pricing by Fivetran](https://fivetran.com/pricing) is based on the features and connectors you select, and is contracted and invoiced annually. This pricing structure helps to ensure that your annual cost remains stable and predictable, regardless of data volume. The exact cost is tailored per customer.\nTo generate a cost estimate based on your projected usage,  use the [pricing calculator](/products/calculator) . \nWhen you finish the tasks that are described in this document, you can avoid continued billing by deleting the resources that you created. For more information, see [Clean up](#clean-up) .## Before you begin- Make sure that you have the [Cloud Functions Developer role](/functions/docs/reference/iam/roles) . For more information, see [Understanding roles](/iam/docs/understanding-roles) .## The Yelp Business Search endpointSuppose you wanted to use the Yelp Business Search endpoint to search for [makerspaces](https://makerspaces.make.co/) near San Francisco (you can, obviously, substitute any type of business and any location). If you call the Yelp Business Search endpoint, it returns the following list of business profiles in `.json` :\n```\n{  \"businesses\": [    {      \"id\": \"8nVI-kU5JlAP4EIzIVtwlQ\",      \"alias\": \"noisebridge-san-francisco\",      \"name\": \"Noisebridge\",      \"image_url\": \"https:\\/\\/s3-media1.fl.yelpcdn.com\\/bphoto\\/RBhhlYAl4cVcMc-upiBcZA\\/o.jpg\",      \"is_closed\": false,      \"url\": \"https:\\/\\/www.yelp.com\\/biz\\/noisebridge-san-francisco?adjust_creative=x8TUK-FIcJqcb_Q262-Stw&utm_campaign=yelp_api_v3&utm_medium=api_v3_business_search&utm_source=x8TUK-FIcJqcb_Q262-Stw\",      \"review_count\": 32,      \"categories\": [        {          \"alias\": \"nonprofit\",          \"title\": \"Community Service\\/Non-Profit\"        },        {          \"alias\": \"makerspaces\",          \"title\": \"Makerspaces\"        }      ],      \"rating\": 4.5,      \"coordinates\": {        \"latitude\": 37.76238,        \"longitude\": -122.41905      },      \"location\": {        \"address1\": \"2169 Mission St\",        \"address2\": \"\",        \"address3\": \"\",        \"city\": \"San Francisco\",        \"zip_code\": \"94110\",        \"country\": \"US\",        \"state\": \"CA\",        \"display_address\": [          \"2169 Mission St\",          \"San Francisco, CA 94110\"        ]      },      \"phone\": \"\",      \"display_phone\": \"\",      \"distance\": 1525.9308928508    },    {      \"id\": \"ri9lRarikS9fswsFWCt-FA\",    }}\n```\nIn the preceding file, each business has a list of categories nested within it. To ingest this data, you need to create two tables—one containing business profiles and another mapping categories to businesses.## Getting credentials for the data sourceFivetran doesn't support the Yelp [Business Search](https://www.yelp.com/developers/documentation/v3/business_search) API, but there are plenty of reasons your organization might want to identify nearby potential competitors, partners, and customers.\nYou need credentials from Yelp in the form of a client ID and API key.- In a browser window, [Create an account for Yelp](https://www.yelp.com/signup) .\n- [Create an application with Yelp](https://www.yelp.com/developers/v3/manage_app) .Make a note of your client ID and API key because you need them later in the tutorial.\n## Creating a Cloud Storage bucketYou create a Cloud Storage bucket to manage authorization for the Cloud Function.- In the Google Cloud console, go the **Browser** page. [Go to browser](https://console.cloud.google.com/storage/) \n- Click **Create Bucket** .\n- In the name field, enter a unique name for your Cloud Storage bucket.\n- Click **Create** .\n## Creating and testing a Cloud FunctionYou create and configure a Cloud Function in Google Cloud before setting up the Fivetran connector. Test the Cloud Function to make sure that you are receiving the correct outputs.\n### Create a Cloud Function\n- In the Google Cloud console, go to the Cloud Functions page. [Go to Cloud functions](https://console.cloud.google.com/functions) \n- Click **Create function** .\n- In the **Name** field, enter `yelp-business-search` . Make a note of the **URL** because you'll need it later.\n- Click **Save** , then click **Next** . \n- In the **Runtime** drop-down list, click **Python 3.10** or later. \n- [Copy the code from the Yelp file](https://raw.githubusercontent.com/fivetran/functions/master/yelp/google_cloud_v2/main.py) and paste the code in the **main.py** field.\n- In the **Entry point** field, enter `handler` .\n- In `requirements.txt` , add each request on its own line. \n- Click **Deploy** . \n### Test the Cloud FunctionAfter you create the Cloud Function, you can test the function and examine its outputs. You need the credentials (client ID and API key) that you saved from Yelp earlier.- In the Google Cloud console, go to the **Cloud Functions** page. [Go to Cloud functions](https://console.cloud.google.com/functions) \n- Click **yelp-business-search** .\n- Click **Testing** .\n- In the **Triggering event** field, enter the following:```\n{\n \"secrets\":\n { \"client_id\": \"client-id\",\n \"api_key\": \"api-key\" },\n \"state\": {}\n}\n```Replace the following:- : the client ID that you copied from Yelp.\n- : the API key that you copied from Yelp.\n- Click **Test the function** . When your test is successful, it outputs a list of business profiles in `.json` . Log entries after the output indicate when the function started and finished.\n## Creating a BigQuery datasetYou create a BigQuery dataset for the connector to send data to.- In the Google Cloud console, go to the **BigQuery** page. [Go to BigQuery](https://console.cloud.google.com/BigQuery) \n- Click **Create Dataset** .\n- In the **Dataset ID** field, enter `test-data` .\n- Click **Create dataset** .\n## Setting up the Cloud Function connector on FivetranYou need your API credentials, the URL for your Cloud Function, and the name of your Cloud Storage bucket.- In the Google Cloud console, go to Google Cloud Marketplace. [Go to Cloud Marketplace](https://console.cloud.google.com/marketplace/) \n- In the **Search** field, enter `Fivetran Cloud Functions` .\n- Click **Google Cloud Functions Connector by Fivetran** .\n- Click **Enroll** , and then click **Configure Transfer** .\n- On the **Source type** page, complete the following steps:- In the **Transfer config name** , enter`test-transer`.\n- From the **Destination dataset** drop-down list, click **test-data** . Leave the rest of the settings at their default values.\n- Click **Connect Source** .\n- If you agree to the terms, click **Accept agreement** . \n- When prompted to sign in, use your Google Account credentials. When you set up a transfer in BigQuery Data Transfer Service, Fivetran automatically creates a Fivetran account.\n- On the **Google Cloud Function New Connector** page, complete the following steps:- On the **Destination schema** , enter`google-cloud-function`.\n- In the **Function Trigger** field, enter the URL that you copied when you created the Cloud function.\n- In the **Secrets** field, paste your `.json` API credentials:```\n{ \"client_id\": \"client-id\",\n \"api_key\": \"api-key\" }\n```\n- Before you can save and test, you need to provide the Cloud Functions Invoker role to the service account for Fivetran so it can access the bucket. Make a note of the email address that you see.In a new window, complete the following steps:- Return to the main page for your cloud function.\n- Click the **Permissions** tab.\n- Click **Grant access** .\n- Enter the Fivetran service account email address you copied earlier.\n- Choose the **Cloud Functions Invoker** role.\n- Click **Save** .\n- In the window where you're setting up the Fivetran connector, click **Save & Test** .\n- In the Google Cloud console, go to **BigQuery** . [Go to BigQuery](https://console.cloud.google.com/bigquery) Verify that the appropriate datasets and tables are populated.\nYelp's Business Search API is just the beginning. You can use a similar approach to build custom API endpoint ingestions for various sources.## Clean upTo avoid incurring charges to your Google Cloud account for the resources used in this   tutorial, either delete the project that contains the resources, or keep the project and   delete the individual resources.\n### Delete the project\n- **Caution** : Deleting a project has the following effects:- **Everything in the project is deleted.** If you used an existing project for  the tasks in this document, when you delete it, you also delete any other work you've  done in the project.\n- **Custom project IDs are lost.** When you created this project, you might have created a custom project ID that you want to use in  the future. To preserve the URLs that use the project ID, such as an`appspot.com`URL, delete selected resources inside the project instead of deleting the whole project.\n- In the Google Cloud console, go to the **Manage resources** page. [Go to Manage resources](https://console.cloud.google.com/iam-admin/projects) \n- In the project list, select the project that you  want to delete, and then click **Delete** .\n- In the dialog, type the project ID, and then click **Shut down** to delete the project.\n## What's next\n- You can also write Cloud Functions using [ Node.js](https://fivetran.com/blog/serverless-etl-with-cloud-functions) .\n- Read about [what it takes to build a connector](https://fivetran.com/blog/why-fivetran-builds-the-best-connectors) , and why you should [avoid it if possible](https://fivetran.com/blog/build-vs-buy) .\n- Visit the [Fivetran Google Cloud Functions](https://support.fivetran.com/hc/en-us/articles/360061749994-Google-Cloud-Functions-Setup-Guide) documentation.\n- Explore reference architectures, diagrams, and best practices about Google Cloud. Take a look at our [Cloud Architecture Center](/architecture) .", "guide": "Docs"}