{"title": "Docs - Manage compliance obligations", "url": "https://cloud.google.com/architecture/framework/security/compliance", "abstract": "# Docs - Manage compliance obligations\nLast reviewed 2023-07-17 UTC\nThis document in the [Google Cloud Architecture Framework](/architecture/framework) provides best practices for managing compliance obligations.\nYour cloud regulatory requirements depend on a combination of factors, including the following:\n- The laws and regulations that apply your organization's physical locations.\n- The laws and regulations that apply to your customers' physical locations.\n- Your industry's regulatory requirements.\nThese requirements shape many of the decisions that you need to make about which security controls to enable for your workloads in Google Cloud.\nA typical compliance journey goes through three stages: assessment, gap remediation, and continual monitoring. This section addresses the best practices that you can use during each stage.\n", "content": "## Assess your compliance needs\nCompliance assessment starts with a thorough review of all of your regulatory obligations and how your business is implementing them. To help you with your assessment of Google Cloud services, use the [Compliance resource center](/security/compliance) . This site provides you with details on the following:\n- Service support for various regulations\n- Google Cloud certifications and attestations\nYou can [ask for an engagement](/support-hub) with a Google compliance specialist to better understand the compliance lifecycle at Google and how your requirements can be met.\nFor more information, see [Assuring compliance in the cloud (PDF)](https://services.google.com/fh/files/misc/assuringcompliance_in_the_cloud.pdf) .\n## Deploy Assured Workloads\n[Assured Workloads](/assured-workloads) is the Google Cloud tool that builds on the controls within Google Cloud to help you meet your compliance obligations. Assured Workloads lets you do the following:\n- Select your compliance regime. The tool then automatically sets the baseline personnel access controls.\n- Set the location for your data using organization policies so that your data at rest and your resources remain only in that region.\n- Select the key management option (such as the key rotation period) that best fits your security and compliance requirements.\n- For certain regulatory requirements such as FedRAMP Moderate, select the criteria for access by Google support personnel (for example, whether they have completed appropriate background checks).\n- Ensure that Google-managed encryption keys are FIPS-140-2 compliant and support FedRAMP Moderate compliance. For an added layer of control and separation of duties, you can use customer-managed encryption keys (CMEK). For more information about keys, see [Encrypt your data](/architecture/framework/security/data-security#encrypt-data) .## Review blueprints for templates and best practices that apply to your compliance regime\nGoogle has published blueprints and solutions guides that describe best practices and that provide Terraform modules to let you roll out an environment that helps you achieve compliance. The following table lists a selection of blueprints that address security and alignment with compliance requirements.\n| Standard | Description                                      |\n|:-----------|:-----------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| PCI  | Security blueprint: PCI on GKE PCI Data Security Standard compliance Limiting scope of compliance for PCI environments in Google Cloud PCI DSS compliance on GKE |\n| FedRAMP | Google Cloud FedRAMP implementation guide (PDF) Setting up a FedRAMP Aligned Three-Tier Workload on Google Cloud             |\n| HIPAA  | Protecting healthcare data on Google Cloud (PDF) Setting up a HIPAA aligned workload using Data Protection Toolkit (PDF)           |\n## Monitor your compliance\nMost regulations require you to monitor particular activities, including  access controls. To help with your monitoring, you can use the following:\n- [Access Transparency](/assured-workloads/access-transparency/docs/overview) , which provides near real-time logs when Google Cloud admins access your content.\n- [Firewall Rules Logging](/vpc/docs/firewall-rules-logging) to record TCP and UDP connections inside a VPC network for any rules that you create yourself. These logs can be useful for auditing network access or for providing early warning that the network is being used in an unapproved manner.\n- [VPC Flow Logs](/vpc/docs/using-flow-logs) to record network traffic flows that are sent or received by VM instances.\n- [Security Command Center Premium](/security-command-center/docs/concepts-vulnerabilities-findings) to monitor for compliance with various standards.\n- [OSSEC](https://ossec.github.io/index.html) (or another open source tool) to log the activity of individuals who have admin access to your environment.\n- [Key Access Justifications](/assured-workloads/key-access-justifications/docs/overview) to view the reasons for a key access request.## Automate your compliance\nTo help you remain in compliance with changing regulations, determine if there are ways that you can automate your security policies by incorporating them into your infrastructure as code deployments. For example, consider the following:\n- Use security blueprints to build your security policies into your infrastructure deployments.\n- Configure Security Command Center to alert when non-compliance issues occur. For example, monitor for issues such as users disabling two-step verification or over-privileged service accounts. For more information, see [Setting up finding notifications](/security-command-center/docs/how-to-notifications) .\n- Set up automatic remediation to particular notifications. For more information, see [Cloud Functions code](https://github.com/GoogleCloudPlatform/security-response-automation) .\nFore more information about compliance automation, see the [Risk and Compliance as Code (RCaC) solution](/solutions/risk-and-compliance-as-code) .\n## What's next\nLearn more about compliance with the following resources:\n- [Implement data residency and sovereignty requirements](/architecture/framework/security/data-residency-sovereignty) (next document in this series)\n- [Compliance Resource Center](/security/compliance) \n- [Google security whitepaper (PDF)](https://services.google.com/fh/files/misc/google_security_wp.pdf) \n- [Assured Workloads](/assured-workloads/docs)", "guide": "Docs"}