{"title": "Docs - Jump Start Solution: Ecommerce platform with serverless computing", "url": "https://cloud.google.com/architecture/application-development/ecommerce-serverless", "abstract": "# Docs - Jump Start Solution: Ecommerce platform with serverless computing\nLast reviewed 2023-08-24 UTC\nThis guide helps you understand, deploy, and use the [Ecommerce platform with serverless computing](https://console.cloud.google.com/products/solutions/details/ecommerce-platform-serverless) solution. This solution demonstrates how to build and run a simple ecommerce application for a retail organization, with a publicly visible online store website. It shows you how to create an application that scales to handle spikes in usage (for example, during peak scale events like a seasonal sale), and that can manage requests based on the visitor's location. This design helps the online store provide a consistent service to geographically distributed customers.\nThis solution is a good starting point if you want to learn how to deploy scalable ecommerce web apps with [serverless capabilities](/serverless#capabilities) . If you want granular operational control, check out the [Ecommerce web app deployed on Kubernetes](/architecture/application-development/ecommerce-microservices) solution.\nThis document assumes that you're familiar with basic cloud concepts, though not necessarily Google Cloud. Experience with Terraform is helpful.\n**Note:** This solution helps you explore the capabilities of Google Cloud. The solution is not intended to be used as is for production environments. For information about designing and setting up production-grade environments in Google Cloud, see [Landing zone design in Google Cloud](/architecture/landing-zones) and [Google Cloud setup checklist](/docs/enterprise/setup-checklist) .\n", "content": "## Objectives\nThis solution guide helps you do the following:\n- Learn how to design a system architecture for an ecommerce website.\n- Optimize an ecommerce website for performance, scale, and responsiveness.\n- Monitor and anticipate load limitations.\n- Use tracing and error reporting to understand and manage problems.## Products\nThe solution uses the following Google Cloud products:\n- [Cloud Run](/run) : A fully managed service that lets you build and deploy serverless containerized apps. Google Cloud handles scaling and other infrastructure tasks so that you can focus on the business logic of your code.\n- [Cloud SQL](/sql) : A cloud-based PostgreSQL database that's fully managed on the Google Cloud infrastructure.\n- [Secret Manager](/secret-manager) : A service that lets you store, manage, and access secrets as binary blobs or text strings. You can use Secret Manager to store database passwords, API keys, or TLS certificates that are needed by an application at runtime.\n- [Cloud Storage](/storage) : An enterprise-ready service that provides low-cost, no-limit object storage for diverse data types. Data is accessible from within and outside of Google Cloud and is replicated geo-redundantly.\n- [Firebase Hosting](https://firebase.google.com/docs/hosting) : A fully managed hosting service to deploy and serve your web applications and static content.\n- [Cloud Logging](/logging) : A service that lets you store, search, analyze, monitor, and alert on logging data and events from Google Cloud and other clouds.\n- [Cloud Trace](/trace) : A distributed tracing system for Google Cloud that helps you understand how long it takes your application to handle incoming requests from users or other applications, and how long it takes to complete operations like RPC calls performed when handling the requests.\n- [Error Reporting](/error-reporting) : This service aggregates and displays errors produced in your running cloud services. Error Reporting groups errors which are considered to have the same root cause.## Architecture\nThe following diagram shows the architecture of the solution:### Request flow\nThe following is the request processing flow of the ecommerce platform. The steps in the flow are numbered as shown in the preceding architecture diagram.\n- A Firebase Hosting client frontend. The frontend uses [Lit](http://lit.dev) and web components for client-side rendering of API data.\n- The web client calls an API backend that is running as a Cloud Run service. The Cloud Run API server is written in [Django](https://www.djangoproject.com/) using the [Django REST Framework](https://www.django-rest-framework.org/) .\n- The configuration and other secrets for the Python application are stored in Secret Manager.\n- Static assets for the application are stored in Cloud Storage.\n- A Cloud SQL database, using [PostgreSQL](https://www.postgresql.org/) , is used as the relational database backend for the Python application.\n- Cloud Logging, Cloud Trace, and Error Reporting stores logs, OpenTelemetry [traces](https://opentelemetry.io/docs/concepts/signals/traces/) , and error reports sent by other cloud products and the Cloud Run API server. This data enables monitoring for the correct application behavior and troubleshooting of unexpected behavior.## Cost\nFor an estimate of the cost of the Google Cloud resources that the Ecommerce platform with serverless computing solution uses, see the precalculated estimate in the [Google Cloud Pricing Calculator](https://cloud.google.com/products/calculator#id=https://cloud.google.com/products/calculator#id=d101fd04-9054-46ce-9f56-4276df30c0ba) .\nUse the estimate as a starting point to calculate the cost of your deployment. You can modify the estimate to reflect any configuration changes that you plan to make for the resources that are used in the solution.\nThe precalculated estimate is based on assumptions for certain factors, including the following:\n- The Google Cloud locations where the resources are deployed.\n- The amount of time that the resources are used.## Deploy the solution\nThis section guides you through the process of deploying the solution.\n### Create or choose a Google Cloud project\nWhen you deploy the solution, you choose the [Google Cloud project](/resource-manager/docs/creating-managing-projects) where the resources are deployed. When you're deciding whether to use an existing project or to create a new project, consider the following factors:\n- If you create a project for the solution, then when you no longer need the deployment, you can delete the project and avoid continued billing. If you use an existing project, you must delete the deployment when you no longer need it.\n- Using a new project can help avoid conflicts with previously provisioned resources, such as resources that are used for production workloads.\nIf you want to deploy the solution in a new project, create the project you begin the deployment.\nTo create a project, complete the following steps:\n- In the Google Cloud console, go to the project selector page. [Go to project selector](https://console.cloud.google.com/projectselector2/home/dashboard) \n- To begin creating a   Google Cloud project, click **Create project** .\n- Name your project. Make a note of your generated project ID.\n- Edit the other fields as needed.\n- To create the project, click **Create** .### Get the required IAM permissions\n**Note:** This list of required IAM permissions is for deploying through the console. If you deploy by using the Terraform CLI instead, your user account needs the same roles as those noted below as being granted to the created service account.\nTo start the deployment process, you need the Identity and Access Management (IAM) permissions that are listed in the following table. If you have the `roles/owner` [basic role](/iam/docs/understanding-roles#basic) for the project in which you plan to deploy the solution, then you already have all the necessary permissions. If you don't have the `roles/owner` role, then ask your administrator to grant these permissions (or the roles that include these permissions) to you.\n| IAM permission required       | Predefined role that includes the required permissions  |\n|:--------------------------------------------------|:------------------------------------------------------------|\n| serviceusage.services.enable      | Service Usage Admin (roles/serviceusage.serviceUsageAdmin) |\n| iam.serviceAccounts.create      | Service Account Admin (roles/iam.serviceAccountAdmin)  |\n| resourcemanager.projects.setIamPolicy    | Project IAM Admin (roles/resourcemanager.projectIamAdmin) |\n| config.deployments.create config.deployments.list | Cloud Infrastructure Manager Admin (roles/config.admin) |\nWhen you initiate the deployment process, a [service account](/iam/docs/service-accounts) is created to deploy the solution on your behalf (and to delete the deployment later if you choose). This service account is assigned certain IAM permissions ; that is, the permissions are revoked automatically after the solution deployment and deletion operations are completed. Google recommends that after you delete the deployment, you delete the service account, as described later in this guide.### Choose a deployment method\nTo help you deploy this solution with minimal effort, a Terraform configuration is provided in GitHub. The Terraform configuration defines all the Google Cloud resources that are required for the solution.\nYou can deploy the solution by using one of the following methods:\n- **Through the console** : Use this method if you want to try the solution with the default configuration and see how it works. Cloud Build deploys all the resources that are required for the solution. When you no longer need the deployed solution, you can delete it through the console. Any resources that you create after you deploy the solution might need to be deleted separately.To use this deployment method, follow the instructions in [Deploy through the console](#deploy-from-console) .\n- **Using the Terraform CLI** : Use this method if you want to customize the solution or if you want to automate the provisioning and management of the resources by using the infrastructure as code (IaC) approach. Download the Terraform configuration from GitHub, optionally customize the code as necessary, and then deploy the solution by using the Terraform CLI. After you deploy the solution, you can continue to use Terraform to manage the solution.To use this deployment method, follow the instructions in [Deploy using the Terraform CLI](#deploy-using-terraform) .\n### Deploy through the console\nComplete the following steps to deploy the preconfigured solution.\n**Note:** If you want to customize the solution or automate the provisioning and management of the solution by using the infrastructure as code (IaC) approach, then see [Deploy using the Terraform CLI](#deploy-using-terraform) .\n- In the Google Cloud Jump Start Solutions catalog, go to the **Ecommerce platform with serverless computing** solution. [Go to the Ecommerce platform with serverless computing solution](https://console.cloud.google.com/products/solutions/details/ecommerce-platform-serverless) \n- Review the information that's provided on the page, such as the estimated cost of the solution and the estimated deployment time.\n- When you're ready to start deploying the solution, click **Deploy** .A step-by-step interactive guide is displayed.\n- Complete the steps in the interactive guide.Note the name that you enter for the deployment. This name is required later when you delete the deployment.When you click **Deploy** , the **Solution deployments** page is displayed. The **Status** field on this page shows **Deploying** .\n- Wait for the solution to be deployed.If the deployment fails, the **Status** field shows **Failed** . You can use the Cloud Build log to diagnose the errors. For more information, see [Errors when deploying through the console](#console-deploy-errors) .After the deployment is completed, the **Status** field changes to **Deployed** .\n- To view and use the deployed ecommerce web app, follow the instructions in [Explore your Avocano deployment](#explore) .\n- To view the Google Cloud resources that are deployed and their configuration, take an interactive tour. [Start the tour](https://console.cloud.google.com/products/solutions/deployments?walkthrough_id=solutions-in-console--dynamic-python-webapp--tour#step_index=1) \nWhen you no longer need the solution, you can delete the deployment to avoid continued billing for the Google Cloud resources. For more information, see [Delete the deployment](#delete-deployment) .\n### Deploy using the Terraform CLI\nThis section describes how you can customize the solution or automate the provisioning and management of the solution by using the Terraform CLI. Solutions that you deploy by using the Terraform CLI are not displayed in the **Solution deployments** page in the Google Cloud console.\n**Note:** If you want to deploy the solution with the default configuration to see how it works, then follow the instructions in [Deploy through the console](#deploy-from-console) .\nYou can run Terraform either in Cloud Shell or on your local host. This guide describes how to run Terraform in Cloud Shell, which has Terraform preinstalled and configured to authenticate with Google Cloud.\nThe Terraform code for this solution is available in a GitHub repository.\n- Clone the GitHub repository to Cloud Shell. [](https://ssh.cloud.google.com/cloudshell/editor?cloudshell_git_repo=https://github.com/GoogleCloudPlatform/terraform-dynamic-python-webapp) A prompt is displayed to confirm downloading the GitHub repository to Cloud Shell.\n- Click **Confirm** .Cloud Shell is launched in a separate browser tab, and the Terraform code is downloaded to the `$HOME/cloudshell_open` directory of your Cloud Shell environment.\n- In Cloud Shell, check whether the current working directory is `$HOME/cloudshell_open/terraform-dynamic-python-webapp/infra` . This is the directory that contains the Terraform configuration files for the solution. If you need to change to that directory, run the following command:```\ncd $HOME/cloudshell_open/terraform-dynamic-python-webapp/infra\n```\n- Initialize Terraform by running the following command:```\nterraform init\n```Wait until you see the following message:```\nTerraform has been successfully initialized!\n```The Terraform code that you downloaded includes variables that you can use to customize the deployment based on your requirements. For example, you can specify the Google Cloud project and the region where you want the solution to be deployed.\n- Make sure that the current working directory is `$HOME/cloudshell_open/terraform-dynamic-python-webapp/infra` . If it isn't, go to that directory.\n- In the same directory, create a text file named `terraform.tfvars` .\n- In the `terraform.tfvars` file, copy the following code snippet, and set values for the required variables.- Follow the instructions that are provided as comments in the code snippet.\n- This code snippet includes only the variables for which youset values. The Terraform configuration includes other variables that have default values. To review all the variables and the default values, see the`variables.tf`file that's available in the`$HOME/cloudshell_open/terraform-dynamic-python-webapp/infra`directory.\n- Make sure that each value that you set in the `terraform.tfvars` file matches the variable [type](https://www.terraform.io/docs/language/values/variables.html#type-constraints) as declared in the `variables.tf` file. For example, if the type that’s defined for a variable in the `variables.tf` file is `bool` , then you must specify `true` or `false` as the value of that variable in the `terraform.tfvars` file.```\n# This is an example of the terraform.tfvars file.# The values in this file must match the variable types declared in variables.tf.# The values in this file override any defaults in variables.tf.# ID of the project in which you want to deploy the solutionproject_id = \"PROJECT_ID\"# Google Cloud region where you want to deploy the solution# Example: us-central1region = \"REGION\"# Google Cloud zone where you want to deploy the solution# Example: us-central1-azone = \"ZONE\"# Container Registry that hosts the client imageclient_image_host = \"hsa-public/serverless-ecommerce\"# Container Registry that hosts the server imageserver_image_host = \"hsa-public/serverless-ecommerce\"\n```For information about the values that you can assign to the required variables, see the following:- : [Identifying projects](/resource-manager/docs/creating-managing-projects#identifying_projects) \n- and: [Available regions and zones](/compute/docs/regions-zones#available) - Make sure that the current working directory is `$HOME/cloudshell_open/terraform-dynamic-python-webapp/infra` . If it isn't, go to that directory.\n- Verify that the Terraform configuration has no errors:```\nterraform validate\n```If the command returns any errors, make the required corrections in the configuration and then run the `terraform validate` command again. Repeat this step until the command returns the following message:```\nSuccess! The configuration is valid.\n```\n- Review the resources that are defined in the configuration:```\nterraform plan\n```\n- If you didn't create the `terraform.tfvars` file as described earlier, Terraform prompts you to enter values for the variables that don't have default values. Enter the required values.The output of the `terraform plan` command is a list of the resources that Terraform provisions when you apply the configuration.If you want to make any changes, edit the configuration and then run the `terraform validate` and `terraform plan` commands again.When no further changes are necessary in the Terraform configuration, deploy the resources.\n- Make sure that the current working directory is `$HOME/cloudshell_open/terraform-dynamic-python-webapp/infra` . If it isn't, go to that directory.\n- Apply the Terraform configuration:```\nterraform apply\n```\n- If you didn't create the `terraform.tfvars` file as described earlier, Terraform prompts you to enter values for the variables that don't have default values. Enter the required values.Terraform displays a list of the resources that will be created.\n- When you're prompted to perform the actions, enter `yes` .Terraform displays messages showing the progress of the deployment.If the deployment can't be completed, Terraform displays the errors that caused the failure. Review the error messages and update the configuration to fix the errors. Then run the `terraform apply` command again. For help with troubleshooting Terraform errors, see [Errors when deploying the solution using the Terraform CLI](#tf-deploy-errors) .After all the resources are created, Terraform displays the following message:```\nApply complete!\n```\n- To view and use the deployed ecommerce web app, follow the instructions in [Explore your Avocano deployment](#explore) .\n- To view the Google Cloud resources that are deployed and their configuration, take an interactive tour. [Start the tour](https://console.cloud.google.com/products/solutions/deployments?walkthrough_id=solutions-in-console--dynamic-python-webapp--tour#step_index=1) \nWhen you no longer need the solution, you can delete the deployment to avoid continued billing for the Google Cloud resources. For more information, see [Delete the deployment](#delete-deployment) .\n## Explore your Avocano deployment\nYou have now deployed the Avocano website application! You can visit the Avocano website and look around, and then explore how the solution works in Google Cloud console. Be aware that it can take a few minutes after deploying the application for the site to show up at the provided address.\n### What is Avocano?\nThis solution uses a sample application named [Avocano](https://github.com/GoogleCloudPlatform/avocano) to demonstrate the deployment and management of a web app with many of the tools and products used for serverless applications. Avocano is an application that mimics a real-world implementation of an ecommerce web app.\nThe Avocano frontend presents a faux storefront, where you can add items to your cart, and attempt to complete a checkout process, but then the store reveals it is fake (Avoca--no!). While you can't actually purchase an avocado, the application demonstrates inventory management by decreasing the amount of available product by one.### Explore the frontend\nTo launch the frontend of your solution deployment:\n- Open the [Firebase console](https://console.firebase.google.com/project/) .\n- Select your existing project.\n- Navigate to the **Build > Hosting** section.\n- Select the **Domain** ending with **web.app** . The frontend of your sample application opens in a new browser window.\nYou can now interact with the Avocano website just as its customers would see it, including browsing through products, adding products to the shopping cart, and checking out as a guest.\n### View the autoscaling and concurrency configuration\nCloud Run [automatically scales](/run/docs/about-instance-autoscaling) up or down container instances from zero depending on traffic, to provide a fast startup time for your app.\nIt's important to understand that the settings for autoscaling and concurrency on Cloud Run can affect the performance and costs for your app. These settings are briefly described below:\n- **Minimum instances** : You can set the minimum instances setting to enable idle instances for your service. By raising the minimum instances setting in anticipation of higher traffic, you can minimize response time for the first users. If your service [requires reduced latency](/run/docs/tips/general#start_containers_quickly) , especially when scaling from zero active instances, you can specify a minimum number of container instances to be kept warm and ready to serve requests.\n- **Maximum instances** : Increasing the maximum instances setting in Cloud Run can help you to serve exceptionally high traffic that's anticipated. In such a scenario, you should also evaluate your current quota and consider requesting an increase. Reducing the maximum instances setting can help you avoid unexpected costs or a higher utilization of underlying backing infrastructure (such as your database capacity).\n- **Concurrency** : The Cloud Run concurrency setting specifies the maximum number of requests that can be processed simultaneously by a given container instance. Optimizing the memory, CPU, and concurrency for your application's behavior ensures that each container instance has the best utilization, and minimizes the need to scale up to new instances. For more information, see [Optimize concurrency](/run/docs/tips/general#optimize_concurrency) .To view the current minimum and maximum instances settings, and concurrency settings for your Cloud Run service:\n- [Go to Cloud Run](https://console.cloud.google.com/run) \n- Click the service you are interested in to open the **Service details** page.\n- Click the **Revisions** tab.\n- In the details panel at the right, the current minimum instances, maximum instances, and concurrency settings are listed under the **Container** tab.\nIf you want to learn how to adjust these settings to optimize app performance, see the [General development tips](/run/docs/tips/general) in the Cloud Run documentation.\n### View traffic logs\nYou can use the logging tools in Cloud Run to keep watch on traffic to your app and get alerts when problems arise.\nTo view logs for your Cloud Run service:\n- [Go to Cloud Run](https://console.cloud.google.com/run) \n- Click the desired service in the displayed list.\n- Click the **Logs** tab to get the request and container logs for all revisions of this service. You can filter by log severity level.\nCloud Run automatically captures logs [from many places](/run/docs/logging#container-logs) : anything written to standard out and standard error, anything in `/var/log/` , and others. Any manual logging done with the [Cloud Logging libraries](/logging/docs/reference/libraries) is also captured. You can also view the logs for this service directly in Cloud Logging by clicking **View in Logs Explorer** .\nIn the Avocano app, try the following user actions to trigger corresponding output that you can view in the logs.\n| User action                               | Log output               |\n|:---------------------------------------------------------------------------------------------------------------------------------------|:---------------------------------------------------------------------|\n| Purchase the shopping cart using Collect as the payment type and the product amount in the cart does not exceed the inventory count. | The log output shows an info log, with httpRequest status of 200. |\n| Purchase the shopping cart using Collect as the payment type but the product amount in the cart exceeds the inventory count.   | The log output shows a Warning log, with httpRequest status of 400. |\n| Purchase the shopping cart using Credit as the payment type.                   | The log output shows an Error log, with httpRequest status of 501. |\nYou can view the code that raises the error that leads to the `400/501` HTTP response in the [serializers.py](https://github.com/GoogleCloudPlatform/avocano/blob/main/server/store/serializers.py#L79) file. Cloud Run notes the response, and generates a corresponding request log entry.\nYou can use [log-based alerts](/logging/docs/alerting/log-based-alerts) to notify you whenever a specific message appears in your included logs.\n### View trace instrumentation and captured traces\nThis solution uses [Open Telemetry Python automatic instrumentation](https://opentelemetry.io/docs/instrumentation/python/automatic/) to capture telemetry data for the Avocano application.\nThe solution implements the following code and configuration settings in order to generate traces using automatic instrumentation:\n- Add dependencies for Cloud Trace in the [requirements.txt](https://github.com/GoogleCloudPlatform/avocano/blob/main/server/requirements.txt) file, including the following:- `opentelemetry-distro`: installs the Open Telemetry API, SDK, and command-line tools.\n- `opentelemetry-instrumentation`: adds support for Python auto-instrumentation.\n- `opentelemetry-exporter-gcp-trace`: provides support for exporting traces to Cloud Trace.\n- `opentelemetry-resource-detector`: provides support for detecting Google Cloud resources.\n- `opentelemetry-instrumentation-django`: allow tracing requests for Django application.\n- Set the IAM binding in the [iam.tf](https://github.com/GoogleCloudPlatform/avocano/blob/main/provisioning/terraform/iam.tf#L46) file to enable the server to write to Cloud Trace.\n- Configure the`OTEL_TRACES_EXPORTER`environment variable in the [services.tf](https://github.com/GoogleCloudPlatform/avocano/blob/main/provisioning/terraform/service.tf#L30) file to use the exporter for Cloud Trace.\n- In the [server/Procfile](https://github.com/GoogleCloudPlatform/avocano/blob/main/server/Procfile) , configure the server to run the`opentelemetry-instrument`command on the Avocano app. This command detects packages in Avocano and applies automatic tracing instrumentation on them, if possible.\nTo learn more about collecting Cloud Trace data for Python, see [Python and OpenTelemetry](/trace/docs/setup/python-ot) .\nTo view the latency data for requests, follow these steps:\n- [Go to Cloud Trace](https://console.cloud.google.com/traces/list) \n- In the **Select a trace** section of the **Trace list** page, click the blue dot, which represents a captured trace. The **Latency** column displays the latency for the captured traces.\nYou can also view trace data using the following visualizations in the **Trace list** page:\n- [Waterfall graph](https://cloud.google.com/trace/docs/viewing-details) : represents a complete request through the application. Each step in the timeline is a [span](/trace/docs/reference#spans) , which you can click to view details. Cloud Run automatically creates spans for internal operations, such as request handling and load balancing. These spans appear in the same waterfall graph as spans produced by Avocano, allowing you to view the full lifetime of the request.\n- [Span details](https://cloud.google.com/trace/docs/viewing-details#span_information) : shows any labels or annotations you added to the app's code when you instrumented it for tracing.\nIf you want to add customized traces, refer to [Manual Instrumentation](https://opentelemetry.io/docs/instrumentation/python/manual/) in the Open Telemetry documentation.\n## Design recommendations\nThis section provides recommendations for using the Ecommerce platform with serverless computing solution to develop an architecture that meets your requirements for security, reliability, cost, and performance.\nTo view the design recommendations for each area, click the appropriate tab.\n| Design focus     | Recommendations                                                            |\n|:-------------------------------|:-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| Data encryption    | By default, Cloud Run encrypts data by using a Google-managed encryption key. To protect your containers by using a key that you control, you can use customer managed encryption keys. For more information, see Using customer-managed encryption keys. |\n| Software supply-chain security | To ensure that only authorized container images are deployed to the Cloud Run services, you can use Binary Authorization.                                 || Design focus     | Recommendations                                                                                                                                                     |\n|:--------------------------------|:--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| App scaling      | The Cloud Run services in the solution are configured to autoscale the container instances horizontally based on the request load. Review and adjust the autoscaling parameters based on your requirements. For more information, see About container instance autoscaling.                                                                                     |\n| Request handling    | To improve the responsiveness of Cloud Run services that store client-specific state on container instances, you can use session affinity. Requests from the same client are routed to the same container instance, on a best-effort basis. For more information, see Setting session affinity (services).                                                                             |\n| Data durability     | To protect your data against loss, you can use automated backups of the Cloud SQL database. For more information, see About Cloud SQL backups.                                                                                                                     |\n| Database high availability (HA) | The Cloud SQL database in the solution is deployed in a single zone. For HA, you can use a multi-zone configuration. For more information, see About high availability. If database HA is a critical requirement, AlloyDB for PostgreSQL is an alternative Google Cloud service that you can consider.                                                                              |\n| Database reliability   | The Cloud SQL instance in this solution uses the db-custom-2-4096 machine type, which uses two CPUs with 4 GB of memory. This machine type is designed to provide resources for a low-cost database that might be appropriate for test and development environments only. If you need production-grade reliability, consider using a machine type that provides more CPU and memory. A Cloud SQL instance that uses the db-g1-small machine type is not included in the Cloud SQL service level agreement (SLA). For more information about configurations that are excluded from the SLA, see Operational guidelines. |\n| Quotas and limits    | The number of Cloud Run resources is limited. If you anticipate a surge in traffic, for example due to a seasonal holiday or sales event, you should request a quota increase. For more information, see How to increase quota. Some quota requests require manual approval, so you should plan ahead. You can also set alerts on your progress towards reaching your quota.                                                            |\n| Design focus  | Recommendations                                                                                                                                                                        |\n|:--------------------|:---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| Resource efficiency | Cloud Run determines the number of requests that should be sent to a container instance based on CPU usage and memory usage. By increasing the maximum concurrency setting, you can reduce the number of container instances that Cloud Run needs to create, and therefore reduce cost. For more information, see Maximum concurrent requests per instance (services). The Cloud Run services in this solution are configured to allocate CPUs only during request processing. When a Cloud Run service finishes handling a request, the container instance's access to CPUs is disabled. For information about the cost and performance effect of this configuration, see CPU allocation (services). |\n| Design focus   | Recommendations                                                                                               |\n|:---------------------|:-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| App startup time  | To reduce the performance effect of cold starts, you can configure the minimum number of Cloud Run container instances to a non-zero value. For more information, see General development tips for Cloud Run.                                               |\n| Tune concurrency  | This solution is tuned to maximize individual container throughput. Cloud Run automatically adjusts the concurrency for serving multiple requests. However, you should adjust the default maximum concurrency if your container is not able to process many concurrent requests, or if your container is able to handle a larger volume of requests. For more information, see Optimize concurrency. |\n| Database performance | For performance-sensitive applications, you can improve performance of Cloud SQL by using a larger machine type and by increasing the storage capacity. If database performance is a critical requirement, AlloyDB for PostgreSQL is an alternative Google Cloud service that you can consider.                           |\nNote the following:\n- Before you make any design changes, assess the cost impact and consider potential trade-offs with other features. You can assess the cost impact of design changes by using the [Google Cloud Pricing Calculator](/products/calculator#id=d101fd04-9054-46ce-9f56-4276df30c0ba) .\n- To implement design changes in the solution, you need expertise in Terraform coding and advanced knowledge of the Google Cloud services that are used in the solution.\n- If you modify the Google-provided Terraform configuration and if you then experience errors, create issues in [GitHub](https://github.com/GoogleCloudPlatform/terraform-dynamic-python-webapp) . GitHub issues are reviewed on a best-effort basis and are not intended for general usage questions.\n- For more information about designing and setting up production-grade environments in Google Cloud, see [Landing zone design in Google Cloud](/architecture/landing-zones) and [Google Cloud setup checklist](/docs/enterprise/setup-checklist) .## Delete the solution deployment\nWhen you no longer need the solution deployment, to avoid continued billing for the resources that you created, delete the deployment.\n### Delete through the console\nUse this procedure if you deployed the solution through the console.\n- In the Google Cloud console, go to the **Solution deployments** page. [Go to Solution deployments](https://console.cloud.google.com/products/solutions/deployments) \n- Select the project that contains the deployment that you want to delete.\n- Locate the deployment that you want to delete.\n- Click more_vert **Actions** and then select **Delete** .\n- Enter the name of the deployment and then click **Confirm** .The **Status** field shows **Deleting** .If the deletion fails, see the troubleshooting guidance in [Error when deleting a deployment](#error-deleting-deployment) .\nWhen you no longer need the Google Cloud project that you used for the solution, you can delete the project. For more information, see [Optional: Delete the project](#delete-project) .\n### Delete using the Terraform CLI\nUse this procedure if you deployed the solution by using the Terraform CLI.\n- In Cloud Shell, make sure that the current working directory is `$HOME/cloudshell_open/terraform-dynamic-python-webapp/infra` . If it isn't, go to that directory.\n- Remove the resources that were provisioned by Terraform:```\nterraform destroy\n```Terraform displays a list of the resources that will be destroyed.\n- When you're prompted to perform the actions, enter `yes` .Terraform displays messages showing the progress. After all the resources are deleted, Terraform displays the following message:```\nDestroy complete!\n```If the deletion fails, see the troubleshooting guidance in [Error when deleting a deployment](#error-deleting-deployment) .\nWhen you no longer need the Google Cloud project that you used for the solution, you can delete the project. For more information, see [Optional: Delete the project](#delete-project) .\n### Optional: Delete the project\nIf you deployed the solution in a new Google Cloud project, and if you no longer need the project, then delete it by completing the following steps:\n**Caution:** If you delete a project, all the resources in the project are permanently deleted.\n- In the Google Cloud console, go to the **Manage resources** page. [Go to Manage resources](https://console.cloud.google.com/iam-admin/projects) \n- In the project list, select the project that you want to delete, and then  click **Delete** .\n- At the prompt, type the project ID, and then click **Shut down** .\nIf you decide to retain the project, then delete the service account that was created for this solution, as described in the next section.\n### Optional: Delete the service account\nIf you deleted the project that you used for the solution, then skip this section.\nAs mentioned earlier in this guide, when you deployed the solution, a service account was created on your behalf. The service account was assigned certain IAM permissions ; that is, the permissions were revoked automatically after the solution deployment and deletion operations were completed, but the service account isn't deleted. Google recommends that you delete this service account.\n- If you deployed the solution through the Google Cloud console, go to the [Solution deployments](https://console.cloud.google.com/products/solutions/deployments) page. (If you're already on that page, refresh the browser.) A process is triggered in the background to delete the service account. No further action is necessary.\n- If you deployed the solution by using the Terraform CLI, complete the following steps:- In the Google Cloud console, go to the **Service accounts** page. [Go to Service accounts](https://console.cloud.google.com/iam-admin/serviceaccounts) \n- Select the project that you used for the solution.\n- Select the service account that you want to delete.The email ID of the service account that was created for the solution is in the following format:```\ngoog-sc-DEPLOYMENT_NAME-NNN@PROJECT_ID.iam.gserviceaccount.com\n```The email ID contains the following values:- : the name of the deployment.\n- : a random 3-digit number.\n- : the ID of the project in which you deployed the solution.\n- Click **Delete** .\n## Troubleshoot errors\nThe actions that you can take to diagnose and resolve errors depend on the deployment method and the complexity of the error.\n### Errors when deploying through the console\nIf the deployment fails when you use the console, do the following:\n- Go to the **Solution deployments** page.If the deployment failed, the **Status** field shows **Failed** .\n- View the details of the errors that caused the failure:- Click more_vert **Actions** .\n- Select **View Cloud Build logs** .\n- Review the Cloud Build log and take appropriate action to resolve the issue that caused the failure.\n### Errors when deploying using the Terraform CLI\nIf the deployment fails when you use Terraform, the output of the `terraform apply` command includes error messages that you can review to diagnose the problem.\nThe examples in the following sections show deployment errors that you might encounter when you use Terraform.\nIf you create a project and then immediately attempt to deploy the solution in the new project, the deployment might fail with an error like the following:\n```\nError: Error creating Network: googleapi: Error 403: Compute Engine API has not\nbeen used in project PROJECT_ID before or it is disabled. Enable it by visiting\nhttps://console.developers.google.com/apis/api/compute.googleapis.com/overview?project=PROJECT_ID\nthen retry. If you enabled this API recently, wait a few minutes for the action\nto propagate to our systems and retry.\n```\nIf this error occurs, wait a few minutes and then run the `terraform apply` command again.\nWhen you run the `terraform apply` command, a `cannot assign requested address` error might occur, with a message like the following:\n```\nError: Error creating service account:\n Post \"https://iam.googleapis.com/v1/projects/PROJECT_ID/serviceAccounts:\n dial tcp [2001:db8:ffff:ffff::5f]:443:\n connect: cannot assign requested address\n```\nIf this error occurs, run the `terraform apply` command again.\n### Error when deleting a deployment\nIn certain cases, attempts to delete a deployment might fail:\n- After deploying a solution through the console, if you change any resource that was provisioned by the solution, and if you then try to delete the deployment, the deletion might fail. The **Status** field on the **Solution deployments** page shows **Failed** , and the Cloud Build log shows the cause of the error.\n- After deploying a solution by using the Terraform CLI, if you change any resource by using a non-Terraform interface (for example, the console), and if you then try to delete the deployment, the deletion might fail. The messages in the output of the`terraform destroy`command show the cause of the error.\nReview the error logs and messages, identify and delete the resources that caused the error, and then try deleting the deployment again.\nIf a console-based deployment doesn't get deleted and if you can't diagnose the error by using the Cloud Build log, then you can delete the deployment by using the Terraform CLI, as described in the next section.\n### Delete a console-based deployment by using the Terraform CLI\nThis section describes how to delete a console-based deployment if errors occur when you try to delete it through the console. In this approach, you download the Terraform configuration for the deployment that you want to delete and then use the Terraform CLI to delete the deployment.\n- Identify the region where the deployment's Terraform code, logs, and other data are stored. This region might be different from the region that you selected while deploying the solution.- In the Google Cloud console, go to the **Solution deployments** page. [Go to Solution deployments](https://console.cloud.google.com/products/solutions/deployments) \n- Select the project that contains the deployment that you want to delete.\n- In the list of deployments, identify the row for the deployment that you want to delete.\n- Click expand_more **View all rowcontent** .\n- In the **Location** column, note the location, as highlighted in the following example: \n- In the Google Cloud console, activate Cloud Shell. [Activate Cloud Shell](https://console.cloud.google.com/?cloudshell=true) At the bottom of the Google Cloud console, a [Cloud Shell](/shell/docs/how-cloud-shell-works) session starts and displays a command-line prompt. Cloud Shell is a shell environment  with the Google Cloud CLI  already installed and with values already set for  your current project. It can take a few seconds for the session to initialize.\n- Create environment variables for the project ID, region, and name of the deployment that you want to delete:```\nexport REGION=\"REGION\"export PROJECT_ID=\"PROJECT_ID\"export DEPLOYMENT_NAME=\"DEPLOYMENT_NAME\"\n```In these commands, replace the following:- : the location that you noted earlier in this procedure.\n- : the ID of the project where you deployed the solution.\n- : the name of the deployment that you want to delete.\n- Get the ID of the latest revision of the deployment that you want to delete:```\nexport REVISION_ID=$(curl \\    -H \"Authorization: Bearer $(gcloud auth print-access-token)\" \\    -H \"Content-Type: application/json\" \\    \"https://config.googleapis.com/v1alpha2/projects/${PROJECT_ID}/locations/${REGION}/deployments/${DEPLOYMENT_NAME}\" \\    | jq .latestRevision -r)    echo $REVISION_ID\n```The output is similar to the following:```\nprojects/PROJECT_ID/locations/REGION/deployments/DEPLOYMENT_NAME/revisions/r-0\n```\n- Get the Cloud Storage location of the Terraform configuration for the deployment:```\nexport CONTENT_PATH=$(curl \\    -H \"Authorization: Bearer $(gcloud auth print-access-token)\" \\    -H \"Content-Type: application/json\" \\    \"https://config.googleapis.com/v1alpha2/${REVISION_ID}\" \\    | jq .applyResults.content -r)    echo $CONTENT_PATH\n```The following is an example of the output of this command:```\ngs://PROJECT_ID-REGION-blueprint-config/DEPLOYMENT_NAME/r-0/apply_results/content\n```\n- Download the Terraform configuration from Cloud Storage to Cloud Shell:```\ngsutil cp -r $CONTENT_PATH $HOMEcd $HOME/content/infra\n```Wait until the `Operation completed` message is displayed, as shown in the following example:```\nOperation completed over 45 objects/268.5 KiB\n```\n- Initialize Terraform:```\nterraform init\n```Wait until you see the following message:```\nTerraform has been successfully initialized!\n```\n- Remove the deployed resources:```\nterraform destroy\n```Terraform displays a list of the resources that will be destroyed.If any warnings about undeclared variables are displayed, ignore the warnings.\n- When you're prompted to perform the actions, enter `yes` .Terraform displays messages showing the progress. After all the resources are deleted, Terraform displays the following message:```\nDestroy complete!\n```\n- Delete the deployment artifact:```\ncurl -X DELETE \\    -H \"Authorization: Bearer $(gcloud auth print-access-token)\" \\    -H \"Content-Type: application/json\" \\    \"https://config.googleapis.com/v1alpha2/projects/${PROJECT_ID}/locations/${REGION}/deployments/${DEPLOYMENT_NAME}?force=true&delete_policy=abandon\"\n```\n- Wait a few seconds and then verify that the deployment artifact was deleted:```\ncurl -H \"Authorization: Bearer $(gcloud auth print-access-token)\" \\    -H \"Content-Type: application/json\" \\    \"https://config.googleapis.com/v1alpha2/projects/${PROJECT_ID}/locations/${REGION}/deployments/${DEPLOYMENT_NAME}\" \\    | jq .error.message\n```If the output shows `null` , wait a few seconds and then run the command again.After the deployment artifact is deleted, a message as shown in the following example is displayed:```\nResource 'projects/PROJECT_ID/locations/REGION/deployments/DEPLOYMENT_NAME' was not found\n```\n### Submit feedback\nJump Start Solutions are for informational purposes only and are not officially supported products. Google may change or remove solutions without notice.\nTo troubleshoot errors, review the Cloud Build logs and the Terraform output.\nTo submit feedback, do the following:\n- For documentation, in-console tutorials, or the solution, use the **Send Feedback** button on the page.\n- For unmodified code, create issues in the appropriate GitHub repository:- [Terraform code](https://github.com/GoogleCloudPlatform/terraform-dynamic-python-webapp) \n- [Application code](https://github.com/GoogleCloudPlatform/avocano) \nGitHub issues are reviewed on a best-effort basis and are not intended for general usage questions.\n- For issues with the products that are used in the solution, contact [Cloud Customer Care](/support-hub) .## What's next\nThis solution demonstrates how to deploy an ecommerce web application using Cloud Run. To continue learning more about Google Cloud products and capabilities, see:\n- [General development tips for Cloud Run](/run/docs/tips/general) .\n- [Load testing best practices for Cloud Run](/run/docs/about-load-testing) .\n- [End user authentication for Cloud Run tutorial](/run/docs/tutorials/identity-platform) .\n- [Serve dynamic content and host microservices using Firebase Hosting](https://firebase.google.com/docs/hosting/serverless-overview) .", "guide": "Docs"}