{"title": "Docs - Choose a Google Cloud bare metal migration strategy", "url": "https://cloud.google.com/architecture/migrating-bare-metal-workloads", "abstract": "# Docs - Choose a Google Cloud bare metal migration strategy\nThis article describes the three most common options for migrating your bare metal workloads to Google Cloud along with a framework for understanding your workload requirements. It also explains how to choose the bare metal option that's right for your situation. Finally, it provides practical use cases for each migration strategy.\nThis article is designed for IT managers and staff who want to understand the capabilities of the Google Cloud offerings [Migrate to Virtual Machines](/migrate/compute-engine/docs) , [Bare Metal Solution](/solutions/bare-metal) , and [Mainframe Modernization](/solutions/mainframe-modernization) , and how each can facilitate the migration of bare-metal workloads. The article also discusses an IBM offering for working on Google Cloud.\nMigrating to bare metal in Google Cloud serves as an important step toward transforming your IT strategy to focus on the cloud. By running your bare metal workloads closer to Google Cloud services, you can take advantage of those services while implementing your application modernization strategy in parallel.\n", "content": "## Evaluating subscription-based billing\nBefore you decide between the bare metal options described in this article, make sure that you understand your current costs. That way you can align your solution with your accounting and capacity planning. Migrating from on-premises physical hardware to a cloud-based subscription might affect your accounting practices and business-planning processes.\nBy migrating to the cloud, you no longer need to buy servers every three to five years. Instead, Google bills you every month for the cloud resources you use. This practice is known as subscription-based cloud billing. Depreciating your physical servers over a period of years is different from accounting for operating costs monthly. It's important to align your accounting and capacity-planning functions before migrating to bare metal.\n## Visualize migrating to bare metal with Google Cloud\nGoogle Cloud offers many options for migrating bare metal workloads. The three most common are:\n- [Migrate to VMs](/migrate/compute-engine) \n- [Google Cloud Bare Metal Solution](/bare-metal) \n- [IBM Power Systems on Google Cloud](https://console.cloud.google.com/marketplace/details/ibm-sg/ibm-power-cloud-for-gcp) \nThe following flowchart summarizes the decision points you'll encounter as you determine the best migration strategy for your bare metal workloads. If your bare metal server architecture is based on IBM, then use IBM Power Systems on Google Cloud. If the architecture is x86, ask yourself if you can virtualize your workload. If not, then use Google Cloud bare metal solution; if so, proceed to the next question. If your license terms strongly incentivize running on bare metal, OR if you want to self-manage physical servers, then use Google Cloud bare metal solution. If not, proceed to the next question: If your workload is affected by noisy neighbors, then use Compute Engine sole-tenant node. If not, use a standard Compute Engine VM.\nThe following section discusses virtualization and other important information for comparing bare metal options.\n## Before you begin: Understand virtualization\nVirtualization allows a single physical machine to run multiple virtual machines, each running separate operating systems and workloads. Most business workloads are run on virtual machines. Others are run directly on the physical machine, or \"bare metal.\"\nSome bare metal workloads can run directly on physical hardware using Bare Metal Solution, while others can be virtualized and migrated to Compute Engine.\nThe following diagram illustrates how Bare Metal Solution and Compute Engine work with each layer of a bare metal virtualization stack: physical hardware, hypervisor, virtual machines, operating systems, and applications.\nWith Migrate to VMs, you choose your operating system and manage your applications. Google manages the underlying virtual machine infrastructure, which includes the hypervisor and bare metal.\nWith Bare Metal Solution, you can manage every layer of the virtualization stack, which includes the hypervisor and everything inside it.\n### When not to virtualize\nEven if your company can virtualize its workloads, that doesn't always mean it should. For example, if managing physical servers is a core competency, it can make sense for your business to continue to do so. Your company might use specialized software that imposes restrictive licensing arrangements—making it cost-prohibitive to run the software virtually.\nMany workloads running on bare metal have technical requirements they can achieve only when running on hardware. For example, the VMware ESXi Hypervisor [requires access to hardware-level virtualization features](https://docs.vmware.com/en/VMware-vSphere/6.7/com.vmware.esxi.install.doc/GUID-DEB8086A-306B-4239-BF76-E354679202FC.html) , such as [Intel VT-x](https://www.intel.com/content/www/us/en/virtualization/virtualization-technology/intel-virtualization-technology.html) or [AMD RVI](https://www.amd.com/en/technologies/virtualization-solutions) . If you manage your own virtualization stack, you might need to configure specific BIOS settings for the software.\nSome workloads might need to remain on bare metal for non-technical reasons. Non-technical requirements include business policies, accounting practices, IT staff competencies, and licensing restrictions. For example, some software vendors might write restrictions into their licensing agreements to discourage or prohibit virtualizing their software. If that is the case, your company might incur greater costs by virtualizing instead of running on bare metal.\nYour company might have an appliance with specialized software that would be prohibitive to reengineer using cloud-based services, or that could suffer an unacceptable performance decrease if you migrate to a virtual machine. Even though direct hardware access isn't strictly required, it might be needed for performance or latency reasons. When migrating specialized appliances, assess whether they should be virtualized or whether they should continue to run on bare metal.\nNow that you understand when not to virtualize, here are the available bare metal options on Google Cloud.\n## Comparing Google Cloud bare metal options\nThis section spells out the bare metal options that are shown in the workflow diagram.\n### Migrate to IBM on Google Cloud\n[IBM Power Systems on Google Cloud](https://console.cloud.google.com/marketplace/details/ibm-sg/ibm-power-cloud-for-gcp) is an infrastructure-as-a-service offering from IBM. It's designed to deliver a public-cloud-based experience with the same infrastructure capabilities that you run on-premises and with low-latency access to Google Cloud services. The IBM Power Systems for Google Cloud service includes a license to run the AIX operating system with support entitlement for supported AIX versions.\nCloud instances are networked into a target Google Cloud project by using Google Cloud VPC Network Peering. VPC Network Peering enables virtual machines on IBM Power Systems servers to obtain direct private access to Google Cloud resources, such as compute, cloud storage, and other services over the internal global Google network. You can use this connectivity for solutions that span IBM Power Systems infrastructure and Google Cloud resources.\nIf you're running on IBM, IBM Power Systems for Google Cloud is your best option.\n### Migrate to bare metal with Bare Metal Solution\n[Google Cloud Bare Metal Solution](/bare-metal) provides commodity x86-64 server hardware to run specialized workloads with low-latency access to Google Cloud services. Google manages the server hardware, networking, facilities, and other core infrastructure. You can deploy these resources to any [Google Cloud region that supports bare metal](/bare-metal/docs/bms-planning#regional_availability) . You manage bare metal servers through the [Google Cloud console](/cloud-console) , access and security through [Identity and Access Management (IAM)](/iam/docs) , and billing through [Cloud Billing](/billing/docs) .\nWhen your licensing incentivizes running on bare metal, Bare Metal Solution is the best option.\n### Migrate to VMs\n[Migrate to VMs](/migrate/compute-engine/docs/4.5/how-to/prepare-vms-servers/physical-servers) can migrate physical servers or virtual machines that run [supported operating systems](/migrate/compute-engine/docs/4.8/reference/supported-os-versions) in Compute Engine. The Migrate to VMs [physical server connector](/migrate/compute-engine/docs/4.5/resources/downloads#drivers_and_add-ons) boots from an ISO image on your physical server and prepares the server for migration. The connector prepares the server by mapping the local storage of the physical server and creating a stub VMware virtual machine as a management object for Migrate to VMs cloud migration operations. The migration then proceeds for other virtual machines, except that the other migrations are performed in write-isolation mode. In write-isolation mode, changes made in the cloud are not synced back on-premises.\nIf your workloads aren't sensitive to [noisy neighbors](https://wikipedia.org/wiki/Cloud_computing_issues#Performance_interference_and_noisy_neighbors) , Migrate to VMs is the best option.\nBy default, Compute Engine virtual machines are multi-tenant. Many virtual machines run on a single physical machine. However, some workloads might perform poorly in a multi-tenant environment even if they don't require direct hardware access. For example, if your workload makes heavy use of L3 cache, its performance could suffer if other workloads on the same shared physical machine are concurrently consuming L3 cache. This sharing of resources is sometimes known as the noisy neighbor problem.\nIf your workloads are sensitive to noisy neighbors, the Compute Engine sole-tenant node is the best option.\n## Example use cases\nNow that you've read about the options available for migrating bare metal workloads, here are some specific examples that illustrate how each bare metal solution can apply to different workload types.\n### Commercial off-the-shelf software\nMany commercial off-the-shelf (COTS) applications do not require specific hardware and can be virtualized. There are many reasons for running commodity COTS software applications on bare metal. Maybe you merged with another company that ran bare metal and you haven't fully integrated IT environments, or maybe these applications began on dedicated hardware for performance reasons. If you can virtualize your workloads, then you have additional options available when you choose a migration strategy.\nYou can migrate virtual bare metal workloads with [Migrate to VMs](/migrate/compute-engine/docs) . Migrate to VMs [supports migration of physical servers](/migrate/compute-engine/docs/4.5/how-to/prepare-vms-servers/physical-servers) by virtualizing your bare metal system and migrating that virtual image to [Compute Engine](/compute/docs) virtual machines through an automated physical-to-virtual process.\n### Oracle Database\nSometimes where virtualizing is technically feasible, your licensing agreements might make it more cost-effective to run some applications on bare metal instead. As an example, [licensing Oracle Ⓡ software in the cloud](https://www.oracle.com/assets/cloud-licensing-070579.pdf) might be different than licensing it on bare metal due to the relationship between the Oracle Processor and the [Compute Engine vCPU](/compute/docs/cpu-platforms) . Oracle's [Partitioning Policy](https://www.oracle.com/assets/partitioning-070609.pdf) introduces additional considerations when running Oracle software in a multi-tenant environment. For licensing purposes, you might use a [processor core factor](http://www.oracle.com/us/corporate/contracts/processor-core-factor-table-070634.pdf) that is similar to that of your on-premises hardware. It is always wise to understand the financial implications of your [Oracle](https://www.oracle.com/assets/cloud-licensing-070579.pdf) license agreement. That way, you can optimize costs when moving to the cloud.\nTo meet performance requirements, many Oracle workloads could require [certified hardware](https://linux.oracle.com/pls/apex/f?p=117:1) and specific licenses. For more information, and to better understand your hardware options, [contact Sales](/contact) .\nDeploying your Oracle database on bare metal in Google Cloud might let you realize many of the cost benefits gained by running directly on hardware on-premises, while taking advantage of close proximity to Google Cloud services. By provisioning multiple bare metal instances, you can also set up Oracle Real Application Clusters for improved redundancy and performance.\nOracle, Partitioning Policy, Database, and Real Application Clusters are registered trademarks of Oracle and/or its affiliates.\n### VMware virtualization stack\nIf you self-manage your entire virtualization stack, migrating to bare metal in Google Cloud might be your most effective option. To optimize infrastructure costs, you can use your staff's expertise and your current license investment. You can run the full VMware virtualization stack, such as vSphere Hypervisor (ESXi), directly on bare metal with none of the functionality or performance limitations that you encounter in a nested (non-bare metal) virtualization architecture.\nWith a VMware hypervisor running on bare metal in Google Cloud, you can enjoy the same benefits as running on-premises bare metal, but with low-latency access to Google Cloud services. You can apply your existing investment and expertise in self-managing your VMware stack while gaining the ability to manage your bare metal instances like you manage the rest of your cloud environment.\n## Finding help\nGoogle Cloud provides the following support resources:\n- [Self-service resources](/solutions/migration-to-gcp-getting-started#self-service_resources) . If you don't need dedicated support, Google offers various options you can review at your own pace.\n- [Technology partners](https://cloud.google.com/find-a-partner/?search=bare%20metal) . Google Cloud has partnered with multiple companies to help you use our products and services.\n- [Google Cloud professional services](/consulting) . Our professional services can help you get the most out of your investment in Google Cloud.\nThere are more resources to help migrate workloads to Google Cloud in the [Google Cloud Migration Center](/migration-center) .\nFor more information about these resources, refer to the [finding help section](/solutions/migration-to-gcp-getting-started#finding_help) of [Migration to Google Cloud: getting started](/solutions/migration-to-gcp-getting-started) .\n## What's next\n- Read more about [Google Cloud bare metal solution](/solutions/bare-metal) .\n- Learn about our [Mainframe modernization offering](/solutions/mainframe-modernization) .\n- Learn about [Migrate to VMs](/migrate/compute-engine) .\n- Try out [IBM Power Systems on Google Cloud](https://console.cloud.google.com/marketplace/details/ibm-sg/ibm-power-cloud-for-gcp) from the marketplace.\n- Learn about Compute Engine [Sole-tenant nodes](/compute/docs/nodes) .", "guide": "Docs"}