{"title": "Docs - Manage your assets", "url": "https://cloud.google.com/architecture/framework/security/asset-management", "abstract": "# Docs - Manage your assets\nLast reviewed 2023-08-04 UTC\nThis document in the [Google Cloud Architecture Framework](/architecture/framework) provides best practices for managing assets.\nAsset management is an important part of your business requirements analysis. You must know what assets you have, and you must have a good understanding of all your assets, their value, and any critical paths or processes related to them. You must have an accurate asset inventory before you can design any sort of security controls to protect your assets.\nTo manage security incidents and meet your organization's regulatory requirements, you need an accurate and up-to-date asset inventory that includes a way to analyze historical data. You must be able to track your assets, including how their risk exposure might change over time.\nMoving to Google Cloud means that you need to modify your asset management processes to adapt to a cloud environment. For example, one of the benefits of moving to the cloud is that you increase your organization's ability to scale quickly. However, the ability to scale quickly can cause shadow IT issues, in which your employees create cloud resources that aren't properly managed and secured. Therefore, your asset management processes must provide sufficient flexibility for employees to get their work done while also providing for appropriate security controls.\n", "content": "## Use cloud asset management tools\nGoogle Cloud asset management tools are tailored specifically to our environment and to top customer use cases.\nOne of these tools is [Cloud Asset Inventory](/asset-inventory/docs/overview) , which provides you with both real-time information on the current state of your resources and with a five-week history. By using this service, you can get an organization-wide snapshot of your inventory for a wide variety of Google Cloud resources and policies. Automation tools can then use the snapshot for monitoring or for policy enforcement, or the tools can archive the snapshot for compliance auditing. If you want to analyze changes to the assets, asset inventory also lets you export metadata history.\nFor more information about Cloud Asset Inventory, see [Custom solution to respond to asset changes](/architecture/security-foundations/detective-controls#custom-solution-asset) and [Detective controls](/architecture/security-foundations/detective-controls) .\n## Automate asset management\nAutomation lets you quickly create and manage assets based on the security requirements that you specify. You can automate aspects of the asset lifecycle in the following ways:\n- Deploy your cloud infrastructure using automation tools such as Terraform. Google Cloud provides the [enterprise foundations blueprint](/architecture/security-foundations) , which helps you set up infrastructure resources that meet security best practices. In addition, it configures asset changes and policy compliance notifications in Cloud Asset Inventory.\n- Deploy your applications using automation tools such as [Cloud Run](/run/docs) and the [Artifact Registry](/artifact-registry/docs/overview) .## Monitor for deviations from your compliance policies\nDeviations from policies can occur during all phases of the asset lifecycle. For example, assets might be created without the proper security controls, or their privileges might be escalated. Similarly, assets might be abandoned without the appropriate end-of-life procedures being followed.\nTo help avoid these scenarios, we recommend that you monitor assets for deviation from compliance. Which set of assets that you monitor depends on the results of your risk assessment and business requirements. For more information about monitoring assets, see [Monitoring asset changes](/asset-inventory/docs/monitoring-asset-changes) .\n## Integrate with your existing asset management monitoring systems\nIf you already use a [SIEM](https://wikipedia.org/wiki/Security_information_and_event_management) system or other monitoring system, integrate your Google Cloud assets with that system. Integration ensures that your organization has a single, comprehensive view into all resources, regardless of environment. For more information, see [Export Google Cloud security data to your SIEM system](/community/tutorials/exporting-security-data-to-your-siem) and [Scenarios for exporting Cloud Logging data: Splunk](/architecture/exporting-stackdriver-logging-for-splunk) .\n## Use data analysis to enrich your monitoring\nYou can export your inventory to a [BigQuery table](/asset-inventory/docs/analyzing-iam-policy-longrunning-bigquery) or [Cloud Storage bucket](/asset-inventory/docs/analyzing-iam-policy-longrunning-cloud-storage) for additional analysis.\n## What's next\nLearn more about managing your assets with the following resources:\n- [Manage identity and access](/architecture/framework/security/identity-access) (next document in this series)\n- [Resource management](/architecture/framework/system-design/resource-management) \n- [System design](/architecture/framework/system-design)", "guide": "Docs"}