{"title": "Docs - Select geographic zones and regions", "url": "https://cloud.google.com/architecture/framework/system-design/geographic-zones-regions", "abstract": "# Docs - Select geographic zones and regions\nLast reviewed 2023-08-05 UTC\nThis document in the [Google Cloud Architecture Framework](/architecture/framework) provides best practices to deploy your system based on geographic requirements. You learn how to select optimal geographic zones and regions based on availability and proximity, to support compliance, optimize costs, and implement load balancing.\nWhen you select a region or multiple regions for your business applications, you consider criteria including service availability, end-user latency, application latency, cost, and regulatory or sustainability requirements. To support your business priorities and policies, balance these requirements and identify the best tradeoffs. For example, the most compliant region might not be the most cost-efficient region or it might not have the lowest carbon footprint.\n", "content": "## Deploy over multiple regions\nare independent geographic areas that consist of multiple zones. A is a deployment area for Google Cloud resources within a region; each zone represents a single failure domain within a region.\nTo help protect against expected downtime (including maintenance) and help protect against unexpected downtime like incidents, we recommend that you deploy fault-tolerant applications that have high availability and deploy your applications across multiple zones in one or more regions. For more information, see [Geography and regions](/docs/geography-and-regions) , [Application deployment considerations](/docs/geography-and-regions#application_deployment_considerations) , and [Best practices for Compute Engine regions selection](/solutions/best-practices-compute-engine-region-selection) .\nMulti-zonal deployments can provide resiliency if multi-region deployments are limited due to cost or other considerations. This approach is especially helpful in preventing zonal or regional outages and in addressing disaster recovery and business continuity concerns. For more information, see [Design for scale and high availability](/architecture/framework/reliability/design-scale-high-availability) .\n## Select regions based on geographic proximity\nLatency impacts the user experience and affects costs associated with serving external users. To minimize latency when serving traffic to external users, select a region or set of regions that are geographically close to your users and where your services run in a compliant way. For more information, see [Cloud locations](/about/locations) and the [Compliance resource center](/security/compliance) .\n## Select regions based on available services\nSelect a region based on the available services that your business requires. Most services are available across all regions. Some enterprise-specific services might be available in a subset of regions with their initial release. To verify region selection, see [Cloud locations](/about/locations) .\n## Choose regions to support compliance\nSelect a specific region or set of regions to meet geographic regulatory or compliance regulations that require the use of certain geographies, for example [General Data Protection Regulation (GDPR)](https://gdpr-info.eu/) or data residency. To learn more about designing secure systems, see [Compliance offerings](/security/compliance/offerings#/regions=Global) and [Data residency, operational transparency, and privacy for European customers on Google Cloud](https://services.google.com/fh/files/misc/googlecloud_european_commitments_whitepaper.pdf) .\n## Compare pricing of major resources\nRegions have different cost rates for the same services. To identify a cost-efficient region, compare pricing of the major resources that you plan to use. Cost considerations differ depending on backup requirements and resources like compute, networking, and data storage. To learn more, see the [Costoptimization category](/architecture/framework/cost-optimization) .\n## Use Cloud Load Balancing to serve global users\nTo improve the user experience when you serve global users, use [Cloud Load Balancing](/load-balancing) to help provide a single IP address that is routed to your application. To learn more about designing reliable systems, see [Google Cloud Architecture Framework: Reliability](/architecture/framework/reliability) .\n## Use the Cloud Region Picker to support sustainability\nGoogle has been carbon neutral since 2007 and is committed to being carbon-free by 2030. To select a region by its carbon footprint, use the [Google Cloud Region Picker](https://googlecloudplatform.github.io/region-picker/) . To learn more about designing for sustainability, see [Cloud sustainability](/sustainability) .\n## What's next\nLearn how to [manage your cloud resources](/architecture/framework/system-design/resource-management) using [Resource Manager](/resource-manager/docs) , the Google Cloud [resource hierarchy](/resource-manager/docs/cloud-platform-resource-hierarchy) , and the [Organization Policy Service](/resource-manager/docs/organization-policy/overview) .\nExplore other categories in the [Architecture Framework](/architecture/framework) such as reliability, operational excellence, and security, privacy, and compliance.", "guide": "Docs"}