{"title": "Docs - Migrate from AWS to Google Cloud: Get started", "url": "https://cloud.google.com/architecture/migration-from-aws-get-started", "abstract": "# Docs - Migrate from AWS to Google Cloud: Get started\nLast reviewed 2023-05-19 UTC\nGoogle Cloud provides tools, products, guidance, and professional services to help you migrate workloads, data, and processes from Amazon Web Services (AWS) to Google Cloud. This document introduces a discussion about how to design, implement, and validate a plan to migrate from AWS to Google Cloud.\nThe discussion is intended for cloud administrators who want details about how to plan and implement a migration process. It's also intended for decision-makers who are evaluating the opportunity to migrate and who want to explore what migration looks like.\nThis document is part of a multi-part series about migrating from AWS to Google Cloud that includes the following documents:\n- Get started (this document)\n- [Migrate from Amazon EC2 to Compute Engine](/architecture/migrate-amazon-ec2-to-compute-engine) \n- [Migrate from Amazon S3 to Cloud Storage](/architecture/migrate-amazon-s3-to-cloud-storage) \n- [Migrate from Amazon Elastic Kubernetes Service (Amazon EKS) to Google Kubernetes Engine](/architecture/migrate-amazon-eks-to-gke) \nThis series assumes that you've read and are familiar with the following documents:\n- [Migrate to Google Cloud: Choose your migration path](/architecture/migration) : presents the Migration to Google Cloud series and helps you understand how each piece of the series relates to other documents.\n- [Migrate to Google Cloud: Get started](/solutions/migration-to-gcp-getting-started) : describes the general migration framework that you follow in this migration.\nMigrating your workloads, data, and processes from AWS to Google Cloud can be a challenging task and can take days, weeks, or months to complete, depending on the scope and size of the migration. Therefore, we recommend that you plan and execute your migration carefully.\nAWS and Google Cloud products that target similar use cases might seem similar in the way you provision, configure, and use the resources that they provide. However, despite similarities, these resources might differ significantly in the way they work and in their requirements. We therefore recommend that you assess the ways in which similar AWS and Google Cloud resources work before you plan your migration.\nThis series provides guidance about the following migration journeys:\n- **From AWS compute services to Google Cloud** - [Migrate from Amazon EC2 to Compute Engine](/architecture/migrate-amazon-ec2-to-compute-engine) \n- [Migrate VMware VMs to your Google Cloud VMware Engine private cloud](/vmware-engine/docs/workloads/howto-migrate-workloads) \n- [Migrate from Amazon Elastic Kubernetes Service (Amazon EKS) to Google Kubernetes Engine](/architecture/migrate-amazon-eks-to-gke) \n- **From AWS data storage services to Google Cloud** - [Migrate from Amazon S3 to Cloud Storage](/architecture/migrate-amazon-s3-to-cloud-storage) \n- **From AWS data analytics services to Google Cloud** - [Amazon Redshift to BigQuery migration](/bigquery/docs/migration/redshift-overview) We also recommend that you design and implement proofs of concept to validate your migration plans and to gather experience. For more information, see [Migrate to Google Cloud: Assess and discover your workloads](/architecture/migration-to-gcp-assessing-and-discovering-your-workloads#experimenting_and_designing_proofs_of_concept) .\n", "content": "## What's next\n- Learn [how to migrate from Amazon EC2 to Compute Engine](/architecture/migrate-amazon-ec2-to-compute-engine) .\n- Learn [how to migrate from Amazon S3 to Cloud Storage](/architecture/migrate-amazon-s3-to-cloud-storage) .\n- Learn when to [find help for your migrations](/architecture/migration-to-gcp-getting-started#finding_help) .\n- Learn [how to compare AWS and Azure services to Google Cloud](/free/docs/aws-azure-gcp-service-comparison) .\n- Learn about other migration options by reading [Migrate to Google Cloud: Choose your migration path](/architecture/migration) .\n- Learn about the migration framework by reading [Migrate to Google Cloud: Get started](/architecture/migration-to-gcp-getting-started) .\n- Explore reference architectures, diagrams, and best practices about Google Cloud. Take a look at our [Cloud Architecture Center](/architecture) .", "guide": "Docs"}