{"title": "Docs - Terminology", "url": "https://cloud.google.com/architecture/framework/reliability/terminology", "abstract": "# Docs - Terminology\nThis document provides common definitions for SLO-related terms used in the [Google CloudArchitecture Framework: Reliability](/architecture/framework/reliability) section.\n- **service level:** a measurement of how well a given service performs its expected work for the user. You can describe this measurement in terms of and measure it by various methods, depending on what the service does and what the user expects it to do or is told it can do.Example: \"A user expects our service to be available and fast.\"\n- **critical user journey (CUJ):** a set of interactions a user has with a service to achieve a single goal—for example, a single click or a multi-step pipeline.Example: \"A user clicks the checkout button and waits for the response that the cart is processed and a receipt is returned.\"\n- **service level indicator (SLI):** a gauge of user happiness that can be measured quantitatively for a service level. In other words, to measure a service level, you must measure an indicator that represents user happiness with that service level—for example, a service's availability. An SLI can be thought of as a line on a graph that changes over time, as the service improves or degrades. This tends to be a radio of \"good\" / \"total\" expressed as a unit-less percentage. By consistently using these percentages, teams can understand the SLI without deep knowledge of its implementationExample: \"Measure the number of successful requests in the last 10 minutes divided by the number of all valid requests in the last 10 minutes.\"\n- **service level objective (SLO):** the level that you expect a service to achieve most of the time and against which an SLI is measured.Example: \"Service responses are be faster than 400 milliseconds (ms) for 95% of all valid requests measured over 14 days.\"\n- **service level agreement (SLA):** a description of what must happen if an SLO is not met. Generally, an SLA is a legal agreement between providers and customers and might even include terms of compensation. In technical discussions about SRE, this term is often avoided.Example: \"If the service does not provide 99.95% availability over a calendar month, the service provider compensates the customer for every minute out of compliance.\"\n- **error budget:** how much time or how many negative events you can withstand before you violate your SLO. This measurement tells you how many errors your business can expect or tolerate. The error budget is critical in [helping you make potentially risky decisions](https://landing.google.com/sre/sre-book/chapters/embracing-risk/) .Example: \"If our SLO is 99.9% available, we allow 0.1% of our requests to serve errors, either through incidents, accidents, or experimentation.", "content": "\"", "guide": "Docs"}