{"title": "Docs - Google Cloud Architecture Framework: Cost optimization", "url": "https://cloud.google.com/architecture/framework/cost-optimization", "abstract": "# Docs - Google Cloud Architecture Framework: Cost optimization\nLast reviewed 2023-06-12 UTC\nThis category in the [Google Cloud Architecture Framework](/architecture/framework) provides design recommendations and describes best practices to help architects, developers, administrators, and other cloud practitioners optimize the cost of workloads in Google Cloud.\nMoving your IT workloads to the cloud can help you to innovate at scale, deliver features faster, and respond to evolving customer needs. To migrate existing workloads or deploy applications built for the cloud, you need a topology that's optimized for security, resilience, operational excellence, cost, and performance.\nIn the cost optimization category of the Architecture Framework, you learn to do the following:\n- [Adopt and implement FinOps](/architecture/framework/cost-optimization/finops) : Strategies to help you encourage employees to consider the cost impact when provisioning and managing resources in Google Cloud.\n- [Monitor and control cost](/architecture/framework/cost-optimization/monitor) : Best practices, tools, and techniques to track and control the cost of your resources in Google Cloud.\n- [Optimize cost: Compute, containers, and serverless](/architecture/framework/cost-optimization/compute) : Service-specific cost-optimization controls for Compute Engine, Google Kubernetes Engine, Cloud Run, Cloud Functions, and App Engine.\n- [Optimize cost: Storage](/architecture/framework/cost-optimization/storage) : Cost-optimization controls for Cloud Storage, Persistent Disk, and Filestore.\n- [Optimize cost: Databases and smart analytics](/architecture/framework/cost-optimization/databases) : Cost-optimization controls for BigQuery, Bigtable, Spanner, Cloud SQL, Dataflow, and Dataproc.\n- [Optimize cost: Networking](/architecture/framework/cost-optimization/networking) : Cost-optimization controls for your networking resources in Google Cloud.\n- [Optimize cost: Cloud operations](/architecture/framework/cost-optimization/cloudops) : Recommendations to help you optimize the cost of monitoring and managing your resources in Google Cloud", "content": ".", "guide": "Docs"}