{"title": "Docs - Organization structure", "url": "https://cloud.google.com/architecture/security-foundations/organization-structure", "abstract": "# Docs - Organization structure\nLast reviewed 2023-12-20 UTC\nThe root node for managing resources in Google Cloud is the [organization](/resource-manager/docs/cloud-platform-resource-hierarchy#organizations) . The Google Cloud organization provides a [resource hierarchy](/resource-manager/docs/cloud-platform-resource-hierarchy) that provides an ownership structure for resources and attachment points for [organization policies](/resource-manager/docs/organization-policy/overview#organization_policy) and access controls. The resource hierarchy consists of folders, projects, and resources, and it defines the structure and use of Google Cloud services within an organization.\nResources lower in the hierarchy inherit policies such as IAM allow policies and organization policies. All access permissions are denied by default, until you apply allow policies directly to a resource or the resource inherits the allow policies from a higher level in the resource hierarchy.\nThe following diagram shows the folders and projects that are deployed by the blueprint.\nThe following sections describe the folders and projects in the diagram.\n", "content": "## Folders\nThe blueprint uses [folders](/resource-manager/docs/cloud-platform-resource-hierarchy#folders) to group projects based on their environment. This logical grouping is used to apply configurations like allow policies and organization policies at the folder level and then all resources within the folder inherit the policies. The following table describes the folders that are part of the blueprint.\n| Folder  | Description                         |\n|:--------------|:---------------------------------------------------------------------------------------------------------------|\n| bootstrap  | Contains the projects that are used to deploy foundation components.           |\n| common  | Contains projects with resources that are shared by all environments.           |\n| production | Contains projects with production resources.                 |\n| nonproduction | Contains a copy of the production environment to let you test workloads before you promote them to production. |\n| development | Contains the cloud resources that are used for development.             |\n| networking | Contains the networking resources that are shared by all environments.           |\n## Projects\nThe blueprint uses [projects](/resource-manager/docs/cloud-platform-resource-hierarchy#projects) to group individual resources based on their functionality and intended boundaries for access control. This following table describes the projects that are included in the blueprint.\n| Folder               | Project       | Description                                           |\n|:------------------------------------------------------------------|:--------------------------------|:--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| bootstrap               | prj-b-cicd      | Contains the deployment pipeline that's used to build out the foundation components of the organization. For more information, see deployment methodology.       |\n| bootstrap               | prj-b-seed      | Contains the Terraform state of your infrastructure and the Terraform service account that is required to run the pipeline. For more information, see deployment methodology.   |\n| common               | prj-c-secrets     | Contains organization-level secrets. For more information, see store application credentials with Secret Manager.                  |\n| common               | prj-c-logging     | Contains the aggregated log sources for audit logs. For more information, see centralized logging for security and audit.                |\n| common               | prj-c-scc      | Contains resources to help configure Security Command Center alerting and other custom security monitoring. For more information, see threat monitoring with Security Command Center. |\n| common               | prj-c-billing-logs    | Contains a BigQuery dataset with the organization's billing exports. For more information, see allocate costs between internal cost centers.           |\n| common               | prj-c-infra-pipeline   | Contains an infrastructure pipeline for deploying resources like VMs and databases to be used by workloads. For more information, see pipeline layers.        |\n| common               | prj-c-kms      | Contains organization-level encryption keys. For more information, see manage encryption keys.                      |\n| networking              | prj-net-{env}-shared-base  | Contains the host project for a Shared VPC network for workloads that don't require VPC Service Controls. For more information, see network topology.         |\n| networking              | prj-net-{env}-shared-restricted | Contains the host project for a Shared VPC network for workloads that do require VPC Service Controls. For more information, see network topology.         |\n| networking              | prj-net-interconnect   | Contains the Cloud Interconnect connections that provide connectivity between your on-premises environment and Google Cloud. For more information, see hybrid connectivity.   |\n| networking              | prj-net-dns-hub     | Contains resources for a central point of communication between your on-premises DNS system and Cloud DNS. For more information, see centralized DNS setup.       |\n| environment folders (production, non-production, and development) | prj-{env}-monitoring   | Contains a scoping project to aggregate metrics from projects in that environment. For more information, see alerting on log-based metrics and performance metrics     |\n| environment folders (production, non-production, and development) | prj-{env}-secrets    | Contains folder-level secrets. For more information, see store and audit application credentials with Secret Manager.                 |\n| environment folders (production, non-production, and development) | prj-{env}-kms     | Contains folder-level encryption keys. For more information, see manage encryption keys.                        |\n| environment folders (production, non-production, and development) | application projects   | Contains various projects in which you create resources for applications. For more information, see project deployment patterns and pipeline layers.         |\n## Governance for resource ownership\nWe recommend that you apply labels consistently to your projects to assist with governance and cost allocation. The following table describes the project labels that are added to each project for governance in the blueprint.\n| Label   | Description                                                   |\n|:-----------------|:-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| application  | The human-readable name of the application or workload that is associated with the project.                               |\n| businesscode  | A short code that describes which business unit owns the project. The code shared is used for common projects that are not explicitly tied to a business unit.               |\n| billingcode  | A code that's used to provide chargeback information.                                         |\n| primarycontact | The username of the primary contact that is responsible for the project. Because project labels can't include special characters such as the ampersand (@), it is set to the username without the @example.com suffix. |\n| secondarycontact | The username of the secondary secondary contact that is responsible for the project. Because project labels can't include special characters such as @, set only the username without the @example.com suffix.   |\n| environment  | A value that identifies the type of environment, such as bootstrap, common, production, non-production,development, or network.                      |\n| envcode   | A value that identifies the type of environment, shortened to b, c, p, n, d, or net.                                 |\n| vpc    | The ID of the VPC network that this project is expected to use.                                      |\nGoogle might occasionally send important notifications such as account suspensions or updates to product terms. The blueprint uses [Essential Contacts](/resource-manager/docs/managing-notification-contacts) to send those notifications to the groups that you configure during deployment. Essential Contacts is configured at the organization node and inherited by all projects in the organization. We recommend that you review these groups and ensure that emails are monitored reliably.\nEssential Contacts is used for a different purpose than the `primarycontact` and `secondarycontact` fields that are configured in project labels. The contacts in project labels are intended for internal governance. For example, if you identify non-compliant resources in a workload project and need to contact the owners, you could use the `primarycontact` field to find the person or team responsible for that workload.\n## What's next\n- Read about [networking](/architecture/security-foundations/networking) (next document in this series).", "guide": "Docs"}