{"title": "Docs - Installing F5 BIG-IP ADC for GKE on VMware", "url": "https://cloud.google.com/architecture/partners/installing-f5-big-ip-adc-for-gke-on-prem?hl=zh-cn", "abstract": "# Docs - Installing F5 BIG-IP ADC for GKE on VMware\nLast reviewed 2022-08-25 UTC\nBy Gregory Coward, Solution Architect, [F5 Networks](https://www.f5.com/) \nThis document shows how to install and configure the [F5 BIG-IP](https://www.f5.com/products/big-ip-services) Application Delivery Controller (ADC) before you [integrate the ADC with GKE on VMware](/anthos/clusters/docs/on-prem) . If you're interested in installing F5 BIG-IP ADC using manual load-balancing mode on GKE on VMware, see [Installing F5 BIG-IP ADC for GKE on VMware using manual load balancing](/solutions/partners/installing-f5-big-ip-adc-for-gke-on-prem-using-manual-load-balancing) .\nF5 is a leading provider of ADC services. The F5 BIG-IP platform provides various services to help you enhance the security, availability, and performance of your apps. These services include L7 load balancing, network firewalling, [web application firewalling (WAF)](https://wikipedia.org/wiki/Web_application_firewall) , and DNS services. For GKE on VMware, the BIG-IP provides external access and L3/4 load-balancing services.", "content": "## Why F5?Among its various services and features, BIG-IP provides [container ingress services (CIS)](https://clouddocs.f5.com/containers/v2/) . CIS provides platform-native integrations for BIG-IP devices from platform as a service (PaaS) providers like Kubernetes. This integration makes it possible to dynamically allocate BIG-IP L4-L7 services in container orchestration environments.\n [GKE Enterprise](/anthos) uses a version of CIS to automatically provision L4 load-balancing services on the BIG-IP platform while providing external access to apps deployed on GKE on VMware clusters.\nAfter you configure BIG-IP, you can integrate with GKE on VMware for ingress as part of the [default installation](/anthos/clusters/docs/on-prem) .\n **Note:** Currently, when deployed as part of the [default GKE on VMware installation](/anthos/clusters/docs/on-prem) , only a single CIS controller can be deployed. To use more controllers, consider deploying the BIG-IP using [manual load-balancing mode](/anthos/clusters/docs/on-prem/how-to/manual-load-balance) .## Objectives\n- Learn about BIG-IP high availability.\n- Set up BIG-IP.\n- Configure BIG-IP before you deploy it to GKE on VMware.\n## CostsIn this document, you use the following billable components of Google Cloud:- [GKE Enterprise](/anthos/pricing) \nTo generate a cost estimate based on your projected usage,  use the [pricing calculator](/products/calculator) . ## Before you begin\n- GKE on VMware automatically installs F5 BIG-IP container ingress services (CIS). Each version of GKE on VMware relies on a [different version of CIS](/anthos/clusters/docs/on-prem/how-to/setup-load-balance) . Ensure that the F5 BIG-IP load balancer version supports the F5 BIG-IP CIS version that comes with GKE on VMware by consulting with the [F5 BIG-IP Controller/Platform compatibility matrix](https://clouddocs.f5.com/containers/v2/releases_and_versioning.html#connector-compatibility) .\n- Obtain an F5 BIG-IP Application Delivery Controller and license. The F5 BIG-IP ADC is available in various hardware platforms and virtual editions. Regardless of the platform you use, the solution is supported, and the following configuration process is applicable.There are three types of licenses for F5 BIG-IP.| License type   | Production      | Evaluation      | Demonstration     |\n|:-----------------------|:-------------------------------|:--------------------------------|:--------------------------------|\n| Expiration date  | No        | Yes, 45 days     | Yes, 30 days     |\n| Throughput limitations | Up to 40 Gbps on GKE on VMware | 25 Mbps - 10 Gbps    | 1 Mbps       |\n| Use case    | Production      | Proof of concept, demonstration | Proof of concept, demonstration |- If you have a production license, you can use that license.\n- For the purpose of this tutorial, you can [request a free trial license key](https://www.f5.com/trials) .\n- If your throughput requirements are greater than 1 Mbps provided by the trial license, you can request an evaluation license from F5:- [Request a BIG-IP evaluation license](https://www.google.com/url?sa=D&q=https%3A%2F%2Ff5.com%2Fproducts%2Ftrials%2Fbig-ip-evaluation-request%2Fpopup%2Ftrue%3Fsbtitle%3DBIG-IP%2BEvaluation%2BTrial%2BRequest%26utm_source%3Df5com%26utm_medium%3Dweb%26utm_campaign%3Dhtb-trial-page) .\n- If you use GKE Enterprise, [Send email to F5 to request a BIG-IP evaluation license](mailto:googleteam@f5.com) .\n- If the BIG-IP system contains an evaluation or demonstration license, the BIG-IP system stops processing traffic when the license expires.\n- [Activate a license key for BIG-IP](https://www.f5.com/products/get-f5) .\n- Make sure your environment meets the following minimum system requirements:- 8 vCPUs that aren't shared between other hosts on that system\n- 16 GB memory that isn't shared between other hosts on that system## ArchitectureThere are two common scenarios to deploy BIG-IP ADC to GKE on VMware clusters. Because the BIG-IP acts as a proxy for external access to the clusters, it's common to deploy a BIG-IP with three or more interfaces, as illustrated in the following diagram.In the preceding diagram, separate interfaces serve internal and external -facing traffic independently. This architecture provides better visibility for monitoring and troubleshooting, and increased throughput.\nAlthough uncommon, you can deploy BIG-IP in a two-armed mode, where only one interface serves data plane traffic, as illustrated in the following diagram.While the preceding configuration isn't considered a best practice, if you're integrating into an existing environment with a pre-defined network architecture, you might need this type of configuration.## BIG-IP high availabilityTo ensure availability of your applications, it is considered a best practice for the BIG-IP to be deployed in either an active-standby or active-active device service cluster. The BIG-IP uses [device service clustering (DSC)](https://techdocs.f5.com/kb/en-us/products/big-ip_ltm/manuals/product/bigip-system-device-service-clustering-administration-13-1-0/1.html) to synchronize configuration data between cluster group members and to provide automatic failover if the active device fails.\nYou can configure the BIG-IP for DSC as part of the [initial setup](https://techdocs.f5.com/kb/en-us/products/big-ip_ltm/manuals/product/bigip-system-initial-configuration-11-6-0.html) or anytime thereafter by running the [Config Sync/HA utility](https://techdocs.f5.com/kb/en-us/products/big-ip_ltm/manuals/product/bigip-system-device-service-clustering-administration-13-1-0/1.html) . With that said, there are important considerations for the DSC and how the BIG-IP interacts with GKE on VMware.\n### F5 CIS and Config SyncAs noted earlier, the BIG-IP uses F5 Container Integration Services (CIS) to integrate with GKE on VMware. CIS deploys a lightweight controller into the environment to monitor the partition it manages for configuration changes. If CIS discovers changes, the connector reapplies its own configuration to the BIG-IP system.\nF5 doesn't typically recommend making configuration changes to objects in any partition managed by F5 CIS by any other means, including by syncing configuration from another device or service group. However, because GKE on VMware uses [NodePort](/anthos/clusters/docs/on-prem/concepts/networking) mode only, you can deploy the BIG-IP systems in an active-standby cluster and take advantage of F5’s native configuration auto-sync capabilities.\n### Controller instance to BIG-IP ratioBIG-IP systems use two types of IP addresses, floating and non-floating. A non-floating IP address always remains with the BIG-IP device where it was defined. Floating IP addresses are used and are owned by whichever BIG-IP is the active device. In the event of a failover, these addresses float from the formerly active to the newly active BIG-IP.\nWhile F5 typically recommends deploying one controller instance per BIG-IP device to further enhance availability, you can deploy a single CIS instance pointing to the BIG-IP cluster's floating self-IP address. When changes to the GKE on VMware infrastructure occur and are updated on the active BIG-IP by the controller), the standby device receives updates automatically from the configuration synchronization.## Setting up your environment\n- [Follow the instructions to set up BIG-IP virtual edition deployed on VMware ESXi 6.5](https://techdocs.f5.com/kb/en-us/products/big-ip_ltm/manuals/product/bigip-ve-setup-vmware-esxi-13-1-0/3.html) .The OVF template requires configuring four interfaces. The fourth interface is designated for HA heartbeat traffic between BIG-IP pairs. For this three-arm deployment, assign the internal network `gke-node` .\n- After the VM boots, use the F5 BIG-IP's [setup utility](https://techdocs.f5.com/kb/en-us/products/big-ip_ltm/manuals/product/bigip-system-initial-configuration-11-6-0.html) for initial configuration. The setup utility walks you through the following configuration tasks:- From a network accessible workstation on which you configured the`gke-mgmt`interface, go to the following URL`https://` ``where``is the address you configured for your device.\n- When prompted, enter the default username as`admin`and the password as`admin`.\n- Click **Log in** .\n- To install a license, in the **Base Registration Key** field, enter your key. The type of license dictates the BIG-IP's services and bandwidth limits.\n- To enhance performance when working with GKE clusters, set the **Management (MGMT)** plane provisioning to **Large** .\n- To provide L3/4 load balancing to the GKE on VMware environment, set the **Local Traffic (LTM)** module to **Nominal** .\n- In the **Host and User Information** window, you provide the hostname, FQDN of the BIG-IP system, and update the and account passwords.\n- In the **Networking** window, you walk through configuring the BIG-IP's  basic networking. The utility creates the internal, `gke-node` and  external, `gke-external` interfaces, VLANs, and self-IP addresses. The fourth interface deployed by VMware is left unconfigured. \n## Additional configurationAfter the Setup utility completes, you have a functioning BIG-IP with a management plane interface attached to the `gke-mgmt` VMware network and two data plane interfaces attached to VMware networks, `gke-node` and `gke-external` .\nBefore you deploy GKE on VMware, more configuration of BIG-IP is required.- [Create an administrative partition](https://techdocs.f5.com/kb/en-us/products/big-ip_ltm/manuals/product/bigip-user-account-administration-12-0-0/3.html) for each admin and user cluster you intend to expose and access. Initially, you define two partitions: one for the admin cluster, and one for the first user cluster. Don't use cluster partitions for anything else. Each of the clusters must have a partition that is for the sole use of that cluster.\n- If you're planning to use a default route domain in the partitions, follow the instructions in [this](https://techdocs.f5.com/en-us/bigip-14-1-0/big-ip-tmos-routing-administration-14-1-0/route-domains.html) document to assign default route domain to each partition that you plan to use.\n### F5 BIG-IP account permissionsThe existing Administrator role provides enough permissions for use with GKE on VMware. For more information, see [User roles](https://techdocs.f5.com/kb/en-us/products/big-ip_ltm/manuals/product/bigip-user-account-administration-11-6-0/3.html) . You can also learn how to [create additional users](https://techdocs.f5.com/kb/en-us/products/big-ip_ltm/manuals/product/bigip-user-account-administration-13-1-0/4.html) .\n### GKE Enterprise-specific system optimization\n- Use an SSH utility, such as [Putty](https://www.putty.org/) or [Cygwin](https://www.cygwin.com/) to establish an SSH connection to the BIG-IP's management interface.\n- Allocate more memory to the `restjavad` process:```\ntmsh modify sys db restjavad.useextramb value true\n```You don't need access to tmsh ( [Traffic Management Shell](https://clouddocs.f5.com/cli/tmsh-reference/latest/general/tmsh.html) ) to run this command. The `restjavad` process provides control-plane access to the BIG-IP system by using an HTTP REST API.\n- Restart the `restjavad` process:```\nbigstart restart restjavad\n```\n- If you're using BIG-IP 13.1 or a higher version, you can skip this step. Allocate more memory to Tomcat:```\ntmsh modify /sys db provision.tomcat.extramb value 20\n```\n- Restart the Tomcat service:```\ntmsh restart /sys service tomcat\n```\n## Modifying CIS-managed virtual serversAs noted earlier, CIS is deployed to the GKE on VMware environment to monitor configuration changes and update the BIG-IP system, effectively overwriting the relevant user partition. As a result of this integration, manual modifications made to a virtual server within a CIS-managed cluster are overwritten.\nWhile not typically recommended, there can be situations, such as using custom protocol profiles or persistence settings, where you might use BIG-IP system functionality that isn't natively supported by the CIS controller. To accomplish this, you can whitelist a CIS-configured virtual server. Whitelisting tells the Controller to merge its configuration into the existing virtual server instead of overwriting it.\nTo whitelist a particular CIS-managed virtual server, complete the following steps:- Establish an SSH connection to the BIG-IP's management interface.\n- Access the TMOS command-line shell:```\ntmsh\n```\n- Change to your `` user partition.```\ncd /partition name\n```\n- Whitelist a virtual server:```\nmodify ltm virtual virtual-server-name metadata add { cccl-whitelist { value 1 }}\n```Replace the following:- ``: the name of the virtual server you want to whitelist.\nAt this point, your BIG-IP is configured and ready to provide L3/4 load-balancing services for your GKE on VMware environment. You can now proceed with [deploying GKE on VMware](/anthos/clusters/docs/on-prem) .## What's next\n- Explore reference architectures, diagrams, and best practices about Google Cloud. Take a look at our [Cloud Architecture Center](/architecture) .\n- Learn more about F5 [BIG-IP Application Services](https://www.f5.com/products/big-ip-services) .\n- Learn more about F5 [Container Ingress Services](https://clouddocs.f5.com/containers/v2/kubernetes/) .\n- Learn more about BIG-IP configurations and capabilities:- [Certificate profiles](https://techdocs.f5.com/kb/en-us/products/big-ip_ltm/manuals/product/ltm-profiles-reference-13-1-0/6.html) \n- [WAF policies](https://support.f5.com/csp/article/K85426947)", "guide": "Docs"}