{"title": "Docs - Migrating VMs to containers with Migrate to Containers", "url": "https://cloud.google.com/architecture/migrating-vms-to-containers-with-migrate-for-anthos", "abstract": "# Docs - Migrating VMs to containers with Migrate to Containers\nLast reviewed 2021-10-21 UTC\nThis document is for cloud architects responsible for designing and implementing a migration plan for virtual-machine-based workloads to containers. It provides guidance about using [Migrate to Containers](/migrate/anthos/docs) to migrate your virtual machines (VMs) from your source environment to containers running in [Google Kubernetes Engine (GKE) or GKE Enterprise](/migrate/anthos/docs/getting-started) . Your source environment might be running in an on-premises environment, in a private hosting environment, or in another cloud.\nThis document provides an overview of Migrate to Containers. It also contains important points for you to consider when planning a VM migration to containers. It's part of a multi-part series about migrating to Google Cloud. If you're interested in an overview of the series, see [Migration to Google Cloud: Choosing your migration path](/architecture/migration-to-gcp-choosing-your-path) .\n**Important:** The processes and procedures described can take days, weeks, or months to complete depending on the size of your organization.\nRead this document if you're planning to migrate VMs running a [compatible operating system](/migrate/anthos/docs/compatible-os-versions) (OS), such as Linux or Windows, from a [supported source environment](/migrate/anthos/docs/migration-prerequisites#supported_vm_source_platforms) to a [GKE or GKE Enterprise environment](/migrate/anthos/docs/getting-started) with Migrate to Containers. These source environments can include the following:\n- A [Compute Engine](/compute/docs) environment\n- A [VMware vSphere](https://www.vmware.com/products/vsphere.html) environment\n- A [Microsoft Azure VM](https://azure.microsoft.com/en-us/services/virtual-machines/) environment\n- An [Amazon Elastic Compute Cloud (Amazon EC2)](https://aws.amazon.com/ec2/) environment\nMigrate to Containers lets you place existing VM-based workloads into GKE and GKE Enterprise containers, without:\n- Requiring access to source code\n- Rewriting your workloads\n- Manually containerizing your workloads\nMigrating VM-based workloads with Migrate to Containers, provides the following benefits:\n- [A containerized environment](/migrate/anthos/docs/anthos-migrate-benefits) , including:\n- High-workload density\n- Rich orchestration mechanisms and policy management\n- Flexible service-to-service communication channels\n- Can use continuous integration and continuous deployment pipelines\n- Can move from unsupported OS versions\n- Can start decommissioning your VM-based environment\nMigrating VM-based workloads to containers with Migrate to Containers is one of the possible steps in your workload modernization journey. Migrating VM-based workloads with Migrate to Containers helps you avoid the expensive rewrites needed to modernize those workloads. It doesn't transform them into workloads designed to run in a cloud environment, however.\nIdeal migration candidates include the following:\n- Workloads where modernization through a complete rewrite is either impossible or too expensive\n- Workloads with unknown dependencies that could break something if touched\n- Workloads that are maintained, but not actively developed\n- Workloads that aren't maintained anymore\n- Workloads without source code access\nYou can interact with Migrate to Containers in multiple ways. For example, it's accessible through the [Google Cloud console](/migrate/anthos/docs/dev-env-overview#google-cloud-console) . If you need to automate the migration process and integrate it with your existing toolchain, you can use the [command-line interface](/migrate/anthos/docs/dev-env-overview#command-line_interface) and Migrate to Containers [Kubernetes Custom Resource Definitions (CRDs)](/migrate/anthos/docs/dev-env-overview#crd-based_api) .\nFor more information about Migrate to Containers interfaces, see [APIs and reference | Migrate to Containers](/migrate/anthos/docs/reference) .\nThis document assumes that you've read and are familiar with the following documents:\n- [Migration to Google Cloud: Getting started](/architecture/migration-to-gcp-getting-started) describes the process of migrating your workloads to Google Cloud.\n- [Migrate to Containers architecture](/migrate/anthos/docs/architecture) describes the reference architecture of Migrate to Containers.\n- [Migrate to Containers migration prerequisites](/migrate/anthos/docs/migration-prerequisites-overview) describes how to assess whether your workloads are compatible with a migration with Migrate to Containers.", "content": "## Designing the migration to Google Cloud\nTo migrate your VMs from your source environment to containers running in Google Cloud, we recommend that you follow the framework described in the [Migration to Google Cloud series](/architecture/migration-to-gcp-getting-started) .\nThe following diagram illustrates the path of your migration journey:\nThe framework illustrated in the preceding diagram has four phases:\n- **Assess** . In this phase, you assess your source environment, assess the workloads that you want to migrate to Google Cloud, and assess which VMs support each workload.\n- **Plan** . In this phase, you create the basic infrastructure for Migrate to Containers, such as provisioning the resource hierarchy and setting up network access.\n- **Deploy** . In this phase, you migrate the VMs from the source environment to GKE or GKE Enterprise with Migrate to Containers.\n- **Optimize** . In this phase, you begin to take advantage of the cloud technologies and capabilities.## Assessing the source environment and workloads\nIn the assessment phase, you gather information about your source environment and the VM-based workloads you want to migrate. Doing so helps you rightsize the resources that you need—both for the migration and for your target environment.\nIn the assessment phase, you do the following:\n- Build a comprehensive inventory of your workloads.\n- Catalog your applications according to their properties and dependencies.\n- Train and educate your teams on Google Cloud.\n- Build an experiment and a proof of concept on Google Cloud.\n- Calculate the total cost of ownership (TCO) of the target environment.\n- Choose the workloads that you want to migrate first.\nThe following sections rely on the information within [Migration to Google Cloud: Assessing and discovering your workloads](/architecture/migration-to-gcp-assessing-and-discovering-your-workloads) . However, they provide information that's specific to assessing the VM-based workloads that you want to migrate to containers with Migrate to Containers.\n### Build your inventories\nTo scope your migration, you must understand your current VM-based environment. To understand your environment, gather information about your workloads and their dependencies.\n[Building an inventory of your apps](/architecture/migration-to-gcp-assessing-and-discovering-your-workloads#building_an_inventory_of_your_apps) describes how to build an inventory of the workloads in your VM-based environment and their dependencies. Follow that guidance and build your inventories before proceeding with this document.\nAfter you build an inventory of your workloads and their dependencies, you refine the inventory. Assess the aspects and features that are of interest to your organization when it migrates its VM-based workloads with Migrate to Containers.\nTo complete the inventory of your workloads, consider the following:\n- **Source environment** . Migrate to Containers supports migrating VMs from [different source environments](/migrate/anthos/docs/migration-prerequisites#supported_vm_source_platforms) :- Compute Engine\n- VMware vSphere\n- Microsoft Azure VM\n- Amazon EC2\nTo correctly set up Migrate to Containers so it can migrate your workloads, you must assess the source environment.\n- **Operating system running in your VMs:** Gather information about the operating systems and their licenses running in your VMs, and ensure that the operating systems are compatible with Migrate to Containers. If you're running an OS that Migrate to Containers doesn't support, consider upgrading to a supported version or changing your OS to an [OS that Migrate to Containers supports](/migrate/anthos/docs/compatible-os-versions) .\n- **Workloads in your VMs:** Assess which workloads are deployed in each VM. Then map the dependencies between your workloads and between your workloads and external services. Next, gather information about the configuration sources of your workloads. For example, are you using environment variables, a distributed configuration system, or metadata servers to dynamically configure your workloads? Also, evaluate how your workloads send information to your logging system.\n- **Migrate to Containers fit score:** Assess whether your workloads are fit to migrate with Migrate to Containers. Migrate to Containers provides a fit assessment tool for [Linux and Windows](/migrate/anthos/docs/fit-assessment) that you can run on your VMs to compute a fit score. A low fit score indicates that there are issues that you need to resolve before migrating your workloads. For example, if you enabled [security-enhanced Linux](https://wikipedia.org/wiki/Security-Enhanced_Linux) on your VMs, you [might need additional effort to mitigate this dependency](/migrate/anthos/docs/fit-assessment#linux_vm_assessment_rules) before migrating them.\n- **Network services:** Gather information about the configuration of your network services, and how your VM-based workloads use these services. For example, assess how your workloads are using the Domain Name System (DNS), Multicast DNS, hosts files, and other [service discovery](https://wikipedia.org/wiki/Service_discovery) mechanisms to determine the location of other workloads and services. Next, assess the hosts file of each VM for any customized entry that your workloads need. For more information about hosts files, see [Verify and validate the generated resources and descriptors](#generate-and-review-the-migration-plan) .\n- **Hardware dependencies:** Evaluate any type of hardware that you're using in your VM-based environment, such as high-performance storage devices, GPUs, [TPUs](https://wikipedia.org/wiki/Tensor_Processing_Unit) , or network appliances.\n- **Stateless and stateful workloads:** Stateless workloads don't store state in the cluster or to persistent storage. Stateful workloads save data for later use. Because [migrating stateful workloads is typically harder than migrating stateless workloads](/architecture/migration-to-gcp-getting-started#choose_which_workloads_to_migrate_first) , assess which workloads are stateless and which are stateful.\n- **Storage:** For stateful workloads, make a list of your storage requirements. Here are some things to consider when making a list:- Storage system type (block volumes, file storage, or object storage)\n- Storage system size\n- Workload access to the storage system- For example, are your workloads using [Network File System](https://wikipedia.org/wiki/Network_File_System) (NFS), or [Server Message Block](https://wikipedia.org/wiki/Server_Message_Block) (SMB) to access files over a network?\n- For example, do your VMs run NFS or SMB servers?If your VMs run [NFS servers in kernel mode](/migrate/anthos/docs/planning-best-practices#kernel-mode_nfs_servers) , you need to spend additional effort to migrate those servers. You can can migrate those servers to another runtime environment, such as Compute Engine or GKE. Or you can migrate data to [Filestore](/filestore/docs) , which is a fully managed network attached storage service.\n- Disk configuration:- Assess the configuration of all the disks, data partitions, and volumes in your VMs, and the security and confidentiality features of each.\n- **Data locality:** Data locality affects the performance of stateful workloads. The distance and connectivity between your external systems and your environment affects latency. For each external data storage system, consider any performance and availability requirements that it must satisfy.\n### Complete the assessment\nAfter building the inventories related to your environment and your VM-based workloads, complete the rest of the assessment phase activities documented in [Migration to Google Cloud: Assessing and discovering your workloads](/architecture/migration-to-gcp-assessing-and-discovering-your-workloads) . When you're done with that work, continue reading this document.\n## Planning and building your foundation\nIn the planning and building phase, you provision and configure the cloud infrastructure and services that support your workloads on Google Cloud:\n- Build a resource hierarchy.\n- Configure Identity and Access Management.\n- Set up billing.\n- Set up network connectivity.\n- Harden your security.\n- Set up monitoring and alerting.\nFor guidance about how to build the cloud infrastructure and services that support your workloads and their dependencies, see [Migration to Google Cloud: Building your foundation](/architecture/migration-to-google-cloud-building-your-foundation) . Follow those guidelines to build a foundation for your environments. When you are done with that work, continue reading this document.\nAfter following the guidance in \"Migration to Google Cloud: Building your foundation\", complete your foundation work by [setting up Migrate to Containers](/migrate/anthos/docs/setting-up-overview) :\n- Confirm that your workloads and source environment meet [Migrate to Containers prerequisites](/migrate/anthos/docs/migration-prerequisites-overview) .\n- Enable [Migrate to Containers Cloud APIs](/migrate/anthos/docs/config-dev-env) .\n- Provision the service accounts that [Migrate to Containers uses to access resources in the target environment](/migrate/anthos/docs/config-dev-env#configuring_service_accounts) .\n- If you're migrating your workloads to GKE or GKE clusters on Google Cloud, set up [Migrate to Virtual Machines](/migrate/compute-engine) .\n- Configure a [Migrate to Containers processing cluster](/migrate/anthos/docs/configuring-a-cluster-overview) . A Migrate to Containers processing cluster runs Migrate to Containers components during the migration.\n- [Install and configure Migrate to Containers in the processing cluster](/migrate/anthos/docs/install-overview) .\nThe \"Setting up Migrate to Containers\" article mentioned previously describes how to provision and configure Migrate to Containers and its dependencies. Follow that guidance to set up Migrate to Containers.\nWhen you're done with the work described in this section, return to this document.\n## Migrating your VM-based workloads to containers\nIn the deployment phase, use the following milestones to guide you as you migrate the VMs from your source environment to containers running in GKE or GKE Enterprise:\n- Generate and review migration plans.\n- Generate container artifacts and deployment descriptors.\n- Verify, validate, and customize the resources descriptors that Migrate to Containers generated for you.\n- Deploy and validate the containerized workloads to GKE or GKE Enterprise.\n- Uninstall Migrate to Containers.\nFor more information about the steps required to migrate VMs with Migrate to Containers, see [Execute a migration](/migrate/containers/docs/executing-a-migration) .\n### Generate and review the migration plan\nCreate a Migrate to Containers migration plan for your VM-based workloads:\n- **Configure the source environments as Migrate to Containers\nmigration sources.** To migrate your VM-based workloads, Migrate to Containers needs information about the source environments where your VMs currently run. You gathered that information by performing the tasks described in the [Build your inventories](/architecture/migrating-vms-to-containers-with-migrate-for-anthos#build_your_inventories) section within this document. For more information about configuring your source environments, see [Adding a migration source (Linux)](/migrate/anthos/docs/adding-a-migration-source) and [Adding a migration source (Windows)](/migrate/anthos/docs/windows/adding-a-migration-source) .\n- **Create migration plans.** To specify which VM-based workloads you want to migrate from a source environment to a supported target environment, create a migration plan. For example, you can configure where you want to store your persistent data. For more information about creating and monitoring migration plans, see [Creating a migration (Linux)](/migrate/anthos/docs/creating-a-migration) and [Creating a migration (Windows)](/migrate/anthos/docs/windows/creating-a-migration) .\n- **Review and customize migration plans.** After generating migration plans for each of the VM-based workloads that you want to migrate, we recommend that you review and customize each migration plan to ensure that it fits your requirements. For more information about customizing migration plans, see [Customizing a migration plan (Linux)](/migrate/anthos/docs/customizing-a-migration-plan) and [Customizing a migration plan (Windows)](/migrate/anthos/docs/windows/customizing-a-migration-plan) .\nWhen you're done with the work described in this section, return to this document.\n### Generate container artifacts and deployment descriptors\nTo generate the target container artifacts for your workloads, Migrate to Containers creates a container image containing the workload and data extracted from the VM in the migration plan. It then stores a copy of the container image in the [configured container image repository](/migrate/anthos/docs/customizing-a-migration-plan#setting_the_name_of_the_container_image) . Migrate to Containers also [generates the deployment descriptors](/migrate/anthos/docs/customizing-a-migration-plan#editing_the_migration_plan) that you can customize and use to deploy instances of the container images in the target environment.\nFor more information about generating container artifacts, see [Executing a migration (Linux)](/migrate/anthos/docs/executing-a-migration) and [Executing a migration (Windows)](/migrate/anthos/docs/windows/executing-a-migration) .\nYou can monitor the progress of the container artifacts you create and migrate. For more information about monitoring a migration, see [Monitoring a migration (Linux)](/migrate/anthos/docs/monitoring-a-migration) and [Monitoring a migration (Windows)](/migrate/anthos/docs/windows/monitoring-a-migration) .\nIf you're generating container artifacts for Windows workloads, use the artifacts and the deployment descriptors that Migrate to Containers generated to build Windows container images for those workloads. For more information about building Windows container images for your workloads, see [Building a Windows container image](/migrate/anthos/docs/windows/build-container-image) .\nWhen you're done with the work described in this section, return to this document.\n### Verify and validate the generated resources and descriptors\nAfter you generate container artifacts and deployment descriptors with Migrate to Containers, review and update those artifacts and descriptors to ensure that they meet your requirements. The amount of time needed to update your container artifacts and deployment descriptors depends on how many VM-based workloads you're migrating and how complex they are. For more information about reviewing container artifacts and deployment descriptors, see [Reviewing generated deployment files (Linux)](/migrate/anthos/docs/review-deployment-files) , and [Building a Windows container image](/migrate/anthos/docs/windows/build-container-image) . For example, consider the following aspects.- **Container image descriptors:** Review the container image descriptors that you generated with Migrate to Containers and verify that they are adequate for the requirements you have for your VM-based workloads. If you need to update the container image descriptors, see [Post-migration image updates](/migrate/anthos/docs/post-migration-image-updates) . For example, you can update the [workload container image layers](/migrate/anthos/docs/post-migration-image-updates#updating_migrated_workload_components_layer) , and the [Migrate to Containers container image layers](/migrate/anthos/docs/post-migration-image-updates#updating_the_layer_version) .\n- **Environment variables and instance metadata:** If your workloads depend on environment variables or [instance metadata](/compute/docs/storing-retrieving-metadata) , define these values in [ConfigMap](https://kubernetes.io/docs/concepts/configuration/configmap/) , and configure the Pods that run your workloads to [use those ConfigMaps](https://kubernetes.io/docs/tasks/configure-pod-container/configure-pod-configmap/) .\n- **Namespaces and service names:** Kubernetes supports a service discovery mechanism that [uses namespaces and Service names to configure DNS entries for your workloads](https://kubernetes.io/docs/concepts/services-networking/service/#discovering-services) . If your workloads rely on DNS records to discover other workloads, you must verify the names of all the namespaces and services in your deployment descriptors. Once you've verified the names, [adjust those names according to your needs](/migrate/anthos/docs/planning-best-practices#plan_your_kubernetes_service_names) . If your workloads rely on hostnames for service discovery, you must [create the corresponding services](/migrate/anthos/docs/planning-best-practices#create_and_apply_services_for_connections_to_pods_and_containers) because those hostnames are no longer applicable in the target environment.- **Application-level logging:** Migrate to Containers automatically writes certain log messages to Cloud Logging. If you need to forward additional logs to [Cloud Logging](/logging/docs) , see [Configure logging to Cloud Logging (Linux)](/migrate/anthos/docs/configuring-cloud-logging) and [Configure logging to Cloud logging (Windows)](/migrate/anthos/docs/windows/build-container-image#configuring_logging_to) .\n- **Disks, partitions, and mount points configuration:** Because migrated workloads might [fail to start if their disk and partition configurations aren't correct](/migrate/anthos/docs/troubleshooting#a_device_listed_in_etcfstab_fails_to_mount) , you should assess the configuration of the disks, partitions, and mount points that your workloads expect. For example, assess the file systems table file to ensure that all the file systems are available to mount and that the universally unique identifiers for disks are configured. If your workloads need NFS mounts, [configure them in the generated deployment descriptors](/migrate/anthos/docs/planning-best-practices#define_nfs_mounts_as_persistent_volumes) . If your workloads require volumes that you're not managing with [Persistent Volumes](https://kubernetes.io/docs/concepts/storage/persistent-volumes/) , see [Mounting external volumes](/migrate/anthos/docs/mounting-external-volumes) for guidance about mounting additional volumes.\n- **Hosts files:** If your workloads need certain hosts to be configured with hosts files, you can configure [HostAliases](https://kubernetes.io/docs/concepts/services-networking/add-entries-to-pod-etc-hosts-with-host-aliases/) to add entries to the hosts files of the [Pods](https://kubernetes.io/docs/concepts/workloads/pods/) that run your workloads.- **Access Control Lists (ACLs) for Windows workloads:** Because Windows containers don't support setting ACLs when building Windows container images, Migrate to Containers doesn't migrate customized [Windows ACLs](https://docs.microsoft.com/en-us/windows/win32/secauthz/dacls-and-aces) . If you need to customize your Windows workloads, see [Setting ACLs](/migrate/anthos/docs/windows/build-container-image#setting_acls) .\n- **AppArmor profiles:** Ensure that all the [AppArmor](https://wikipedia.org/wiki/AppArmor) profiles that your workloads require are available in the target environment, otherwise the [migrated workloads might not start](/migrate/anthos/docs/troubleshooting#failure_in_capabilities_of_deployed_container_because_of_apparmor) .\n- **Network policies:** If you need to restrict access to the Pods running your workloads, you can use [NetworkPolicies to control the traffic flow](https://kubernetes.io/docs/concepts/services-networking/network-policies/) to and from your Pods.- **Disabled system services:** [Migrate to Containers automatically disables some system services](/migrate/anthos/docs/planning-best-practices#disable_unneeded_services) that aren't needed in the target environment. It also disables the [services that you disabled when you customized your migration plans](/migrate/anthos/docs/customizing-a-migration-plan#customizing_the_services_list) . If your workloads depend on those system services, you might have to spend additional effort to mitigate those dependencies. For more information about the system services that Migrate to Containers disables, see [Disable unneeded services](/migrate/anthos/docs/planning-best-practices#disable_unneeded_services) .\n- **Downtime and cutover windows:** Assess the high availability requirements for your workloads. If your workloads fail when they experience any downtime, [plan for redundancy and for a cutover window](/architecture/migration-to-gcp-assessing-and-discovering-your-workloads#availability_and_reliability) . For example, if you migrate a cluster of VMs, you might have to split the cluster and recompose it after the migration.\nWhen you're done with the work described in this section, return to this document.\n### Deploy and validate the containerized workloads\nWhen the deployment descriptors for your workloads are ready, perform the following steps:\n- **Deploy your migrated workloads in the target environment** . For guidance about deploying your migrated Linux and Windows workloads, see [Deploying a Linux workload to a target cluster](/migrate/anthos/docs/deploying-to-target-cluster) and [Deploying a Windows workload to a target cluster](/migrate/anthos/docs/windows/deploying-to-target-cluster) .\n- **Monitor your migrated workloads** . After deploying your migrated Linux workloads and Windows workloads, you can gather information about how they are performing. For more information, see [Monitoring migrated workloads (Linux)](/migrate/anthos/docs/monitoring-migrated-workloads) and [Monitoring migrated workloads (Windows)](/migrate/anthos/docs/windows/monitoring-migrated-workloads) .\n- **Integrate your migrated workloads** . Once the workloads you deployed in the target environment work, integrate them. Integrate the container artifact generation and deployment processes of the workloads with your [deployment processes and pipelines](/architecture/migration-to-gcp-deploying-your-workloads) . If you don't currently have an automated deployment process in place and are [manually deploying your workloads](/architecture/migration-to-gcp-deploying-your-workloads#deploy_manually) , it's recommended that you [migrate from manual deployments to automated deployments](/architecture/migration-to-google-cloud-automated-containerized-deployments) .\nWhen you're done with the work described in this section, return to this document.\n### Uninstall Migrate to Containers\nAfter you complete the migration of your workloads with Migrate to Containers, it's recommended that you:\n- Ensure that you have all the references to the [artifacts that Migrate to Containers generated during the migration](/migrate/anthos/docs/migctl-reference#migctl-migration-get-artifacts) .\n- [Uninstall Migrate to Containers](/migrate/anthos/docs/uninstalling) .\nWhen you're done with the work described in this section, return to this document.\n## Optimizing your environment after migration\nOptimizing your environment is the last phase of your migration. To optimize your GKE and GKE Enterprise environment, see [Optimizing your environment](/architecture/migrating-containers-kubernetes-gke#optimizing_your_environment) .\n## What's next\n- Read about how to [get started with your migration to Google Cloud](/architecture/migration-to-gcp-getting-started) and with [Migrate to Containers](/migrate/anthos/docs/getting-started) .\n- Learn how to [troubleshoot common issues with Migrate to Containers](/migrate/anthos/docs/troubleshooting) .\n- Read about new or updated features, bug fixes, known issues, and deprecated functionality in the [Migrate to Containers release notes](/migrate/anthos/docs/release-notes) .\n- Learn how to [migrate from manual deployments to automated, containerized deployments](/architecture/migration-to-google-cloud-automated-containerized-deployments) .\n- Read about best practices for [building](/architecture/best-practices-for-building-containers) and [operating](/architecture/best-practices-for-operating-containers) containers.\n- Learn [best practices for GKE networking](/kubernetes-engine/docs/best-practices/networking) .\n- Understand how to [help harden your cluster's security](/kubernetes-engine/docs/how-to/hardening-your-cluster) and read the [GKE security overview](/kubernetes-engine/docs/concepts/security-overview) .\n- Read about [best practices for running cost-optimized Kubernetes applications on GKE](/architecture/best-practices-for-running-cost-effective-kubernetes-applications-on-gke) .\n- Explore reference architectures, diagrams, and best practices about Google Cloud. Take a look at our [Cloud Architecture Center](/architecture) .", "guide": "Docs"}