{"title": "Docs - Establish cloud support and escalation processes", "url": "https://cloud.google.com/architecture/framework/operational-excellence/establish-cloud-support-and-escalation-processes", "abstract": "# Docs - Establish cloud support and escalation processes\nLast reviewed 2023-06-16 UTC\nThis document in the [Google Cloud Architecture Framework](/architecture/framework) shows you how to define an effective escalation process. Establishing support from your cloud provider or other third-party service providers is a key part of effective escalation management.\nGoogle Cloud provides you with various support channels, including [live support](/support) or through published guidance such as [developer communities](/support/docs/community) or [product documentation](/docs) . An offering from [Cloud Customer Care](/support) ensures you can work with Google Cloud to run your workloads efficiently.\n", "content": "## Establish support from your providers\nPurchase a support contract from your cloud provider or other third-party service providers. Support is critical to ensure the prompt response and resolution of various operational issues.\nTo work with Google Cloud Customer Care, consider purchasing a [Customer Care offering](/support) that includes Standard, Enhanced, or Premium Support. Consider using Enhanced or Premium Support for your major production environments.\n## Define your escalation process\nA well-defined escalation process is key to reducing the effort and time that it takes to identify and address any issues in your systems. This includes issues that require support for Google Cloud products or for other cloud producers or third-party services.\nTo create your escalation path:\n- Define when and how to escalate issues internally.\n- Define when and how to create support cases with your cloud provider or other third-party service provider.\n- Learn how to work with the teams that provide you support. For Google Cloud, you and your operations teams should review the [Best practices for working with Customer Care](/support/docs/best-practices) . Incorporate these practices into your escalation path.\n- Find or create documents that describe your architecture. Ensure these documents include information that is helpful for support engineers.\n- Define how your teams communicate during an outage.\n- Ensure that people who need support have [appropriate levels of support permissions](/support/docs/manage-cases#before_you_begin) to access the Google Cloud Support Center, or to communicate with other support providers. To learn about using the Google Cloud Support Center, visit [Support procedures](/support/docs/procedures) .\n- [Set up monitoring, alerting, and logging](/architecture/framework/operational-excellence/set-up-monitoring-alerting-logging) so that you have the information needed to act on when issues arise.\n- Create templates for incident reporting. For information to include in your incident reports, see [Best practices for working with Customer Care](/support/docs/best-practices) .\n- Document your organization's escalation process. Ensure that you have clear, well-defined actions to address escalations.\n- Include a plan to teach new team members how to interact with support.\nRegularly test your escalation process internally. Test your escalation process before major events, such as migrations, new product launches, and peak traffic events. If you have Google Cloud Customer Care [Premium Support](/support/docs/premium) , your [Technical Account Manager](/tam) can help review your escalation process and coordinate your tests with Google Cloud Customer Care.\n## Ensure you receive communication from support\nEnsure that your administrators are receiving communication from your cloud providers and third-party services. This information allows admins to make informed decisions and fix issues before they cause larger problems. Ensure that the following are true:\n- Security, network, and system administrators are set up to receive critical emails from Google Cloud and your other providers or services.\n- Security, network, and system administrators are set up to receive system alerts generated by monitoring tools, like Cloud Monitoring.\n- Project owners have email-routable usernames so that they can receive critical emails.\nFor information about managing notifications from Google Cloud, see [Managing contacts for notifications](/resource-manager/docs/managing-notification-contacts) .\n## Establish review processes\nEstablish a review or postmortem processes. Follow these processes after you raise a new support ticket or escalate an existing support ticket. As part of the postmortem, document the lessons learned and track mitigations. As you do this review, foster a blameless postmortem culture.\nFor more information about postmortems, see [Postmortem Culture: Learning from Failure](https://sre.google/sre-book/postmortem-culture/) .\n## Build centers of excellence\nIt can be valuable to capture your organization's information, experience, and patterns in an internal knowledge base, such as a wiki, Google site, or intranet site. As new products and features are continually being rolled out in Google Cloud, this knowledge can help track why you chose a particular design for your applications and services. For more information, see [Architecture decision records](/architecture/architecture-decision-records) .\nIt's also a good practice to nominate Google Cloud experts and champions in your organization. A range of [training and certification](/training) options are available to help nominated champions grow in their area of expertise. Teams can stay up to date on the latest news, announcements, and customer stories by subscribing to the [Google Cloud blog](/blog) .\n## What's next\n- [Manage capacity and quota](/architecture/framework/operational-excellence/manage-capacity-and-quota) (next document in this series)\n- Explore other categories in the [Architecture Framework](/architecture/framework) such as system design, security, privacy, and compliance, reliability, cost optimization, and performance optimization.", "guide": "Docs"}