{"title": "Docs - Landing zone design in Google Cloud", "url": "https://cloud.google.com/architecture/landing-zones", "abstract": "# Docs - Landing zone design in Google Cloud\nLast reviewed 2023-08-31 UTC\nThis document provides an overview on how to design landing zones in Google Cloud. A landing zone, also called a , is a modular and scalable configuration that enables organizations to adopt Google Cloud for their business needs. A landing zone is often a prerequisite to deploying enterprise workloads in a cloud environment.\nA is not a [zone](https://cloud.google.com/docs/geography-and-regions#regions_and_zones) or [zonal resources](https://cloud.google.com/docs/geography-and-regions#zonal_resources) .\nThis document is aimed at solutions architects, technical practitioners, and executive stakeholders who want an overview of the following:\n- Typical elements of landing zones in Google Cloud\n- Where to find detailed information on landing zone design\n- How to deploy a landing zone for your enterprise, including options to deploy pre-built solutions\nThis document is part of a series that helps you understand how to design and build a landing zone. The other documents in this series help guide you through the high-level decisions that you need to make when you design your organization's landing zone. In this series, you learn about the following:\n- Landing zone design in Google Cloud (this document)\n- [Decide how to onboard identities to Google Cloud](/architecture/landing-zones/decide-how-to-onboard-identities) \n- [Decide the resource hierarchy for your Google Cloud landing zone](/architecture/landing-zones/decide-resource-hierarchy) \n- [Decide the network design for your Google Cloud landing zone](/architecture/landing-zones/decide-network-design) \n- [Decide the security for your Google Cloud landing zone](/architecture/landing-zones/decide-security) \nThis series does not specifically address compliance requirements from regulated industries such as financial services or healthcare.\n", "content": "## What is a Google Cloud landing zone?\nLanding zones help your enterprise deploy, use, and scale Google Cloud services more securely. Landing zones are dynamic and grow as your enterprise adopts more cloud-based workloads over time.\nTo deploy a landing zone, you must first [create an organization resource](/resource-manager/docs/creating-managing-organization) and [create a billing account](/billing/docs/how-to/manage-billing-account) , either online or invoiced.\nA landing zone spans multiple areas and includes different elements, such as identities, resource management, security, and networking. Many other elements can also be part of a landing zone, as described in [Elements of a landing zone](#elements) .\nThe following diagram shows a sample implementation of a landing zone. It shows an Infrastructure as a Service (IaaS) use case with hybrid cloud and on-premises connectivity in Google Cloud:\nThe example architecture in the preceding diagram shows a Google Cloud landing zone that includes the following Google Cloud services and features:\n- Resource Manager defines a [resource hierarchy](/resource-manager/docs/cloud-platform-resource-hierarchy) with [organizational policies.](/resource-manager/docs/organization-policy/overview) \n- A [Cloud Identity](/identity/docs/overview) account synchronizes with an on-premises identity provider and [Identity and Access Management (IAM)](/iam/docs/overview) providing granular access to Google Cloud resources.\n- A network deployment that includes the following:- A [Shared VPC](/vpc/docs/shared-vpc) network for each environment (production, development, and testing) connects resources from multiple projects to the VPC network.\n- [Virtual Private Cloud (VPC) firewall rules](/vpc/docs/firewalls) control connectivity to and from workloads in the [Shared VPC](/vpc/docs/shared-vpc) networks.\n- A [Cloud NAT](/nat/docs/overview) gateway allows outbound connections to the internet from resources in these networks without external IP addresses.\n- [Cloud Interconnect](/network-connectivity/docs/interconnect/concepts/overview) connects on-premises applications and users. (You can choose between different Cloud Interconnect options, including [Dedicated Interconnect](/network-connectivity/docs/interconnect/concepts/dedicated-overview) or [Partner Interconnect](/network-connectivity/docs/interconnect/concepts/partner-overview) .)\n- [Cloud VPN](/network-connectivity/docs/vpn) connects to other cloud service providers.\n- A [Cloud DNS](/dns/docs/overview) private zone hosts DNS records for your deployments in Google Cloud.\n- Multiple service projects are configured to use the [Shared VPC](/vpc/docs/shared-vpc) networks. These service projects host your application resources.\n- [Google Cloud Observability](/stackdriver/docs) includes [Cloud Monitoring](/monitoring/docs) for monitoring and [Cloud Logging](/logging/docs) for logging. [Cloud Audit Logs](/logging/docs/audit) , [Firewall Rules Logging](/vpc/docs/firewall-rules-logging) and [VPC Flow Logs](/vpc/docs/flow-logs) help ensure all necessary data is logged and available for analysis.\n- A [VPC Service Controls](/vpc-service-controls/docs/overview) perimeter includes Shared VPC and the on-premises environment. A security perimeter isolates service and resources, which helps to mitigate the risk of data exfiltration from supported Google Cloud services.\nThe diagram above is only an example, because there is no single or standard implementation of a landing zone. Your business must make many design choices, depending on different factors, including the following:\n- Your industry\n- Your organizational structure and processes\n- Your security and compliance requirements\n- The workloads that you want to move to Google Cloud\n- Your existing IT infrastructure and other cloud environments\n- The location of your business and customers## When to build a landing zone\nWe recommend that you build a landing zone before you deploy your first enterprise workload on Google Cloud, because a landing zone provides the following:\n- A foundation that's designed to be secure\n- The network for enterprise workloads\n- The tools that you require to govern your internal cost distribution\nHowever, because a landing zone is modular, your first iteration of a landing zone is often not your final version. Therefore, we recommend that you design a landing zone with scalability and growth in mind. For example, if your first workload does not require access to on-premises network resources, you could build connectivity to your on-premises environment later.\nDepending on your organization and the type of workloads that you plan to run on Google Cloud, some workloads might have very different requirements. For example, some workloads might have unique scalability or compliance requirements. In these cases, you might require more than one landing zone for your organization: one landing zone to host most of the workloads and a separate landing zone to host the unique workloads. You can share some elements such as identities, billing, and the organization resource across your landing zones. However, other elements, such as the network setup, deployment mechanisms, and folder-level policies, might vary.\n## Elements of a landing zone\nA landing zone requires you to design the following core elements on Google Cloud:\n- [Identity provisioning ](/architecture/landing-zones/decide-how-to-onboard-identities) \n- [Resource hierarchy ](/architecture/landing-zones/decide-resource-hierarchy) \n- [Network](/architecture/landing-zones/decide-network-design) \n- [Security controls](/architecture/landing-zones/decide-security) \nIn addition to these core elements, your business might have additional requirements. The following table describes these elements and where you can find more information about them.\n| Landing zone element   | Description                                                                              |\n|:-----------------------------|:--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| Monitoring and logging  | Design a monitoring and logging strategy that helps ensure all relevant data is logged and that you have dashboards that visualize the data and alerts that notify you of any actionable exceptions. For more information, see the following: Set up monitoring, alerting, and logging Google Cloud Observability documentation |\n| Backup and disaster recovery | Design a strategy for backups and disaster recovery. For more information, see the following: Disaster recovery planning guide Backup and DR Service                                           |\n| Compliance     | Follow the compliance frameworks that are relevant to your organization. For more information, see the Compliance resource center.                                                |\n| Cost efficiency and control | Design capabilities to monitor and optimize cost for workloads in your landing zone. For more information, see the following: Overview of cloud billing concepts Google Cloud Architecture Framework: Cost optimization Cost management                       |\n| API management    | Design a scalable solution for APIs that you develop. For more information, see Apigee API Management.                                                       |\n| Cluster management   | Design Google Kubernetes Engine (GKE) clusters that follow best practices to build scalable, resilient, and observable services. For more information, see the following: GKE best practices GKE Autopilot mode Multi-cluster Services About Anthos Service Mesh                |\n## Best practices for designing and deploying a landing zone\nDesigning and deploying a landing zone requires planning. You must have the right team to perform the tasks, and use a project management process. We also recommend that you follow the technical best practices that are described in this series.\n### Build a team\nBring together a team that includes people from multiple technical functions across the organization. The team must include people who can build all landing zone elements, including security, identity, networks, and operations. Identify a cloud practitioner who understands Google Cloud to lead the team. Your team should include members who manage the project and track achievements, and members who collaborate with application or business owners.\nMake sure that all stakeholders are involved early in the process. Your stakeholders must come to a common understanding of the scope of the process and make high-level decisions when the project gets kicked off.\n### Apply project management to your landing zone deployment\nDesigning and deploying your landing zone can take multiple weeks, so project management is essential. Ensure that project goals are clearly defined and communicated to all stakeholders and that all parties receive updates on any project changes. Define regular checkpoints and agree on milestones with realistic timelines that take operational processes and unexpected delays into account.\nTo best align with business requirements, plan the initial landing zone deployment around the use cases that you want to deploy first in Google Cloud. We recommend that you first deploy workloads that can most easily run on Google Cloud, such as horizontally scaling multi-tier web applications. These workloads might be new or existing workloads. To assess existing workloads for migration readiness, see [Migration to Google Cloud: Getting started](/architecture/migration-to-gcp-getting-started) .\nBecause landing zones are modular, center the initial design around the elements that are required to migrate your first workloads and plan to add other elements later.\n### Follow technical best practices\nConsider using [Infrastructure as Code (IaC)](https://en.wikipedia.org/wiki/Infrastructure_as_code) , with, for example, [Terraform](/docs/terraform) . IaC helps you make your deployment repeatable and modular. Having a [CI/CD pipeline that deploys cloud infrastructure changes](/docs/terraform/resource-management/managing-infrastructure-as-code) using GitOps helps you ensure that you follow internal guidelines and put the right controls in place.\nWhen you design your landing zone, ensure that you and your team take technical best practices into consideration. For more information on decisions to make in your landing zone, see the other guides in this series.\nIn addition to this series, the following table describes frameworks, guides, and blueprints that can also help you follow best practices, depending on your use cases.\n| Related documentation    | Description                                                     |\n|:------------------------------------|:-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| Google Cloud setup checklist  | A high-level checklist to help you set up Google Cloud for scalable, production-ready, enterprise workloads.                             |\n| Security foundations blueprint  | An opinionated view of Google Cloud security best practices, aimed at CISO, security practitioners, risk managers, or compliance officers.                      |\n| Google Cloud architecture framework | Recommendations and best practices to help architects, developers, administrators, and other cloud practitioners design and operate a cloud topology that's secure, efficient, resilient, high-performing, and cost-effective. |\n| Terraform blueprints    | A list of blueprints and modules that are packaged as Terraform modules and that you can use to create resources for Google Cloud.                        |\n## Identify resources to help implement your landing zone\nGoogle Cloud offers the following options to help you set up your landing zone:\n- Design and deploy a landing zone that is customized to your requirements with [Google Cloudpartners](/partners) or Google Cloud [professional services](/consulting) .\n- Onboard a workload with the [Google CloudCustomer Onboarding program](/onboarding) .\n- Deploy a generic landing zone with the [setup guide in the Google Cloud console](https://console.cloud.google.com/cloud-setup/overview) .\n- Deploy a highly opinionated landing zone that is aligned to the security foundations blueprint by using the [Terraform example foundation](https://github.com/terraform-google-modules/terraform-example-foundation) .\nAll these offerings have approaches that are designed specifically to meet the needs of different industries and business sizes, across the globe. To help you make the best selection for your use case, we recommend that you work with your Google Cloud account team to make the selection and help to ensure a successful project.\n## What's next\n- [Decide how to onboard identities to Google Cloud](/architecture/landing-zones/decide-how-to-onboard-identities) (next document in this series).\n- [Decide the resource hierarchy for your Google Cloud landing zone](/architecture/landing-zones/decide-resource-hierarchy) .\n- [Decide the network design for your Google Cloud landing zone](/architecture/landing-zones/decide-network-design) .\n- [Decide the security for your Google Cloud landing zone](/architecture/landing-zones/decide-security) .", "guide": "Docs"}