{"title": "Docs - Decide how to onboard identities to Google Cloud", "url": "https://cloud.google.com/architecture/landing-zones/decide-how-to-onboard-identities", "abstract": "# Docs - Decide how to onboard identities to Google Cloud\nLast reviewed 2023-08-31 UTC\nThis document describes identity provisioning options for Google Cloud and the decisions that you must make when you onboard your users to Cloud Identity or Google Workspace. This document also provides guidance on where to find more information on how to deploy each option.\nThis document is part of a series about [landing zones](/architecture/landing-zones) , and is intended for architects and technical practitioners who are involved in managing identities for your organization and your Google Cloud deployment.\n", "content": "## Overview\nTo let your organization's users access your Google Cloud resources, you must provide a way for them to authenticate themselves. Google Cloud uses [Google Sign-In](https://account.google.com/) to authenticate users, which is the same identity provider (IdP) that other Google services such as Gmail or Google Ads use.\nAlthough some users in your organization might already have a private Google user account, we strongly advise against letting them use their private accounts when they access Google Cloud. Instead, you can onboard your users to Cloud Identity or Google Workspace, which lets you control the lifecycle and security of user accounts.\nProvisioning identities in Google Cloud is a complex topic and your exact strategy might require more detail than is in scope for this decision guide. For more best practices, planning, and deployment information, see [overview of identity and access management](/architecture/identity) .\n## Decision points for identity onboarding\nTo choose the best identity provisioning design for your organization, you must make the following decisions:\n- [Your identity architecture](#identity-architecture) \n- [How to consolidate existing user accounts](#account-consolidation) ## Decide on your identity architecture\nManaging the lifecycle and security of user accounts plays an important role in securing your Google Cloud deployment. A key decision that you must make is the role that Google Cloud should play in relation to your existing identity management systems and applications. The options are as follows:\n- Use Google as your primary identity provider (IdP).\n- Use federation with an external identity provider.\nThe following sections provide more information about each option.\n### Option 1: Use Google as your primary source for identities (no federation)\nWhen you create user accounts directly in [Cloud Identity](/identity) or [Google Workspace](https://workspace.google.com/) , you can make Google your source of identities and primary IdP. Users can then use these identities and credentials to sign in to Google Cloud and other Google services.\nCloud Identity and Google Workspace provide a large selection of [ready-to-use integrations](https://workspace.google.com/marketplace) for popular third-party applications. You can also use standard protocols such as [SAML](https://support.google.com/a/answer/6087519) , [OAuth](https://support.google.com/googleapi/answer/6158849) , and [OpenID Connect](https://developers.google.com/identity/protocols/OpenIDConnect) to integrate your custom applications with Cloud Identity or Google Workspace.\nUse this strategy when the following is true:\n- Your organization already has user identities provisioned in Google Workspace.\n- Your organization doesn't have an existing IdP.\n- Your organization has an existing IdP but wants to start quickly with a small subset of users and federate identities later.\nAvoid this strategy when you have an existing IdP that you want to use as an authoritative source for identities.\nFor more information, see the following:\n- [Preparing your Google Workspace or Cloud Identity Account](/architecture/identity/preparing-your-g-suite-or-cloud-identity-account) \n- [Using Google as an IdP](/architecture/identity/reference-architectures#using_google_as_an_idp) \n### Option 2: Use federation with an external identity provider\nYou can integrate Google Cloud with an existing external IdP by using federation. Identity federation establishes trust between two or more IdPs so that the multiple identities that a user might have in different identity management systems can be linked.\nWhen you [federate a Cloud Identity or Google Workspace account](/architecture/identity/overview-google-authentication#external_identities) with an external IdP, you let users use their existing identity and credentials to sign in to Google Cloud and other Google services.\n**Important:** Super administrator accounts always bypass single-sign-on (SSO).\nUse this strategy when the following is true:\n- You have an existing IdP such as Active Directory, Azure AD, ForgeRock, Okta, or Ping Identity.\n- You want employees to use their existing identity and credentials to sign in to Google Cloud and other Google services such as Google Ads and Google Marketing Platform.\nAvoid this strategy when your organization doesn't have an existing IdP.\nFor more information, see the following:\n- [External identities - Overview of Google identity management](/architecture/identity/overview-google-authentication#external_identities) \n- [Reference architectures: Using an external IdP](/architecture/identity/reference-architectures#using_an_external_idp) \n- [Best practices for federating Google Cloud with an external identity provider](/architecture/identity/best-practices-for-federating) \n- [Federating Google Cloud with Active Directory](/architecture/identity/federating-gcp-with-active-directory-introduction) \n- [Federating Google Cloud with Azure AD](/architecture/identity/federating-gcp-with-azure-active-directory) ## Decide how to consolidate existing user accounts\nIf you haven't been using Cloud Identity or Google Workspace, it's possible that your organization's employees are using [consumer accounts](/architecture/identity/overview-google-authentication#consumer_account) to access your Google services. Consumer accounts are accounts that are fully owned and managed by the people who created them. Because those accounts are not under your organization's control and might include both personal and corporate data, you must decide how to consolidate these accounts with other corporate accounts.\nFor details on consumer accounts, how to identify them, and what risk they might pose to your organization, see [Assessing existing user accounts](/architecture/identity/assessing-existing-user-accounts) .\nThe options for consolidating the accounts are as follows:\n- Consolidate a relevant subset of consumer accounts.\n- Consolidate all accounts through migration.\n- Consolidate all accounts through eviction, by not migrating accounts before creating new ones.\nThe following sections provide more information about each option.\n### Option 1: Consolidate a relevant subset of consumer accounts\nIf you want to keep consumer accounts and manage them and their data under corporate policies, you must migrate them to Cloud Identity or Google Workspace. However, the process of consolidating consumer accounts can be time consuming. Therefore, we recommend that you first evaluate which subset of users are relevant for your planned Google Cloud deployment, and then consolidate only those user accounts.\nUse this strategy when the following is true:\n- The [transfer tool for unmanaged user accounts](https://support.google.com/a/answer/6178640) shows many consumer user accounts in your domain, but only a subset of your users will use Google Cloud.\n- You want to save time in the consolidation process.\nAvoid this strategy when the following is true:\n- You don't have consumer user accounts in your domain.\n- You want to ensure that all data from all consumer user accounts in your domain is consolidated to managed accounts before you start using Google Cloud.\nFor more information, see [Overview of consolidating accounts](/architecture/identity/overview-consolidating-accounts) .\n### Option 2: Consolidate all accounts through migration\nIf you want to manage all user accounts in your domain, you can consolidate all consumer accounts by migrating them to managed accounts.\nUse this strategy when the following is true:\n- The transfer tool for unmanaged user accounts shows only a few consumer accounts in your domain.\n- You want to restrict the use of consumer accounts in your organization.\nAvoid this strategy when you want to save time in the consolidation process.\nFor more information, see [Migrating consumer accounts](/architecture/identity/migrating-consumer-accounts) .\n### Option 3: Consolidate all accounts through eviction\nYou can evict consumer accounts in the following circumstances:\n- You want users who created consumer accounts to keep full control over their accounts and data.\n- You don't want to transfer any data to be managed by your organization.\nTo evict consumer accounts, create a managed user identity of the same name without migrating the user account first.\nUse this strategy when the following is true:\n- You want to create new managed accounts for your users without transferring any of the data that exists in their consumer accounts.\n- You want to restrict the Google services that are available in your organization. You also want users to keep their data and keep using these services for the consumer accounts that they created.\nAvoid this strategy when consumer accounts have been used for corporate purposes and might have access to corporate data.\nFor more information, see [Evicting consumer accounts](/architecture/identity/evicting-consumer-accounts) .\n## Best practices for onboarding identities\nAfter you choose your identity architecture and your method to consolidate existing consumer accounts, consider the following identity best practices.\n### Select a suitable onboarding plan that works for your organization\nSelect a high-level plan to onboard your organization's identities to Cloud Identity or Google Workspace. For a selection of proven onboarding plans, along with guidance on how to select the plan that best suits your needs, see [Assessing onboarding plans](/architecture/identity/assessing-onboarding-plans) .\nIf you plan to use an external IdP and have identified user accounts that need to be migrated, you might have additional requirements. For more information, see [Assessing the impact of user account consolidation on federation](/architecture/identity/assessing-consolidation-impact-on-federation) .\n### Protect user accounts\nAfter you've onboarded users to Cloud Identity or Google Workspace, you must put measures in place to help protect their accounts from abuse. For more information, see the following:\n- Implement [security best practices for Cloud Identity administrative accounts](https://support.google.com/a/answer/9011373) .\n- Enforce [uniform multifactor authentication rules ](/identity/solutions/enforce-mfa) and follow [best practices when combined with federating identities](/architecture/identity/best-practices-for-federating#multi-factor_authentication) .\n- Export your [Google Workspace or Cloud Identity audit logs](/logging/docs/audit/gsuite-audit-logging) to Cloud Logging by [enabling data sharing](/logging/docs/audit/configure-gsuite-audit-logs#share_audit_logs) .## What's next\n- [Decide your resource hierarchy](/architecture/landing-zones/decide-resource-hierarchy) (next document in this series).\n- Find out more about [how users, Cloud Identity accounts, and Google Cloud organizations relate](/architecture/identity/overview-google-authentication) .\n- Review recommended [best practices for planning accounts and organizations](/architecture/identity/best-practices-for-planning) .\n- Read about [best practices for federating Google Cloud with an external identity provider](/architecture/identity/best-practices-for-federating) .", "guide": "Docs"}