{"title": "Docs - Manage identity and access", "url": "https://cloud.google.com/architecture/framework/security/identity-access", "abstract": "# Docs - Manage identity and access\nLast reviewed 2023-08-08 UTC\nThis document in the [Google Cloud Architecture Framework](/architecture/framework) provides best practices for managing identity and access.\nThe practice of identity and access management (generally referred to as ) helps you ensure that the right people can access the right resources. IAM addresses the following aspects of authentication and authorization:\n- Account management, including provisioning\n- Identity governance\n- Authentication\n- Access control (authorization)\n- Identity federation\nManaging IAM can be challenging when you have different environments or you use multiple identity providers. However, it's critical that you set up a system that can meet your business requirements while mitigating risks.\nThe recommendations in this document help you review your current IAM policies and procedures and determine which of those you might need to modify for your workloads in Google Cloud. For example, you must review the following:\n- Whether you can use existing groups to manage access or whether you need to create new ones.\n- Your authentication requirements (such as [multi-factor authentication (MFA)](https://wikipedia.org/wiki/Multi-factor_authentication) using a token).\n- The impact of service accounts on your current policies.\n- If you're using Google Cloud for disaster recovery, maintaining appropriate separation of duties.\nWithin Google Cloud, you use [Cloud Identity](/identity/docs/overview) to authenticate your users and resources and Google's [Identity and Access Management (IAM)](/iam/docs) product to dictate resource access. Administrators can restrict access at the organization, folder, project, and resource level. Google IAM policies dictate who can do what on which resources. Correctly configured IAM policies help secure your environment by preventing unauthorized access to resources.\nFor more information, see [Overview of identity and access management](/architecture/identity) .\n", "content": "## Use a single identity provider\nMany of our customers have user accounts that are managed and provisioned by identity providers outside of Google Cloud. Google Cloud supports [federation](https://wikipedia.org/wiki/Federated_identity) with most identity providers and with on-premises directories such as [Active Directory](/architecture/identity/federating-gcp-with-active-directory-introduction) .\nMost identity providers let you enable single sign-on (SSO) for your users and groups. For applications that you deploy on Google Cloud and that use your external identity provider, you can extend your identity provider to Google Cloud. For more information, see [Reference architectures](/architecture/identity/reference-architectures) and [Patterns for authentication corporate users in a hybrid environment](/architecture/patterns-for-authenticating-corporate-users-in-a-hybrid-environment) .\nIf you don't have an existing identity provider, you can use either [Cloud Identity Premium](/identity) or [Google Workspace](https://workspace.google.com/) to manage identities for your employees.\n## Protect the super admin account\nThe super admin account (managed by Google Workspace or Cloud Identity) lets you create your [Google Cloud organization](/resource-manager/docs/creating-managing-organization) . This admin account is therefore highly privileged. Best practices for this account include the following:\n- Create a new account for this purpose; don't use an existing user account.\n- Create and protect backup accounts.\n- Enable MFA.\nFor more information, see [Super administrator account best practices](/resource-manager/docs/super-admin-best-practices) .\n## Plan your use of service accounts\nA [service account](/iam/docs/understanding-service-accounts) is a Google account that applications can use to [call the Google API of a service](https://developers.google.com/identity/protocols/OAuth2ServiceAccount#authorizingrequests) .\nUnlike your user accounts, service accounts are created and managed within Google Cloud. Service accounts also authenticate differently than user accounts:\n- To let an application running on Google Cloud authenticate using a service account, you can [attach a service account](/iam/docs/attach-service-accounts#attaching-to-resources) to the compute resource the application runs on.\n- To let an application running on GKE authenticate using a service account, you can use [Workload Identity](/kubernetes-engine/docs/how-to/workload-identity) .\n- To let applications running outside of Google Cloud authenticate using a service account, you can use [Workload identity federation](/iam/docs/workload-identity-federation) \nWhen you use service accounts, you must consider an appropriate segregation of duties during your design process. Note the API calls that you must make, and determine the service accounts and associated roles that the API calls require. For example, if you're setting up a BigQuery data warehouse, you probably need identities for at least the following processes and services:\n- Cloud Storage or Pub/Sub, depending on whether you're providing a batch file or creating a streaming service.\n- [Dataflow](/dataflow/docs/concepts/security-and-permissions#security_and_permissions_for_pipelines_on) and Sensitive Data Protection to de-identify sensitive data.\nFor more information, see [Best practices for working with service accounts](/iam/docs/best-practices-service-accounts) .\n## Update your identity processes for the cloud\nIdentity governance lets you track access, risks, and policy violations so that you can support your regulatory requirements. This governance requires that you have processes and policies in place so that you can grant and audit access control roles and permissions to users. Your processes and policies must reflect the requirements of your environments—for example, test, development, and production.\nBefore you deploy workloads on Google Cloud, review your current identity processes and update them if appropriate. Ensure that you appropriately [plan](/architecture/identity/best-practices-for-planning) for the types of accounts that your organization needs and that you have a good understanding of their role and access requirements.\nTo help you audit Google IAM activities, Google Cloud creates [audit logs](/iam/docs/audit-logging) , which include the following:\n- Administrator activity. This logging can't be disabled.\n- Data access activity. You must [enable](/logging/docs/audit/configure-data-access#config-console-enable) this logging.\nIf necessary for compliance purposes, or if you want to set up log analysis (for example, with your SIEM system), you can [export the logs](/logging/docs/export) . Because logs can increase your storage requirements, they might affect your costs. Ensure that you log only the actions that you require, and set appropriate retention schedules.\n## Set up SSO and MFA\nYour identity provider manages user account authentication. Federated identities can authenticate to Google Cloud using SSO. For privileged accounts, such as super admins, you should configure MFA. [Titan Security Keys](/titan-security-key) are physical tokens that you can use for two-factor authentication (2FA) to help prevent phishing attacks.\n[Cloud Identity](/identity) supports MFA using various methods. For more information, see [Enforce uniform MFA to company-owned resources](/identity/solutions/enforce-mfa) .\nGoogle Cloud supports authentication for workload identities using the OAuth 2.0 protocol or [signed JSON Web Tokens (JWT)](https://developers.google.com/identity/protocols/oauth2/service-account#jwt-auth) . For more information about workload authentication, see [Authentication overview](/docs/authentication) .\n## Implement least privilege and separation of duties\nYou must ensure that the right individuals get access only to the resources and services that they need in order to perform their jobs. That is, you should follow the [principle of least privilege](https://wikipedia.org/wiki/Principle_of_least_privilege) . In addition, you must ensure there is an appropriate [separation of duties](/binary-authorization/docs/reference/organizational-and-iam-roles) .\nOverprovisioning user access can increase the risk of insider threat, misconfigured resources, and non-compliance with audits. Underprovisioning permissions can prevent users from being able to access the resources they need in order to complete their tasks.\nOne way to avoid overprovisioning is to implement — that is, to [provide privileged access only as needed, and to only grant ittemporarily](/architecture/manage-just-in-time-privileged-access-to-project) .\nBe aware that when a Google Cloud organization is created, all users in your domain are granted the Billing Account Creator and Project Creator roles by default. Identify the users who will perform these duties, and revoke these roles from other users. For more information, see [Creating and managing organizations](/resource-manager/docs/creating-managing-organization) .\nFor more information about how roles and permissions work in Google Cloud, see [Overview](/iam/docs/overview) and [Understanding roles](/iam/docs/understanding-roles) in the IAM documentation. For more information about enforcing least privilege, see [Enforce least privilege with role recommendations](/iam/docs/recommender-overview) .\n## Audit access\nTo monitor the activities of privileged accounts for deviations from approved conditions, use [Cloud Audit Logs](/audit-logs) . Cloud Audit Logs records the actions that members in your Google Cloud organization have taken in your Google Cloud resources. You can work with various [audit log types](/logging/docs/audit/understanding-audit-logs) across [Google services](/logging/docs/audit/services) . For more information, see [Using Cloud Audit Logs to Help Manage Insider Risk (video)](https://www.youtube.com/watch?v=dqoZEfJ7UbM) .\nUse [IAM recommender](/recommender/docs) to track usage and to adjust permissions where appropriate. The roles that are recommended by IAM recommender can help you determine which roles to grant to a user based on the user's past behavior and on other criteria. For more information, see [Best practices for role recommendations](/iam/docs/recommender-best-practices) .\nTo audit and control access to your resources by Google support and engineering personnel, you can use [Access Transparency](/access-transparency) . Access Transparency records the actions taken by Google personnel. Use [Access Approval](/assured-workloads/access-approval/docs/overview) , which is part of Access Transparency, to grant explicit approval every time customer content is accessed. For more information, see [Control cloud administrators' access to your data](/architecture/framework/security/data-security#control_cloud_administrators_access_to_your_data) .\n## Automate your policy controls\nSet access permissions programmatically whenever possible. For best practices, see [Organization policy constraints](/architecture/security-foundations/preventative-controls#organization-policy) . The Terraform scripts for the enterprise foundations blueprint are in the [example foundation repository](https://github.com/terraform-google-modules/terraform-example-foundation/tree/master/1-org) .\nGoogle Cloud includes [Policy Intelligence](/policy-intelligence) , which lets you automatically review and update your access permissions. Policy Intelligence includes the [Recommender](/iam/docs/recommender-overview) , [Policy Troubleshooter](/iam/docs/troubleshooting-access) , and [Policy Analyzer](/asset-inventory/docs/analyzing-iam-policy) tools, which do the following:\n- Provide recommendations for IAM role assignment.\n- Monitor and help prevent overly permissive IAM policies.\n- Assist with troubleshooting access-control-related issues.## Set restrictions on resources\nGoogle [IAM](/iam) focuses on , and it lets you [authorize](/resource-manager/docs/access-control-org) who can act on specific resources based on permissions. The [Organization Policy Service](/resource-manager/docs/organization-policy/overview) focuses on , and it lets you set restrictions on resources to specify how they can be configured. For example, you can use an organization policy to do the following:\n- [Limit resource sharing](/resource-manager/docs/organization-policy/restricting-domains) based on domain.\n- [Limit the use of service accounts](/resource-manager/docs/organization-policy/restricting-service-accounts) .\n- [Restrict the physical location](/resource-manager/docs/organization-policy/defining-locations) of newly created resources.\nIn addition to using organizational policies for these tasks, you can restrict access to resources using one of the following methods:\n- [Use tags](/iam/docs/tags-access-control) to manage access to your resources without defining the access permissions on each resource. Instead, you add the tag and then set the access definition for the tag itself.\n- [Use IAM Conditions](/iam/docs/conditions-overview) for conditional, attribute-based control of access to resources.\n- Implement defense-in-depth using [VPC Service Controls](/vpc-service-controls/docs) to further restrict access to resources.\nFor more about resource management, see [Resource management](/architecture/framework/system-design/resource-management) .\n## What's next\nLearn more about IAM with the following resources:\n- [Implement compute and container security](/architecture/framework/security/compute-container-security) (next document in this series)\n- [Using IAM securely](/iam/docs/using-iam-securely) \n- [Reference architectures](/architecture/identity/reference-architectures#using_google_as_an_idp) \n- [IAM Recommender: least privilege with less effort](/blog/products/identity-security/achieve-least-privilege-with-less-effort-using-iam-recommender) \n- [Cloud Data Privacy](/security/privacy) \n- [Overview of identity and access management](/architecture/identity)", "guide": "Docs"}