{"title": "Docs - Google Cloud plug-in for VMware Aria", "url": "https://cloud.google.com/architecture/vmware-aria-plugin", "abstract": "# Docs - Google Cloud plug-in for VMware Aria\n", "content": "## Introduction\nThe Google Cloud Plug-in for VMware Aria Automation Orchestrator lets you provision and manage Google Cloud resources using VMware Aria Automation Orchestrator and VMware Aria Automation, including Compute Engine instances, GKE clusters, Spanner and Cloud SQL instances, and Cloud Storage buckets.\n### Benefits\nThe Google Cloud Plug-in for VMware Aria provides a consistent management and governance experience across on-premises and Google Cloud-based IT environments. For example, you can use Google-provided blueprints or build your own blueprints for Compute Engine resources and publish to the VMware Aria service catalog. This means that you can select and launch resources predictably using a tool you're already familiar with when you orchestrate VMs in your on-premises VMware environment.\n### Prerequisites\nYou need a Google Billing account to complete the instructions in this guide. If you don't have an account, see [Create, Modify, or Close Your Billing Account](/billing/docs/how-to/manage-billing-account) . New Google Cloud users might be eligible for a [free trial](/free-trial) .\nThis guide assumes that you have a working knowledge of the following:\n- [Google Cloud](/) , especially the concepts in [Google Cloud for Data Center Professionals](/docs/compare/data-centers) \n- [VMware Aria Automation Orchestrator](https://www.vmware.com/products/vrealize-orchestrator.html) \n- [VMware Aria Automation ](https://www.vmware.com/products/vrealize-automation.html) \n### Supported Google Cloud products\nThe plug-in supports the following Google Cloud resources:\n- BigQuery\n- Filestore\n- Cloud KMS\n- Pub/Sub\n- Spanner\n- Cloud SQL\n- Cloud Storage\n- Compute Engine\n- IAM service accounts and keys\n- Google Kubernetes Engine clusters\n- Virtual Private Cloud networks and firewall rules\n- Turnkey VM-based application servers:- ASP.NET\n- MS SQLServer Enterprise\n- WordPress\n- LAMP\n- HA load-balanced Compute Engine VM cluster\n## Setting up the Google Cloud plug-in for VMware Aria\nThis section explains how to install and configure the plug-in.\n**Note:** Use of the plug-in is subject to the Google Cloud [Terms of Service](/terms/service-terms) .\n### Set up your Google Cloud environment\n### Download the plug-in\n- On a computer where you have access to the VMware Aria Automation Orchestrator Control Center, download the latest version of the Google Cloud plug-in for VMware Aria from the following location: [https://storage.googleapis.com/cpe-ti-vmware/signed/o11nplug-in-gcp-plug-in-for-vro.vmoapp](https://storage.googleapis.com/cpe-ti-vmware/signed/o11nplugin-gcp-plugin-for-vro.vmoapp) In order to have the Google Cloud plug-in for VMware Aria interact with your Google Cloud resources, the plug-in needs to have a service account credential that is used to authenticate API calls to Google Cloud.\n- In the Google Cloud console, go to the select **IAM & admin** page [Go to the IAM & admin page](https://console.cloud.google.com/iam-admin) \n- Select **Service accounts** and then click **Create Service Account** .\n- Give the service account a name and optionally provide a description.\n- Click **Create** .\n- Grant the following roles to the service account. (Use the filter box at the top to find these roles.)- To enable the plug-in to create and manage Compute Engine instances, add the **Compute Admin** and **Service Account User** roles.\n- To enable the plug-in to manage GKE clusters, add the **Kubernetes Engine Admin** role.\n- To enable the plug-in to manage Pub/Sub topics and subscriptions, add the **Pub/Sub Admin** role.\nTo enable the plug-in to manage additional resource types, add the appropriate role. For more information, see [Understanding Service Accounts](/iam/docs/understanding-service-accounts) .\n- Alternatively, to enable the plug-in to manage all Google Cloud resource types, give the service account the **Editor** role on the project. However, it's a best practice to grant the fewest privileges that are necessary in order for the plug-in to manage your Google Cloud resources.\n- When you've finished assigning roles, click **Continue** .\n- Click **Create Key** and select the **JSON** option.\nYour browser downloads a new service account credential file in JSON format that contains the service account private key. Store this in a secure location, because you need it later to create the Google Cloud connection in the plug-in.\nNote: You can change the roles assigned to a service account at any time. To do so, in the Google Cloud console, go to **IAM & admin** > **IAM** . Find your service account in the list of principals that have access to your project, then clickedit.\nYou can now configure the plug-in in VMware Aria Automation Orchestrator.\n- In your browser, log in to the VMware Aria Automation Orchestrator Control Center as an administrator. The URL is typically like the following:```\nhttps://hostname:8283/vco-controlcenter\n```\n- Go to the **Manage Plug-Ins** page.\n- Browse for the plug-in file you downloaded and click **Upload** .\n- If you accept the EULA, click **Install** .\n- If you're prompted, click **Save Changes** .Wait for VMware Aria Automation Orchestrator to restart its services before you use the plug-in. The restart might take a few minutes. You'll know that VMware Aria Automation Orchestrator has restarted when you see all green checkmarks in the **Validate Configuration** page. The final stage in the setup is to use the service account credential file you downloaded earlier to establish a connection in the VMware Aria Automation Orchestrator. Doing this allows the plug-in to execute operations on behalf of any logged-in VMware Aria Automation Orchestrator user.\n- In the **Workflows** tab of VMware Aria Automation Orchestrator, select **Library** > **GCP** > **Configuration** > **Create GCP Connection** .\n- Provide a name for the connection.\n- Provide the key in either of these ways:- Attach the service account credential file that you downloaded earlier\n- Paste the credential in the **Paste JSON-encoded Service\nAccount** field.\n \n- If your VMware Aria Automation Orchestrator server needs to connect to a proxy server before reaching the public internet, check the **Use proxy?** option and provide your proxy server details: \n- When the workflow completes, go to the **Inventory** tab in the VMware Aria Automation Orchestrator client.In the **Google Cloud Platform** tree entry, you see a new subtree with your connection name and project ID. Unless you already have Google Cloud resources, most of the tree nodes are empty except for the ones available by default in a project. These include **ComputeRegions/Zones** , the default network and firewall rules, and the service account that you created and used to establish the connection from VMware Aria Automation Orchestrator. \nYou have now completed the configuration of the plug-in, and you can run any of the other workflows available in the Google Cloud directory.\n## Working with Google Cloud resources in VMware Aria Automation Orchestrator and VMware Aria Automation\nThis section provides an overview of using workflows in the Google Cloud plug-in for VMware Aria.\n**Note** : This tutorial provides instructions for working with this app: VMware Aria Automation Orchestrator version 7.5. The instructions might not represent newer versions of the app. For more information, see the documentation: [VMware Aria Automation Orchestrator](https://docs.vmware.com/en/vRealize-Orchestrator/index.html) .\n### Authenticating and authorizing users\nVMware Aria administrators and users authenticate to VMware Aria Automation Orchestrator and VMware Aria Automation using VMware Aria [role-based access management](https://docs.vmware.com/en/vRealize-Orchestrator/7.3/com.vmware.vrealize.orchestrator-install-config.doc/GUID-9680434A-1ABF-410B-83C5-3E7243878081.html) . VMware Aria roles are not mapped to IAM permissions. Instead, all VMware Aria user and administrator actions are performed using the same Google Cloud service account that was used when [creating the connection](#establish_a_google_cloud_connection_in_aria_automation_orchestrator) . The service account must have appropriate IAM permissions to allow VMware Aria users to provision resources in Google Cloud, as [describedearlier](#create_service_account) .\nYou can create more than one connection, each one using different Google Cloud projects and service accounts. This lets you isolate user and administrator actions by granting specific user groups access to a connection. You can specify a different connection for each workflow that's used to create a new resource, and each workflow that operates on an existing resource infers the connection from the project ID where the resource is located.\n**Note:** Because a service account is used to connect to Google Cloud, Google Cloud audit logs show the service account as the user. To see audit activity by individual users, refer to the VMware Aria Automation Orchestrator and VMware Aria Automation Orchestrator log.\n### Running Google Cloud workflows in VMware Aria Automation Orchestrator\nThe workflows included in the Google Cloud plug-in for Vmware Aria Automation Orchestrator lets users create many common Google Cloud resources, including Compute Engine instances, GKE clusters, Virtual Private Cloud firewall rules, Cloud Storage buckets. In general, workflows for creating these resources can be accessed within the folder for the resource type (for example, **Instances** for Compute Engine instances).\nAs an example of how to run a Google Cloud workflow, the following section describes how to build a Compute Engine instance.- In the VMware Aria Automation Orchestrator folder, open **GCP** > **Instances** , and then click **Create Instance** . \n- Select a Google Cloud connection. This provides the authorization credential to be able to interact with Google Cloud APIs. \n- Use the fields to customize the configuration of the VM instance, such as specifying the region, zone, instance name, machine type, and so on. Required fields are marked with a red asterisk. \n- Click **Next** to move to additional pages that let you specify options like a startup script, tags, an external IP address, and an SSH key. \n- Optionally, examine the information in the **Price estimate** form. This page provides an estimated calculation of the monthly cost for running the VM. This is not intended to be an exact measure of your expected billing charges, but can provide a rough estimate to use for budgeting purposes. \n- When you've finished specifying options, click **Submit** .In the **Logs** tab of the workflow execution page, you see diagnostic information that indicates the status of the create operation. The workflow completes after a few seconds. You can then reload the **VM instances** node to view the new instance in the VMware Aria Automation Orchestrator inventory tree. \n- To show attributes of the new instance, click it in the listing. \n- Optionally, in the Google Cloud console, go to the **VM Instances** page and find your new instance. In VMware documentation, [Day 2 operations](https://docs.vmware.com/en/vCloud-Availability-for-vCloud-Director/1.0.1/com.vmware.vcavcd.install.doc/GUID-74E95E3E-6B24-418C-B14E-02DF90C3447A.html) are those that you perform after initial provisioning. This section describes how to execute an operational workflow on a Google Cloud resource.\nAs an example, the following procedure shows how to run a workflow on an existing Compute Engine instance.\n- In VMware Aria Automation Orchestrator, right-click the resource and select **Run workflow** . \n- Click on the workflow to execute, and then click **Select** . The VM instance is populated in the form field.\n- Run the workflow to perform the action. (In this case, to reset the instance.) A dialog appears and remains on the screen until the workflow completes. You may optionally choose to send the workflow to the background if you want to perform other tasks while it runs.\n- Optionally, go to the Google Cloud console and note the effect of running the workflow. ## Using VMware Aria Automation with Google Cloud\nThe Google Cloud plug-in for VMware Aria Automation Orchestrator enables VMware Aria Automation administrators to create blueprints of Google Cloud resources and publish them to the VMware Aria Automation catalog. End users can request and deploy blueprints.\nFor more information, see [Designing and Publishing Blueprints](https://docs.vmware.com/en/vRealize-Orchestrator/7.0/com.vmware.using.vio.plugin.doc_20/GUID-FC6663D6-A0DA-4413-9E4D-B2EE03C64466.html?hWord=N4IghgNiBcIB5jAZwAQCMIFcCmAHATgJYB2ALkiAL5A) in the VMware documentation.\n### Creating XaaS blueprints in VMware Aria Automation from VMware Aria Automation Orchestrator\nThis section describes the procedure for using workflows provided by VMware Aria Automation Orchestrator and by the Google Cloud plug-in for VMware Aria Automation Orchestrator to import the XaaS resource types and blueprints that you intend to use inside of VMware Aria Automation.- In VMware Aria Automation Orchestrator, go to the **Workflows** tab and then open **VMware Aria Automation** > **Configuration** .\n- Run the **Add a vRA Host** workflow. \n- Provide the information for your VMware Aria Automation host. Be sure to use a user account that has [IaaS administrative roles](https://docs.vmware.com/en/vRealize-Automation/7.5/com.vmware.vra.prepare.use.doc/GUID-135436AC-CF31-44A1-A358-61D2B68183AE.html) assigned to it.- In VMware Aria Automation Orchestrator, go to the **Workflows** tab and then open **GCP** > **vRA Blueprints** .\n- Run the **Import XaaS Custom Resources** workflow. \n- Choose your VMware Aria Automation host and select the Google Cloud resource types that you want to have available in VMware Aria Automation. For example, if you want to manage Cloud Storage resources in VMware Aria Automation, select `Google Cloud:Bucket` and `Google Cloud:StorageObject` . By default, all Google Cloud types available in the plug-in are selected. \n- Submit the workflow.When it completes, you see the imported custom resources in the **Design** > **XaaS** > **Custom Resources** section of VMware Aria Automation. - In VMware Aria Automation Orchestrator, go to the **Workflows** tab and open **GCP** > **vRA Blueprints** .\n- Run the **Import XaaS Services Blueprints** workflow. \n- Choose your VMware Aria Automation Host and select the workflows that create instances of the custom resource types that you imported in the previously. For example, the **BigQuery** > **Create Dataset** workflow is available because it is used to create a `Google Cloud:Dataset` .You can select as many workflows as you want based on the custom resource types known to your VMware Aria Automation Host. The service name field is used to define the name of the VMware Aria Automation service catalog. \n- Submit the workflow.When it completes, you see all of the imported blueprints under the **Design** > **XaaS** > **XaaS Blueprints** section in VMware Aria Automation Orchestrator. \n- To verify the workflows, in VMware Aria Automation Orchestator, go to **Administration** > **Catalog Management** > **Catalog Items** .You see that the new Google Cloud service has been added and that each of the XaaS blueprints has been added as a catalog item within the new service. To allow users to create and manage Google Cloud resources, you create an entitlement that specifies the Google Cloud service, along with the catalog items and actions that will be available.\nFor details, see [Entitlements](https://docs.vmware.com/en/vRealize-Automation/7.5/com.vmware.vra.prepare.use.doc/GUID-879045A7-A759-4864-B1EA-9B509D3259E6.html?hWord=N4IghgNiBcIKYDsAuBLJE4FtFJAXyA) in the VMware documentation.\nAfter the entitlement is created and made active, users that are a part of the assigned business group see the Google Cloud catalog items as options.\n[Day 2 operations](https://docs.vmware.com/en/vCloud-Availability-for-vCloud-Director/1.0.1/com.vmware.vcavcd.install.doc/GUID-74E95E3E-6B24-418C-B14E-02DF90C3447A.html) on custom resources need to be created as actions.\n- In VMware Aria Automation Orchestrator, go to the **Workflows** tab and then open **GCP** > **vRA Blueprints** .\n- Run the **Create Actions for Custom Resource** workflow. \n- Choose your VMware Aria Automation host and then type the name of the custom resource type you want to create actions for. \n- Submit the workflow.When it completes, you see the actions as published resource actions in the **Design** > **XaaS** > **Resource Actions** section of VMware Aria Automation. \n- Optionally, enable the actions in the entitlement established for your users. This makes sure that they appear on created resources managed by VMware Aria Automation. \n**Note:** Resource actions that are used to dispose of deployments in VMware Aria Automation need to be marked as `Disposal` actions after you create them. In the **Design** > **XaaS** > **Resource Actions** section of VMware Aria Automation, edit the deletion actions and select the **Disposal** box.\n### Manually creating XaaS blueprints in VMware Aria Automation\nThe procedures in this section describe the manual steps for configuring VMware Aria Automation to allow your users to run workflows from the Google Cloud Plug-in for VMware Aria Automation Orchestrator in a VMware Aria Automation service catalog. This guide assumes you have XaaS Administrator privileges and are familiar with the instructions described in [Creating XaaS Blueprints and Actions](https://docs.vmware.com/en/vRealize-Automation/7.4/com.vmware.vra.prepare.use.doc/GUID-08B3C736-6EAF-4070-8276-564A82AAE522.html) in the VMware documentation.\nFor a more efficient means of building VMware Aria Automation XaaS artifacts, we recommend following the steps in the [Creating XaaS Blueprints in VMware Aria Automation from VMware Aria Automation Orchestrator](#creating_xaas_blueprints_in_aria_automation) section.\n### Create a multi-resource blueprint\nYou can use the VMware Aria Automation blueprint designer to build reusable templates that consist of multiple XaaS blueprint components.\nFor example, you can create a blueprint that creates a Compute Engine instance that's running Microsoft SQL Server and that has the associated network and firewall rules. You can use the blueprint designer interface to add Google Cloud resources and create custom blueprints.\n## Updates and release notes\nTo get the latest version of the Google Cloud plug-in for VMware Aria, download it from the following Cloud Storage bucket:\n[https://storage.googleapis.com/cpe-ti-vmware/signed/o11nplug-in-gcp-plug-in-for-vro.vmoapp](https://storage.googleapis.com/cpe-ti-vmware/signed/o11nplugin-gcp-plugin-for-vro.vmoapp)\nIf you are running an older version of the plug-in, you will receive a warning message when you run workflows indicating that a newer version is available.\nYou can use VMware Aria Automation Orchestrator to download the latest version of the plug-in.\n- In the Google Cloud console, make sure the Cloud Storage JSON API is enabled. [Go to the Cloud Storage JSON API page](https://console.cloud.google.com/apis/library/storage-api.googleapis.com?q=json&id=05a76622-58c5-41e6-9dd2-d52dbcb4d883&project=aaa-my-project-i-1508972506829&folder&organizationId=433637338589) \n- In VMware Aria Automation Orchestrator, go to the **GCP** > **Configuration** folder.\n- Run the **Download Latest Plugin** workflow and provide your Google Cloud connection. Running the workflow downloads the plug-in's `.dar` file to a temporary folder.\n- Follow the steps in this [VMware KB article 2151653](https://kb.vmware.com/s/article/2151653) to copy the plug-in's file to the appropriate location on the VMware Aria Automation Orchestrator server. Use `cp` in place of `rm` in Step 4 to move the downloaded `.dar` file to the `/usr/lib/vco/app-server/plugins/` folder. \nRelease notes are maintained at [https://storage.googleapis.com/cpe-ti-vmware/RELEASE_NOTES.txt](https://storage.googleapis.com/cpe-ti-vmware/RELEASE_NOTES.txt) .\n## Issues\nTo report product defects, send an email to [gcp-vrealize-feedback@google.com](mailto:gcp-vrealize-feedback@google.com) .", "guide": "Docs"}