{"title": "Docs - Performance optimization process", "url": "https://cloud.google.com/architecture/framework/performance-optimization/process", "abstract": "# Docs - Performance optimization process\nLast reviewed 2023-07-12 UTC\nThis document in the [Google Cloud Architecture Framework](/architecture/framework) provides an overview of the performance optimization process.\nPerformance optimization is a continuous process, not a one-time activity. The following diagram shows the stages in the performance optimization process:\nThe following is an overview of the stages in the performance optimization process:\n", "content": "## Define performance requirements\nBefore you start to design and develop the applications that you intend to deploy or migrate to the cloud, determine the performance requirements. Define the requirements as granularly as possible for each layer of the application stack: frontend load balancing, web or applications servers, database, and storage. For example, for the storage layer of the stack, decide on the [throughput](https://wikipedia.org/wiki/Throughput) and I/O operations per second ( [IOPS](https://wikipedia.org/wiki/IOPS) ) that your applications need.\n## Design and deploy your applications\nDesign your applications by using elastic and scalable design patterns that can help you meet the performance requirements. Consider the following guidelines for designing applications that are elastic and scalable:\n- Architect the workloads for optimal content placement.\n- Isolate read and write traffic.\n- Isolate static and dynamic traffic.\n- Implement content caching. Use data caches for internal layers.\n- Use managed services and serverless architectures.\nGoogle Cloud provides [open source tools](/free/docs/measure-compare-performance) that you can use to benchmark the performance of Google Cloud services with other cloud platforms.\n## Monitor and analyze performance\nAfter you deploy your applications, continuously monitor performance by using logs and alerts, analyze the data, and identify performance issues. As your applications grow and evolve, reassess your performance requirements. You might have to redesign some parts of the applications to maintain or improve performance.\n## Optimize performance\nBased on the performance of your applications and changes in requirements, configure the cloud resources to meet the current performance requirements. For example, resize the resources or set up autoscaling. When you configure the resources, evaluate opportunities to use recently released Google Cloud features and services that can help further optimize performance.\nThe performance optimization process doesn't end at this point. Continue the cycle of monitoring performance, reassessing requirements when necessary, and adjusting the cloud resources to maintain and improve performance.\n## What's next\n- [Monitor and analyze performance](/architecture/framework/performance-optimization/monitor) .\n- [Optimize compute performance](/architecture/framework/performance-optimization/compute) .\n- [Optimize storage performance](/architecture/framework/performance-optimization/storage) .\n- [Optimize networking performance](/architecture/framework/performance-optimization/networking) .\n- [Optimize database performance](/architecture/framework/performance-optimization/databases) .\n- [Optimize analytics performance](/architecture/framework/performance-optimization/analytics) .", "guide": "Docs"}