{"title": "Docs - Monitor and control cost", "url": "https://cloud.google.com/architecture/framework/cost-optimization/monitor", "abstract": "# Docs - Monitor and control cost\nLast reviewed 2023-09-08 UTC\nThis document in [Google Cloud Architecture Framework](/architecture/framework) describes best practices, tools, and techniques to help you track and control the cost of your resources in Google Cloud.\nThe guidance in this section is intended for users who provision or manage resources in the cloud.\n", "content": "## Cost-management focus areas\nThe cost of your resources in Google Cloud depends on the quantity of resources that you use and the rate at which you're billed for the resources.\nTo manage the cost of cloud resources, we recommend that you focus on the following areas:\n- Cost visibility\n- Resource optimization\n- Rate optimization\n### Cost visibility\nTrack how much you spend and how your resources and services are billed, so that you can analyze the effect of cost on business outcomes. We recommend that you follow the [FinOps operating model](/resources/cloud-finops-getting-started-whitepaper) , which suggests the following actions to make cost information visible across your organization:\n- **Allocate** : Assign an owner for every cost item.\n- **Report** : Make cost data available, consumable, and actionable.\n- **Forecast** : Estimate and track future spend.\n### Resource optimization\nAlign the number and size of your cloud resources to the requirements of your workload. Where feasible, consider using managed services or re-architecting your applications. Typically, individual engineering teams have more context than the central [FinOps](/architecture/framework/cost-optimization/finops) (financial operations) team on opportunities and techniques to optimize resource deployment. We recommend that the FinOps team work with the individual engineering teams to identify resource-optimization opportunities that can be applied across the organization.\n### Rate optimization\nThe FinOps team often makes rate optimization decisions centrally. We recommend that the individual engineering teams work with the central FinOps team to take advantage of deep discounts for reservations, committed usage, Spot VMs, flat-rate pricing, and volume and contract discounting.\n## Design recommendations\nThis section suggests approaches that you can use to monitor and control costs.\n### Consolidate billing and resource management\nTo manage billing and resources in Google Cloud efficiently, we recommend that you use a single billing account for your organization, and use internal chargeback mechanisms to allocate costs. Use multiple billing accounts for loosely structured conglomerates and organizations with entities that don't affect each other. For example, resellers might need distinct accounts for each customer. Using separate billing accounts might also help you meet country-specific tax regulations.\nAnother recommended best practice is to move all the projects that you manage into your organization. We recommend using Resource Manager to build a [resource hierarchy](/resource-manager/docs/cloud-platform-resource-hierarchy#resource-hierarchy-detail) that helps you achieve the following goals:\n- Establish a hierarchy of resource-ownership based on the relationship of each resource to its immediate parent.\n- Control how access policies and cost-allocation tags or labels are attached to and inherited by the resources in your organization.\nIn addition, we recommend that you allocate the cost of shared services proportionally based on consumption. Review and adjust the cost allocation parameters periodically based on changes in your business goals and priorities.\n### Track and allocate cost using tags or labels\nTags and labels are two different methods that you can use to annotate your Google Cloud resources. Tags provide more capabilities than labels. For example, you can implement fine-grained control over resources by creating Identity and Access Management (IAM) policies that are conditional based on whether a tag is attached to a supported resource. In addition, the tags that are associated with a resource are inherited by all the child resources in the hierarchy. For more information about the differences between tags and labels, see [Tags overview](https://cloud.google.com/resource-manager/docs/tags/tags-overview#tags_and_labels) .\nIf you're building a new framework for cost allocation and tracking, we recommend using tags.\nTo categorize cost data at the required granularity, establish a tagging or labeling schema that suits your organization's chargeback mechanism and helps you allocate costs appropriately. You can define tags at the organization or project level. You can assign labels at the project level, and define a set of labels that can be applied by default to all the projects.\nDefine a process to detect and correct tagging and labeling anomalies and unlabeled projects. For example, from [Cloud Asset Inventory](https://console.cloud.google.com/iam-admin/asset-inventory/resources) , you can download an inventory ( `.csv` file) of all the resources in a project and analyze the inventory to identify resources that aren't assigned any tags or labels.\nTo track the cost of shared resources and services (for example, common datastores, multi-tenant clusters, and support subscriptions), consider using a special tag or label to identify projects that contain shared resources.\n### Configure billing access control\nTo control access to Cloud Billing, we recommend that you assign the Billing Account Administrator role to only those users who manage billing contact information. For example, employees in finance, accounting, and operations might need this role.\nTo avoid a single point of failure for billing support, assign the Billing Account Administrator role to multiple users or to a group. Only users with the Billing Account Administrator role can contact support. For detailed guidance, see [Cloud Billing access control examples](/billing/docs/how-to/billing-access#cloud-billing_access-control-examples) and [Important Roles](/billing/docs/concepts#important_roles) .\nMake the following configurations to manage access to billing:\n- To associate a billing account with a project, members need the Billing Account User role on the billing account and the Project Billing Manager role on the project.\n- To enable teams to manually associate billing accounts with projects, you can assign the Project Billing Manager role at the organization level and the Billing Account User role on the billing account. You can automate the association of billing accounts during project creation by assigning the Project Billing Manager and Billing Account User roles to a [service account](/iam/docs/service-accounts) . We recommend that you restrict the Billing Account Creator role or remove all assignments of this role.\n- To prevent outages caused by unintentional changes to the billing status of a project, you can lock the link between the project and its billing account. For more information, see [Secure the link between a project and its billing account](/billing/docs/how-to/secure-project-billing-account-link) .\n### Configure billing reports\nSet up [billing reports](/billing/docs/how-to/reports) to provide data for the key metrics that you need to track. We recommend that you track the following metrics:\n- Cost trends\n- Largest spenders (by project and by product)\n- Areas of irregular spending\n- Key organization-wide insights as follows:- Anomaly detection\n- Trends over time\n- Trends that occur in a set pattern (for example, month-on-month)\n- Cost comparison and benchmark analysis between internal and external workloads\n- Business case tracking and value realization (for example, cloud costs compared with the cost of similar on-premises resources)\n- Validation that Google Cloud bills are as expected and accurate\n### Analyze trends and forecast cost\nCustomize and analyze cost reports using [BigQuery Billing Export](/billing/docs/how-to/export-data-bigquery) , and visualize cost data using [Looker Studio](https://lookerstudio.google.com/overview) . Assess the trend of actual costs and how much you might spend by using the [forecasting tool](/billing/docs/how-to/reports#cost-forecast) .\n### Optimize resource usage and cost\nThis section recommendeds best practices to help you optimize the usage and cost of your resources across Google Cloud services.\nTo prevent overspending, consider configuring default budgets and alerts with high thresholds for all your projects. To help keep within budgets, we recommend that you do the following:\n- Configure [budgets and alerts](/billing/docs/how-to/budgets) for projects where absolute usage limits are necessary (for example, training or sandbox projects).\n- Define budgets based on the financial budgets that you need to track. For example, if a department has an overall cloud budget, set the scope of the Google Cloud budget to include the specific projects that you need to track.\n- To ensure that budgets are maintained, delegate the responsibility for configuring budgets and alerts to the teams that own the workloads.\nTo help optimize costs, we also recommend that you do the following:\n- [Cap API usage](/apis/docs/capping-api-usage) in cases where it has minimal or no business impact. Capping can be useful for sandbox or training projects and for projects with fixed budgets (for example, ad-hoc analytics in BigQuery). Capping doesn't remove all the resources and data from the associated projects.\n- Use [quotas](/docs/quota) to set hard limits that throttle resource deployment. Quotas help you control cost and prevent malicious use or misuse of resources. Quotas are applied at the project level, per resource type and location.\n- View and implement the cost-optimization recommendations in the [Recommendation Hub](/recommender/docs/recommendation-hub/identify-configuration-problems) .\n- Purchase [committed use discounts (CUD)](/docs/cuds) to save money on resources for workloads with predictable resource needs.## Tools and techniques\nThe on-demand provisioning and pay-per-use characteristics of the cloud help you to optimize your IT spend. This section describes tools that Google Cloud provides and techniques that you can use to track and control the cost of your resources in the cloud. Before you use these tools and techniques, review the [basic Cloud Billing concepts](/billing/docs/concepts) .\n### Billing reports\nGoogle Cloud provides [billing reports](/billing/docs/how-to/reports) within the Google Cloud console to help you view your current and forecasted spend. The billing reports enable you to view cost data on a single page, discover and analyze trends, forecast the end-of-period cost, and take corrective action when necessary.\nBilling reports provide the following data:\n- The costs and cost trends for a given period, organized as follows:- By billing account\n- By project\n- By product (for example, Compute Engine)\n- By [SKU](/skus) (for example, static IP addresses)\n- The potential costs if discounts or promotional credits were excluded\n- The forecasted spend\n### Data export to BigQuery\nYou can [export billing reports to BigQuery](/billing/docs/how-to/export-data-bigquery) , and analyze costs using granular and historical views of data, including data that's categorized using labels or tags. You can perform more advanced analyses using BigQuery ML. We recommend that you enable export of billing reports to BigQuery when you create the Cloud Billing account. Your BigQuery dataset contains billing data from the date you set up Cloud Billing export. The dataset doesn't include data for the period before you enabled export.\n**Note:** Exported billing data might be different from the data in billing invoices, due to late-reported data, timestamp variations, errors and adjustments, and taxes. For more information, see [Differences between exported data and invoices](/billing/docs/how-to/export-data-bigquery-tables#differences_between_exported_data_and_invoices) .\nTo visualize cost data, you can create custom dashboards that integrate with BigQuery (example templates: [Looker](/architecture/reference-patterns/overview#understanding-and-optimizing-your-google-cloud-spend) , [Looker Studio](https://github.com/GoogleCloudPlatform/professional-services/tree/main/examples/cost-optimization-dashboard) ).\nYou can use tags and labels as criteria for filtering the exported billing data. The number of labels included in the billing export is limited. Up to a 1,000 label-maps within a a period of one hour are preserved. Labels don't appear in the [invoice PDF or CSV](/billing/docs/how-to/read-invoice) . Consider annotating resources by using tags or labels that indicate the business unit, internal chargeback unit, and other relevant metadata.\n### Billing access control\nYou can [control access to Cloud Billing](/billing/docs/how-to/billing-access) for specific resources by defining Identity and Access Management (IAM) policies for the resources. To grant or limit access to Cloud Billing, you can set an IAM policy at the organization level, the billing account level, or the project level.\n**Note:** Although billing accounts are linked to projects, billing accounts are not parents of projects in IAM. Projects don't inherit permissions from the billing account that they are linked to.\nAccess control for billing and resource management follows the principle of separation of duties. Each user has only the permissions necessary for their business role. The Organization Administrator and Billing Administrator roles don't have the same permissions.\nYou can set billing-related permissions at the billing account level and the organization level. The common roles are Billing Account Administrator, Billing Account User, and Billing Account Viewer.\nWe recommend that you use [invoiced billing](/billing/docs/how-to/invoiced-billing) , or configure a [backup payment method](/billing/docs/how-to/payment-methods) . Maintain [contact and notification settings](/billing/docs/how-to/modify-contacts) for billing and payment.\n### Budgets, alerts, and quotas\n[Budgets](/billing/docs/how-to/budgets) help you track actual Google Cloud costs against planned spending. When you create a budget, you can configure alert rules to trigger email notifications when the actual or forecasted spend exceeds a defined threshold. You can also use budgets to automate cost-control responses.\nBudgets can trigger alerts to inform you about resource usage and cost trends, and prompt you to take cost-optimization actions. However, budgets don't prevent the use or billing of your services when the actual cost reaches or exceeds the budget or threshold. To automatically control cost, you can use budget notifications to programmatically disable Cloud Billing for a project. You can also [limit API usage](/apis/docs/capping-api-usage) to stop incurring cost after a defined usage threshold.\nYou can configure [alerts](/billing/docs/how-to/budgets#email-notifications) for billing accounts and projects. Configure at least one budget for an account.\nTo prevent provisioning resources beyond a predetermined level or to limit the volume of specific operations, you can set [quotas](/docs/quota) at the resource or API level. The following are examples of how you can use quotas:\n- Control the number of API calls per second.\n- Limit the number of VMs created.\n- Restrict the amount of data queried per day in BigQuery.\nProject owners can reduce the amount of quota that can be charged against a quota limit, by using the Service Usage API to apply consumer overrides to specific quota limits. For more information, see [Creating a consumer quota override](/service-usage/docs/manage-quota#create_consumer_quota_override) .\n### Workload efficiency improvement\nWe recommend the following strategies to help make your workloads in Google Cloud cost-efficient:\n- Optimize resource usage by improving product efficiency.\n- Reduce the rate at which you're billed for resources.\n- Control and limit resource usage and spending.\nWhen selecting cost-reduction techniques and Google Cloud features, consider the effort required and the expected savings, as shown in the following graph:\nThe following is a summary of the techniques shown in the preceding graph:\n- The following techniques potentially yield high savings with low effort:- Committed use discounts\n- Autoscaling\n- BigQuery slots\n- The following techniques potentially yield high savings with moderate-to-high effort:- Spot VMs\n- Re-architecting as serverless or containerized applications\n- Re-platforming to use managed services\n- The following techniques potentially yield moderate savings with moderate effort:- Custom machine types\n- Cloud Storage lifecycle management\n- Rightsizing\n- Reclaiming idle resourcesThe techniques explained in the following sections can help you improve the efficiency of your workloads.\nYou can achieve substantial cost savings by refactoring or [re-architecting](/rearchitecting-to-cloud-native-whitepaper) your workload to use Google Cloud products. For example, moving to [serverless services](/serverless/whitepaper) (like Cloud Storage, Cloud Run, BigQuery, and Cloud Functions) that support scaling to zero can help improve efficiency. To assess and compare the cost of these products, you can use the [pricing calculator](/products/calculator) .\nThis technique helps you ensure that the scale of your infrastructure matches the intended usage. This strategy is relevant primarily to infrastructure-as-a-service (IaaS) solutions, where you pay for the underlying infrastructure. For example, you've deployed 50 VMs, but the VMs aren't fully utilized, and you determine that the workloads could run effectively on fewer (or smaller) VMs. In this case, you can remove or resize some of the VMs. Google Cloud provides [rightsizing recommendations](/compute/docs/instances/apply-machine-type-recommendations-for-instances) to help you detect opportunities to save money without affecting performance by provisioning smaller VMs. Rightsizing requires less effort if done during the design phase than after deploying resources to production.\nIf the products you use support dynamic autoscaling, consider designing the workloads to take advantage of autoscaling to get cost and performance benefits. For example, for compute-intensive workloads, you can use managed instance groups in Compute Engine or containerize the applications and deploy them to a Google Kubernetes Engine cluster.\n### Active Assist recommendations\n[Active Assist](/solutions/active-assist) uses data, intelligence, and machine learning to reduce cloud complexity and administrative effort. Active Assist makes it easy to optimize the security, performance, and cost of your cloud topology. It provides [intelligent recommendations](/recommender) for optimizing your costs and usage. You can apply these recommendations for immediate cost savings and greater efficiency.\nThe following are examples of recommendations provided by Active Assist:\n- Compute Engine resource rightsizing: Resize your [VM instances](/compute/docs/instances/apply-sizing-recommendations-for-instances) to optimize for cost and performance based on usage. Identify and delete or back up [idle VMs](/compute/docs/instances/viewing-and-applying-idle-vm-recommendations) and [persistent disks](/compute/docs/disks/viewing-and-applying-idle-pd-recommendations) to optimize your infrastructure cost.\n- Committed-use discount (CUD): Google Cloud analyzes your historical usage, finds the optimal commitment quantity for your workloads, and provides easy-to-understand, actionable recommendations for cost savings. For more information, see [Committed use discount recommender](/docs/cuds-recommender) .\n- Unattended projects: Discover unattended projects in your organization, and remove or reclaim them. For more information, see [Unattended project recommender](/recommender/docs/unattended-project-recommender) .\nFor a complete list, see [Recommenders](/recommender/docs/recommenders) .\n## What's next\n- [Learn about Cloud Billing concepts](/billing/docs/concepts) \n- [Set budgets and budget alerts](/billing/docs/how-to/budgets) \n- Optimize cost for compute services, storage, databases, networking, and operations:- [Optimize cost: Compute, containers, and serverless](/architecture/framework/cost-optimization/compute) \n- [Optimize cost: Storage](/architecture/framework/cost-optimization/storage) \n- [Optimize cost: Databases and smart analytics](/architecture/framework/cost-optimization/databases) \n- [Optimize cost: Networking](/architecture/framework/cost-optimization/networking) \n- [Optimize cost: Cloud operations](/architecture/framework/cost-optimization/cloudops) \n- Explore the other categories of the [Google Cloud Architecture Framework](/architecture/framework)", "guide": "Docs"}