{"title": "Docs - 將單體式應用重構爲微服務", "url": "https://cloud.google.com/architecture/microservices-architecture-refactoring-monoliths?hl=zh-cn", "abstract": "# Docs - 將單體式應用重構爲微服務\n本參考指南是由四個部分組成的系列教程中的第二篇，該系列教程介紹瞭如何設計、構建和部署微服務。本系列文章介紹了微服務架構的各種元素。該系列介紹了微服務架構模式的優缺點及其應用方式。\n- [微服務簡介](https://cloud.google.com/architecture/microservices-architecture-introduction?hl=zh-cn) \n- 將單體式應用重構爲微服務（本文檔）\n- [微服務設置中的服務間通信](https://cloud.google.com/architecture/microservices-architecture-interservice-communication?hl=zh-cn) \n- [微服務應用中的分佈式跟蹤](https://cloud.google.com/architecture/microservices-architecture-distributed-tracing?hl=zh-cn) \n本系列文章面向設計和實施遷移以將單體式應用重構爲微服務應用的應用開發者和架構師。\n將單體式應用轉換爲微服務的過程是 [應用現代化改造](https://wikipedia.org/wiki/Software_modernization) 的一種形式。爲了完成應用現代化改造，我們建議您不要同時重構所有代碼。相反，我們建議您 [逐步重構](https://dora.dev/devops-capabilities/technical/loosely-coupled-architecture/#ways-to-improve-your-architecture) 單體式應用。逐步重構應用時，您需要逐步構建由微服務組成的新應用，並運行該應用與單體式應用。此方法也稱爲 [Strangler Fig 模式](https://martinfowler.com/bliki/StranglerFigApplication.html) 。隨着時間的推移，單體式應用實現的功能量會逐漸減少，直到它完全消失或成爲另一個微服務。\n如需分離功能與單體式應用，您必須仔細提取功能的數據、邏輯和麪向用戶的組件，並將其重定向到新服務。在進入解決方案空間之前，您必須充分了解問題空間。\n瞭解問題空間後，您就可以瞭解提供適當隔離級別的網域的自然邊界。我們建議您充分了解網域，然後再創建較大的服務，而不是創建較小的服務。\n定義服務邊界是一個迭代過程。由於此過程具有非常大的工作量，因此您需要持續評估分離所帶來的好處和費用。以下因素可幫助您評估如何分離單體式應用：\n- 避免一次重構所有內容。如需確定服務分離的優先級，請評估費用與優勢。\n- 微服務架構中的服務是圍繞業務問題組織的，而不是技術問題。\n- 在逐步遷移服務時，請配置服務和單體式應用之間的通信以經過明確定義的 API 合約。\n- 微服務需要更多的自動化功能：因此請提前考慮 [持續集成 (CI)](https://dora.dev/devops-capabilities/technical/continuous-integration/) 、 [持續部署 (CD)](https://dora.dev/devops-capabilities/technical/deployment-automation/) 、集中日誌記錄和監控。\n以下部分討論了分離服務並逐步遷移單體式應用的各種策略。\n", "content": "## 按網域驅動的設計分離\n微服務應圍繞業務功能（而非數據訪問或消息功能等水平層）而設計。微服務還應具有鬆散耦合和高功能凝聚度。如果您可以更改一項服務，而無需更改其他服務，則微服務是鬆散耦合的。如果微服務具有單一且明確定義的用途（例如管理用戶賬號或處理付款），則微服務具有凝聚力。\n[網域驅動型設計](https://wikipedia.org/wiki/Domain-driven_design) (DDD) 需要充分了解爲其編寫應用的網域。創建應用所需的網域知識由網域人員掌握，即網域專家。\n您可以將 DDD 方法追溯應用於現有應用，如下所示：\n- 識別 [無所不在的語言](https://martinfowler.com/bliki/UbiquitousLanguage.html) ，即在所有利益相關方之間共享的通用詞彙。作爲開發者，請務必在代碼中使用非技術人員可以理解的術語。您的代碼嘗試實現的目標應反映您的公司流程。\n- 確定單體式應用中的相關 [模塊](https://wikipedia.org/wiki/Modular_programming) ，然後將通用詞彙表應用於這些模塊。\n- 定義 [有界限上下文](https://martinfowler.com/bliki/BoundedContext.html) ，在此上下文中，您將顯式邊界應用於具有明確定義的責任的已識別模塊。您確定的有界限上下文將被重構爲更小的微服務的候選定位設置。\n下圖展示瞭如何將有界限上下文應用於現有電子商務應用：\n**圖 1.** 應用功能分爲遷移到服務的有界限上下文。\n在圖 1 中，電子商務應用的功能分爲有界限上下文並遷移到服務，如下所示：\n- 訂單管理和履單功能分爲以下幾類：\n- 訂單管理功能將遷移到訂單服務。\n- 物流交付管理功能遷移到了交付服務。\n- 產品目錄功能將遷移到產品目錄服務。\n- 會計功能被綁定到某一單一類別：- 消費者、賣家和第三方功能綁定在一起並遷移到賬號服務。\n## 遷移的服務優先級\n解耦服務的理想起點是確定單體式應用中的鬆散耦合模塊。您可以選擇鬆散耦合模塊作爲第一批要轉換爲微服務的模塊。如需完成每個模塊的依賴項分析，請注意以下事項：\n- 依賴項的類型 - 來自數據或其他模塊的依賴項。\n- 依賴項的規模：已識別模塊中的更改如何影響其他模塊。\n遷移包含大量數據依賴項的模塊通常是一項複雜的任務。如果您先遷移特徵，稍後再遷移相關數據，可能會臨時從多個數據庫中讀取數據以及向其寫入數據。因此，您必須考慮數據完整性和同步挑戰。\n我們建議您提取與單體式應用的其餘部分相比，資源要求不同的模塊。例如，如果模塊具有內存數據庫，您可以將其轉換爲服務，然後可以將該服務部署在具有更高內存的主機上。將具有特定資源要求的模塊轉換爲服務時，可以使應用更容易擴縮。\n從運營的角度來看，將模塊重構爲自己的服務也意味着在調整現有的團隊結構。明確問責制的最佳方法是爲擁有整個服務的小型團隊提供支持。\n可影響遷移服務優先級的其他因素包括業務重要性、全面的測試覆蓋範圍、應用的安全狀況和組織購買。根據您的評估，您可以按照本系列第一個文檔中的說明對服務進行排名，即 [從重構中受益](https://cloud.google.com/architecture/microservices-architecture-introduction?hl=zh-cn#microservices-benefits) 。\n## 從單體式應用中提取服務\n確定理想的候選服務後，您必須確定微服務和單體式應用模塊共存的方法。管理這種共存的一種方法是引入進程間通信 (IPC) 適配器，適配器可以幫助模塊協同工作。隨着時間的推移，微服務承擔了負載並消除了單體式應用組件。這一增量過程可以降低從單體式應用遷移到新的微服務的風險，因爲您可以逐步檢測錯誤或性能問題。\n下圖顯示瞭如何實現 IPC 方法：\n**圖 2** ：IPC 適配器可協調單體式應用與微服務模塊之間的通信。\n在圖 2 中，模塊 Z 是您希望從單體式應用中提取的服務候選對象。模塊 X 和 Y 依賴於模塊 Z。微服務模塊 X 和 Y 使用單體式應用中的 IPC 適配器，通過 REST API 與模塊 Z 進行通信。\n本系列的下一個文檔是 [微服務設置中的服務間通信](https://cloud.google.com/architecture/microservices-architecture-interservice-communication?hl=zh-cn) ，介紹了 [Strangler Fig 模式](https://martinfowler.com/bliki/StranglerFigApplication.html) 以及如何解構單體式應用中的服務。\n## 管理單體式數據庫\n通常，單體式應用具有自己的單體式數據庫。微服務架構的一個原則是每個微服務都有一個數據庫。因此，在將單體式應用現代化改造爲微服務時，您必須根據所識別的服務邊界拆分單體式數據庫。\n要確定拆分單體式數據庫的位置，請首先分析數據庫映射。在服務提取分析過程中，您收集了需要創建的微服務的一些數據洞見。您可以使用相同的方法分析數據庫使用情況，並將表或其他數據庫對象映射到新的微服務。 [Schema Datapreper](https://www.schemacrawler.com/) 、 [SchemaSpy](http://schemaspy.org/) 和 [ERBuilder](https://soft-builder.com/erbuilder-data-modeler/) 等工具可幫助您執行此類分析。映射表和其他對象可以幫助您瞭解跨越潛在微服務邊界的數據庫對象之間的耦合。\n但是，拆分單體式數據庫非常複雜，因爲數據庫對象之間可能沒有明確分離。您還需要考慮其他問題，例如數據同步、事務完整性、聯接和延遲時間。下一部分將介紹拆分單體式數據庫時可幫助您響應這些問題的模式。\n## 參考表\n在單體式應用中，模塊通常通過 SQL 聯接到其他模塊的表訪問不同模塊所需的數據。下圖使用上一個電子商務應用示例來展示此 SQL 聯接訪問過程：\n**圖 3** ：模塊將數據聯接到其他模塊的表。\n在圖 3 中，爲了獲取產品信息，訂單模塊使用 `product_id` 外鍵將訂單聯接到商品表。\n但是，如果您將模塊解構爲單獨的服務，我們建議您不要讓訂單服務直接調用產品服務的數據庫來運行聯接操作。以下各部分介紹了您可以考慮隔離數據庫對象的選項。\n### 通過 API 共享數據\n將核心功能或模塊分離爲微服務時，通常使用 API 共享和公開數據。引用的服務以調用服務所需的 API 的形式公開了數據，如下圖所示：\n**圖 4.** 服務使用 API 調用從其他服務獲取數據。\n在圖 4 中，訂單模塊使用 API 調用從產品模塊獲取數據。由於存在額外的網絡和數據庫調用，此實現存在明顯的性能問題。但是，當數據大小受限時，通過 API 共享數據的效果很好。此外，如果被調用服務返回具有已知變化率的數據，您可以在調用者上實現本地 TTL 緩存，以減少對被調用服務的網絡請求。\n### 複製數據\n在兩個單獨的微服務之間共享數據的另一種方法是複製依賴服務數據庫中的數據。數據複製是隻讀的，可以隨時重新構建。這種模式使服務更加統一。下圖展示了數據複製在兩個微服務之間的工作原理：\n**圖 5.** 在依賴的服務數據庫中，服務中的數據會被複制。\n在圖 5 中，產品服務數據庫被複制到訂單服務數據庫。此實現允許訂單服務獲取商品數據，而無需重複調用商品服務。\n如需構建數據複製，您可以使用具體化視圖、更改數據捕獲 (CDC) 和事件通知等技術。複製的數據最終是一致的，但複製數據可能會有延遲，因此存在傳送過時數據的風險。\n### 將靜態數據作爲配置\n靜態數據（例如國家/地區代碼和支持的貨幣）的更改速度很慢。您可以將此類靜態數據作爲微服務中的配置進行注入。現代微服務和雲框架提供了利用配置服務器、鍵值對存儲區和保險櫃管理此類配置數據的功能。 您可以通過聲明方式添加這些功能。\n## 共享的可變數據\n單體式應用具有一種稱爲 共享可變狀態的通用模式。在共享可變狀態配置中，多個模塊會使用單個表，如下圖所示：\n**圖 6.** 多個模塊使用一個表。\n在圖 6 中，電子商務應用的訂單、付款和配送功能使用相同的 `ShoppingStatus` 表來維護客戶在整個購物歷程中的訂單狀態。\n如需遷移共享的可變狀態單體式應用，您可以開發一個單獨的 ShoppingStatus 微服務來管理 `ShoppingStatus` 數據庫表。此微服務公開了用於管理客戶的購物狀態的 API，如下圖所示：\n**圖 7.** 微服務將 API 公開給多個其他服務。\n在圖 7 中，付款微服務、訂單微服務和配送微服務使用的是 ShoppingStatus 微服務 API。如果數據庫表與其中一項服務密切相關，我們建議您將數據遷移到該服務。然後，您可以通過 API 公開數據以供其他服務使用。此實現可幫助您確保不會有太多相互頻繁調用的精細服務。如果您錯誤地拆分服務，則需要重新訪問定義服務邊界。\n## 分佈式事務\n將服務與單體式應用隔離後，原始單體式系統中的本地事務可能會分佈在多項服務之間。跨多個服務的事務被視爲分佈式事務。在單體式應用中，數據庫系統會確保事務是原子性的。如需在基於微服務的系統中處理各種服務之間的事務，您需要創建全局事務協調器。事務協調器會處理回滾、補償性操作以及本系列的下一個文檔（ [微服務設置中的服務間通信](https://cloud.google.com/architecture/microservices-architecture-interservice-communication?hl=zh-cn) ）中所述的其他事務。\n## 數據一致性\n分佈式事務帶來了保持跨服務的數據一致性的挑戰。所有更新都必須以原子方式完成。在單體式應用中，事務屬性可保證查詢 [根據其隔離級別](https://wikipedia.org/wiki/Isolation_(database_systems)) 返回一致的數據庫視圖。\n相比之下，考慮基於微服務的架構中的多步驟事務。如有任何一項服務事務失敗，必須通過回滾在其他服務中成功完成的步驟來協調數據。否則，應用數據的全局視圖在服務之間會不一致。\n確定實現最終一致性的步驟何時失敗，可能會很困難。例如，某個步驟可能不會立即失敗，但可能會阻止或超時。因此，您可能需要實現某種超時機制。如果複製的數據在調用的服務訪問數據時已過時，則服務之間緩存或複製數據可以減少網絡延遲，這樣也可能會導致數據不一致。\n本系列的下一個文檔是 [微服務設置中的服務間通信](https://cloud.google.com/architecture/microservices-architecture-interservice-communication?hl=zh-cn) ，提供了一個處理微服務間分佈式事務的模式示例。\n## 設計服務間通信\n在單體式應用中，組件（或應用模塊）通過函數調用直接相互調用。相比之下，基於微服務的應用包含通過網絡相互交互的多個服務。\n在設計服務間通信時，請先考慮服務之間期望的交互方式。服務交互可以是以下項之一：\n- **一對一交互** ：每個客戶端請求僅由一項服務處理。\n- **一對多交互** ：每個請求由多項服務處理。\n另外，請考慮互動是同步還是異步：\n- **同步** ：客戶端希望服務及時響應，可能會在等待期間阻塞。\n- **異步** ：客戶端在等待響應時不會阻塞。響應（如果有）不一定立即發送。\n下表顯示了互動樣式的組合：\n| Unnamed: 0 | 一對一                | 一對多                |\n|:-------------|:-------------------------------------------------------------------|:---------------------------------------------------------------------|\n| 同步   | 請求和響應：向服務發送請求並等待響應。        | —                 |\n| 異步   | 通知：向服務發送請求，但未期望或發送任何答覆。      | 發佈和訂閱：客戶端發佈須知消息，且零或多個感興趣的服務會使用該消息。 |\n| 異步   | 請求和異步響應：向服務發送請求，該服務會異步回覆。客戶端不會屏蔽。 | 發佈和異步響應：客戶端發佈請求，並等待來自相關服務的響應。   |\n每種服務通常使用這些互動樣式的組合。\n## 實現服務間通信\n如需實現服務間通信，您可以從不同的 IPC 技術中進行選擇。例如，服務可以使用基於同步請求的通信機制，例如基於 HTTP 的 REST、gRPC 或 Thrift。或者，服務可以使用基於消息的異步通信機制，例如 AMQP 或 STOMP。此外，您還可以從各種不同的消息格式中進行選擇。例如，服務可以使用人類可讀、基於文本的格式，例如 JSON 或 XML。此外，服務可以使用二進制格式，例如 Avro 或協議緩衝區。\n將服務配置爲直接調用其他服務會導致服務之間存在高耦合性。相反，我們建議使用消息功能或基於事件的通信：\n- **消息功能** ：實現消息功能時，您不再需要直接相互調用服務。相反，所有服務都知道消息代理，並且會將消息推送到該代理。消息代理將這些消息保存在消息隊列中。其他服務可以訂閱它們關注的消息。\n- **基於事件的通信** ：當您實現事件驅動的處理時，服務之間的通信通過各服務產生的事件進行。各項服務會將其事件寫入消息代理。服務可以監聽感興趣的事件。這種模式使服務鬆散耦合，因爲事件不包含載荷。\n在微服務應用中，我們建議使用異步服務間通信而不是同步通信。請求響應是一種易於理解的架構模式，因此設計同步 API 可能比設計異步系統更自然。服務之間的異步通信可以使用消息功能或事件驅動的通信來實現。使用異步通信具有以下優勢：\n- **鬆散耦合** ：異步模型將請求-響應交互拆分爲兩個單獨的消息，一個用於請求，另一個用於響應。服務的消費者啓動請求消息並等待響應，服務提供商等待其響應消息以及響應消息。此設置意味着調用者不必等待響應消息。\n- **故障隔離** ：即使下游消費者發生故障，發送者仍然可以繼續發送消息。消費者會在恢復時提取積壓輸入量。此功能在微服務架構中尤其有用，因爲每項服務都有自己的生命週期。但是，同步 API 要求下游服務可用或操作失敗。\n- **響應速度** ：如果上游服務不等待下游服務，則可以更快地回覆。如果存在服務依賴項（服務 A 調用 B，B 調用 C 等）鏈，等待同步調用可能會增加不可接受的延遲時間量。\n- **流控制** ：消息隊列充當緩衝區，以便接收者可以按自己的速率處理消息。\n但是，有效使用異步消息功能存在一些挑戰：\n- **延遲時間** ：如果消息代理成爲瓶頸，端到端延遲時間可能會變高。\n- **開發和測試開銷** ：根據消息功能或事件基礎架構的選擇，可能存在重複消息，這使得操作很難冪等。使用異步消息功能可能難以實現和測試請求-響應語義。您需要一種方法來關聯請求和響應消息。\n- **吞吐量** ：使用中央隊列或一些其他機制的異步消息處理可能會成爲系統中的瓶頸。後端系統（例如隊列和下游消費者）應進行擴縮以匹配系統的吞吐量要求。\n- **錯誤處理處理** ：在異步系統中，調用者不知道請求是成功還是失敗，因此需要在頻段外處理錯誤處理。這種類型的系統可能難以實現重試或指數退避算法等邏輯。如果有多個必須全部成功或失敗的鏈式異步調用，則錯誤處理會更加複雜。\n本系列中的下一個文檔（即 [微服務設置中的服務間通信](https://cloud.google.com/architecture/microservices-architecture-interservice-communication?hl=zh-cn) ）提供了一個參考實現，該實現可以解決上述列表中提到的一些挑戰。\n## 後續步驟\n- 閱讀本系列文章的第一篇，瞭解 [微服務、其優勢、挑戰和使用場景](https://cloud.google.com/architecture/microservices-architecture-introduction?hl=zh-cn) 。\n- 閱讀本系列的下一個文檔（即 [微服務設置中的服務間通信](https://cloud.google.com/architecture/microservices-architecture-interservice-communication?hl=zh-cn) ）。\n- 閱讀本系列文章中的第四篇最終文檔，以詳細瞭解 [微服務之間的分佈式跟蹤](https://cloud.google.com/architecture/microservices-architecture-distributed-tracing?hl=zh-cn) 。", "guide": "Docs"}