{"title": "Docs - Google Cloud zonal deployment archetype", "url": "https://cloud.google.com/architecture/deployment-archetypes/zonal", "abstract": "# Docs - Google Cloud zonal deployment archetype\nLast reviewed 2024-02-08 UTC\nThis section of the [Google Cloud deployment archetypes](/architecture/deployment-archetypes) guide describes the zonal deployment archetype.\nIn a cloud architecture that uses the basic zonal deployment archetype, the application runs in a single Google Cloud zone, as shown in the following diagram:\nTo be able to recover from zone outages, you can use a dual-zone architecture where a passive replica of the application stack is provisioned in a second (failover) zone, as shown in the following diagram:\nIf an outage occurs in the primary zone, you can promote the standby database to be the primary (write) database and update the load balancer to send traffic to the frontend in the failover zone.\n", "content": "## Use cases\nThe following are examples of use cases for which the zonal deployment archetype is an appropriate choice:\n- **Cloud development and test environments** : You can use the zonal deployment archetype to build a low-cost environment for development and testing.\n- **Applications that don't need high availability** : The zonal deployment archetype might be sufficient for applications that can tolerate downtime.\n- **Low-latency networking between application components** : A single-zone architecture might be well suited for applications such as batch computing that need low-latency and high-bandwidth network connections among the compute nodes.\n- **Migration of commodity workloads** : The zonal deployment archetype provides a cloud migration path for commodity on-premises apps for which you have no control over the code or that can't support architectures beyond a basic active-passive topology.\n- **Running license-restricted software** : The zonal deployment archetype might be well suited for license-restricted systems where running more than one instance at a time is either too expensive or isn't permitted.## Design considerations\nWhen you build an architecture that's based on the zonal deployment archetype, consider the potential downtime during zone and region outages.\n### Zone outages\nIf the application runs in a single zone with no failover zone, then when a zone outage occurs, the application can't serve requests. To prevent this situation, you must maintain a passive replica of the infrastructure stack in another (failover) zone in the same region. If an outage occurs in the primary zone, you can promote the database in the failover zone to be the primary database, and ensure that incoming traffic is routed to the frontend in the failover zone. After Google resolves the outage, you can choose to either to the primary zone or make it the new failover zone.\n### Region outages\nIf a region outage occurs, you must wait for Google to resolve the outage and then verify that the application works as expected. If you need robustness against region outages, consider using the multi-regional deployment archetype.\n## Reference architecture\nFor a reference architecture that you can use to design a zonal deployment on Compute Engine VMs, see [Single-zone deployment on Compute Engine](/architecture/single-zone-deployment-compute-engine) .", "guide": "Docs"}