{"title": "Docs - Dataproc reliability guide", "url": "https://cloud.google.com/architecture/framework/reliability/product-guides/dataproc", "abstract": "# Docs - Dataproc reliability guide\nLast reviewed 2023-07-20 UTC\nDataproc is a fully managed, scalable service for running Apache Hadoop and Spark jobs. With Dataproc, virtual machines can be customized and scaled up and down as needed. Dataproc integrates tightly with Cloud Storage, BigQuery, Bigtable, and other Google Cloud services.\n", "content": "## Best practices\n- [Dataproc High Availability mode](https://cloud.google.com/dataproc/docs/concepts/configuring-clusters/high-availability) - compare Hadoop High Availability (HA) mode with the default non-HA mode in terms of instance names, Apache ZooKeeper, Hadoop Distributed File System (HDFS), and Yet Another Resource Negotiator (YARN). Also, how to create a high availability cluster.\n- [Autoscaling clusters](https://cloud.google.com/dataproc/docs/concepts/configuring-clusters/autoscaling) - when to use Dataproc autoscaling, how to create an autoscaling policy, multi-cluster policy usage, reliability best practices for autoscaling configuration, and metrics and logs.\n- [Dataproc Enhanced Flexibility Mode (EFM)](https://cloud.google.com/dataproc/docs/concepts/configuring-clusters/flex) - examples of using Enhanced Flexibility Mode to minimize job progress delays, advanced configuration such as partitioning and parallelism, and YARN graceful decommissioning on EFM clusters.\n- [Graceful decomissioning](https://cloud.google.com/dataproc/docs/concepts/configuring-clusters/scaling-clusters#graceful_decommissioning) - using graceful decomissioning to minimize the impact of removing workers from a cluster, how to use this feature with secondary workers, and command examples for graceful decomissioning.\n- [Restartable jobs](https://cloud.google.com/dataproc/docs/concepts/jobs/restartable-jobs) - by using optional settings, you can set jobs to restart on failure to mitigate common types of job failure, including out-of-memory issues and unexpected Compute Engine virtual machine reboots.", "guide": "Docs"}