{"title": "Docs - Data management with Cohesity Helios and Google Cloud", "url": "https://cloud.google.com/architecture/partners/using-cohesity-with-cloud-storage-for-enterprise-hybrid-data-protection?hl=zh-cn", "abstract": "# Docs - Data management with Cohesity Helios and Google Cloud\nLast reviewed 2023-01-31 UTC\nBy Edwin Galang (Cohesity Cloud Solutions Architect) and Vikram Kanodia (Cohesity Cloud Solutions Architect)\nThis document describes how you can use the [Cohesity Helios data platform](https://www.cohesity.com/products/helios/) with Google Cloud. Using this platform has the following benefits:\n- Long-term data retention with [Cloud Storage](/storage) .\n- Backup and recovery of workloads and VMs in [Compute Engine](/compute) and [Google Cloud VMware Engine](/vmware-engine) using [Cohesity DataProtect](https://www.cohesity.com/products/dataprotect/) .\n- File services in Google Cloud using [Cohesity SmartFiles](https://www.cohesity.com/products/smartfiles/) .\nCohesity Helios is a data management platform that consolidates multiple functions like backup, recovery, analytics, and disaster recovery in a single scalable, secure, AI-driven platform.\nYou can deploy Cohesity Helios at your network edge, in a data center, or in Google Cloud.\n", "content": "## Architecture\nThe following diagram shows how Cohesity integrates with Google Cloud.\nAs the diagram shows, Cohesity Helios is installed in your data center and in Google Cloud. It connects with Compute Engine and VMware Engine to obtain VM images and stores them in Cloud Storage.\nCohesity Helios connects with Cloud Storage to provide a long-term archive for your data. You can deploy Cohesity Helios in Google Cloud to back up and recover:\n- Compute Engine VMs\n- VMware Engine VMs\n- Application workloads- SAP HANA\n- Oracle database\n- SQL ServerWith Cohesity SmartFiles, you can use protocols like network file system (NFS) and server message block (SMB) to provide file services in your Google Cloud environment.\n## Cohesity Helios components\nCohesity Helios has the following main components:\n- **Cohesity DataProtect:** A software-defined backup and recovery solution that supports cloud environments. Cohesity DataProtect is designed for hyperscale and offers comprehensive policy-based protection for both on-premises and cloud data sources.\n- **Cohesity SmartFiles:** A multiprotocol file and object solution that supports large enterprises and cloud environments. It's designed to let you scale, protect, and create multiple tiers for data management.## Long-term data retention with Cloud Storage\nCohesity supports the following [Cloud Storage classes](/storage/docs/storage-classes) :\n- Standard\n- Nearline\n- Coldline\nThat means you can archive your data in the storage class that best meets your long-retention and cost requirements.\nUsing Cohesity with Cloud Storage provides the following benefits:\n- You don't need cloud gateways to connect Cohesity with Cloud Storage.\n- You can use wildcards in searches to locate and restore archived data from Cloud Storage.\n- You can recover individual VMs, restore files to source VMs, and recover individual application objects.## Backup and recovery of Compute Engine VMs, VMware Engine VMs, and application workloads\nCohesity DataProtect is designed to provide consistent and comprehensive protection for Compute Engine VMs, VMware Engine VMs, and application workloads.\nUsing Cohesity DataProtect with Cloud Storage provides the following benefits:\n- A single UI to manage and provision all your backup and recovery services.\n- Policy automation to meet your business service level agreements (SLAs) and assign policies to a single job or to all jobs, globally.\n- Immutable snapshots with Advanced Encryption Standard 256 encryption, multi-factor authentication, and Federal Information Processing Standards certification to help protect against ransomware.\n- The use of strict consistency, erasure coding, and hardware fault tolerance to meet your SLAs and achieve higher data resiliency.\n- Global, variable-length deduplication across workloads and protocols to maximize space.## File services for Compute Engine VMs and VMware Engine\nCohesity SmartFiles lets you consolidate data silos. It's designed to help securely manage the following unstructured content and application data types, including:\n- Digital libraries\n- Archives\n- Rich media\n- Video surveillance\n- Big data\n- Backup datasets\nCohesity SmartFiles provides the following benefits:\n- Broad compatibility across users and applications, whether on-premises or in the cloud, with support for the NFS and SMB protocols.\n- Resiliency and consistency while eliminating disruptive upgrades, unique and distributed file systems.\n- Ability to grow incrementally using linear performance and capacity that adds additional nodes.\n- Space maximization using [sliding window](https://en.wikipedia.org/wiki/Sliding_window_protocol) variable-length deduplication, Zstandard compression, and small file efficiency.\n- Policies that transparently down-tier and up-tier data storage to optimize spending.\n- An external network-attached storage tiering that coexists with your existing systems.\n- A UI to manage, monitor, and search all your unstructured data. Machine-driven operational insights help predict future needs.## Configure Cohesity with Cloud Storage\nThis section describes how to configure Cohesity Helios with Cloud Storage and create a policy to archive data to Cloud Storage for long-term retention.\n### Register Cloud Storage with Cohesity Helios\nTo use Cloud Storage with Cohesity Helios, you must first register it as an external target.\n- Log in to the [Cohesity Helios](https://helios.cohesity.com/) console using your MyCohesity credentials or your SSO credentials if you are using another identity provider.\n- In the Cohesity Dashboard, click **Infrastructure > External Targets** .\n- Click **Register External Target** to access the **Register External\nTarget** page.\n- Register the Cloud Storage target using the following information:- **Purpose:** select **Archival** \n- **New Target:** enter a unique name for the target\n- **Type:** select the Cloud Storage class\n- **Bucket name:** enter the name of the Cloud Storage bucket\n- **Project ID:** enter the name of the project that hosts Cloud Storage\n- **Client Email Address:** enter the service account email address for Cloud Storage\n- **Client Private Key:** enter the private key that is associated with the service account\n- **Encryption:** enable to send and store data in an encrypted format\n- **Compression:** enable to send and store the data in a compressed format\n- **Source Side Deduplication:** enable to deduplicate data before sending it to the target\n- **Bandwidth Throttling:** enable to limit the maximum data transfer rate to the target during a time window\nThe following screenshot shows sample inputs.\n- To create the new external target, click **Register** .\nNext, create a policy to archive data.\n### Create a policy to archive data to Cloud Storage\nA policy is a reusable set of settings that define how and when data is protected, replicated, and archived.\n- Log in to the Cohesity Helios console.\n- In the Cohesity Dashboard, select **Data Protection > Policies.** \n- Click **Create Policy** .\n- Enter the following information to configure the policy:- **Policy name:** enter a unique name for the policy\n- **DataLock:** enable to create a write-once-read-many (WORM)-compliant backup\n- **Archive to:** select the name of the Cloud Storage bucket\n- **Every:** select how often backups are captured by the protection group\n- **Retain for:** specify the number of days that backups are stored on the Cohesity cluster before the backups are deleted\n- Click **Add Archive** .\n- In the **Archive to** list, select the Cloud Storage bucket.\n- Specify the archive schedule for copies of the snapshots that were created by this job. These copies are stored on the registered target.The following screenshot shows a sample policy.\n- Click **Save** .## Configure Cohesity to back up Compute Engine VMs\nThe following sections describe how to register a Google Cloud source, create a policy, and create a protection group to back up Compute Engine VMs.\n### Register a Google Cloud source\n- Log in to the Cohesity Helios console.\n- In the Cohesity Dashboard, select **Data Protection > Sources** .\n- Select **Register > Virtual Machines** .\n- Complete the following:- **Source Type:** select **Cloud > GCP: IAM User** \n- **Use JSON Key File:** enable to use the service account's JSON key file\n- **Service Account JSON Key File:** select the service account's`JSON`key file or enter the information manually\n- **VPC:** enter the VPC network\n- **Subnet:** enter the VPC subnet\nThe following screenshot shows a sample registration.\n- Click **Register** .\n### Create a policy to back up Compute Engine VMs\nA policy is a reusable set of settings that define how and when objects are protected, replicated, and archived.\n- Log in to the Cohesity Helios console.\n- In the Cohesity Dashboard, select **Data Protection** > **Policies** .\n- Click **Create Policy** .\n- Complete the following information:- **Policy name:** enter a unique name for the policy\n- **DataLock:** enable to create a WORM-compliant backup\n- **Archive to:** select the name of the Cloud Storage bucket\n- **Every:** select how often backups are captured by the protection group\n- **Retain for:** specify the number of days that backups are stored on the Cohesity cluster before the backups are deleted\n- **Policy Name:** enter a unique name for the policy\n- **DataLock:** enable to create a WORM-compliant backup\n- (Optional) To meet long-term retention requirements, archive Google Cloud data to Cloud Storage.- Click **Add Archive** to add Cloud Storage to the policy.\n- Enter the following information:- **Archive to:** select the Cloud Storage bucket.\n- **Every:** select when an archive is created.\n- **Retain for:** select how long the copies are stored in the Cloud Storage bucket before they are deleted.The following screenshot shows a sample policy.\n- Click **Save** .\n### Create a protection group for Compute Engine VMs\n- Log in to the Cohesity Helios console.\n- In the Cohesity Dashboard, select **Data Protection > Protection** .\n- Click **Protect** .\n- Click **Add Objects** .\n- In the **Registered Source** list, select the Google Cloud source.\n- Select the VMs to protect and click **Continue** .The following screenshot shows some selected VMs.\n- Enter the **Protection Group** name.The following screenshot shows a selected protection group.\n- From the **Policy** list, select the policy.\n- Click **Protect** .## Recover Compute Engine VMs\nCohesity can help you recover protected objects (such as VMs) from a snapshot created by a protection group. You can recover data from a Cohesity cluster or a Cloud Storage target. You can recover data to its original location or a new location.\n- Log in to the Cohesity Helios console.\n- In the Cohesity Dashboard, select **Data Protection > Recoveries** .\n- Click **Recover** and select **Virtual Machines > VMs** .\n- In the **New Recovery** wizard, search for the VMs.\n- From the search results, select the VMs that you want to recover, the recovery point, and the location to recover the VM from.\n- Click **Next: Recover Options** .\n- Complete the following information:- **Recover to:** select the location to recover to\n- **Recovery Options:** select the recovery options\n- Click **Recover** .## What's next\nReview additional documentation on the Cohesity website:\n- [Next generation data management with Cohesity](https://www.cohesity.com/solutions/cloud/google/) .\n- [Cohesity and Google Cloud](https://www.cohesity.com/solutions/cloud/google/) .\n- [About Cohesity](https://www.cohesity.com/) .\n- [Cohesity Blogs](https://www.cohesity.com/blogs/) .\n- Explore reference architectures, diagrams, and best practices about Google Cloud. Take a look at our [Cloud Architecture Center](/architecture) .", "guide": "Docs"}