{"title": "Docs - 有關開發高質量的機器學習解決方案的指南", "url": "https://cloud.google.com/architecture/guidelines-for-developing-high-quality-ml-solutions?hl=zh-cn", "abstract": "# Docs - 有關開發高質量的機器學習解決方案的指南\nLast reviewed 2022-02-17 UTC\n本文檔介紹了一些指南，可幫助您評估、確保和控制機器學習 (ML) 解決方案的質量。它提供了針對流程的每個步驟的建議，從開發機器學習模型到部署訓練系統和將系統提供給生產環境都涵蓋在內。本文檔擴充了 [MLOps 從業人員指南](https://cloud.google.com/resources/mlops-whitepaper?hl=zh-cn) 中討論的信息，重點強調和提煉了 MLOps 生命週期每個流程的質量方面。\n本文檔適用於參與構建、部署和運營機器學習解決方案的所有人。本文檔假定您整體上熟悉 MLOps。它並不假定您瞭解任何特定的機器學習平臺。\n", "content": "## 機器學習解決方案質量概覽\n在軟件工程中，開發了許多標準、流程、工具和做法來確保 [軟件質量](https://en.wikipedia.org/wiki/Software_quality) 。目標是確保軟件在生產環境中按預期運行，並且同時滿足功能性和非功能性要求。這些做法涵蓋軟件 [測試](https://en.wikipedia.org/wiki/Software_testing) 、軟件 [覈實和驗證](https://en.wikipedia.org/wiki/Software_verification_and_validation) ，以及軟件 [日誌記錄](https://en.wikipedia.org/wiki/Logging_(software)) 和 [監控](https://en.wikipedia.org/wiki/Application_performance_management) 等主題。在 [DevOps](https://en.wikipedia.org/wiki/DevOps) 中，這些做法通常在 [CI/CD](https://en.wikipedia.org/wiki/CI/CD) 流程中集成和自動化。\n[MLOps](https://cloud.google.com/blog/products/ai-machine-learning/google-cloud-launches-vertex-ai-unified-platform-for-mlops?hl=zh-cn) 是一組標準化流程和功能，用於快速、可靠地構建、部署和操作機器學習系統。與其他軟件解決方案一樣，機器學習軟件解決方案要求您集成這些軟件質量做法，並在 MLOps 生命週期中應用這些做法。通過應用這些做法，您可以確保模型的可信度和可預測性，並確保模型符合您的要求。\n但是，構建、部署和操作機器學習系統的任務帶來了額外的挑戰，需要某些可能與其他軟件系統無關的質量做法。除了大多數其他軟件系統的特徵之外，機器學習系統還具有以下特徵：\n- **依賴數據的系統** 。經過訓練的模型及其預測的質量取決於用於訓練的數據和提交供預測請求使用的數據的有效性。任何軟件系統都依賴於有效數據，但機器學習系統會自動推斷根據數據做出決策的邏輯，因此特別依賴於數據質量。\n- **雙訓練-服務系統** 。機器學習工作負載通常由兩個不同但相關的生產系統組成：訓練系統和服務系統。持續訓練流水線生成新訓練的模型，然後部署這些模型用於預測服務每個系統都需要一組不同的質量做法來均衡有效性和效率，從而生成和維護生產環境中的高性能模型。此外，這兩個系統之間的不一致會導致錯誤，並使預測性能不佳。\n- **容易過時** 。模型在部署到生產環境中後往往會降級，這是因爲這些模型無法適應它們代表的環境的變化，例如購買行爲的季節性變化。這些模型也無法適應數據的變化，例如新的產品和位置。因此，跟蹤模型在生產環境中的有效性是機器學習系統面臨的額外挑戰。\n- **自動化決策系統** 。在其他軟件系統中，會針對一組要求和業務規則仔細地手動編碼操作，而機器學習模型則從數據中學習規則來做出決策。數據中的隱性偏差可能會導致模型產生不公平的結果。\n當已部署的機器學習模型生成錯誤預測時，機器學習質量不佳可能是由於各種問題造成的。其中一些問題可能是由於任何程序中的典型 Bug 造成的。但是，特定於機器學習的問題還可能包括數據傾斜和異常，以及訓練過程中缺少適當的模型評估和驗證過程。另一個潛在問題是模型的內置接口和服務 API 之間的數據格式不一致。此外，即使沒有這些問題，模型性能也會隨着時間的推移而下降；如果未正確監控，模型可能會以靜默方式失敗。因此，您應該在開發期間、部署期間和生產環境中包括對機器學習模型和系統的不同類型的測試和監控。\n## 模型開發質量指南\n在實驗階段開發機器學習模型時，您可使用以下兩組目標指標來評估模型的性能：\n- **模型的優化指標** 。此指標反映了模型的預測效果。該指標包括分類任務中的 [準確率](https://en.wikipedia.org/wiki/Accuracy_and_precision) 和 [f-measure](https://en.wikipedia.org/wiki/F-score) 、迴歸和預測任務中的 [平均絕對百分比誤差](https://en.wikipedia.org/wiki/Mean_absolute_percentage_error) 、排名任務中的 [折扣累積增益](https://en.wikipedia.org/wiki/Discounted_cumulative_gain) ，以及語言模型中的 [困惑度](https://en.wikipedia.org/wiki/Perplexity) 和 [BLEU](https://en.wikipedia.org/wiki/BLEU) 得分。該指標的值越好，模型越適合給定任務。在某些使用場景中，爲了確保公平性，請務必對不同的數據切片實現類似的預測效果，例如針對不同的客戶受衆特徵。\n- **模型的滿意指標** 。此指標反映了模型需要滿足的運行限制，例如預測延遲時間。您應將延遲時間閾值設置爲特定值，如 200 毫秒。不接受任何不滿足閾值限制的模型。滿意指標的另外一個示例是模型大小，如果要將模型部署到低功耗硬件（如移動設備和嵌入式設備），這一點很重要。\n在實驗期間，您可開發、訓練、評估和調試模型，來提高其在優化指標方面的效率，而不會違反滿意指標閾值。\n### 實驗指南\n- 具有預定義和固定閾值，用於優化指標和滿意指標。\n- 實現簡化的評估例程，該例程接受模型和數據並生成一組評估指標。實現例程，使其不受模型類型（例如決策樹或神經網絡）或模型框架（例如 TensorFlow 或 Scikit-learn）的影響。\n- 確保您有一個要進行比較的基準模型。此基準可以包含硬編碼啓發法，也可以是預測平均值或模式目標值的簡單模型。使用基準模型檢查機器學習模型的性能。如果機器學習模型並不優於基準模型，則機器學習模型存在一個根本問題。\n- 跟蹤已完成的每個實驗來幫助實現可重現性和增量改進。對於每個實驗，請存儲超參數值、特徵選擇和隨機種子。\n### 數據質量指南\n- 選擇正確的評估指標，在實驗中儘早解決任何不均衡類別。此外，請應用權重上調少數類實例或降採樣多數類實例等技術。\n- 確保您瞭解當前的數據源，並執行相關 [數據預處理和特徵工程](https://developers.google.com/machine-learning/data-prep/process?hl=zh-cn) 以準備訓練數據集。此類過程需要可重複且可自動化。\n- 確保您對模型的最終評估使用單獨的 [測試數據拆分](https://en.wikipedia.org/wiki/Training,_validation,_and_test_sets) （留出）。測試拆分不應在訓練期間可見，請勿使用它進行超參數調節。\n- 確保訓練、驗證和測試拆分平等地代表您的輸入數據。此類測試拆分的採樣取決於數據的性質和當前機器學習任務的性質。例如，分層拆分與分類任務相關，而時間順序拆分與時間序列任務相關。\n- 確保將驗證和測試拆分與訓練數據拆分分開進行預處理。如何混合地預處理這些拆分，會導致 [數據泄露](https://en.wikipedia.org/wiki/Leakage_(machine_learning)) 。例如，當您使用統計信息轉換數據來進行歸一化或對數值特徵進行分桶時，請計算訓練數據的統計信息，並應用它們來規範化驗證和測試拆分。\n- 生成一個包含特徵的數據類型和一些統計屬性的數據集架構。您可以使用此架構在實驗和訓練期間查找異常或無效的數據。\n- 確保您的訓練數據正確分批重排，但仍然滿足模型訓練要求。例如，此任務可以應用於正實例和負實例分佈。\n- 有單獨的驗證數據集用於超參數微調和模型選擇。您還可使用驗證數據集來執行早停法。否則，您可針對完整一組給定的最大迭代次數進行模型訓練。但是，僅當模型在驗證數據集上的性能相對於先前快照有所提升時，才保存模型的新快照。\n### 模型質量指南\n- 請確保您的模型沒有任何基本問題會阻止模型學習輸入和輸出之間的任何關係。您可以使用極少數示例訓練模型來實現此目標。如果模型未能針對這些示例實現高精確度，則模型實現或訓練例程中可能存在錯誤。\n- 在訓練神經網絡時，請監控損失中的`NaN`值，以及在整個模型訓練中具有零值的權重百分比。這些`NaN`值或零值可以表示錯誤的算術計算，或者梯度消失或爆炸問題。直觀呈現權重值分佈隨時間的變化有助於檢測拖慢訓練的 [內部協變量偏移](https://arxiv.org/abs/1502.03167) 。您可以應用批次歸一化來緩解速度降低的情況。\n- 將模型在訓練數據上的性能與在測試數據上的性能進行比較，以瞭解您的模型是過擬合還是欠擬合。如果您看到以上任一問題，請執行相關改進。例如，如果存在欠擬合，您可以增加模型的學習能力。如果存在過擬合，您可以應用正則化。\n- 分析分類錯誤的實例，尤其是預測置信度高的實例和多類別 [混淆矩陣](https://developers.google.com/machine-learning/glossary?hl=zh-cn#confusion-matrix) 中最易混淆的類別。這些錯誤可能表示帶有錯誤標籤的訓練示例。這些錯誤還可以確定數據預處理（例如移除離羣值）的機會，或者創建新的特徵來幫助區分這些類的機會。\n- 分析特徵重要性得分，並清理沒有充分提高模型質量的特徵。 [簡約模型](https://en.wikipedia.org/wiki/Occam%27s_razor) 優於複雜模型。## 訓練流水線部署質量指南\n在實現模型和模型訓練流水線時，您需要在 CI/CD 例程中創建一組測試。這些測試會在您推送新代碼更改時自動運行，也可以在將訓練流水線部署到目標環境之前運行它們。\n### 指南\n- 對特徵工程功能進行單元測試。\n- 對模型的輸入編碼進行單元測試。\n- 對模型的用戶實現的（自定義）模塊獨立進行單元測試，例如對自定義圖卷積和池化層或自定義注意力層進行單元測試。\n- 對任何自定義損失或評估函數進行單元測試。\n- 根據預期輸入對模型的輸出類型和形狀進行單元測試。\n- 進行單元測試，確定模型的`fit`函數對一些小批量數據正常運行，而不出現錯誤。這些測試應確保損失減少並且訓練步驟的執行時間符合預期。進行這些檢查的原因是，模型代碼的更改可能會引入錯誤，從而導致訓練過程變慢。\n- 對模型的保存和加載功能進行單元測試。\n- 根據原始輸入和預期輸出對導出的模型-服務接口進行單元測試。\n- 使用模擬輸入和輸出工件測試流水線步驟的組件。\n- 將流水線部署到測試環境，並對端到端流水線執行集成測試。對於此過程，請使用一些測試數據來確保工作流全程正確執行並生成預期的工件。\n- 將新版本的訓練流水線部署到生產環境時使用 [影子部署](https://thenewstack.io/deployment-strategies/) 。影子部署有助於確保在實時數據上將新部署的流水線版本並行執行到上一個流水線版本。## 持續訓練質量指南\n持續訓練過程涉及編排和自動執行訓練流水線。典型的訓練工作流包括數據注入和拆分、數據轉換、模型訓練、模型評估以及模型註冊等步驟。某些訓練流水線由更復雜的工作流組成。其他任務可能包括執行使用未加標籤的數據的自監督模型訓練，或者構建用於嵌入的近似最鄰近索引。任何訓練流水線的主要輸入都是新的訓練數據，主輸出是在生產環境中部署的新候選模型。\n訓練流水線在生產環境中根據時間表（例如每天或每週）或基於觸發器（例如在具有標籤的新數據可用時）自動運行。因此，您需要向訓練工作流添加質量控制步驟，尤其是數據驗證步驟和模型驗證步驟。這些步驟會驗證流水線的輸入和輸出。\n您可以在訓練工作流中的數據注入步驟後添加數據驗證步驟。數據驗證步驟剖析提取到流水線中的新輸入訓練數據。在剖析期間，流水線使用預定義的數據架構來檢測異常；該架構是在機器學習開發過程中創建的。根據使用場景，您可以忽略或僅移除數據集中的一些無效記錄。但是，新提取的數據中的其他問題可能會停止訓練流水線的執行，因此您必須識別並解決這些問題。\n### 數據驗證指南\n- 驗證提取的訓練數據的特徵是否完整，以及它們是否與預期的架構匹配 - 也就是說，沒有缺失的特徵，也沒有添加的特徵。另外，驗證特徵是否與預計的卷匹配。\n- 驗證數據集中提取到訓練流水線的數據類型和特徵形狀。\n- 驗證特定特徵（例如日期、時間、網址、郵政編碼和 IP 地址）的格式是否與預期的正則表達式匹配。另外，驗證特徵是否在有效範圍內。\n- 驗證每個特徵的缺失值的最大比例。特定特徵中大量缺失值可能會影響模型訓練。缺失值通常表示特徵來源不可靠。\n- 驗證輸入特徵的網域。例如，檢查分類特徵的詞彙表是否發生變化或數值特徵的範圍是否發生變化，並相應地調整數據預處理。再舉一例，如果填充特徵的上游系統中的更新使用不同的度量單位，則數值特徵的範圍可能會更改。例如，上游系統可能會將貨幣從“美元”更改爲“日元”，也可能會將距離從“公里”更改爲“米”。\n- 驗證每個特徵的分佈是否符合您的預期。例如，您可能會測試得出付款類型特徵最常見的值爲`cash`，並且此付款類型計入所有值的 50%。但是，如果最常見的付款類型更改爲`credit_card`，則此測試可能會失敗。此類外部更改可能需要更改模型。\n您可以在模型註冊步驟之前添加模型驗證步驟，以確保只有通過驗證標準的模型才能註冊用於生產部署。\n### 模型驗證指南\n- 對於最終模型評估，請使用尚未用於模型訓練或超參數微調的單獨測試拆分。\n- 根據測試數據拆分對候選模型評分，計算相關評估指標，並驗證候選模型是否超過預定義的質量閾值。\n- 確保測試數據拆分代表整個數據，考慮到不同的數據模式。對於時間序列數據，請確保測試拆分包含比訓練拆分更新的數據。\n- 使用重要數據切片測試模型質量，例如按國家/地區劃分的用戶或按類型劃分的電影。通過對切片數據進行測試，可以避免全局摘要指標遮蓋了精細性能問題這一難題。\n- 根據測試數據拆分評估當前（倡導）模型，並將其與訓練流水線生成的候選（挑戰）模型進行比較。\n- 根據公平性指標驗證模型以檢測隱性偏差，例如，訓練數據中多樣性不夠可能會引起隱性偏差。公平性指標可以揭示將模型部署到生產環境之前必須解決的根因問題。\n在持續訓練期間，您可以根據優化指標和滿意指標驗證模型。或者，您可以僅根據優化指標驗證模型，並將根據滿意指標進行驗證的操作推遲到模型部署階段。如果您計劃將同一模型的變體部署到不同的服務環境或工作負載，則最好推遲根據滿意指標進行驗證的操作。不同的服務環境或工作負載（例如雲環境與設備上的環境，或者實時環境與批量傳送環境）可能需要不同的滿意指標閾值。如果您要部署到多個環境，您的持續訓練流水線可能會訓練兩個或更多模型，其中每個模型都針對其目標部署環境進行了優化。如需瞭解詳情並查看示例，請參閱 [Vertex AI 上的雙重部署](https://cloud.google.com/blog/topics/developers-practitioners/dual-deployments-vertex-ai?hl=zh-cn) 。\n將更多具有複雜工作流的持續訓練流水線部署到生產環境時，您必須跟蹤該流水線運行生成的元數據和工件。通過跟蹤此信息，您可以跟蹤和調試生產環境中可能出現的問題。跟蹤信息還有助於重現流水線的輸出，以便改善後續機器學習開發迭代中的實現。\n### 有關跟蹤機器學習元數據和工件的指南\n- 跟蹤源代碼的沿襲、已部署的流水線、流水線組件、流水線運行、正在使用的數據集和生成的工件。\n- 跟蹤流水線運行的超參數和配置。\n- 跟蹤流水線步驟的關鍵輸入和輸出工件，例如數據集統計信息、數據集異常情況（如果有）、轉換後的數據和架構、模型檢查點以及模型評估結果。\n- 跟蹤條件流水線步驟運行以響應條件，並通過在關鍵步驟未運行或失敗時添加更改機制來確保可觀測性。## 模型部署質量指南\n假設您有一個經過訓練的模型，該模型從優化指標的角度進行驗證，並且從模型治理角度批准了模型（如後文的 [模型治理](#model_governance) 部分所述）。模型存儲在模型註冊表中，並已準備好部署到生產環境中。此時，您需要實現一組測試來驗證模型是否適合在其目標環境中提供服務。您還需要在模型 CI/CD 例程中自動執行這些測試。\n### 指南\n- 驗證模型工件是否可通過其運行時依賴項成功加載和調用。您可以通過將模型暫存在服務環境的沙盒版本中來執行此驗證。此驗證有助於確保模型使用的操作和二進制文件存在於環境中。\n- 在預演環境中驗證模型的滿意指標（如果有），例如模型大小和延遲時間。\n- 針對原始輸入和預期輸出，在預演環境中對模型-工件-服務接口進行單元測試。\n- 針對預測請求的一組典型和邊緣用例，在預演環境中對模型工件進行單元測試。例如，對所有特徵都設置爲`None`的請求實例進行單元測試。\n- 在將模型服務 API 部署到目標環境後對其進行冒煙測試。如需執行此測試，請向模型服務發送單個實例或一批實例，並驗證服務響應。\n- 使用少量實時傳送數據對新部署的模型版本進行 Canary 測試。此測試可確保在向大量用戶公開模型之前，新的模型服務不會產生錯誤。\n- 在預演環境中測試您是否可快速、安全地回滾到先前的服務模型版本。\n- 執行在線實驗，使用一小部分服務填充內容測試新訓練的模型。此測試衡量新模型與當前模型相比的性能情況。將新模型的性能與當前模型的性能進行比較後，您可能會決定完全發佈新模型來處理所有實時預測請求。在線實驗技術包括 [A/B 測試](https://en.wikipedia.org/wiki/A/B_testing) 和 [多臂老虎機 (MAB)](https://www.tensorflow.org/agents/tutorials/intro_bandit?hl=zh-cn) 。## 模型服務質量指南\n已部署且在生產環境中使用的機器學習模型的預測性能通常會隨着時間的推移而下降。導致這種性能下降的原因可能是在提供的特徵與模型預期特徵之間引入了不一致。這些不一致被稱爲訓練-應用偏差 。例如，推薦模型可能需要特徵的字母數字輸入值（例如最近查看的產品代碼）。但是，由於使用模型服務的應用發生了更新，因此在服務期間會傳遞產品名稱（而不是產品代碼）。\n此外，隨着傳送數據統計屬性隨着時間的推移而偏移，模型可能會過時，並且當前部署的模型所學習的模式不再準確。在這兩種情況下，模型都無法再提供準確的預測。\n爲了避免模型的預測性能下降，您必須持續監控模型的效果。通過監控，您可以定期主動地驗證模型的性能是否不會降低。\n### 指南\n- 記錄數據存儲區中傳送請求-響應載荷的樣本來進行常規分析。請求是輸入實例，響應是模型爲該數據實例生成的預測。\n- 實現通過計算描述性統計信息來分析存儲的請求-響應數據的自動化流程。定期計算和存儲這些傳送統計信息。\n- 通過將傳送數據統計信息與訓練數據的基準統計信息進行比較，確定由數據移位和偏移引起的訓練-應用偏差。此外，分析傳送數據統計信息隨時間的變化。\n- 通過分析預測的特徵歸因隨時間的變化，確定 [概念偏移](https://en.wikipedia.org/wiki/Concept_drift) 。\n- 識別被視爲訓練數據的離羣值的傳送數據實例。要找到這些離羣值，請使用新穎檢測技術，並跟蹤傳送數據中離羣值的百分比隨時間的變化情況。\n- 設置當模型達到數據集中關鍵預測特徵的偏差得分閾值時的提醒。\n- 如果標籤可用（即標準答案），請將真實標籤與傳送實例的預測標籤聯接起來，以進行持續評估。該方法類似於您在在線實驗期間作爲 A/B 測試實現的評估系統。持續評估不僅可以識別模型在生產環境中的預測能力，還可確定模型使用哪種類型的請求時表現良好，使用哪種類型的請求時表現不佳。\n- 設置對您來說重要的系統指標的目標，並根據這些目標衡量模型的性能。\n- 監控服務效率以確保您的模型能夠在生產環境中大規模提供服務。此監控還可幫助您預測和管理容量規劃，並幫助您估算服務基礎架構的費用。監控效率指標，包括 CPU 利用率、GPU 利用率、內存利用率、服務延遲時間、吞吐量和錯誤率。## 模型治理\n模型治理是公司的核心功能，可提供指導和流程來幫助員工實現公司的 AI 原則。這些原則可能包括避免使用創建或強制執行偏差的模型，以及能夠證明 AI 決策的合理性。模型治理函數確保人機協同 (human-in-the-loop)。進行人工審覈是對於敏感性和高影響工作負載（通常是面向用戶的工作負載）來說尤爲重要。此類工作負載可能包括對信用風險進行評分、對職位候選人進行排名、批准保險政策，以及在社交媒體中傳播信息。\n### 指南\n- 按任務爲每個模型創建 [責任分配矩陣](https://en.wikipedia.org/wiki/Responsibility_assignment_matrix) 。此矩陣應考慮整個組織層次結構中的跨職能團隊（業務線、數據工程、數據科學、機器學習工程、風險和合規性等）。\n- 在與模型版本關聯的模型註冊表中維護模型文檔和報告（例如，使用 [模型卡片](https://modelcards.withgoogle.com/) ）。此類元數據包含用於訓練模型的數據、模型性能和任何已知限制的相關信息。\n- 在批准模型部署到生產環境之前，先實施該模型的審覈流程。在此類流程中，您可以保留模型覈對清單的版本、補充文檔以及利益相關方可能要求的任何其他信息。\n- 根據基準數據集（也稱爲黃金數據集）評估模型，其中涵蓋標準用例和邊緣用例。此外，根據公平性指標驗證模型，以幫助檢測隱性偏差。\n- 向模型用戶說明模型的整體預測行爲以及針對特定樣本輸入實例的預測行爲。提供此信息有助於您瞭解模型的重要特徵和可能的不良行爲。\n- 使用 [假設性分析工具](https://pair-code.github.io/what-if-tool/) 分析模型的預測行爲，以瞭解不同數據特徵的重要性。此分析還有助於直觀呈現多個模型和輸入數據子集中的模型行爲。\n- 針對 [惡意攻擊](https://openai.com/blog/adversarial-example-research/) 測試模型，來幫助確保模型可在生產環境中可靠使用。\n- 跟蹤有關模型在生產環境中、出現數據集位移和出現偏移時的預測性能的提醒。配置提醒以通知模型利益相關方。\n- 管理模型的在線實驗、發佈和回滾。## 後續步驟\n- 閱讀來自 Google 研究團隊的 [機器學習測試得分：有關機器學習生產就緒性和技術債務減少的評分準則](https://research.google/pubs/pub46555/?hl=zh-cn) 。\n- 閱讀 O'Reilly 撰寫的 [有關在生產環境中運行機器學習系統的簡要說明](https://www.oreilly.com/content/a-brief-guide-to-running-ml-systems-in-production/) 。\n- 閱讀 [機器學習規則](https://developers.google.com/machine-learning/guides/rules-of-ml?hl=zh-cn) 。\n- 嘗試參加 [機器學習中的測試和調試](https://developers.google.com/machine-learning/testing-debugging?hl=zh-cn) 培訓。\n- 閱讀 [機器學習中的數據驗證](https://mlsys.org/Conferences/2019/doc/2019/167.pdf) 一文。\n- 請參閱 [Google Cloud 上的 E2E MLOps](https://github.com/GoogleCloudPlatform/vertex-ai-samples/tree/main/notebooks/community/ml_ops) 代碼庫。\n- 探索有關 Google Cloud 的參考架構、圖表和最佳做法。查看我們的 [Cloud Architecture Center](https://cloud.google.com/architecture?hl=zh-cn) 。", "guide": "Docs"}