{"title": "Docs - Implement data residency and sovereignty requirements", "url": "https://cloud.google.com/architecture/framework/security/data-residency-sovereignty", "abstract": "# Docs - Implement data residency and sovereignty requirements\nLast reviewed 2023-08-08 UTC\nThis document in the [Google Cloud Architecture Framework](/architecture/framework) provides best practices for implementing data residency and sovereignty requirements.\nData residency and sovereignty requirements are based on your regional and industry-specific regulations, and different organizations might have different data sovereignty requirements. For example, you might have the following requirements:\n- Control over all access to your data by Google Cloud, including what type of personnel can access the data and from which region they can access it.\n- Inspectability of changes to cloud infrastructure and services, which can have an impact on access to your data or the security of your data. Insight into these types of changes helps ensure that Google Cloud is unable to circumvent controls or move your data out of the region.\n- Survivability of your workloads for an extended time when you are unable to receive software updates from Google Cloud.", "content": "## Manage your data sovereignty\nData sovereignty provides you with a mechanism to prevent Google from accessing your data. You approve access only for provider behaviors that you agree are necessary.\nFor example, you can manage your data sovereignty in the following ways:\n- Store and manage [encryption keys](/kms/docs/ekm) outside the cloud.\n- Only [grant access](/blog/products/identity-security/control-access-to-gcp-data-with-key-access-justifications) to these keys based on detailed access justifications.\n- [Protect data in use](/blog/products/identity-security/introducing-google-cloud-confidential-computing-with-confidential-vms) .## Manage your operational sovereignty\nOperational sovereignty provides you with assurances that Google personnel can't compromise your workloads.\nFor example, you can manage operational sovereignty in the following ways:\n- [Restrict the deployment](/blog/products/identity-security/assured-workloads-for-government-compliance-without-compromise) of new resources to specific provider regions.\n- [Limit Google personnel access](/blog/products/identity-security/assured-workloads-for-government-compliance-without-compromise) based on predefined attributes such as their citizenship or geographic location.## Manage software sovereignty\nSoftware sovereignty provides you with assurances that you can control the availability of your workloads and run them wherever you want, without depending on (or being locked in to) a single cloud provider. Software sovereignty includes the ability to survive events that require you to quickly change where your workloads are deployed and what level of outside connection is allowed.\nFor example, Google Cloud supports [hybrid and multicloud deployments](/architecture/hybrid-multicloud-patterns-and-practices) . In addition, [GKE Enterprise](/anthos/docs/concepts/overview) lets you manage and deploy your applications in both cloud environments and on-premises environments.\n## Control data residency\nData residency describes where your data is stored at rest. Data residency requirements vary based on systems design objectives, industry regulatory concerns, national law, tax implications, and even culture.\nControlling data residency starts with the following:\n- Understanding the type of your data and its location.\n- Determining what risks exist to your data, and what laws and regulations apply.\n- Controlling where data is or where it goes.\nTo help comply with data residency requirements, Google Cloud lets you control where your data is stored, how it is accessed, and how it's processed. You can use [resource location policies](/resource-manager/docs/organization-policy/defining-locations) to restrict where resources are created and to limit where data is replicated between regions. You can use the location property of a resource to identify where the service deploys and who maintains it.\nFor supportability information, see [Resource locations supported services](/resource-manager/docs/organization-policy/defining-locations-supported-services) .\n## What's next\nLearn more about data residency and sovereignty with the following resources:\n- [Implement privacy requirements](/architecture/framework/security/privacy) (next document in this series)\n- [Data residency, operational transparency, and privacy for European customers on Google Cloud (PDF)](https://services.google.com/fh/files/misc/googlecloud_european_commitments_whitepaper.pdf) \n- [Designing and deploying data security strategy (PDF)](https://services.google.com/fh/files/misc/designing_and_deploying_data_security_strategy.pdf) \n- [Cloud Key Management Service](/security-key-management) \n- [Trusting your data with Google Cloud (PDF)](https://services.google.com/fh/files/misc/072022_google_cloud_trust_whitepaper.pdf) \n- [Privileged access at Google](/logging/docs/audit/privileged-access) \n- [Google Cloud Access Transparency](/logging/docs/audit/access-transparency-overview)", "guide": "Docs"}