{"title": "Docs - Google Cloud 上的聯邦學習", "url": "https://cloud.google.com/architecture/federated-learning-google-cloud?hl=zh-cn", "abstract": "# Docs - Google Cloud 上的聯邦學習\nLast reviewed 2022-06-08 UTC\n本文檔介紹了 [聯邦學習](https://wikipedia.org/wiki/Federated_learning) 用例的實現，它考慮了您需要針對多雲環境和混合環境考慮的安全和隔離注意事項。本文檔面向有興趣實現聯邦學習系統的 IT 管理員、IT 架構師和數據科學家。\n", "content": "## 聯邦學習\n聯邦學習是一種機器學習 (ML) 技術，可讓一組組織或同一組織內的羣組以協作和迭代的方式訓練和改進共享的全局機器學習模型。使用此方法時，不會在單個設備或羣組之外共享數據。參與的組織形成一個可以由各種配置（如地理區域和時區）或同一組織內的不同業務部門組成的聯盟。\n在聯邦學習中，重點是使用同構和同分佈的數據，或使用非獨立且可能非同分佈的數據訓練機器學習模型。參與聯邦學習的組織之間不會交換唯一數據。聯邦學習可在由於隱私權、監管或技術限制條件，在組織之間通常很難共享數據的行業和用例中實現機器學習。一個示例用例是世界各地參與同一臨牀試驗的一組醫院。通常，單家醫院收集的有關患者的數據無法離開其控制範圍或醫院環境。因此，醫院無法將患者數據轉移給第三方。通過聯邦學習，關聯的醫院可以訓練共享機器學習模型，同時仍然能夠控制每家醫院內的患者數據。\n## 實現聯邦學習用例\n如需在 Google Cloud 中實現聯邦學習用例，您必須滿足以下最低前提條件，詳情請參閱下一部分：\n- [建立聯邦學習聯盟](#establish_a_federated_learning_consortium) 。\n- [確定聯邦學習聯盟的協作模型](#determine_a_collaboration_model_for_the_federated_learning_consortium) ，以實現並決定該聯盟中每位參與者的責任。\n除了這些前提條件之外，聯盟所有者還必須執行其他不在本文檔討論範圍內的操作，例如：\n- 管理聯邦學習聯盟。\n- 設計和實現協作模型。\n- 準備、管理和操作模型訓練數據以及聯盟所有者打算訓練的模型。\n- 創建、容器化和編排聯邦學習工作流。\n- 部署和管理聯邦學習工作負載。\n- 爲參與者組織設置通信通道，以便安全地轉移數據。## 建立聯邦學習聯盟\n參與聯邦學習工作的組織羣組建立聯邦學習聯盟。 組織僅共享機器學習模型的參數，並且這些參數可以加密以提高隱私性。如果聯邦學習聯盟允許這一做法，則組織還可以彙總不包含個人身份信息 (PII) 的數據。\n## 確定聯邦學習聯盟的協作模型\n聯邦學習聯盟可以實現不同的協作模型，例如：\n- 由稱爲聯盟所有者或編排者的單個協調組織以及一組參與者組織或數據所有者組成的集中式模型。\n- 由作爲一個羣組進行協調的組織組成的分散式模型。\n- 由各種參與組織的聯盟組成的異構模型，所有這些組織爲聯盟提供不同的資源。\n在本文檔中，假設協作模型是集中式模型。\n### 確定參與者組織的責任\n爲聯邦學習選擇協作模型後，聯盟所有者必須確定參與者組織的責任。\n在開始組建聯邦學習聯盟時，聯盟所有者還必須執行以下操作：\n- 協調聯邦學習工作。\n- 設計和實現全局機器學習模型以及與參與者組織共享的機器學習模型。\n- 定義聯邦學習輪次（即機器學習訓練過程的迭代方法）。\n- 選擇爲任何給定聯邦學習輪次作貢獻的參與者組織。此選擇結果稱爲同類羣組。\n- 爲參與者組織設計和實現聯盟成員資格驗證流程。\n- 更新全局機器學習模型以及與參與者組織共享的機器學習模型。\n- 爲參與者組織提供工具，以驗證聯邦學習聯盟符合其隱私權、安全和監管要求。\n- 爲參與者組織提供安全且加密的通信通道。\n- 爲參與者組織提供完成每輪聯邦學習所需的所有必要的非機密彙總數據。\n參與者組織承擔以下責任：\n- 提供並維護安全、隔離的環境（孤島）。孤島是指參與者組織存儲自己的數據以及實現機器學習模型訓練的位置。\n- 使用自己的計算基礎架構和自己的本地數據訓練聯盟所有者提供的模型。\n- 移除任何個人身份信息後，以彙總數據的形式與聯盟所有者共享模型訓練結果。\n聯盟所有者和參與者組織會優化機器學習模型訓練，直到滿足其要求。\n## 在 Google Cloud 上實現聯邦學習\n建立聯邦學習聯盟並確定其協作方式後，我們建議參與者組織執行以下操作：\n- 爲聯邦學習聯盟預配和配置必要的基礎架構。\n- 實現協作模型。\n- 開始聯邦學習。\n### 爲聯邦學習聯盟預配和配置基礎架構\n在爲聯邦學習聯盟預配和配置基礎架構時，聯盟所有者負責創建用於訓練聯邦機器學習模型的工作負載並將其分發到參與者組織。由於第三方（聯盟所有者）創建並提供了工作負載，因此參與者組織在運行時環境中部署這些工作負載時必須採取預防措施。\n參與者組織必須根據各自的安全最佳實踐配置其環境，並應用控制措施來限制授予每個工作負載的範圍和權限。除了遵循各自的安全最佳實踐之外，我們還建議聯盟所有者和參與者組織考慮 [特定於聯邦學習的威脅矢量](#security_considerations) 。\n爲了幫助您實現安全的運行時環境，讓您能夠控制 Google Cloud 上的聯邦學習工作負載之間的訪問和隔離，我們建議所有參與的組織使用 [Google Kubernetes Engine (GKE)](https://cloud.google.com/kubernetes-engine/docs?hl=zh-cn) 。\n如需瞭解如何預配和配置 GKE 集羣以提供聯邦學習所需的所有功能和安全控制，請參閱 [爲第三方分發的應用準備 GKE 集羣](https://cloud.google.com/architecture/preparing-gke-cluster-apps-distributed-third-party?hl=zh-cn) 。在此方法中，您將使用 [多租戶](https://cloud.google.com/kubernetes-engine/docs/concepts/multitenancy-overview?hl=zh-cn) 架構，並且訓練聯邦模型的工作負載被視爲 GKE 集羣中的租戶。租戶會被分組到專用的 [Kubernetes Namespace](https://kubernetes.io/docs/concepts/overview/working-with-objects/namespaces/) 中，Namespace 在專用 GKE 集羣節點上彼此隔離。通過此方法，您可以將安全控制和政策應用於託管租戶工作負載的節點和 Namespace。\n### 實現協作模型\n聯邦學習聯盟基礎架構準備就緒後，聯盟所有者會設計並實現使參與者組織能夠彼此交互的機制。該方法遵循聯盟所有者爲聯邦學習聯盟選擇的協作模型。\n不同協作模型的設計和實現不在本文檔的探討範圍之內。\n### 開始聯邦學習\n實現協作模型後，聯盟所有者會實現要訓練的全局機器學習模型，以及與參與者組織共享的機器學習模型。這些機器學習模型準備就緒後，聯盟所有者會開始第一輪聯邦學習。在每輪聯邦學習中，聯盟所有者會執行以下操作：\n- 預處理要與參與者組織共享的訓練數據，以避免泄露任何個人身份信息。\n- 分發要與參與者組織共享的機器學習模型，以及必要的訓練數據。\n- 等待參與者組織提供聯盟所有者共享的機器學習模型的訓練結果。\n- 收集並處理參與者組織生成的訓練結果。\n- 在接收到參與組織的適當訓練結果後，更新全局機器學習模型。\n- 更新要在適當情況下與其他聯盟成員共享的機器學習模型。\n- 爲下一輪聯邦學習準備訓練數據。\n- 開始下一輪聯邦學習。## 安全注意事項\n儘管具有嚴格的數據共享模型，但聯邦學習本身並不能防範所有定向攻擊。機器學習模型或模型訓練數據也存在意外泄露信息的風險。例如，攻擊者可能會有意危害全局機器學習模型或多輪聯邦學習，或者可能會執行 [計時攻擊（一種邊信道攻擊）](https://en.wikipedia.org/wiki/Timing_attack) 來收集有關訓練數據集大小的信息。\n針對聯邦學習實現的最常見威脅如下所示：\n- **有意或無意的訓練數據記憶** 。您的聯邦學習實現或攻擊者可能會有意或無意地以很難使用的方式存儲數據。攻擊者可能會通過對存儲的數據進行逆向工程來收集有關全局機器學習模型或聯邦學習過往輪次的信息。\n- **從全局機器學習模型的更新中提取信息** 。攻擊者可能會對聯盟所有者在一輪聯邦學習期間從參與者組織收集的全局機器學習模型更新進行逆向工程。\n- **聯盟所有者可能會泄露輪次** 。受到攻擊的聯盟所有者可能會控制惡意孤島並開始一輪聯邦學習。在這一輪結束時，受到攻擊的聯盟所有者也許能夠通過將這些更新與惡意孤島生成的更新進行比較來收集有關其從合法參與者組織收集的更新的信息。\n- **參與者組織可能會破壞全局機器學習模型** 。組織可能會在聯邦學習輪次期間生成惡意或不合邏輯的更新，以試圖惡意影響全局機器學習模型的性能、質量或完整性。\n爲了幫助緩解本部分所述威脅的影響，我們建議聯盟的所有人執行以下操作：\n- 調整訓練數據記憶，將其降至最低。\n- 實現隱私權保護機制。\n- 定期審覈全局機器學習模型、您打算共享的機器學習模型、訓練數據，以及您用於實現聯邦學習的基礎架構。\n- 實現 [安全聚合](https://research.google/pubs/pub45808/?hl=zh-cn) 算法，以處理參與者組織生成的訓練結果。\n- 使用 [公鑰基礎架構](https://wikipedia.org/wiki/Public_key_infrastructure) 安全地生成和分發數據加密密鑰。\n- 在 [可信計算](https://wikipedia.org/wiki/Trusted_Computing) 平臺上部署基礎架構。\n聯盟所有者還必須執行以下額外的步驟：\n- 驗證每個參與者組織的身份和每個孤島的完整性。\n- 將更新的範圍限制爲參與者組織可以生成的全局機器學習模型。## 後續步驟\n- 瞭解如何 [爲第三方分發的應用準備 GKE 集羣](https://cloud.google.com/architecture/preparing-gke-cluster-apps-distributed-third-party?hl=zh-cn) 。\n- 探索如何在 [TensorFlow Federated 平臺](https://www.tensorflow.org/federated/get_started?hl=zh-cn) 上實現聯邦學習算法。\n- 瞭解 [聯邦學習的推進和開放問題](https://arxiv.org/abs/1912.04977) 。\n- 瞭解 [Google AI 博客上的聯邦學習](https://ai.googleblog.com/2017/04/federated-learning-collaborative.html) 。\n- 觀看 [Google 如何使用去標識化的聚合信息進行聯邦學習，以保護隱私權的方式改進機器學習模型](https://www.youtube.com/watch?v=gbRJPa9d-VU&hl=zh-cn) 。\n- [使用 Data Protection Toolkit 設置遵守《健康保險流通與責任法案》(HIPAA) 的工作負載](https://services.google.com/fh/files/misc/hipaa_technical_solution_guide.pdf?hl=zh-cn) 。\n- 探索有關 Google Cloud 的參考架構、圖表和最佳做法。查看我們的 [Cloud Architecture Center](https://cloud.google.com/architecture?hl=zh-cn) 。", "guide": "Docs"}