{"title": "Docs - Migrate across Google Cloud regions: Get started", "url": "https://cloud.google.com/architecture/migrate-across-regions", "abstract": "# Docs - Migrate across Google Cloud regions: Get started\nLast reviewed 2023-12-08 UTC\nThis document series helps you prepare for migrating your workloads and data across Google Cloud regions. In this series, you learn how to design reliable, single-region environments, and how to set up security and compliance controls to help ensure that your workloads and data stay inside specific Google Cloud regions. This series also provides guidance on how to expand your environment to multiple regions. This series is useful if you're planning to do any of these actions, or if you're evaluating the opportunity to do so in the future and want to explore what it might look like.\nThis document is part of the following series:\n- Get started (this document)\n- [Design resilient single-region environments on Google Cloud](/architecture/migrate-across-regions/design-resilient-single-region-environments) \n- [Prepare data and batch workloads for the migration](/architecture/migrate-across-regions/prepare-data-and-batch-workloads) \nThis series assumes that you have read and are familiar with [Migrate to Google Cloud: Get started](/architecture/migration-to-gcp-getting-started) , which describes the general migration framework used in this series. This series is also part of a larger set of migration content. For an overview of all related migration content, see [Migration resources](/architecture/migrations) .\nUse the following list to help you get started with the documents in this series and with related migration content:\n- **Architecting your environments for reliability.** When designing your Google Cloud environments, there are several architectural choices to make, including how to distribute resources across Google Cloud regions and zones. For more information about how to design your Google Cloud environments, and about how to design reliable single-region environments, refer to [Design resilient single-region environments on Google Cloud](/architecture/migrate-across-regions/design-resilient-single-region-environments) .\n- **Preparing for and migrating across Google Cloud regions** . Preparing for a migration across Google Cloud regions helps you avoid potential issues during such a migration, and also reduces the time and effort required to complete the migration. For example, you might want to prepare for a future migration to another region because you don't yet know if a particular region would be the best fit for your environment. Or you might prepare for a migration because you anticipate that your requirements about the preferred region might change in the future. You might even prepare for a migration because you're considering a migration to a soon-to-be-opened region.The guidance in this series is also useful if you didn't plan in advance for a migration across regions or for an expansion to multiple regions. In this case, you might need to spend additional effort to prepare your infrastructure, workloads, and data for the migration across regions and for the expansion to multiple regions.For more information about preparing for a migration across Google Cloud regions, see the following documents:- [Design resilient single-region environments](/architecture/migrate-across-regions/design-resilient-single-region-environments) \n- [Prepare data and batch workloads for migration across regions](/architecture/migrate-across-regions/prepare-data-and-batch-workloads) \n- **Setting up boundaries, and security and compliance controls to ensurethat your workloads and data stay inside certain Google Cloudregions** . You might have to comply with security and regulatory requirements so that your workloads and data can only reside in specific Google Cloud regions. If you have this compliance requirement, you might need to implement boundaries, controls, and auditing to ensure locality, sovereignty, privacy, and confidentiality on top of the [guarantees that Google Cloud offers](/security) . For example, you might need to make your environment compliant with regulations and security requirements that mandate certain workloads and data never leave a specific region residing in a particular political, administrative, or state entity.\n- **Minimizing the costs of your single- and multi-region environments,and of migrations across Google Cloud regions** . As your environments and your Google Cloud footprint grow, you might consider implementing mechanisms and processes to control and reduce the costs that are associated with your environments and your migrations across regions. For example, you can provision resources in specific regions, optimize network traffic patterns, streamline and automate processes, and automatically scale resources with demand. For more information about reducing costs, refer to [Migrate to Google Cloud: Minimize costs](/architecture/migration-to-google-cloud-minimize-costs) .", "content": "## What's next\n- Learn how to [design resilient single-region environments on Google Cloud](/architecture/migrate-across-regions/design-resilient-single-region-environments) .\n- Learn how to [prepare data and batch workloads for the migration](/architecture/migrate-across-regions/prepare-data-and-batch-workloads) .\n- Learn how to [minimize costs](/architecture/migration-to-google-cloud-minimize-costs) of your Google Cloud environment and your migration across regions.\n- Read [an in-depth analysis of deployment archetypes for cloud applications](https://dl.acm.org/doi/10.1145/3498336) .\n- Learn about other migration options by reading [Migration resources](/architecture/migrations) .\n- Learn about the migration framework by reading [Migrate to Google Cloud: Get started](/architecture/migration-to-gcp-getting-started) .\n- Learn when to [find help for your migrations](/architecture/migration-to-gcp-getting-started#finding_help) .\n- For more reference architectures, diagrams, and best practices, explore the [Cloud Architecture Center](/architecture) .## Contributors\nAuthors:\n- [Marco Ferrari](https://www.linkedin.com/in/ferrarimark) | Cloud Solutions Architect\nOther contributors:\n- [Lee Gates](https://www.linkedin.com/in/gatesl) | Group Product Manager", "guide": "Docs"}