{"title": "Docs - 發現和使用數據網格中的數據產品", "url": "https://cloud.google.com/architecture/discover-consume-data-products-data-mesh?hl=zh-cn", "abstract": "# Docs - 發現和使用數據網格中的數據產品\nLast reviewed 2022-10-06 UTC\n我們建議您設計數據網格，以支持各種各樣的數據使用場景。本文檔介紹了組織中最常見的數據使用場景。此外，本文檔還討論了使用者在確定適合其場景的數據產品時必須考慮的信息，以及他們發現和使用數據產品的方式。瞭解這些因素可以幫助組織確保提供合適的指導和工具來支持數據使用者。\n本文檔是介紹如何在 Google Cloud 上實現數據網格的系列文章中的一篇。本文檔假定您已閱讀並熟悉 [數據網格中的架構和職能](https://cloud.google.com/architecture/data-mesh?hl=zh-cn) 以及 [使用 Google Cloud 構建現代分佈式數據網格](https://services.google.com/fh/files/misc/build-a-modern-distributed-datamesh-with-google-cloud-whitepaper.pdf?hl=zh-cn) 所述的概念。\n本系列文章包含以下部分：\n- [數據網格中的架構和職能](https://cloud.google.com/architecture/data-mesh?hl=zh-cn) \n- [爲數據網格設計自助數據平臺](https://cloud.google.com/architecture/design-self-service-data-platform-data-mesh?hl=zh-cn) \n- [描述和整理數據網格中的數據產品和資源](https://cloud.google.com/architecture/describe-organize-data-products-resources-data-mesh?hl=zh-cn) \n- [在數據網格中構建數據產品](https://cloud.google.com/architecture/build-data-products-data-mesh?hl=zh-cn) \n- 發現和使用數據網格中的數據產品（本文檔）\n數據使用層的設計（具體地說，是基於數據領域的使用者使用數據產品的方式）取決於數據使用者要求。但前提條件是假設使用者考慮到了使用場景。假設他們已確定所需的數據，可以搜索中央數據產品目錄來找到這些數據。如果數據不在目錄中或未處於所需狀態（例如，如果接口不合適或 SLA 不足），則使用者必須聯繫數據生產者。\n或者，使用者可以聯繫數據網格的卓越中心 (COE)，以獲得有關哪個網域最適合生產該數據產品的建議。數據使用者也可以詢問如何發出請求。如果您的組織很大，則應實施以自助方式呈現數據產品請求的流程。\n數據使用者通過他們運行的應用使用數據產品。所需的數據洞見類型促進選擇哪種使用數據的應用設計。在開發應用設計時，數據使用者還會確定他們在應用中使用數據產品的首選方式。他們建立對於這些數據的可信度和可靠性的所需信心。然後，數據使用者可以瞭解應用所需的數據產品接口和 SLA。\n", "content": "## 數據使用場景\n爲了讓數據使用者創建數據應用，來源可以是一個或多個數據產品，也可以是數據使用者自己的網域中的數據。如 [在數據網格中構建數據產品](https://cloud.google.com/architecture/build-data-products-data-mesh?hl=zh-cn) 中所述，分析數據產品可能會從基於各種物理數據存儲區的數據產品構建。\n雖然數據使用可以在同一網域中發生，但最常見的使用模式是搜索合適的數據產品（無論網域如何）作爲應用的來源。當合適的數據產品存在於另一個網域中時，使用模式要求您設置後續機制，以跨網域訪問和使用數據。 [數據使用步驟](#data_consumption_steps) 中討論瞭如何使用在使用網域以外的網域中創建的數據產品。\n## 架構\n下圖展示了一個示例場景，在此場景中，使用者通過一系列接口（包括已獲授權的數據集和 API）使用數據產品。\n如上圖所示，數據生產者公開了四個數據產品接口：兩個 BigQuery 已獲授權的數據集、一個通過 BigQuery Storage Read API 公開的 BigQuery 數據集和一個託管在 Google Kubernetes Engine 上的數據訪問 API。使用數據產品時，數據使用者使用一系列查詢或直接訪問數據產品中的數據資源的應用。對於此場景，數據使用者根據其特定的數據訪問要求採用兩種不同的方法之一來訪問數據資源。在第一種方法中，Looker 使用 BigQuery SQL 來查詢已獲授權的數據集。在第二種方法中，Dataproc 通過 BigQuery API 直接訪問數據集，然後處理提取的數據以訓練機器學習 (ML) 模型。\n使用某個使用數據的應用並不總是能產生商業智能 (BI) 報告或 BI 信息中心。使用來自某個網域的數據還可能會導致機器學習模型進一步豐富分析產品、用於數據分析或成爲運營流程的一部分（例如欺詐檢測）。\n一些典型的數據產品使用場景如下：\n- **BI 報告和數據分析** ：在本例中，構建數據應用以使用來自多個數據產品的數據。例如，來自客戶關係管理 (CRM) 團隊的數據使用者需要訪問來自多個網域（如銷售、客戶和財務）的數據。這些數據使用者開發的 CRM 應用可能需要在一個網域中查詢 BigQuery 已授權的視圖，並在另一個網域中從 Cloud Storage Read API 中提取數據。對於數據使用者，影響其首選使用接口的優化因素是計算費用和查詢數據產品後所需的任何其他數據處理。在 BI 和數據分析使用場景中，BigQuery 已授權的視圖很可能最常使用。\n- **數據科學使用場景和模型訓練** ：在本例中，數據使用團隊使用來自其他領域的數據產品來豐富自己的分析數據產品（如機器學習模型）。通過使用 Dataproc Serverless for Spark，Google Cloud 提供了數據預處理和特徵工程功能，以便在運行機器學習任務之前豐富數據。重要考慮因素是以合理的費用獲得足夠數量的訓練數據，以及訓練數據是合適的數據的信心。爲了控制費用，首選使用接口可能是直接讀取 API。數據使用團隊可以將機器學習模型構建爲數據產品，數據使用團隊也轉而成爲新的數據生產團隊。\n- **運營流程** ：使用是數據使用網域中運營流程的一部分。例如，處理欺詐的團隊中的數據使用者可能會使用來自商家網域中的運營數據源的交易數據。通過使用更改數據捕獲等數據集成方法，此交易數據會近乎實時地被攔截。然後，您可以使用 Pub/Sub 定義此數據的架構並將該信息公開爲事件。在本例中，合適的接口將是公開爲 Pub/Sub 主題的數據。## 數據使用步驟\n數據生產者將其數據產品記錄在中央目錄中，包括有關如何使用數據的指導。對於具有多個網域的組織，此記錄方法會創建一個與傳統的集中構建的 ELT/ETL 流水線不同的架構，其中處理方會創建沒有業務網域邊界的輸出。數據網格中的數據使用者必須具有精心設計的發現和使用層，才能創建數據使用生命週期。該層應包含以下內容：\n**第 1 步：通過聲明式搜索和探索數據產品規範來發現數據產品** ：數據使用者可以搜索數據生產者在中央目錄中註冊的任何數據產品。對於所有數據產品，數據產品標記都指定如何發出數據訪問請求以及從所需的數據產品接口使用數據的模式。數據產品標記中的字段可以使用搜索應用進行搜索。數據產品接口實現數據 URI，這意味着無需將數據移動到單獨的使用區以供使用者使用。在不需要實時數據的情況下，使用者會查詢數據產品並使用生成的結果創建報告。\n**第 2 步：通過交互式數據訪問和原型設計來探索數據** ：數據使用者使用 BigQuery Studio 和 Jupyter Notebooks 等交互式工具解讀和試驗數據，以優化生產使用所需的查詢。通過交互式查詢，數據使用者可以探索較新的數據維度，並提高在生產場景中生成的數據分析的正確性。\n**第 3 步：通過應用使用數據產品（通過程序化訪問和生產）** ：\n- **BI 報告** 。近乎實時的批量報告和信息中心是數據使用者所需的最常見的分析使用場景組。報告可能需要跨數據產品訪問權限，以幫助您做出決策。例如，客戶數據平臺需要按計劃以編程方式查詢訂單和 CRM 數據產品。這種方法的結果是爲使用數據的商家用戶提供全面的客戶視圖。\n- **用於實時批量預測的 AI/ML 模型。** 數據科學家使用常見的 MLOps 原則來構建和提供機器學習模型以使用數據產品團隊提供的數據產品。機器學習模型爲事務性使用場景（例如欺詐檢測）提供實時推斷功能。同樣，通過探索性數據分析，數據使用者可以豐富來源數據。例如，關於銷售和營銷活動數據的探索性數據分析顯示預計銷售量最高的人口統計學特徵客戶細分，因此應舉辦營銷活動。## 後續步驟\n- 查看 [數據網格架構的參考實現](https://github.com/GoogleCloudPlatform/data-mesh-demo) 。\n- [詳細瞭解 BigQuery](https://cloud.google.com/bigquery?hl=zh-cn) 。\n- 詳細瞭解 [Vertex AI](https://cloud.google.com/vertex-ai?hl=zh-cn) 。\n- 瞭解 [Dataproc 上的數據科學](https://cloud.google.com/dataproc?hl=zh-cn#section-8) 。\n- 如需查看更多參考架構、圖表和最佳做法，請瀏覽 [雲架構中心](https://cloud.google.com/architecture?hl=zh-cn) 。", "guide": "Docs"}